{
  "posts": [
    {
      "pid": "22308173",
      "uid": "515249",
      "dateline": "1336170796",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]90th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Dispute system[/b][/color]\nAfter hundreds of scam reports each month [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to make a new system which allows members to search a username to see all scam reports on a specific user. This will be very useful for members who frequently visit the marketplace as well as group owners that want to do a quick background check on a user. To view the new system click the following link: http://goo.gl/RwLtu\n\n[color=white][b]Stress testing section open[/b][/color]\nAfter a long wait the Stress testing section is finally open to new sales threads. This will clean up the marketplace quite a bit considering a majority of the threads there were related to stress testing. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has also made it very clear that this section is strictly for stress testing and is in no way related to malicious DDoS attacks. To view the new section click the following link: http://goo.gl/GyCFC\n\n[color=white][b]New Rule[/b][/color]\nE-Whoring has become very popular in the past few years on HF and many members have found several different ways to increase their income while e-whoring. One of the more popular ways was blackmailing the slave after e-whoring them. After seeing constant threads relating to this subject [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to put an end to the discussion and ban the topic as a whole from HackForums. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread click the following link: http://goo.gl/0XSkH\n\n[color=white][b]MOTM[/b][/color]\nIt's that time of the month again and at this point in time there seems to be a clear winner. After being in several MOTM threads it seems Viral Dragon has finally won his first and last MOTM award. The winner is declared by [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] though and his word is final so anything can happen. To see the MOTM thread click the following link: http://goo.gl/V2gOZ\n\n[color=white][b]HJT Team changes[/b][/color]\nThe HJT Team is a well known and respected group that helps track and remove malware as a free service to all HackForums members. Recently their leader Valiant has stepped down and both Infallible and T3h Hack3r will be the new leaders of the group. They also now have their own private subforum, and graduates will receive the HJT Graduate award. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has stated more changes are to come, until then nothing is certain. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread click the following link: http://goo.gl/wvhPW\n\n[color=white][b]New awards[/b][/color]\nTwo new awards have been added to HackForums this week, the \"Gavel of Dredd\" award and the \"HJT Graduate award. It is unknown whether or not the \"Gavel of Dredd\" award will be given out any time soon however members are able to obtain the HJT graduate award by fully completing the training process. It has also been said that only 10 members will be able to receive the \"Gavel of Dredd\" award. To view the awards page click the following link: http://goo.gl/ZBhw3\n\n[color=white][b]Hijacked Twitter[/b][/color]\nRecently [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s twitter was Hijacked and used in an attempt to scam twitter users. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has notified all HackForums members and is currently working with Twitter and his Lawyer to get his account back. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread click the following link: http://goo.gl/nZaVb\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=817877][b][color=black]Guess Who Is Back[/color][/b][/url] was banned for Reporting the same post again & again.\n[url=http://hackforums.net/member.php?action=profile&uid=83518][b][color=black]Alistair[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=63227][b][color=black]Joomla12[/color][/b][/url] was banned for Warez/Leaking.\n[url=http://hackforums.net/member.php?action=profile&uid=530821][b][color=black]Xeronations[/color][/b][/url] was banned for PM advertising.\n[url=http://hackforums.net/member.php?action=profile&uid=1082656][b][color=black]Scar_[/color][/b][/url] was ban for Not in Marketplace.\n[url=http://hackforums.net/member.php?action=profile&uid=334193][b][color=black]Microwave[/color][/b][/url] has been banned and rep-fucked.\n[url=http://hackforums.net/member.php?action=profile&uid=83317][b][color=black]Automatic Coding[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=492171][b][color=black]fuckthapolice[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=614158][b][color=black]MarcelCoder[/color][/b][/url] was banned for scamming.\n[url=http://hackforums.net/member.php?action=profile&uid=967347][b][color=black]Black Veil Brides[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=295159][b][color=black]Lionel Messi[/color][/b][/url] was banned for Post/delete/Bumping.\n[url=http://hackforums.net/member.php?action=profile&uid=977824][b][color=black]Johnny Knoxville[/color][/b][/url] was banned for Fraudulent Donation's.\n[url=http://hackforums.net/member.php?action=profile&uid=665007][b][color=black]Butt-head[/color][/b][/url] was banned for Sales thrashing & leaking/cracking paid stuff.\n[url=http://hackforums.net/member.php?action=profile&uid=474875][b][color=black]shingij3[/color][/b][/url] was banned for Rep fuck complaining.\n[url=http://hackforums.net/member.php?action=profile&uid=1089669][b][color=black]video de cul[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=714225][b][color=black]Exposed[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=965574][b][color=black]Ϝanta[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=812001][b][color=black]BHLK[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=905109][b][color=black]Dashy[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=969426][b][color=black]Vater[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=940728][b][color=black]Manitar[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=373185][b][color=black]Gibson[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=125980][b][color=black]Vv3 Brooklyn[/color][/b][/url] was banned and rep fucked for carding.\n[url=http://hackforums.net/member.php?action=profile&uid=566671][b][color=black]panDa.[/color][/b][/url] had his account stolen yet again.\n[url=http://hackforums.net/member.php?action=profile&uid=646652][b][color=black]Stenography[/color][/b][/url] was banned for leaking/cracking paid stuuff.\n[url=http://hackforums.net/member.php?action=profile&uid=946358][b][color=black]New Yоrk[/color][/b][/url] was banned and rep fucked for being a LQ member and random negative rep trolling.\n[url=http://hackforums.net/member.php?action=profile&uid=988382][b][color=black]No Fun[/color][/b][/url] was banned for a Reputation Violation.\n[url=http://hackforums.net/member.php?action=profile&uid=1061502][b][color=white]мr. X[/color][/b][/url] has reached 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=480676][b][color=black]Іntel[/color][/b][/url] has requested to be banned while on vacation.\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Warning Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2096991]Do not deal with Mark Webber.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=89623][color=white][b]Mark Webber[/b][/color][/url] - For those of you who may have been scammed by \"Mark Webber,\" this is the real one, here to tell you that he is being impersonated.\n\n[i][b]Movie Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2463370]My movie recommendations. [Big List][/url] - [url=http://hackforums.net/member.php?action=profile&uid=651773][color=#0066FF][b]Vitani's Mate[/b][/color][/url] - This is a list of movies that Vitani's Mate enjoys, for those of you who are bored and looking for something to watch.\n\n[i][b]Mentoring Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2448580][Techsperts] Public Mentoring[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1114432][color=white][b]PyroStorm[/b][/color][/url] - The Techsperts group is looking for ideas on what people want classes for.\n\n[i][b]Trick Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2463248]Stupid Retarded \"Trick\". If You Don't Get It, You're An Idiot. (Pictures) (I'm Gay)[/url] - [url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] - Yellows made an interesting thread, see if you can do it!\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview -  [url=http://hackforums.net/member.php?action=profile&uid=1159829]Subscription[/url][/font][/size][/color][spoiler=]\n[b]Waleed:[/b] \"Hello Subscription, I'd first like to thank you for allowing us to interview you. Before we kick off our interview do you wan't to take this opportunity to give your favorite HF colleagues a special shout out?\"\n [color=#87CEEB][b]Subscription:[/b] \"Of course.. Where can i start.. Shoutout to Starstruck, Richard., Christy, .au3... and all the other new friends that iv got from here. And staff\"[/color]\n\n[b]Waleed:[/b] \"With the short time you've been with us you're quickly becoming a big part of our community. What made you join HackForums?\"\n [color=#87CEEB][b]Subscription:[/b] \"I joined because I have had few friends here before and they told me about it and highly recommended it. I also thought i could make some business here as well\"[/color]\n\n[b]Waleed:[/b] \"May I ask what lead or influenced you to choose the username Subscription?\"\n [color=#87CEEB][b]Subscription:[/b] \"You can thank Industrialized™ for that. He sold me the GT Subscription and it just came from there. I registered with username, IKR, I know right\"[/color]\n\n[b]Waleed:[/b] \"HackForums could appeal to anyone, even if their not extremely tech savvy like myself. What do you like and dislike about HackForums?\"\n [color=#87CEEB][b]Subscription:[/b] \"I like the whole community. Most of it is so nice and helpful and have alot of knowledge about almost everything. I also like the Marketplace, as its very active. I totally dislike scammers and how they get away with it\"[/color]\n\n[b]Waleed:[/b] \"Substantial amounts of suggestions are flowing in on a daily basis. What changes do you believe can be made to help enhance our community?\"\n [color=#87CEEB][b]Subscription:[/b] \"As i said, i dont like scammers and that they dont really get any punishment, even after tons of reports. However, i like the new plugin that Omni is working on to take down some of those people\"[/color]\n\n[b]Waleed:[/b] \"Setting computing aside; what are your activities and hobbies outside of the forum?\"\n [color=#87CEEB][b]Subscription:[/b] \"I work hard, almost every day. I have my own company that keeps me pretty busy. Its an offline company, so i really have invest alot of time into it to keep it profitable\"[/color]\n\n[b]Waleed:[/b] \"In our last edition you were mentioned for your generous donation to help Omniscient fix his car. Could you elaborate to give our readers more information about that?\"\n [color=#87CEEB][b]Subscription:[/b] \"Yeah, I made a 420$ donation to omni from my spare money, as I heard his car broke and he needed to get it fixed. I thought I could speed up the process and at the same time show my appreaciation to the forum once again\"[/color]\n\n[b]Waleed:[/b] \"You've impressed many users and accomplished much around the forum. What do you think is your most successful achievement?\"\n [color=#87CEEB][b]Subscription:[/b] This is hard one, there are quite a few. I enjoy being in many HQ groups, as well as I really enjoy peoples trust. Trust is hard to earn, but easy to lose. I hope I can keep it\"[/color]\n\n[b]Waleed:[/b] \"You've been an awesome interviewee; once again I'd like to thank you for taking the time out of your day to partake in this interview. Do you have any last words for our readers?\"\n [color=#87CEEB][b]Subscription:[/b] \"Thanks for reading this and see you around. I will have quite a few things coming up for you guys, such as my own group possibly\"[/color]\n[/spoiler]",
      "subject": "[5/4/12] - HF News"
    },
    {
      "pid": "22316350",
      "uid": "515249",
      "dateline": "1336191218",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][IMG]http://i.imgur.com/uDRgD.png[/IMG][/align]\n[align=center][video=youtube]http://www.youtube.com/watch?v=RujpHSXV5Jg[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]5 Priests Banned from Ministry[/b][/color]\nFive priests were recently banned from ministry following allegations of sexual abuse, said Roman Catholic archbishop.  \n\"When a child is harmed, the church has failed. When trust is lost, the church has failed. When the whole community suffers as a result, the church has failed,\" Chaput said. \"We can't change the past. But I pray — and I do believe — that the lessons of the last year have made our Church humbler, wiser, and a more vigilant guardian of our people's safety.\"\n\nWhile these cases were not considered sexual abuse, they were decided to be immoral, or behavioral issues.  Reporter from USAToday stated, \"Priests removed from ministry can agree to serve a life of prayer and penance in a church-run facility, where they can be monitored. Some might agree to leave the priesthood, while others may be laicized after a church trial. The priests can also appeal the decision.\"\n\n[color=white][b]Facebook Stock[/b][/color]\nFacebook executives recently started to convince investors that the IPO of the company is worth much more.  With the higher price, the company would become the most valuable company, exceeding even Google Inc., as stated in the Wall Street Journal.  Chief Executive Officer, Mark Zuckerberg, currently owns $18.7 billion dollars of stake in the company which is a hefty sum, making him stand out to all other major companies.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[b][color=white]Space Station[/color][/b]\nThe first ever private spaceship has been created. It's going to be the first private spaceship that's going to dock on the international space station. This is amazing movement on technology and space travel. People are now going to be able to travel in space. It still hasn't launched yet because of software that needs to be reviewed in order to make sure nothing goes wrong. \n\n[b][color=white]Facebook[/color][/b]\nFacebook's IPO is coming. And IPO makes a company go public and get into the stock market. Facebook's CEO Mark Zuckerburg  will probably cash in his shares and make about a billion dollars. It's estimated that each share would be 35-40 dollars. Facebook's IPO is a highly awaited one because the company is doing great and people want to cash in on it's success. \n\n[color=white][b]iOS[/b][/color]\nFirmware 5.1 was released a little while ago. And with that, a new jailbreak has to be recreated. There were some hackers who had their hands on a 5.1 untethered for the new iPad but they decided not to release it for whatever reason. Hacker and iOS dev p0d2g and his team have found several exploits that could untether the 5.1 firmware. Some are thinking they should keep these for the iOS 6 firmware launch that could be released during WWDC 2012. \n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b][color=white]New Writer[/color][/b]\nWe are looking for someone to take over the Music News section of the Hack Forums News. If you are interested, please message the original poster (Sir.)\nBe warned, if you don't fit the following requirements, you will be permanently blacklisted from the Writers and possibly even put on Sir's ignore list.\nRequirements: Ub3r, 100+ prestige, member for at least two months, quality grammar, and the will to post your article on time.\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThere must be something wrong with humanity, as we aren't able to connect on a deeper level--except for some cases, with a \"true love.\" However, in most cases, we are generally inclined to stick to ourselves and not connect with others. I don't mean in the sense of intercourse, but more in the sense of intellectual and emotional. Many animals can do this, to some degree, which allows them to move and understand each other as one. I believe humanity was once able to do this, but we have grown inward too much, our intellect has created a barrier around our mental processes and we are too afraid of connecting with people.",
      "subject": "*"
    },
    {
      "pid": "22318169",
      "uid": "515249",
      "dateline": "1336197054",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"How do you feeling about gaming nowadays, compared to old school gaming?\"\"\n\n[i]\"Funny this should be the topic. I was actually playing Dangerous Dave a few \nhours ago on DOSBOX (an emulator for those old MS-DOS games) and I have to \nsay, it was the most fulfilling three hours of my recent gaming experience. The \ngame was both tough as well as fun and had me hooked. I can't even remember \nthe last time I played, say, Modern Warfare 3 or Assassin's Creed for that long. \nThe current games just get repetitive and boring after a certain number of tries \nand there's only so many times one can shoot a Russian or assassinate an Italian \n(no offense to either nationalities). What I'm really trying to say is that games \nback then used to be fun. I mean, really fun. Space Invaders, Blitz, Street Fighter \nand so many of those old arcade games used to be the prime of my existence. \nNow they're taken over by franchises, corporations, DLCs and Pay to Plays. I \nenvision an even sadder life for future gamers.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=766449][i]-BlackChaos[/i][/url]\n\n[align=right][i]\"I feel as if the gaming today is starting to get almost too real, the \nold school gaming was amazing, even games like pong were awesome. I fear that in \nthe future there will be things that get you in the game itself, I just want to sit down \nand play on a console or a pc, not go into the game itself. I believe the day that it \ncomes to that, is the day I stop gaming.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1133072][i]-PieBHP[/i][/url][/align]\n\n[i]\"Well, First of all, I think that gaming became a part of everyone's life at some points. \nI mean today's gaming is totally different from the old school gaming. Gaming nowadays \nbecame like the films industry, it's all about graphics and how much emotion and impact \nit have on the viewer of the trailer, or the reader of the review about that game. I mean, \neverything became so real and beside, I think that nowadays, a game is just another game \nfor the hardcore gamer. The games of yesterday, they were soemthing precious for the guy \nwho bought it. I mean when you bought a game in that time, you keep playing on it and \nplaying and playing, because you know that there isn't gonna be a lot of games after it, \nand even if you loose a level, you continue trying and trying and when you win, you reach \nthat thing, that \"Ecstasy\", that's what made the game worth getting it. Nowadays, all of the \ngamers, excpet the real hardcore ones who appreciate the game for what is it, just give up \neasily, and know there gonna be another part of that game and they will always try again next \ntime. They know if they loose in one game, there are thousands of other games waiting for \nthem. Well, couldn't explained it very well, but I explained it my way. Thanks for your attention \ngamers.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=509788][i]-Makaveli The Don[/i][/url]\n\n[align=right][i]\"Gaming now is a lot different than now. About 10 years ago, just a patch of red \nwas the best graphics, now it is nearly life-like. Our gaming experience is getting better & better \nevery day.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=849324][i]-Text[/i][/url][/align]\n\nThe topic for next week is \"What do you think of the HJT Team?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.imgur.com/hROzu.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/MIdtF.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/rKeHN.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=vOgl9XjLjWM[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=45246][b][color=white]Valiant[/color][/b][/url] has recently stepped down from leader of HJT Team.\n[url=http://hackforums.net/member.php?action=profile&uid=45246][b][color=white]Valiant[/color][/b][/url] has recently been demoted from moderator of the White Hat Help section.\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=white]Genuine[/color][/b][/url] has recently been promoted to Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=70881][b][color=white]Paradoxum[/color][/b][/url] has recently been promoted to Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=7807][b][color=white]VipVince[/color][/b][/url] has recently been promoted to Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=1042274][b][color=white] -๖ۣۜDivine-[/color][/b][/url] has recently been promoted to leader of the Techsperts.\n[url=http://hackforums.net/member.php?action=profile&uid=766855][b][color=white]Anxtrist[/color][/b][/url] has recently been promoted to leader of the Techsperts.\n[url=http://hackforums.net/member.php?action=profile&uid=946680][b][color=white]Ignite.[/color][/b][/url] has recently been removed from leader of Respawn, but still remains in the group.\n[url=http://hackforums.net/member.php?action=profile&uid=790289][b][color=white]Phayzon[/color][/b][/url] has recently been removed from leader of the Coders.\n[url=http://hackforums.net/member.php?action=profile&uid=5e5][b][color=white]CodeIgniter[/color][/b][/url] has recently been removed from leader of the Coders.\n[url=http://hackforums.net/member.php?action=profile&uid=62795][b][color=white]Tasemu[/color][/b][/url] has recently received moderator of the Anime Adventures section.\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=1058767][b][color=white]Richard.[/color][/b][/url] received the Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=1058767][b][color=white]Richard.[/color][/b][/url] received the Drunk award.\n[url=http://hackforums.net/member.php?action=profile&uid=128873][b][color=white]T3h Hack3r[/color][/b][/url] received the HJT Graduate award.\n[url=http://hackforums.net/member.php?action=profile&uid=170785][b][color=white]Infallible[/color][/b][/url] received the HJT Graduate award.\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b][color=white]Existence[/color][/b][/url] received the Sticky Man award.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/KNR24]Starstruck[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/gGUxd]Astonish[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*]~~Open~~\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/YEl4h]Waleed[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/gGUxd]Astonish[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}