{
  "posts": [
    {
      "pid": "6590389",
      "uid": "136025",
      "dateline": "1285142926",
      "message": "[align=center][IMG]http://i52.tinypic.com/28r1ux.jpg[/IMG][/align]\n\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 16th FULL edition. It is for the dates of 9/15/2010 to 9/22/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url]. \n\n[align=center][IMG]http://i54.tinypic.com/qstieq.png[/IMG][/align]\nThis past week on Hack Forums has been a week of twists and turns, mysteries and surprises, good [b]and[/b] bad. There has been an array of events that have sparked everyone's interests. Ranging from people entering new positions of authority and people stepping down from profound positions. Many events have given people a shock as to why it has occurred, and there has been some saddening moments this week.\nIn the last seven days, there has been a sad farewell from a well-known member. This member has been around Hack Forums for over a year, has achieved great amounts of responsibilities, shaped groups that are of prestige to this day, and completed tasks and roles to a great quality. He's been at some of the highest roles on Hack Forums, has had his own fair share of twists and turns as well as his successful amounts, [url=http://hackforums.net/member.php?action=profile&uid=74244]Yin[/url]. Yin has had a tremendous 'career' at Hack Forums, having been a Super Moderator (Staff member) for numerous months, a HJT veteran as well as the leader of the Reviewers for months on end. He has shaped the way the EBook Bazaar runs, created a great tradition, HF News, as well as assisted countless people in cleaning their computers.\n\nSome other saddening news is the demotion of numerous staff members:\n[list]\n[b][*][color=#32CD32]Kutmuskaturt[/color]\n[*][color=#32CD32]VipVince[/color]\n[*][color=#32CD32]Kewlhotrod[/color]\n[*][color=#9400D3]Yin[/color] (Moderator - UB3R)\n[*][color=#00BFFF]Hanzo[/color] (Administrator > HF UB3R)[/b]\n[/list]These Staff members have had an immense effect on the Staff team and Hack Forums itself, there presence will be missed. No one truly knows the reason to their demotion, although 'inactivity' has sparked up numerous times.\n\nAlongside these demotions, another member has stepped up and accepted the position of Super Moderator, [url=http://hackforums.net/member.php?action=profile&uid=143654]Kr4z1[/url]. The promotion of this rookie has sparked some controversy around Hack Forums, although, we should all wish him the best.\n\nOver the past week, there has also been numerous promotions of people into higher positions of authority. In to the Reviewers group, there have been two new leaders appointed to the group, [url=http://hackforums.net/member.php?action=profile&uid=30413]Taserz[/url] and [url=http://hackforums.net/member.php?action=profile&uid=136025]The Elite[/url]. They will be assisting the current leaders with daily errands and tasks. We wish them luck with the journey they embark on.\n\nOmniscient, on the 19th of September 2010, has given amnesty to most of the banned Hack Forums members. He has released many people from their ban as a second chance. This caused quite a controversy. [color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=685697]here[/url].[/b][/color]\n\n[align=center][IMG]http://i54.tinypic.com/30rmg0j.png[/IMG][/align]\nThere have been numerous news and discussion about Hack Forum members in the past week. There seems to have been a rise in amount of people hacked by other members lately. [color=#1E90FF][b]We would like to remind members of Hack Forums to not download and run files without virus scanning it and ensure that the member offering the download is legitimate.[/b][/color] If it seems to good to be true, it most likely is.\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nOn the 21st of September 2010, [url=http://hackforums.net/member.php?action=profile&uid=209986]ViRuzz™[/url] has notified members of Hack Forums that his account has been compromised. It's a good sign that he cleaned his computer quickly.\n\n[color=#1E90FF][b]You can read more of the thread [url=http://hackforums.net/showthread.php?tid=689784]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\n[url=http://hackforums.net/member.php?action=profile&uid=100071]Cobija[/url] has recently hit his one year anniversary at Hack Forums. This is a great achievement for such a contributory member. Cobija has achieved many great things here at Hack Forums, his latest one being an undergraduate for the HJT team. His thread has been locked by himself, although I'm sure you can still wish him the best in private message.\n\n[color=#1E90FF][b]You can read the thread [url=http://hackforums.net/showthread.php?tid=682872]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\n[url=http://hackforums.net/member.php?action=profile&uid=11960]Kn1ght[/url] has started a thread where users can ask him questions about himself. \n\n[color=#1E90FF][b]If you want to know something about Kn1ght, ask him [url=http://hackforums.net/showthread.php?tid=693027]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nThe lucky [url=http://hackforums.net/member.php?action=profile&uid=47360]Nicodemus-[/url] had successfully gotten an interview with Hack Forums Administrator, [url=http://hackforums.net/member.php?action=profile&uid=33279]iBruteforce[/url]. If you want to know something or just simply have an interesting read, the thread is for you.\n\n[color=#1E90FF][b]To read the interview, click [url=http://hackforums.net/showthread.php?tid=692675]here[/url].[/b][/color]\n\n[align=center][IMG]http://i51.tinypic.com/1zd6eja.png[/IMG][/align]\nIn other news, Hack Forums has almost achieved an amazing milestone. Recently hitting the largest MyBB forum ever, it is about to hit over 6,000,000 posts. Omniscient must be extremely proud of his creation and at the pace it is going now.\n\n[color=#1E90FF][b]You can read the thread (over 3 weeks old) about Hack Forums becoming #1 [url=http://hackforums.net/showthread.php?tid=653939]here[/url].[/b][/color]\n\n[color=#1E90FF][b]UB3R only news:[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=52444]..::ғoυrнмan::..[/url] has posted a thread about the UB3R usergroup status declining, all UB3Rs who are interested in putting their 2 cents in, should read the thread [url=http://hackforums.net/showthread.php?tid=672438]here[/url].\n\n[align=center][IMG]http://i51.tinypic.com/2w4f95h.png[/IMG][/align]\nThis week, I was lucky enough to have an interview with the one and only [url=http://hackforums.net/member.php?action=profile&uid=49806]N3w_2_H@Ck1n™[/url].\n\n[color=#1E90FF][b]1.[/b][/color] When did you join Hack Forums? What did you aim to achieve when you joined?\n[color=#32CD32][b]N2H:[/b][/color] [i]I joined around about march last year, when I joined I just wanted to learn more about what hacking was.. I was interested in phone hacking and batch coding at first.[/i]\n\n[color=#1E90FF][b]2.[/b][/color] After joining, where was most of your time spent (section)?\n[color=#32CD32][b]N2H:[/b][/color] [i]Oh well at first when I joined I wasn't that active, just made a couple posts in like beginner hacking and hacking requests and stuff, but then when I came back a few weeks later I found the lounge and got really active there.. It was fun, lol.[/i]\n\n[color=#1E90FF][b]3.[/b][/color] Who was your first ever inspiration and or friend on Hack Forums?\n[b][color=#32CD32]N2H:[/color][/b] [i]My first friend was Azerty, he was really funny and a chill guy. We both posted in the lounge a lot, and would hijack a lot of threads together, lol.[/i]\n\n[color=#1E90FF][b]4.[/b][/color]  When did you upgrade to L33T (approximately) and why?\n[color=#32CD32][b]N2H:[/b][/color] [i]Oh geez.. I don't remember when, must of been over a year ago, I won a contest and the guy now known as OG iFuck bought it for me. ^^[/i]\n[color=#1E90FF][b]Link here: http://hackforums.net/showthread.php?tid=104335[/b][/color]\n\n[color=#1E90FF][b]5. [/b][/color]You're well known for your chill attitude and happy personality yet serious when necessary. Is that how you always hoped to be, or not?\n[b][color=#32CD32]N2H:[/color][/b] [i]I sure hope that's how I'll always be, it makes me feel good to know members find me a more 'fun' mod to chat with. :P but honestly, i never tried to be that way, it's just how i am.[/i]\n\n[color=#1E90FF][b]6.[/b][/color] If you could go back and do one thing, what would it be?\n[color=#32CD32][b]N2H:[/b][/color] [i]I dunno, i don't have any regrets. Maybe I wouldn't have bought ub3r for Braco (on his account Nori) :P.[/i]\n\n[color=#1E90FF][b]7.[/b][/color] If you could choose to be one person on Hack Forums for a day, who would it be and why?\n[color=#32CD32][b]N2H:[/b][/color] [i]I think I'd probably be iBF, everybody is scared of him and I could have some fun with that lol. But honestly I'd prefer being myself. xD[/i]\n\n[color=#1E90FF][b]8. [/b][/color]Do you have any favourite Staff members?\n[color=#32CD32][b]N2H:[/b][/color] [i]No favourites, but I am closer to some more than others. TRRS is probably my best friend inside the Staff circle, we even might meet and go on a road trip next year, who knows. :P[/i]\n\n[color=#1E90FF][b]9.[/b][/color] How did you feel when you were contacted by Omniscient to become a Staff member?\n[color=#32CD32][b]N2H:[/b][/color] [i]Excited as fuck, I felt special lol. I couldn't sleep at all that night hahaha.[/i]\n\n[color=#1E90FF][b]The Elite:[/b][/color] Thank you very much for taking this interview. It's been an honor talking to you. I wish you the best with your future endeavors, and would like to ask you one more question. Is there anything you would like to tell the members of Hack Forums?\n[color=#32CD32][b]N2H:[/b][/color] [i]Yup and thanks for interviewing me, it's been a pleasure. Uhh.. okay yeh there is something I'd like to tell them.. it's more of a confession.. there's something I've been holding out on and keeping secret for far too long now. Thing is, I'm actually a girl.[/i]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nI hope you enjoyed my first ever edition of HF News. I did my best, so please give me feedback.\n\nTune in next week, when we get an interview with Kr4z1.",
      "subject": "[9/15/2010] - HF News"
    }
  ]
}