{
  "posts": [
    {
      "pid": "38277768",
      "uid": "515249",
      "dateline": "1392179804",
      "message": "[align=center][IMG]http://i.minus.com/jbuE5Wi2YsPBNz.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#992828][b]181st full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jeIKQbkYIsaql.png[/img][/align]\n\n[color=white][b]Defense of the Ancients Subforum[/b][/color]\nFollowing an influx of discussion threads about the game Defense of the Ancients, the previously denied suggestion of adding a DotA section in the Gaming tab has implemented into Hack Forums this week. The most recent addition to the gaming line of DotA is DotA 2, a multiple-player online battle arena based game and the standalone sequel to the Defense of the Ancients modification for the Warcraft III range. Available for free on Steam, game play involves two teams of five players each occupying a fortress at one side of a battleground. Similar to the popular game League of Legends, the object of the game is to infiltrate the opposing team's base and destroy an \"Ancient\" located within. The Twitter announcement by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] can be viewed [url=https://twitter.com/HackForumsNet/statuses/432319144059351041][b]here[/b][/url] and the section itself can be visited [url=http://hackforums.net/forumdisplay.php?fid=305][b]here[/b][/url].\n\n[color=white][b]The Old Will Fall[/b][/color]\nA Twitter post by Hack Forums' owner [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] announced that accounts that have had no login or activity for over one year will be closed accordingly. Previously, being an upgraded site member safeguarded accounts against such action, yet with the new update neither L33t or Ub3r members are spared from the unstoppable force of time. The policy will be reflected within the Help Documents and was most likely the result of an attempt to minimize the sales of older, unused accounts and thereby improving the safety and security of remaining active members by reducing the use of said old, and therefore usually regarded as more trusted, accounts for malicious intent. The announcement can be viewed at the following Twitter tweet: [url=https://twitter.com/HackForumsNet/statuses/430537600709849088][b]link[/b][/url].\n\n[color=white][b]The Order of Operations[/b][/color]\nNear the end of the year 2011, the member [url=http://hackforums.net/member.php?action=profile&uid=67412][color=#00AAFF][b]Thyonic[/b][/color][/url] posted a [url=http://hackforums.net/showthread.php?tid=1861119][b]thread[/b][/url] querying HF users for their answer to a simple math equation: \"2+2+2+2+2+2+2+2+2+2+2+2+2+2+2*0 = X\". Over the years, especially following a recent revival of the thread, close to one thousand community members have reflected their input, causing the options \"0\" and \"28\" to fight a close battle for having the most votes. In the dozens of pages of responses, members explained their opposing views of the answer, some arguing that anything times zero results in zero while others explained that due to the Order of Operations, the answer comes out to be 28. In mathematics, however, the result of this equation will always be the same. As is typically taught in middle school and most lower grades as well, equations with several operators can be correctly solved by using the Order of Operations. Following \"PEDMAS\", short for parentheses, exponents, division and multiplication, addition and subtraction, from left to right will cause the \"2*0\" at the end of the equation to be solved first, followed by the addition of the remaining 2's, resulting in the undeniably correct answer of 28 instead of 0. For a detailed explanation of the Order of Operations, a visit to [url=http://www.mathsisfun.com/operation-order-pemdas.html][b]Math Is Fun[/b][/url] is recommended.\n\n[align=center][img]http://i.minus.com/j0VfbyrNSaTvM.png[/img][/align]\n\n[color=white][b]User News[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1189774][color=#EFEFEF][b]Bandors[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=482888][color=#EFEFEF][b]mad[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=1695694][color=#EFEFEF][b]BitMoney[/b][/color][/url] hit 1,000 reputation.\n[/list]\n[color=white][b]News Notables[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1695694][color=#EFEFEF][b]BitMoney[/b][/color][/url] snagged the first post in the 180th edition.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1085827][color=#EFEFEF][b]Razmus[/b][/color][/url] snagged the 50th post in the 180th edition.\n[/list]\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1584453][color=#00AAFF][b]Mortality[/b][/color][/url] was repfucked for reputation abuse.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1659995][color=black][b]_Silky[/b][/color][/url] was repfucked for creating another account.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#383838][b]SkyGuy[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=527919][color=black][b]Frohe[/b][/color][/url] was repfucked for continued rep abuse.\n[/list]\n[color=white][b]Active Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1659995][color=black][b]_Silky[/b][/color][/url] was banned for multiple accounts.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=990843][color=black][b]Klusterfuk[/b][/color][/url] was banned with the reason: \"Provide proof of ownership for this account via the Contact Form.\" \n[*] [url=http://hackforums.net/member.php?action=profile&uid=2045133][color=black][b]Mike‌[/b][/color][/url] was banned with the reason: \"Use Contact Form\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=527919][color=black][b]Frohe[/b][/color][/url] was banned with the reason \"Continued Rep Abuse\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=861282][color=black][b]Badass[/b][/color][/url] was banned for ub3r reversal.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1793976][color=black][b]Nutrients[/b][/color][/url] was banned for post  delete.\n[/list]\n[color=white][b]Vacations[/b][/color]\n[list][list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1320406][color=black][b]Froggy[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1087518][color=black][b]#ReeF[/b][/color][/url] took a vacation ban.\n[/list]\n[/list]\n[color=white][b]Closures[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#383838][b]SkyGuy[/b][/color][/url] had their account closed.\n[/list]\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1263503][color=#EFEFEF][b]Ðexter[/b][/color][/url] received the Sticky Man award for [url=http://hackforums.net/showthread.php?tid=3726185]this[/url] thread.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1205532][color=#EFEFEF][b]Robust[/b][/color][/url] received the Diamond award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1839274][color=#EFEFEF][b]Skitlz[/b][/color][/url] donated for the Master Donator award.\n[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of scheduled release date for the HF News edition.[/size][/align]\n\n[align=center][img]http://i.minus.com/jWeoa1Hjg2W37.png[/img][/align]\n\n[url=http://hackforums.net/showthread.php?tid=1861119][b]How smart is HackForums? 2+2+2+2+2+2+2+2+2+2+2+2+2+2+2*0[/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=67412][color=#00AAFF][b]Thyonic[/b][/color][/url] - A thread questioning the math skills of the average Hackforums user.\n\n[url=http://hackforums.net/showthread.php?tid=4029951][b]Make your username a face![/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=1870701][color=#99FF00][b]Reward[/b][/color][/url] - A neat thread showing you how to make your username into a face.\n\n[url=http://hackforums.net/showthread.php?tid=4042866][b]Viral Dragon Support Contest - Easy to Enter - HUGE and Multiple Prizes - Check now![/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=123541][b][color=#00AAFF]StuffSneak[/color][/b][/url] - Support our fellow member [url=http://hackforums.net/member.php?action=profile&uid=23809][color=#00AAFF][b]Viral Dragon[/b][/color][/url] by entering this contest.\n\n[align=center][img]http://i.minus.com/jrNonh6cHA9zK.png[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=787112]Ty ™[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Heyya. Welcome to the 181st edition of the HF News. How's it going, Ty? Any shoutouts before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] Hey Saturday, I am having a nice day. I would have to give a huge shout out to Shockhosting and its owner Shermy for hosting all my sites. I also would like to give out a huge thanks to Finearts for being my Minecraft partner on Hackercraft and our own server. Also one last shoutout would have to be for Mommy for being one of the first person on Hackforums to welcome me with open arms.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Oh, sweet. Pretty sure one of our other interviewers interviewed Mommy for this week's edition too. So first off, tell us how you came across Hackforums to begin with.\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] I came accross Hackforums on June 30th, 2013 when I was trying to learn how to RAT. I never really got into the whole hacking seen and was inactive from the forum for a bit until I realized some of the other sections like the Marketplace, Monetizing Techniques, And The Lounge. Ever since then I have fell in love with the forum and with all the members I have met.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Well I was going to ask since you mentioned the member who hosts your sites. What type of sites do you run?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] I currently run 3 sites, One for my Minecraft server, a link shortner, and a website to help hackforums user to make auto message links. I really have to give Shockhosting a huge shout out because they provide some of the cheapest hosting I can find.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Oh, that auto message one sounds sweet. I used to have trouble formatting those. So minecraft server, huh? Do you ever play HackerCraft?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] I run a Factions server with Finearts and we have fun running it together. Yes I play Hackercraft quiet a bit, Ever since the map reset Finearts and I created a base together and we play together almost everyday. Its a fun way to make friends and also make money selling the Hackercraft award. I encourage anyone to come on the server to play even if you are not good at the game you can still make tons of friends.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Well aren't you an active member of the community. You're also an ebook salesman here too, eh? How's that going?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] That is just a extra hobby of mine, a lot of people do not respect people that sell eBooks and I can understand that but I am currently starting a new product like called \"Monster Products\". Currently I run MonsterVPN which is down at the moment but I also have two more products coming out soon which I am trying to keep a secret. All I can really say is one is coming out in a week or two and it is a program.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Well I wish you best of luck with that. Moving on, tell us about Ty. Who is really he behind the computer?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] Well I am quite a young teenager at the age of 16 living in Canada. I Like sports like football and soccer. In the way of school I get a average mark of %80 and probably my favourite subject is Computer Science. After school and when I am not on my computer I like to go in my room and talk to all my other friends, the friends I have on Hackforums.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] I do that as well. Live two lives; one online and one offline. I've met some of my best friends to this day online. Highschool, though. Any college plans yet or wherever the wind takes you?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] I currently have a couple of jobs in mind for the future. I would like to be a Software Engineer but because of the amount of people that want that job and the amount of people hiring I will probably go with my second or third choice which would be a electrician or bailiff. I am still a young kid and I may change my mind in the future.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Sounds exciting. So coming back to HF related questions. You've been here for over half a year. What are some major changes you've experienced since registration or what do you hope for the future?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] Some major changes I have seen that has happened was Paypal holders being no long allowed which I agree with %100, the Hackercraft map reset, and one of my favourite members getting promoted to staff which is Emylbus. For the future I wish to see more activity in the Video Editing section, Photography section, and the Investment Strategies and Markets section.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Well thank you a ton for the interview, Ty. I learned a lot about you. Do you have anything to say before I go?\n[url=http://hackforums.net/member.php?action=profile&uid=1871421][color=white][b]Ty ™:[/b][/color][/url] I would just like to say thank you so much for the interview Saturday and have a good night.[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=958226]Mommy[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Welcome to the 181th Edition of the HF News. Today we're joined by HF member Mommy. How's it going Mommy? Do you have any shootouts you'd like to make before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Of course, I gotta throw my shoutouts  to - Reggie, Trapcode, Tibit, Google Expert, Autopost, Smexy, Ni:12, Harlem, Cloudy, Clique, Cryph1x and anyone else thats been with me on my HF journey\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Quite the list, a few names stand out to me as well. So Mommy, how did you discover HF? What made you sign up?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Well too be honest, I was one of those TTG scrubs that just wanted to sell some gamertags. I then wanted to learn about hacking into shit when I saw anonymous and I thought they were cool. I was one of those kids… I know -_____-\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Everyone was at some point or another. Since you registered, have you learned anything about computer security? If not, what are some of your interests that relate to HF?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Too be honest with you, I don't know anything about computers LOL, so i sorta failed on that learning to hack part. But I just come back to HF day to day to just talk to everyone  because I just like to communicate with people and I also like to help the community with whatever I am able to.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] I've noticed you're a very social lad, very friendly too. That's always nice. So I know you have some interest in gaming, which console do you play on and which games specifically?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Hahahaha, thank you for noticing! I actually play call of duty competitively and currently the circuit is still on the xbox 360 so I don't have to throw away the 500 on the xbox one just yet. Sometimes I like to dip into madden or other games that are good to pass the time when Im waiting for my team to get on or if Im waiting for a tourney to start :3\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Cool cool, what's your KD ratio? Do you feel as if KD is an accurate measure of how good a player is?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Hahaha, good question! Uhm my k.d is barely like a 1.6, but KD means nothing on how well a player is (in competitive) unless its something ridiculous like .50 like if you look at pros KDs, they don't even touch a 2.0 if they play objective like I do (most of the time)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Yeah, it comes down to how objective based you are for sure. Anyway, what do you feel HF's most addictive quality is?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Well, currently my addiction is to get to 10k posts. And its just the simple fact that you can go on HF and learn something new every single day. Also I got a lot of good buddies on here that I like to talk to so if I'm not on Skype with them, I'm meeting new people lol. So when it comes down to it, the learning and the users.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Yeah the community's great. So do you have any future goals you'd like to accomplish oh HF?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Right now, I'm really focused on just getting to 10k posts and 1000 rep, but I think owning my own group / becoming a moderator of a section like the call of duty section would be nice. Hopefully one day it'll happen!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Those will be 10k QUALITY posts right? They better be. What's the section you're most active in?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] Of course they are going to be 10,000 High Quality, beautiful, SEXY posts. Im most active in the marketplace/lounge/gaming section (call of duty).\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Which kind of products in the marketplace interest you?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] I mainly look at just random/different stuff that interests me, a lot of real life things at a discount is nice a lot of the time :3 Also, I like to keep up with my buddies  sales and see how they are doing.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Right on, well Mommy, thanks for taking time out of your evening to join us. Any closing statements?\n[url=http://hackforums.net/member.php?action=profile&uid=958226][b]Mommy:[/b][/url] No problem! Feel free to have me back anytime, it is always good to get linked up with the HF community and hopefully everyone learned some things about me. Oh and a message to all the people that are reading this - \n\"Never let a bad day make you feel like you have a bad life.\"[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=875895]Clark[/url][/font][/size]\n[spoiler=][b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color]  Hey there -- welcome to this weeks edition of the news. This time we're (finally) interviewing our very own interviewer for the news, Clark. How are you doin' this weekend?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] I'm good thanks, and you?\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Doing good man. Anyone you'd like to give a shout out to before we continue on?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=875895]Clark[/url]:[/b][/color] Too many people to list, but they know who they are.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Cool, dude! When you first were in the Writ3rs you had Education/Debra Morgan as an alias. Any story behind those?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] I wish, but nah lol. Education just sounded cool, and I chose Debra Morgan because Dexter Morgan was taken. I like my current username though, I won't be changing it.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] I'm glad to hear it. Since, you're Clark. How'd you find us? The site that is.\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] I can't remember, but I stayed because I was receiving tons of support with Python and RATs lel.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Do you know Python yet? That'd be pree' cool. Anyways. What do you do outside of here? (Being a fellow Canadian, eh?)\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] Yeah, and I wouldn't have learned anything if it weren't for the member glob aka catalyst who helped me via Skype every night until I finally developed some logic and was able to problem solve on my own. I also took this course: https://www.coursera.org/course/interactivepython which I found out about in the Python section. I don't program in Python much anymore, I'm still learning HTML/CSS and JavaScript. Out side of here? I do what every canadian does, ride igloos and live in polar bears. I just got to le school and get out as much as I can.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] I believe that codecademy has some decent courses there, too. Best of luck with your future coding endeavors. Are you employed right now?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] Thanks breh, yeah. I work at a gas station. 8 hour shifts of \"fill it up with regular I'll pay inside, and do my windows\" It makes me respect what Omni does a lot more. being your own boss, working from home, and running a forum. That's the dream.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Think you're going to be workin' there forever? There's always options. What do you really want to do?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] I hope not. I've considered a few options, but none of which I've committed to. All I know is I'd like to work with techonologly everyday.\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Interesting, for sure mang. How are you liking HF thus far? Has it impacted you in any way?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] Loving it. Of course, I've learned tons of new things, and met tons new people. It's a great forum with a wonderful atmosphere and there's never a dull moment.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Glad to hear. Out of all the groups that you've been in/apart of. What's one that shines the most to you and why?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] I enjoyed being apart of the Innovation student program before it was cancelled. I was learning a lot and the assignments were fun. I think Innovation should bring that back. Writ3rs is another great group to be apart of. It's the one group that I've been apart of where there's no BS assignments that are forced upon the members simply so the group can try to remain relevant and active. The lounge is relaxed and Sir is a very reasonable-yet firm moderator which makes for an awesome group. level is awesome, and terrible at the same time and it's fun reading sat's and eiqhts responses to level. I hope to be apart of some more groups in the future, but until then I like the groups I'm apart of.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Level is level, no doubt. Glad that you're liking the writ3rs. Are you going to join #RESPAWN whenever it launches (again?)\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] Yes, but I wish Astonish would be a little more active. I'm not sure where he's at with the whole revival but I look forward to it.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Do you have any suggestions that you'd like to see being implemented into the site? Also: Are you watching the Winter Olympics? (You better, it's intense -- go Canada!)\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] I do, but Omni is aware of them. http://hackforums.net/showthread.php?tid=4030042 no, I don't follow the Olympics. sry m8\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Ah, lame dude. You should! Anything you'd like to say before we're done with the interview my man?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]:[/b][/color] Thanks for taking time out of your day for interviewing me Clique. Check out www.supportforums.net, give RDCA mentor permissions! all hail cyberzon5, and shouts to Freddy Krueger from HF.\n[/spoiler]",
      "subject": "HF News - 181"
    },
    {
      "pid": "38277775",
      "uid": "515249",
      "dateline": "1392179813",
      "message": "[align=center][img]http://i.minus.com/jbggqOcIdGP7s5.png[/img][/align]\n\n[color=white][b]Flappy Bird Being Taken Down[/b][/color]\nFlappy Bird hit the mobile community with a bang. It is a simple, but difficult game similar to the classic game, Helicopter. However, the developer announced on Twitter that he is taking the game down. \"I am sorry 'Flappy Bird' users, 22 hours from now, I will take 'Flappy Bird' down. I cannot take this anymore,\" Nguyen said in a series of tweets. \"It is not anything related to legal issues. I just cannot keep it anymore. I also don't sell 'Flappy Bird', please don't ask. And I still make games.\" It is not clear what the real reason is, but people are speculating that there are legal reasons, but the developer doesn't want to say. Flappy Bird has been a bit hit lately, with more than 50 million downloads and according to the developer, earning $50,000 per day in ad-revenue. By the time you read this, the game will most likely be gone.\n\n[color=white][b]Titanfall for Xbox 360 Delayed[/b][/color]\nElectronic Arts have announced that the Xbox 360 version of the much anticipated Titanfall will be delayed until March 25th. EA stated that the 360 version developer Bluepoint needed more time for finishing touches before the game releases. This delay does NOT affect the Xbox One and PC versions of the game. Recently, EA announced that the game will not have Australian servers at launch, however they will be put into place in the future. An upcoming beta will be released sometime this month, which will be held on Xbox One and PC... sorry Xbox 360 gamers. Titanfall launches in March on Xbox One, 360 and PC along with Xbox accessories and even an Xbox One update made to improve the party and matchmaking systems.\n\n[color=white][b]Blizzard E-Sports Initiative[/b][/color]\nBlizzard has announced a new partnership with the e-sports association that will support big college gaming groups and clubs. Blizzard stated that the bigger the group is, the more rewards and support they will provide. “TeSPA has been a positive force in the esports community built from the ground up by a small group of dedicated fans,” CEO and co-founder of Blizzard Mike Morhaime said in a press release. “By partnering with TeSPA we hope to give back to the players in a very new way to add fuel to an already thriving collegiate scene.” New groups will see their own website, t-shirt, manual and mailing list. However, bigger groups will see the following rewards; \"At 40 members, you'll get access to a partnered Twitch stream. At 65, you'll get $300 to sponsor one event a year, and be able to rent equipment like power cords and ethernet cables. At 80 members, the program will cover a pizza party and more equipment. With 200 members, the yearly budget increases to $500, adds gaming peripherals, and more.\" You can view all the benefits on the TESPA website [url=http://tespa.org/benefits/]here[/url]. \n\n[color=white][b]Video of the Week[/b][/color]\nThis week, The Red Dragon talks about a new policy that could effect you.\n\n[align=center][video=youtube]http://www.youtube.com/watch?v=MuWxWrEt8Yk[/video][/align]\n\n[align=center][img]http://i.minus.com/jbb0ATvLAZvxfB.png[/img][/align]\n\n[b][color=white]Snapshot 14w06b[/color][/b]\nAs we get closer to patch 1.8, Minecraft developers have been pushing out snapshots left and right; 14w06b being the latest. This snapshot fixes quite a few of the major bugs in previous versions, as well as other minor fixes. For survival players, the only notable change is mob AI. This snapshot contains many changes for mapmakers as well, just as most of the recent snapshots have. These include a hotkey to show player outlines when spectating, the ability to spawn entities that will not expire, and quite a few other things.\n\n[b][color=white]New Minecraft Console Edition Features Clarified[/color][/b]\nMinecraft for PS3 and Xbox 360 is expecting some new features quite soon. This news comes from a tweet on the official 4J Studios Twitter on February 4th. The tweet from the team clarified some details from a teaser image they released. They confirmed that the image had the PS4 edition on the top screen and PS3 on the bottom. The development team states that most of the new features seen will also be included in Xbox 360 and One versions of the game. 4J also alluded that they are using most of their resources on the TU14 update, which could possibly include many of the teaser features. \n\n[b][color=#43a828]Hacker[/color][color=#9428a8]Craft[/color] [color=white]News[/color][/b]\nActivity on HackerCraft has been good lately, for the first time in a long time (other than the past few weeks). The casino was fixed, server issues are getting better, and factions have been reimplemented to make many users happy. There is some debate regarding the changes, but that's always going to happen.\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]SurrealCraft[/color][/b]\nThis week's featured server is SurrealCraft. SurrealCraft is focused on Factions and PVP-style gameplay, and they have a great griefing and raiding system, which is encouraged. The world border is set at 4,000 blocks from spawn to make raiding more enjoyable for the users. On top of this there is little to no protection of structures and chest outside of the spawn, which many players enjoy. To top it off, the server has a great MobArena as well as several other things to bring more enjoyment to players. Connect today to experience what they have to offer at [b]Play.MCSurrealCraft.com[/b]\n\n[align=center][img]http://i.minus.com/jRoP8j6lSgFc9.png[/img][/align]\n\n[color=white][b]Jay Leno Says his Farewells..Again[/b][/color]\nAfter twelve years of hosting The Tonight Show, Jay Leno finally calls quits. Back in 2009 Jay passed on the show to Conan O'Brien for a small amount of time while working on another show of his. Leno soon returned after drama that occurred, and he continued his reign. After a long 22 years Jimmy Fallon will now be named \"King of the Night.\" Although Jimmy won't be taking Leno's spot on his show until  February 17th, he will still be hosting his show. With that being said, Seth Meyers, who is replacing Fallon on \"Late Night,\" will debut on Monday, February 24th. Jay has been around for years and has put a smile on a lot of his fans. With the game being reset, the \"Late Night Musical Chairs\" has started. Will these changes be for the best or the worst?\n\n[color=white][b]Seattle Reigns Supreme[/b][/color]\nCongrats! Sorry to all you Bronco fans out there, but the Seattle Seahawks have been crowned the Superbowl 48 Champions this past weekend. With Seattle's great offense and defense, the final outcome was 43-8. With everyone watching a man, Peyton Manning didn't have too many chances of passing to someone open. As for offense, the players were able to outrun, outsmart, and score against the opposing team. With the Seahawks receiving the ball first they scored soon enough starting off the game at 2-0. It was a brutal game to some and boring to others. Bronco's defense was way off that night and they had various different things they could have improved on. Have fun and party on!\n\n[color=white][b]Problems at the Vatican[/b][/color]\nThe United Nations brought up a very emotional topic: The Vatican will not disclose information about pedophiles who have been reported. Why are they doing this? To keep their holy image? Law enforcements are currently not allowed to look at the records and they want Pope Francis to do something about this. Although the criminals did it once, they may do it again, and with that being said they still might be on the loose. With people still in danger, keeping the names private will not help anyone whatsoever. Scary enough, some Bishops who have committed the crime themselves are still Bishops. It's a nasty world; Priests are instructed that you will be fired from the church if you go to the police or leak private information. More than likely perpetrators will not come forth and turn themselves in, but let's hope for the best.\n\n[color=white][b]Siege in Russian School[/b][/color]\nWith the Olympics coming to Sochi, it's a big deal for some and not for others. Happy and competitive faces roam the streets to see competitors from all across the world. Sadly, in a different part of Russia, a school was taken over by Chechen rebels. At least 1,200 children and adults were taken hostage at a school in Beslan, which is located in southern Russia. Through the horrible act of the siege, around one-hundred people died. This Chechen operation lasted for three days putting tears on people's faces, putting people in huge trauma attacks and so on so forth. A blast went off to start everything. Dozens of kids and teachers were hit hard. Blood everywhere, chills in the air, everyone who could escape ran off screaming. This all occurred during the first day. Second day: Hostage count grew and grew. The setup of explosives were very complex. Day 3: All the people were rounded up and brought from to the middle school. From there, explosives were placed in the gym. As the hostages were brought in, they were lined up against the wall and then the unfortunate happened...The place exploded. A witness nearby stated that inside the gym it \"Rained meat.\" People who could flee did. They weren't fed at all, the were forced to drink their own urine, and they were sweaty from the location they were kept captive in. Gruesome images have been posted online of those unlucky to survive or injured. Soldiers did their best to fight off the enemies, as well as comfort those there.\n\n[align=center][img]http://i.minus.com/jTIISqnQV7AMM.png[/img][/align]\n\n[color=white][b]Google's Field Trip Adds Ratings To Its Recommendations[/b][/color]\nGoogle hopes with the newest update of their Field Trip app, cool spots will be found easier no matter your location. Niantic Labs has added a rating system to the app which will help popular spots be found by the users. The new system is five-star based and should work easier with users to promote spots in their town.\n\n[color=white][b]Dyson Invests In Robot Research Lab[/b][/color]\nDyson has recently announced that they have invested £5 million (which is about $8.2 million US) into a robotics lab which is currently at Imperial College London. They claim they are working on developing a vision system to help robots adapt to the world around them. This lab is supposedly not only for vacuums but other robots. Some people also think that tons of new technology could come from this.\n\n[color=white][b]Nokia And HTC End Patent Dispute, Agreeing To License Each Other's Technology[/b][/color]\nNokia and HTC have been in a legal battle for a little while, and have now officially put that to rest. The two companies have signed an agreement to license each other's technology, and could possibly collaborate in the near future. There has been no reasoning behind this move from the two, but it could be that they wanted to protect themselves against other companies. Most of the details of the agreement are confidential at this point.\n\n[color=white][b]Verizon Waiving Activation Fees And Offering Trade In Deals[/b][/color]\nVerizon is now offering waived activation fees as well as trade in deals for smartphones for a limited time. This comes after all the promotions that T-Mobile have been doing recently, meaning this could be a move to try to compete with The UnCarrier. Verizon is not the first to do this recently, but no one seems to be complaining. These deals and promotions are best for the consumer. These rivalries could end up saving people a lot of money in cell phone bills and other things. Verizon is running most of these deals through March 31st, so they won't be around forever.\n\n[align=center][img]http://i.minus.com/j2bNJXw7KAGGS.png[/img][/align]\n\n[color=white][b]Trinidad James Arrested For Marijuana Possession In Mississippi[/b][/color]\n'All Gold Everything' MC is reportedly in custody for possession of a \"controlled substance.\" Trinidad James was arrested for possession of a controlled substance on Friday (February 7th) after allegedly smoking marijuana in a hotel room in Batesville, Mississippi. In the state of Mississippi, possession of marijuana is normally considered a misdemeanor. A first offense for possession of 30 grams or less is punishable by a fine of $100 to $250. So it's safe to say that he's fine. More info [url=http://www.tmz.com/2014/02/07/rapper-trinidad-james-busted-arrested-marijuana-mississippi/][u][i]here[/i][/u][/url].\n\nEDIT: He's off the hook for those charges. Read more [url=http://www.tmz.com/2014/02/10/trinidad-james-weed-charge-dropped-marijuana/]here[/url].\n\n[color=white][b]Miley Gets Nude for Fashion[/b][/color]\nNo stranger to controversy, Cyrus ignited the flame again this week with [i]two [/i]new magazine editorials. Vogue Germany shows Cyrus playing the part of Marilyn Monroe, complete with platinum wig, big diamonds and... well, boobs. Lots of boobs (little ones at that.) \"W\" magazine features the star on the cover as well and can you see Cyrus topless in that spread, too.\n\n[color=white][b]Kendrick & Pharrell Team Up For NBA All-Star[/b][/color]\nNBA All-Star Game rolls through on February 15. Pharrell Williams will headline the \"Entertainment Series,\" Kendrick Lamar will perform during the Sprite Slam Dunk Contest, and guitarist Gary Clark Jr. will rock the National Anthem before the big game. We'll also see appearances from Janelle Monae, Serena Ryder and Earth, Wind and Fire. I heard there's also some sport that's going to be played.\n\n[align=center][img]http://i.minus.com/jT4JzXVrxHH7U.png[/img][/align]\n\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n-=-=-\nSuccess. Success can be difficult, time-consuming, and sometimes nigh-impossible, but with the exceptional application of perseverance and planning, it can always be achieved. Success is simply denying yourself the right to retire. Anything truly is possible, the determining factor is whether you give up and move on or buckle down and crank it out. Decide whether it's worth the time and effort, if not, make it. Do.",
      "subject": "*"
    },
    {
      "pid": "38277780",
      "uid": "515249",
      "dateline": "1392179825",
      "message": "[align=center][img]http://i.minus.com/jVmaqh7FT5OHU.png[/img][/align]\n\n\"How do you feel about Emylbus for Staff?\"\n\n[i]\"I think Emylbus will be a great member of staff and an \nexcellent addition to the current staff team, It's been a \nwhile now since we've seen a mentor being promoted to \nstaff but I believe out of all the existing mentors Emylbus \nwas the best choice for the staff position at the time of \nme writing this. Congratulations to Emylbus I hope you \nremain on the staff team for the foreseeable future.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1119610][i]-Winner[/i][/url][/align]\n\n[align=right][i]\"Elymbus is a noob. And Omni is kind \nof noobs. So it only seems right that \nElymbus works for Omni now.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][i]-xadamxk[/i][/url][/align]\n\n[i]\"I personally feel that Emylbus was a great mentor \nand he will continue to do so as staff. He has been \namazing at responding to my PMs with speed and \nprecision that I feel he could staff there after his \nprobation is up. Good job, Emy! :)\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1756844][i]-Zeus[/i][/url]\n\nThe topic for next week is \"How do you feel about the automatic closure of unused accounts?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbqBVzPk0X1Kwz.png[/IMG]\n\n[url=http://hackforums.net/private.php?action=send&uid=884903&subject=gallerysubmission][img]http://puu.sh/6S10o.gif[/img][/url]\n[/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbeer0ih3F578I.png[/img][/align]\n\n[align=center][spoiler=][img]http://i.imgur.com/2Nx2dH2.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/t8jej6K.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/Ztg2saK.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/v9AN1ED.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/bpEniq2.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/JKre34Z.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j64bR8y6VvRNn.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]awhty[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=138559]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=752389]eiqhtworks[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692131]Yuzuha[/url]\n[list][*]World News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=884903]Unreputed[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=139340]Poseidon[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1172544]awhty[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=891000]Xerucide[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}