{
  "posts": [
    {
      "pid": "22532792",
      "uid": "515249",
      "dateline": "1336799541",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]91st full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Basscοde censored and members banned[/b][/color]\nBasscοde, a group infamous for leaking and cracking has recently been caught leaking several HF products. Many of the well known members were banned for the reason \"leaking/cracking\". The word Basscοde was also censored to \"spam\" most likely to prevent discussion of the group.\n\n[color=white][b]Possible new rule[/b][/color]\nAs many of you know the \"Post here and PM me\" threads have recently been banned in the Monetizing section. According to one of [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s posts this rule may become an official site-wide rule on HF. [url=http://hackforums.net/member.php?action=profile&uid=129812][color=lime][b]Peter Chao[/b][/color][/url], one of the main supporters of this change created a thread explaining the issue ad why the rule should be put into affect. To read Peter Chao's thread click the following link: http://goo.gl/7cPSe\n\n[color=white][b]New sections[/b][/color]\nAs per user request both the \"Battlefield series\" and \"Mobile and Tablet gaming\" sections have been added under the Gaming tab. Both sections were suggested by different users this week due to an overflow of threads in mixed sections around HackForums. Surprisingly [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] accepted both suggestions and quickly implemented them. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the downtime click the following link: http://goo.gl/UIxET\n\n[color=white][b]Short downtime[/b][/color]\nEarlier this week there was short period of downtime while [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] did a maintenance reboot. Not much is known about this event other than that it was nothing out of the ordinary for HF members. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the downtime click the following link: http://goo.gl/j85Y2\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[url=http://hackforums.net/reputation.php?uid=946680][b]Ignite[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=47962][color=#0066FF][b]Spafic[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=500863][color=#0066FF][b]Leafs[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=1063224][color=#0066FF][b]Angelic™[/b][/color][/url] have reached the milestone of 1000 reputation points! Congratulations to them.\n[url=http://hackforums.net/member.php?action=profile&uid=566671][color=#0066FF][b]panDa.[/b][/color][/url] has had his account recovered and is glad to be back with the community. You can welcome him back [url=http://hackforums.net/showthread.php?tid=2469965]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=661940][b]bugga[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=89623][b]Mark Webber[/b][/url],  [url=http://hackforums.net/member.php?action=profile&uid=431105][b]Tɦɛ Gʀiɱ[/b][/url] and other well known members are being impersonated in order to scam people out of money. Read more about it [url=http://hackforums.net/showthread.php?tid=2476262]here[/url],  [url=http://hackforums.net/showthread.php?tid=2477338]here[/url], and [url=http://hackforums.net/showthread.php?tid=2464590]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=1159829][color=black][b]Subscription[/b][/color][/url] has had his account closed and repfucked due to to ban evading. It turns out that he was actually [url=http://hackforums.net/member.php?action=profile&uid=699743][color=black][b]Legitti[/b][/color][/url], a known scammer. You can see the thread [url=http://hackforums.net/showthread.php?tid=2477340]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=187420][color=#0066FF][b]iDuL[/b][/color][/url] happens to live right near the new Twitter headquarters! For pictures, check out [url=http://hackforums.net/showthread.php?tid=2479954]this [/url]thread.\n\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172939][color=black][b]E180™[/b][/color][/url] was repfucked and banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=969142][color=black][b]Triple H[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=972306][color=black][b]Foig[/b][/color][/url] was banned for being impatient.\n[*][url=http://hackforums.net/member.php?action=profile&uid=330676][color=#FF0000][b]Diabolic[/b][/color][/url] was repfucked again.\n[*][url=http://hackforums.net/member.php?action=profile&uid=658521][color=black][b]-luke-[/b][/color][/url] was banned for mass cross-posting.\n[*][url=http://hackforums.net/member.php?action=profile&uid=667183][color=black][b]ß|Λcksí-íΛdΘw™[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=108076][color=black][b]Ups.[/b][/color][/url], a former Coders leader, was repfucked and banned for carding.\n[*][url=http://hackforums.net/member.php?action=profile&uid=682899][color=black][b]Billy Mays[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=761719][color=black][b]Jumanji[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=309536][color=black][b]Verilog[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=285508][color=black][b]Pocky[/b][/color][/url] was banned for abusing the ub3r junking feature.\n[*][url=http://hackforums.net/member.php?action=profile&uid=729921][color=black][b]Cяιмιηαℓ[/b][/color][/url] was repfucked and banned.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Star Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2477768]The final Qwazz Star![/url] - [url=http://hackforums.net/member.php?action=profile&uid=295848][color=white][b]Qwazz[/b][/color][/url] - Qwazz has put up his last \"Qwazz Star\" for auction. The highest bidder will take home these pixels!\n\n[i][b]Feedback Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2484477]Hackforums Feedback[/url] - [url=http://hackforums.net/member.php?action=profile&uid=155834][color=white][b]DeMeR[/b][/color][/url] - This is just another voice trying to get heard about Hack Forums. You should read his opinions, and see what you think.\n\n[i][b]Suggestion Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2482338]Member List to Members[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1031147][color=white][b]iamkenIT[/b][/color][/url] - This is the thread that got \"Members List\" changed to \"Members.\"\n\n[i][b]Impersonation Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2476262]Impersonation Beware[/url] - [url=http://hackforums.net/member.php?action=profile&uid=661940][color=white][b]bugga[/b][/color][/url] - There have been a lot of people getting impersonated on Skype, be cautious and always message the person on Hack Forums.\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=426299]Oldskool.[/url][/font][/size][/color][spoiler=]\n[b]Waleed:[/b] Thanks for tuning in HF News readers. I'm here with the one and only Oldskool. An all-around member of the Hack Forums community. Oldskool would you like to take this opportunity to give your closest HF friends a shout out?\n[color=#9370DB][b]Oldskool.:[/b] Oh definitely! First of all, thank you for offering me this opportunity. As for shout outs, I'd like to give one to Diabolic, Dr.BrokenGod, Mark Webber, everyone in team Syndicate and of course, my good friends in the AA section.[/color]\n\n[b]Waleed:[/b] You're very welcome, you definitely deserved it. I hope everyone you've mentioned are pleased to see their names featured in this edition of HF News. All of us have joined HackForums for different reasons; I joined in a poor attempt to show off my virtual goods in the Habbo Section, ironically one year later I'm still here. What influenced you to join HackForums and what was your aim?\n[color=#9370DB][b]Oldskool.:[/b] Mine was quite an unfortunate happening, to be honest. I had downloaded a virtual credit generator for a game called 'Battlefield Heroes' from YouTube. This, obviously, was fake and infected. The attacker made a window pop-up on my screen that said, \"I'm in a good mood. Either you join a forum and use my referral link, or I'll destroy your computer.\". The latter obviously wasn't my preferred choice, so I ended up signing up on Hack Forums![/color]\n\n[b]Waleed:[/b] That's quite a bizarre technique to gain referral points. You yourself have accomplished much around HackForums; A sky rocketing 1079 reputation, 5 awards and even a stickied thread. What would you say is your greatest accomplishment here on HackForums?\n[color=#9370DB][b]Oldskool.:[/b] Aww, I'm flattered. Well, having Omniscient re-open the HMSE section for the second time is without a doubt my biggest accomplishment thus far.[/color]\n\n[b]Waleed:[/b] Sadly it's been closed once again. What made the HMSE section so important to you and do you still wish to see it unlocked?\n[color=#9370DB][b]Oldskool.:[/b] The HMSE section is what has kept me active on HF during my 'darker' period in life. I started manipulating when I was eleven years old, so it's a part of me. I've put heart, soul and lots of hours on threads in the HMSE section, so I was really sad to see it getting closed another time. That's why I've decided to create a new, unofficial group on HF called \"Syndicate\". We consist of members specialized in human manipulation and our main goal is to convince Omniscient of re-opening the section once again. Our ways are unsure as of now, though.[/color]\n\n[b]Waleed:[/b] You were quite the little mastermind. Would you say Syndicate has made progress since it's launch as a group and is there a possibility of seeing the groups main objective regarding the HMSE section being achieved anytime soon?\n[color=#9370DB][b]Oldskool.:[/b] Syndicate has definitely made a lot of progress up 'till now, although not on Hack Forums. Crow, the previous admin in charge of stolen accounts on HF, has made Syndicate an official group on his myBB forum. We've also grown quite a bit in numbers and since everyone tends to think alike, we also really enjoy each other's presence and talk daily on skype. Our main goal has unfortunately been postponed to an unknown date since I forgot to stick to the main plan.[/color]\n\n[b]Waleed:[/b] For our readers who are unaware of what the HMSE section is, could you briefly describe the controversy as well as the intent of human manipulation and social engineering?\n[color=#9370DB][b]Oldskool.:[/b] Lets just say that human manipulation and social engineering are two entirely different things. It's mainly not about getting free items from companies. That is, unless you walk up to a company owner or a help desk in real life and use false documents in order to acquire those. It's really about understanding human behavior, etc. Even though the terms are related, or basically mean the same thing in a way, I'd say that human manipulation refers more to the psychological point of view, which is what I love, and social engineering refers more to item fraud.[/color\n\n[b]Waleed:[/b] You have tremendous knowledge and familiarity regarding this topic. I'd like to thank you for shedding some light with our readers. I hope they've enjoyed reading your responses as much as I did. Do you have any last words before we end this interview?\n[color=#9370DB][b]Oldskool.:[/b] I guess I could say that no one should ever accept candy from a smelly man in a white van, because my mother has taught me that candy is bad for your teeth!<3[/color]\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=488246]Assyrian[/url][/font][/size][/color][spoiler=]\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  Hello HF readers; we're here with [url=http://hackforums.net/member.php?action=profile&uid=488246]Assyrian[/url] today.  Thanks for joining us in this interview, [url=http://hackforums.net/member.php?action=profile&uid=488246]Assyrian[/url].  First of all, I'd like to say happy birthday to you on behalf of the News Team!  Before we start, would you like to make any shout-outs?[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/url]:[/b]  Hey, thanks for the birthday wishes, I'd just like to thank Nivarka for helping me back in the days to getting where I am today ;)[/color]\n\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  Absolutely welcome, I'm sure he will appreciate the shout-out.  With the vague sections of HackForums, nearly anyone can join and find a section suited for them.  How did you personally find out about HackForums, and why did you join?[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/color][/url]:[/b]   I personally found out about HackForums over Google when searching for some beginner hacking techniques, after a bit of skim reading I realized that the forum was full of potential and began my journey from there.[/color]\n\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  Look's like you made a good choice!  What is the most important thing you've learned from HF?[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/color][/url]:[/b]   A well-known quote, \"You can't learn to hack, you hack to learn\".[/color]\n\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  That's quite an inspirational quote.  It disappoints me seeing people take advantage of free information from HackForums for the wrong purposes.  If you get children some day and they grow up to be teenagers, would you approve of them being on HF?  (Assuming it is still around and hasn't changed much)[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/color][/url]:[/b]   Personally, yes I would, just based on the fact there is so much to learn from the community, I know I've learnt a lot, not just about hacking but day to day things that you don't always notice.  [/color]\n\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  I couldn't agree more.  The amount of knowledge one can gain if he looks in the right place is endless.  You have an interesting username, how did you get it?[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/color][/url]:[/b]   I'm quite into history myself, aswell as religion, so I put some thinking into this and went for something quite unique and the first thing that I genuinely considered was the name Assyrian which is a group of people that were a great influence on the Christian religion which means a lot to me.[/color]\n[/color\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  I hear they were a mighty country back in the day, having an empire that streched from the Mediterranean to the head of the Persian Gulf, along with what was was said to be the first true professional army in history.  Thanks for the little history lesson.  I'm also quite fascinated with it as well.  Wrapping it up now; what would you say is your favorite section on HF?[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/color][/url]:[/b]   I'd say that the Gaming section would be my favorite section, solely based on the fact that I spend majority of my time there, and there is always new content to read up on, aswell as it spreads from platform to platform making it hard to become an oudated section and it's something I value quite highly in my life.[/color]\n\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=355307]Chocothunda[/url]:[/b]  You sound like you have your life, passions, and priorities, right where you want it, and I'm sure it will further your success inevitably.  I'd like to thank you for joining me in this interview and I've had a great time.  Before we go, do you have any last words for the readers?[/color]\n[color=#00BFFF][b][url=http://hackforums.net/member.php?action=profile&uid=488246][color=#00BFFF]Assyrian[/color][/url]:[/b] It's a pleasure, I'd just like to say thank you for taking your time reading and good luck with every ambition you have in life and never give up.[/color]\n[/spoiler]",
      "subject": "[5/11/12] - HF News"
    },
    {
      "pid": "22532986",
      "uid": "515249",
      "dateline": "1336800090",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][IMG]http://i.imgur.com/qjUSp.png[/IMG][/align]\n[align=center][yt]http://www.youtube.com/watch?v=4fFSaukOXcQ[/yt][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Mexican Police find numerous mutilated bodies[/b][/color]\nPolice in the western state of Jalisco, Mexico, had recently found an estimated figure of 12 mutilated remains. On further inspection of the vehicles the bodies were found in, an addition of six more were counted. The police suspect that the Zetas drug cartel is involved due to a threatening note found alongside the bodies.\nDue to the state the remains are in, forensic experts have not yet been able to identify whether or not the remains are male or female.\n\n[color=white][b]Thirteen French fire fighters detained over recruit rape[/b][/color]\nA number of fire fighters from Paris have been detained after an alleged rape of a rookie. The supposed attack took place on a coach from a sports competition of which the fire fighters were returning from. \nWhen he protested, several other young firemen got involved in the occurrence. According to Le Parisien newspaper, the slave was stripped, bitten and pinned down while filmed being sexually assaulted.\nIt is claimed there will be a thorough investigation, and the Paris Fire Brigade have stated that the incident was “particularly serious”.\n\n[color=white][b]Ex-Detective imprisoned for love rival murder[/b][/color]\nStephanie Lazarus, 52, who was a detective in Los Angeles was recently sentenced to 27 years for first degree murder. 26 years earlier in February 1986, a 29 year old nurse, Sherri Rasmussen died after being beaten heavily and obtaining three gunshot wounds to the chest.\nAt the time, DNA was not in use as forensic evidence and prosecutors proposed that Lazarus has used her knowledge to conceal the crime of which she committed.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]iPod[/b][/color]\nA man had 4 magnets implanted in him to hold the new iPod nano (small square model). The iPod nano has sparked a market of new products like a wrist watch holder for the iPod watch interface. The thing mostly that is concerning is that if apple comes out with a new design, will it keep the same dynamics as the iPod of the previous generation?\n\n[color=white][b]Blackberry[/b][/color]\nRim which owns blackberry has applied for another 2 patents. It seems like Rim is trying to cling on every last little string they have. Rim is a company that has  been having a difficult year and much loss in people use and \nmoney loss. They have been losing contracts and people using their phones because blackberry has been late to the game of changing their phones and getting into the touch-screen market. \n\n[color=white][b]iOS[/b][/color]\np0d2g has jail broken firmware 5.1 untethered on the new iPad. After much hard work, 2g and other iOS hackers have managed to untether the firmware. It's still not ready for public debut but it's a step in almost getting there. Apple recently released 5.1.1 and it seems like the exploits found for 5.1 still work on 5.1.1. Still don't update until everything is for sure. \n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b]Juelz Santana: Album with Lil Wayne Coming[/b]\nAfter a five year wait for the callabo album from Lil Wayne and Juelz Santana, it still hasn't lost momentum.\nA large sum of mixtape songs were leaked on the internet in just a few days of their recording.\nBoth rappers later revealed that the new album is in the process of being recorded & produced.\n\n[i]No official release date has been set for \"I Can’t Feel My Face\".[/i]\n\n[b]MCA of the Beastie Boys Has Died[/b]\nAdam Yauch, better known as MCA, has died at age 47.\nHe was diagnosed with cancer of his parotid gland and lymph nodes in 2009.\nHe was the founding member of the Beastie Boys. They started to become more popular\nduring the 1980's with big hits such as \"Brass Monkey,\" \"Sabotage\" and \"Sure Shot.\"\n\n[b]Pepsi Reunites With Michael Jackson in New Ads[/b]\nOn May 3rd, the company has announced a deal with estate of Michael Jackson to use\nthe pop star likeness and music as apart of their advertisement. There will also be special edition\ncan's with Michael's image, and new remixed versions of a few of his hit songs.\n\nIn 1984, Michael has suffered from severe burns from his head when his hair got caught on fire\nwhen shooting a commercial for Pepsi. The company provided Michael with $1.5 million for his injuries.\n\n[i]Fans in the U.S & China will be the first to lay eyes on the advertisement as the campaign kicks off in the up-coming weeks.[/i]\n\n[b]Beyoncé Set to Win Writing Award from NYABJ[/b]\nThe Grammy Award winning singer will win a writing award from the New York Association of Black Journalists\nfor her cover story, \"Eat, Play, Love,\" in Essence magazine. \nSince her daughter was born, Beyoncé relaunched her\nofficial website where she has been showing her writing talents.\n\n[i]The New York Association of Black Journalists will host their awards ceremony on May 15.[/i]\n\n[b]Nicki Minaj to Headline Hot 97’s Summer Jam[/b]\nJust eight days ago, New York based radio station has announced the line-up\nfor the annual concert series. Maybach will be represented with Wale, Meek Mill, and Rick Ross.\nNicki Minaj will be representing for the YMCMB family along with Tyga who will\npreform \"Rack City\" in front of 50,000 fans.\n\n[i]Summer Jam 2012 will take place on June 3 at MetLife Stadium in East Rutherford, New Jersey.[/i]\n\n[b]Music Video of The Week[/b]\n[Spoiler= ]\n[yt]http://www.youtube.com/watch?v=Sv6dMFF_yts&ob=av3e[/yt]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThis time it's more of an announcement than my own personal thoughts. I am thinking about giving up some of the sections I write so as to decrease the load on me. I've been doing this for a long time, and in five days I'll have been on the HF News team for a year, running it for seven months. I just think it's time to sit back a little.",
      "subject": "*"
    },
    {
      "pid": "22532998",
      "uid": "515249",
      "dateline": "1336800115",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you think of the HJT Team?\"\n\n[i]\"From a HJT Teacher's point of view, which I am one, the HJT Team is like a family. I came \nfrom the HJT Team from SupportForums and then was transferred here. People take us for \ngranted, and think that this will be a short and easy process. Hence why Omniscient wants \nthe curriculum to be only 2 months which is impossible. People don't understand how malware \nremoval takes. It's not about rushing to the finish line. It's now about how we make the practice \nlogs long and complex. It's about how we teach the material and making sure a trainee understands \nthe material. 4 months would be suitable for graduating or more. The HJT Team is how you say \n\"uncomplete\". Our practice logs will be redone, and teachers will finally get paid. So far there are a \nfew active teachers which are Infallible, T3h Hack3r, Tha Sneak, Deltron, and lastly, myself. We get \npissed when we see a cheater in the team,which Infallible caught one yesterday. Under the former \nleader, Valiant's leadership, nothing happened. It's like he didn't care about us. He was always secretive \nand would just log on then just log off the whole day. But now, seeing new leadership, I hope to see \nchanges be made. I am sure Infallible, and T3h Hack3r will create these changes, with Paradoxum \nadvising them.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=847499][i]-Brandenx781[/i][/url]\n\n[align=right][i]\"Every member in the HJT team is worthy of my respect, and everyone's respect. They \ndo so much good on HF and should be recognized. They volunteer their time to assist members here, \nsomething that really doesn't happen too much online, and very rarely in the real world. This group is \nthe only group that I can fully respect and appreciate each one of their members, and truly say that \nHF would be at a loss if any of them resigned or become inactive.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][i]-Pali[/i][/url][/align]\n\nThe topic for next week is \"What do you think of the HF News?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.imgur.com/f2f0n.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/tFNmb.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/TgV8o.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=Z5UhNsCF6bY[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/myawards.php?uid=923753][color=#0066FF][b]Juicy Booty[/b][/color][/url] got the Master Donater award and The Alien award.  To see all members with these awards, click [url=http://hackforums.net/myawards.php?awid=50]here[/url] and [url=http://hackforums.net/myawards.php?awid=55]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url] got the Sticky Man award for making a very detailed thread on stress testing. You can view this thread [url=http://hackforums.net/showthread.php?tid=2450861]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=766855][b]Anxtrist[/b][/url] got the Sticky Man award for creating mega-thread on League of Legends. Check it out [url=http://hackforums.net/showthread.php?tid=2453105]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=1011113][b]Dan.[/b][/url] got the Ninja award.\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b]Positive[/b][/url] earned the Star award, bring his total award count to the double digits.\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=#0066FF][b]Brandenx781[/b][/color][/url],  [url=http://hackforums.net/member.php?action=profile&uid=847488][b]Deltron[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=70881][b]Paradoxum[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=129812][color=#00FF00][b]Peter Chao[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=56680][b]Shinkirou[/b][/url], and [url=http://hackforums.net/member.php?action=profile&uid=284502][b]Tha Sneak[/b][/url] all received the HJT Graduate award. Congratulations to them!\n[url=http://hackforums.net/member.php?action=profile&uid=492002][color=#0066FF][b]ZooT ツ[/b][/color][/url] received the Da Bomb award. To see all members with this rare award, click [url=http://hackforums.net/myawards.php?awid=26]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=974289][b]Burnin'Bob[/b][/url] got the Turkey award for revealing his information about [url=http://hackforums.net/member.php?action=profile&uid=1159829][color=black]Subscription[/color][/url] two days after the fact.\n[url=http://hackforums.net/member.php?action=profile&uid=1206954][color=#0066FF][b]Victoria Justice[/b][/color][/url] got the Master Donater award and the Dancing Queen award. Thank you for donating.\n\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=725160][b]McFlurry[/b][/url] is now a group leader of Propitious.\n[url=http://hackforums.net/member.php?action=profile&uid=23809][b]Viral Dragon[/b][/url] is now a group leader of Root.\n[url=http://hackforums.net/member.php?action=profile&uid=529870][b]+Pirate[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=60729][b]masterfan[/b][/url] have been promoted to group leaders of Respawn.\n[url=http://hackforums.net/member.php?action=profile&uid=108076][color=black][b]Ups.[/b][/color][/url] has been removed as a leader of the Coders.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/KNR24]Starstruck[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/vwJYz]Eruditus[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/3fcaX]Genuine[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[*][url=http://goo.gl/YEl4h]Waleed[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}