{
  "posts": [
    {
      "pid": "33672112",
      "uid": "515249",
      "dateline": "1372747413",
      "message": "[align=center][IMG]http://i.minus.com/jKNmbtspH7Pil.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#E42217][b]149th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jbd50RvJc3HTdt.png[/img][/align]\n[color=white][b]Legacy Converted to Lannisters![/b][/color]\nFormer gaming group Legacy founded by [url=http://hackforums.net/member.php?action=profile&uid=600771][b]Vinnie'[/b][/url] has now been changed to the Lannisters, a name inspired by The Game of Thrones. The Lannisters group description is now \"A Lannister always pays his debts\". otherwise known as a small family of wealthy yet powerful individuals. If that doesn't give it away, yes, this is a group dedicated to marketing, but don't be fooled as this group will remain small as claimed by [url=http://hackforums.net/member.php?action=profile&uid=600771][b]Vinnie'[/b][/url], and won't be easy to get into. From this time, the group is indeed invite only, and looks as if it will remain this way.\n\n[color=white][b]Blank Changed to Brotherhood[/b][/color]\nFormally known group \"Blank\" has changed into Brotherhood which is founded by [url=http://hackforums.net/member.php?action=profile&uid=716331][b]Cryptic™[/b][/url]. The group was previously called Blank due to them not having come up with a name for the group yet. The group is now officially called Brotherhood with the group description \"The Brotherhood is an organization of individuals who are bound by loyalty to exercise their skills, knowledge, and time, which will encourage the acts of assisting oneself and others.\" This group is currently recruiting; the recruitment thread may be found by [url=http://hackforums.net/showthread.php?tid=3586454][b]clicking here[/b][/url].\n\n[color=white][b]Omniscient Has Enabled Stealth Mode[/b][/color]\nBoard owner [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has recently switched into stealth mode. Many of you may have noticed a new plugin he has developed for himself, and probably for other administrators too. Members can no longer see when [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] is online, or the time he last visited, or even his total time online. If you want to see this plugin in action for yourself, feel free to visit [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s profile by [url=http://hackforums.net/member.php?action=profile&uid=1][b]clicking here[/b][/url]. By the looks of it, you will have no more stalkers [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] 👹\n\n[color=white][b]Omniscient's New Computer Build[/b][/color]\nFor those computer enthusiasts, you may want to check out [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s video of his new build. His old computer has been a victim to BSOD(s) (Blue Screen of Death), so he was forced to purchase a new computer, or in this case, build his own. You can view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s thread by [url=http://hackforums.net/showthread.php?tid=3582382][b]clicking here[/b][/url].\n\n[align=center][img]http://i.minus.com/jbrPyz6ReCubi3.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1356625][color=#FFD700][b]Ne‎ro‎[/b][/color][/url] has returned from a one year ban and account closing.\n[url=http://hackforums.net/member.php?action=profile&uid=789677][b]Grin[/b][/url] has reached 30,000 posts.\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b]Genuine[/b][/url] resigned from Staff and received the Diamond award for his efforts.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1407061][color=black][b]Clark Kent™[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=608523][b]Soliloquy[/b][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1697806][b]Sleeping With Sirens[/b][/url] was repfucked for accusing a member of scamming without a scam report.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=277684][color=black][b]Knuckles[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1407061][color=black][b]Clark Kent™[/b][/color][/url] was banned for \"leaking ebooks.\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=183072][color=#00FF00][b]Mr Kewl[/b][/color][/url] went on a vacation ban and has since returned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=277684][color=black][b]Knuckles[/b][/color][/url] was banned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=482888][b]mad[/b][/url] went on a vacation ban and has since returned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1263952][color=black][b]Daisy[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1029177][color=#FFD700][b]SirGravzy[/b][/color][/url] was banned for a day as a return joke from Omniscient, after SirGravzy has demanded the \"Gift\" award be granted to him. The reason: \"A gift from Omniscient.\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1371476][color=black][b]Feynman[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=397679][color=#383838][b]Anarchy[/b][/color][/url] had his or her account closed for the fourth time.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=789677][b]Grin[/b][/url] received the Sticky Man award for [url=http://hackforums.net/showthread.php?tid=3537549]this[/url] thread.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1148878][b]Clique[/b][/url] received the Cat Lovers award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=787112][b]Saturday[/b][/url] received the Cat Lovers award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=751152][b]Vazity[/b][/url] received the Businessman award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1118885][b]Penar[/b][/url] received the Dog Lovers award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=646916][b]Genuine[/b][/url] received the Diamond award.\n[*] Numerous members received the \"Gift\" award, to see the list, please redirect your attention [url=http://hackforums.net/myawards.php?awid=71]here[/url].\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=632426][b]+Awesome[/b][/url] is now a leader of Complexity.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1452467][color=#0066FF][b]Morchid[/b][/color][/url] is no longer a leader of The Guardians.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=900087][b]Starstruck[/b][/url] is now a leader of The Guardians.\n[/list]\n\n[align=center][img]http://i.minus.com/jMSrdyQChTalc.png[/img][/align]\n\n[i][b]Technology Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3537549]iOS Theming – A Premium Guide[/url]  - [url=http://hackforums.net/member.php?action=profile&uid=789677][b]Grin[/b][/url] - A thread detailing how to theme specific components of iOS.\n\n[i][b]General Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3591567]Reputation System Explained - Latest Update: 07/02/2013[/url]  - [url=http://hackforums.net/member.php?action=profile&uid=121196][b]Natha[/b][/url] - Primarily for new members, this thread covers every piece of the reputation system.\n \n\n[align=center][img]http://i.minus.com/jun9oZkuCHRrn.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1135004]Corso[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: Welcome to your interview for the HF News, Corso, how are you doing on this fine day? Any shout outs?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: I'm doing just fine, though I have members in mind in which I'd like to shout out to - I will refrain from doing so, as I am sure I would miss a few key members.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: When and why did you join HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: I believe I joined in the first few months of 2012, though I was very inactive for many months (basically until 2013). The reason behind it was tracking down an infection on a server system that I supported.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: When did you start working with computers? I heard you're a quick learner. Tell us a bit about that.\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: My first PC was a Vista desktop made by Dell. Within a few weeks of receiving it, Windows 7 was already out (making the Vista machine quite cheap). So that would mean what? Late 2009 basically, haha. So I'd say I'm still a bit of a newbie to computing, sadly.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: What's the skillset you've developed so far?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: Well, I have some 'black holes' or blurred areas of course - However I have a fair share of experience with: White Hat Hacking (in counter, Black Hat Hacking as well), malicious software, networking, voice over IP phone systems, security systems (hardware and software based), programming and scripting, and so forth. Most of which I've either acquired through my current/past employments in the I.T. field or through hours of researching on my own time for personal interests, which almost always tie back to the need of knowledge for my work.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: What were your goals when you got familiar with the forums?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: My goals have still not changed, making this an easy one to answer. First was to join HJT/MRT, which I am on my way to doing (currently a student). Next was to earn an award for supporting members, which I have just recently achieved (White Hat Award). The next, as bad as it sounds was to get to the milestone achievements of 500 and 1000 reputation with little to no negative reputation. Though I am approaching the 500 mark, I have to say I've lost my original drive or desire for those and added a few others (earning certain awards in time).\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: You spend a lot of time in the White Hat Help section which earned you the White Hat Helper award. Do you enjoy helping others? How many people have you helped out so far?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: There is two sides to that really. First being that although I am helping people, I am also getting real life practice for the type of work I do. On the flip side, I do enjoy helping out within the computing sections in general. So in short, I do enjoy it but I also benefit from it (as selfish as that might be). Now for how many I've helped out, honestly I don't keep a count. Hopefully enough to be noticed and respected for...Though I think the biggest 'help' I've provided is teaching a few other members about computing/white hat hacking (Chief being my primary student and a good friend).\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: Let's take about your real life hobbies. What do you like to do?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: Over the years I've kind of defined my hobbies to my true 'loves', so I will only list my major ones here. First we have my love of rifles/shooting, in which I have spent countless hours learning the art and mathematics to. Moving on from that, we have the two hobbies which I thought would be my career options for life. First one being my love for aviation, to be specific - Helicopters. I became a licensed pilot and had high hopes of flying a AH-1Z (Super Cobra) or UH-60 (Black Hawk) for the Marines. Second one would be fighting, from boxing to mixed martial arts. As I had a rough childhood and from attending military boarding school, fighting became like second nature for me. However I lost the opportunity to follow either of these career paths upon a severe accident which ruined my chances. Now I pursue them by attending a gym for boxing and assisting at a local dojo for MMA seasonally, then for the flying - I've resorted to a 'home cockpit' with Digital Combat Simulations.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: Do you have a job IRL or do you make a living online (or both)?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: Although I make some money online, it is too 'unstable' for my personal tastes and may not correlate to job security long term. Due to this, I have both - Online and Offline income. For offline I am a Systems Administrator and Engineer for a rather large company/franchise, plus have my own smaller business of my own (just for friends, family, word of mouth customers - Nothing major).\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: Earlier you stated that you have one or more students, can you tell us a bit more about that?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: A while back, a few members requested we pooled together our White Hat Hacking knowledge together and helped one another grow. This group was filled with members I didn't know at the time, however I know how lucky I was/am to have a good mentor and friend in my life - So I figured I'd give it my best shot. Shortly after this, the group became divided between those who were not serious and those that were serious about learning. The latter, the serious members and myself split off - In which I was 'elected' as a mentor. Sadly the group since split up, due to a lapse of inactivity from myself and a few members losing interest. I hope to eventually get more 'students' who are interested in careers within computing or just wish to learn more, in which my good friend and student, Chief, can help me teach. However it seems as this may be a premature future 'goal' or idea, it has been on my mind a lot lately. With a bit of luck, maybe I will find more members to include in this and get something going!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#A2FF00]Connected[/color][/b][/url]: Thank you for participating in this interview, Corso! Good luck with everything! Any final words?\n[url=http://hackforums.net/member.php?action=profile&uid=1135004][b][color=#FF0000]Corso[/color][/b][/url]: Only to thank you for interviewing me, it was fun!\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=562793]Programmargorp[/url][/font][/size]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Hello HF new readers! For today's edition we will be interviewing the member [url=http://hackforums.net/member.php?action=profile&uid=562793]Programmarorp[/url]. Before we begin, do you have any shoutouts you would like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url]Hey SkyGuy, wow, I made it to the interviews. Never thought I would make it this far for a while :). I would like to shoutout to my buddies at the CoCH section. Big shoutout to Computer Professor, Zankza, Kile Bantick, Aesthetics, Elemen, Koala, archangel.dimitri ahd whoever I managed to miss (I'm sorry :x)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] I'm sure they'll be very happy to receive the shoutouts! Now to begin, what brought you to Hack Forums in the first place?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url] Well, I started off roughly in 2010, mainly wanting to do hacking stuff. Really was just a skid and I never wrote in proper grammar. I read a lot of stuff in the RAT and Wifi hacking sections and learned quite a bit, but didn't really post until ~2011. Roughly at the end of 2011, my friend (who isn't on HF) wanted to build a computer. Figuring that I didn't really have much to do and really, just wanted to expand my knowledge, so I ended up helping and learning over the past year and 7 months or so.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] I see you're a member of the group Complexity. When were you accepted? How are you finding the group?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url] I was accepted into Complexity quite early as one of the mentors likely due to probably either my (somewhat sarcastic) application or my large amount of posting in the hardware section. Not much is really occurring in the group in terms of the computer/hardware parts, but I'm sure you can find someone better to explain all the stuff they have planned or are doing right now :)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Another group you're a part of is The Alliance. What do you think of the group; is there a lot of work involved with being a member?\nThe alliance on the other hand is different to complexity. From the sections of it which I have seen, lots of HQ members are in there. Again, my opinion here probably doesn't matter all that much. In terms of the work in being a member, there used to be a lot of work associated, but we later found it to be quite un-necessary. Currently, the work is to maintain the section which you are in and just help around.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] You're one of the more knowledgeable members in the hardware section. How do you feel about the section? What keeps you coming back?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url] Well, as you and others may know, I was there during the times which the section was well... Crap. So over the course of roughly half a year to a year, we gained and lost a few valuable members and together we made the CoCH sections one of the most HQ sections on HF. There was however a period of a month or two where the section was disgustingly low quality where idiots come in and try to boost their post count, believe me, even I seriously considered quitting at that point. Mainly however I just really don't want to see the section which I spent so much time and effort building up turn into crap. Although in that sense I also enjoy helping people (to a certain extent) and learning about new stuff which I have never known before.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Recently Omniscient built himself a new computer and created a thread about it in the hardware section; what do you think about it?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url] Well, in terms of the part choice, it's a decent build featuring good parts. What I do see from it (and pardon me from saying this) is the amount of people who kind of just flat out stalk Omni's every thread. While I do like the fact that Omni (as with everyone else who does build a computer) comes into the CoCH section and post about their rig; and quite frankly I enjoy reading them. I don't really like how all these people come flooding in, especially if they start spreading incorrect information.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Are there any improvements which you would like to see implemented into the hardware section or anything you would like changed?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url] Currently, only two things trouble me in the CoCH section:\n-The lack of control in terms of rubbish posting in the section.\n-The fact that the description of the section still says \"puter\" 😯\nBut those aren't really big problems. I don't quite mind anything at all really.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Do you have any words of advice for someone who was looking into building their own computer?\n[url=http://hackforums.net/member.php?action=profile&uid=562793][color=white][b]Programmargorp:[/b][/color][/url] Well, the most important thing to note for anyone reading this is to never buy any pre-built computer. They usually use crap parts and overcharge a lot for the specs. I say hop on over to the CoCH and make a thread, me or someone else will be able to help you grab the best build you possibly can. One thing to note however is that I'm human and that other members are human too, so it's usually best to wait for more than one post before making your purchase just in case one of us (and trust me, we do) screw up.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Thank you for taking part today! Is there anything else you would like to add before we end this interview?\nWell, it's been a pleasure appearing on the Interviews in HF news. I guess thanks for the interview. For a few final words, good knowing you Kile and Aesthetics, stay classy Prof, keep shining everyone.\n[/spoiler]",
      "subject": "[6/30/13] - HF News"
    },
    {
      "pid": "33672115",
      "uid": "515249",
      "dateline": "1372747424",
      "message": "[align=center][img]http://i.minus.com/j3DPVBZWZdb4x.png[/img][/align]\n[color=white][b]Saints Row IV Banned in Australia[/b][/color]\nSaints Row IV was banned in Australia because of implied sexual violence and drug abuse. The Australian Classification Board refused classification, even though an R18+ rating was introduced early this year. \"In the Board's opinion, Saints Row IV, includes interactive, visual depictions of implied sexual violence which are not justified by context,\" the statement said. \"In addition, the game includes elements of illicit or proscribed drug use related to incentives or rewards. Such depictions are prohibited by the computer games guidelines.\" The developer announced that they are changing the game so it can be classified in Australia. Sources say that the \"anal probe\" weapon was a cause in the issue. Saints Row IV was set for August 22nd on Xbox 360, PS3 and PC.\n\n[color=white][b]Origin Changes Incoming[/b][/color]\nEA announced that they are planning to launch significant changes to the Origin platform. EA is aware that a negative perception surrounding the platform exists and want to re-build the platform with gamers in mind. \"In the near term, quite frankly, our focus is making that download better, making that install better, making that automatic patching better,\" executive vice president Andrew Wilson told GamesIndustry International. \"Making that friends presence better, making the various game services better. That's what you're going to see from us over the next year, which is really re-establish Origin as a service to gamers, not as a means to drive transactions.\" \"I want to reiterate, it's very important for people to understand that we don't expect that all of a sudden people are going to get up and go 'Oh! Great! We now love Origin!'\" Wilson said. \"We get it. We understand it,\" he added. \"We have heard, we have made some changes already in terms of how we do things, and we're looking at more changes that we'll talk about over the coming months that really are gamer-focused.\" A date for the changes has not yet been revealed.\n\n[color=white][b]Minecraft: Xbox 360 Edition Sells 7 Million[/b][/color]\nThe most popular sandbox game has reached another milestone on the Xbox 360 version. The game has sold over seven million copies via the Xbox LIVE Marketplace, Mojang announced on Twitter. \"Minecraft on Xbox has now sold 7 million copies!!! CRAZY! =D,\" business developer Daniel Kaplan said. Mojang recently launched a disc based version of the game, which is available in stores now. Earlier in the year, the developer said that they are working to make sure Xbox 360 game saves work on the Xbox ONE. \n\n[color=white][b]Microsoft's Ultimate Game Sale[/b][/color]\nMajor Nelson announced Microsoft will launch an \"Ultimate Game Sale\" in the first week of July. Major listed thirty-two titles that will be discounted during the sale week. However, exact game sale prices have not been announced. Major also said that games may not be on sale for the whole week, so it's advised gamers keep checking the daily deals. You can expect to see games such as Crysis 3, Far Cry 3, Gears of War Judgment, L4D2 and a lot more. You can view the list of discounted games [url=http://majornelson.com/2013/06/28/xbox-live-ultimate-game-sale-preview/]here[/url].\n\n[align=center][img]http://i.minus.com/jQ5EQ2ltjeK36.png[/img][/align]\n[color=white][b]Snowden Still in Moscow Airport[/b][/color]\nUS fugitive Edward Snowden is still in the transit area at Moscow airport, confirmed Russian President Vladimir Putin. Mr. Putin has said that Snowden remained a free man, and added that the sooner Snowden chooses a destination, the better. The White House said Russia had a “clear legal basis” to expel Snowden. However, Russia has rejected American charges that they have assisted Mr. Snowden. China has also rejected similar charges. Mr. Snowden flew from Hong Kong to Moscow on Sunday, and he was expected to take a flight to the Venezuelan capital Caracas on Monday but never appeared. The US has revoked Mr. Snowden’s passport. Snowden is being supported by the website Wikileaks, and is being accompanied by several of their legal advisers.\n\n[color=white][b]China’s Shenzhou-10 Astronauts Return to Earth[/b][/color]\nA capsule carrying three Chinese astronauts landed safely after a 15 day long mission in space. They did manual docking exercises and one astronaut, Wang Yaping, gave a video lecture to students back on Earth. The Shenzhou-10 marks China’s fifth manned space mission and it has been 10 years since China first sent an astronaut into space. The State TV showed the capsule touching down in grassland in the Inner Mongolia region at around 08:07 local time. China has plans to have a permanently manned space station in Earth’s orbit.\n\n[color=white][b]US Warns Against Traveling to Egypt After Fierce Clashes[/b][/color]\nThe United States has warned Americans not to travel to Egypt and has told non-emergency diplomatic staff to leave as clashes rage on in the country. US nationals in Egypt have also been warned “to remain alert”. The warnings began when at least three people, one of which being a US citizen, died in clashes between the support and opposition of President Mohammed Morsi. Tensions continue to rise in Egypt and many US citizens have been continually asked to leave Egypt for their own safety.\n\n[align=center][img]http://i.minus.com/jbirdFfeOijxAv.png[/img][/align]\n[b][color=white]Facebook’s Gold Standard[/color][/b]\nFacebook is now putting restrictions on the ads that are being displayed on their site after companies like Marks and Spencer and BSkyB had complaints filed against them for placing ads on \npages with offensive material. \n\n“We recognize we need to fo more to prevent situations where ads are displayed alongside controversial Pages and Groups. So we are taking action,” Facebook said in a blogpost on Friday. \nThis blogpost follows a Sky ad that was placed on a page called “Cute and Gay Boys”. The pages featured many inappropriate pictures of teenage boys- all of whom were underage. \nThe company said on Monday it will implement a new “God Standard” of around 10,000 pages that are deemed suitable for advertisements. It will then inspect other pages to see if it can be added onto the list and remove ads from pages that haven’t been approved. \nThe two companies that have been complained about have said that they will use Facebook again, as long as their advertisements won’t be posted on pages that will have any offensive content or pages that reflect negatively on their brands. \n\nThis is the second time in under a month that Facebook has been under fire. Earlier this month, women’s groups were protesting due to misogynist content on the site, causing many advertisers to suspend their campaigns.  \n\n[b][color=white]R.I.P. Google Reader[/color][/b]\nIn March, Google announced that it would shut down due to decline in use. Whilst the company admitted it did have a “loyal following”, Google’s chief executive Larry Page said that he wanted the company to focus on fewer projects. \n\nSince the announcement, other web companies have been trying to get a hold of the “orphans” when the popular service closes its doors on Monday. \nUsing RSS, which stands for Really Simple Syndication, its users can see the updates from their favourite sites faster without having to visit each site. Similar to an inbox, RSS readers show how many unread updates a user has. \n\nThe decision to stop this particular RSS reader has angered users, many of whom claim that any other service wouldn’t offer the same level of functionality. \nPC magazine published that what Google is doing is “a grave mistake”. A magazine from the United States, Slate, posted a “virtual graveyard” listing all of Google’s retired services. It even went as far as inviting its users to come and offer their condolences to Google’s fallen products. \n\nFor some, however, this provides Google’s competitors to scoop up new users in a very short amount of time. In a recent post, the social recommendation site, Digg, revealed it had been planning to make its own reader for quite some time now. Thanks to Google’s reader closing, it has ramped up the efforts. \n\n“As daily (hourly) users of Google Reader, we’re convinced this is a product worth saving,” wrote Digg’s Andrew McLaughlin. \nAnother service that is expected to gain a following is Feedly, which states that it has gained almost three million new users since Google’s Reader announcement. \nFacebook is rumoured to be launching its own reader, but it isn’t being named as the Google replacement.\n\n[b][color=white]BlackBerry Shares Take a Plunge[/color][/b]\nShares in the Smartphone company BlackBerry have divided since its $84 million loss for the first three months from June 1. Even though this is a large number that has Blackberry disappointed, it’s better than the $518 million loss from this time last year. \n\nThe company said it would post the loss for the next quarter that runs to September. \nBlackberry shipments have increased, but Blackberry didn’t release how many handsets running the Blackberry 10 have been sold this quarter; however the company chief executive promised that the new BB10 would be a hit with the customers. \n\nBlackBerry is increasing investments to support new product rollouts and services for the next three quarters. \nBlackberry launched two new Smartphones this year, the new touchscreen “Z10” and the “Q10” with a mini keyboard that many BlackBerry users prefer. \nOverall, BlackBerry says that they have shipped 6.8 million phones this quarter, a much smaller number than the 7.8 million is shipped out last year. \n“It doesn’t bode well for the initial BlackBerry 10 launch, particularly the Z10. But even the outlook for a second quarter loss doesn’t bode well for the Q10 either,” said Morningstar analyst Brian Colello.\n\nBlackberry has had some serious competition with other smartphone producers such as Apple and Samsung. Some even say that the phone company has fallen between two categories. \n“They’re not the high-end provider anymore, they’re not Apple. They’re not the low-end provider, they’re not Nokia. So they are in the middle and they do relatively low volumes,” Daniel Ernst from Hudson Square Research. \n“It’s difficult to make great margins on that kind of volume, s I would say the outlook is quite negative.”\n\n[align=center][img]http://i.minus.com/jsSqf056c30Ww.png[/img][/align]\n[color=white][b]Beyonce and Jay-Z Resurrect Bonnie & Clyde on 'Part II (On The Run)'[/b][/color]\nIt's been ten years since the two met and started dating. This whole week Jay has been releasing lyrics all week. Jay released the lyrics to yet another MCHG song. The duet will be both exciting and adventurous for the two. With only a week until he is set to release his album, Jay has not released any songs from his upcoming Magna Carta album, only the lyrics to songs. So far \"Holy Grail,\" \"Heaven,\" \"Oceans\" and now \"Part II (On the Run)\" have been released to the public. When the couple first got together there was a lot of talk here and there on how Beyonce would not get along with the rapper with a somewhat \"sketchy\" past. \"If you go to heaven and they bring me to hell/ Just sneak out and meet me/ Bring me a box of L's. She fell in love with the bad guy/ The bad guy/ What you doing with them rap guys/ Them rap guys/ They ain't see potential in me girl/ But you see it if it's you and me against the world/ Then so be it.\" - Lyrics from his new and upcoming song, \"Heaven\".\n\n[color=white][b]Eminem: I Almost Died from Drugs [/b][/color]\nFor all the fans who follow up on Eminem, he recently said that his addiction to prescription drugs almost gave him organ failure.\nSadly, he even remembers the night he was rushed into hospital and checked in for being in critical condition after a night of taking some prescription drugs. \"Xanax, Valium, tomato, tomatoe, it's same thing... F**k it, take it,\" he told filmmaker Matthew Cooke. \"Had I got to the hospital about two hours later, I would have died. My organs were shutting down. My liver, kidneys, everything.\" Eminem explained his past and told us how he pushed away friends who tried to help him. He didn't like the fact that they kept saying he needed help and what he was doing was an issue. Marshall Mathers, Eminem's real name, says he came clean about his addiction on his 2010 hit album Recovery. Most of the fans are aware of the song that came out during the time it was released, \"Not Afraid\". The rapper admits he relapsed just a month after being released from hospital. There's currently a documentary which also includes interviews with Susan Sarandon, Woody Harrelson and Russell Simmons and is going to be released sometime this month. Some of this may not be new, but for the fans who don't always search things on him, this is a great opportunity for fans to get ready to watch it.\n\n[color=white][b]Rihanna 'warned about behaviour'[/b][/color]\nRihanna has been given a warning from her own record label. For all you fans that don't know, she loves to party. Sadly, this has come to a short end because of the amount of time she stays on tour. Some times she has been late on stage and even hit a fan with her microphone during a show. The star's mentor as of now is Jay-Z, who runs the Roc Nation label. This is who she's currently signed to. He dislikes what she has been doing, and is trying to wake her from and bring her back into reality. \"Everyone can see Rihanna's not behaving herself. Fans have paid hundreds of pounds for tickets and she's regularly showing up hours late. Then she often gives lacklustre performances where she even forgets her words at times. They issued a written warning which was emailed to Rihanna,\" said a reporter. Numerous times she has been bashed over by fans. Some include hateful words and many other rude things via the social networking site, Twitter. Many examples of horrible things would have to be singing terribly on stage, as well as showing two hours late to a single show. Jay is really worried about her, and hopes she can pull her act together.\n\n[color=white][b]Music Video of the Week[/b][/color]\n[spoiler=]\n[video=youtube]http://www.youtube.com/watch?v=LrUvu1mlWco[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jj0OFp0aBuwTS.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nWell, I recently discovered that I have participated in over one-hundred editions of the HF News. This means that I have been a part of the HF News for practically two-thirds of its existence. With that in mind, I must truly say that it has been an adventure. I have seen the HF News at both its golden, high-points, and it's down-trodden low-points. Through all of the ups-and-downs, I have loved and developed the HF News as best as I could, and I plan to continue to do so for as long as Hack Forums will have me. I am always open to constructive suggestions and ideas for the betterment of the HF News, so please keep that in mind and voice your opinions. We're all about the community.\nLove,\n~Sir & The Writers (We should be a band.)",
      "subject": "*"
    },
    {
      "pid": "33672130",
      "uid": "515249",
      "dateline": "1372747498",
      "message": "[align=center][img]http://i.minus.com/jbyZ42NjdFe8OT.png[/img][/align]\n\n\"How is your summer going? What's been happening?\"\n\n[i]\"My summer is going very well. Something that I never did before \nhappened. I am French and I went to US (I'm still in US) for the first \ntime ever. I know I have a great luck to be able to take the plane \nand to come in US, and I know it won't happen a lot of times, that's \nwhy I am enjoying everything I do here. Americans people are so \ndifferent from French people. Everything is bigger here. And the \nweather is better than in France. I do a lot of great things everyday, \nI meet new Americans everyday, and my English speaking is better \nevery day. All I can say is that this trip is going to be on my head \nfor a long time, because what is happening to me is just awesome.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1278319][i]-iNuke[/i][/url]\n\n[align=right][i]\"My summer has been great. I haven't gone anywhere \nspecial and I've stayed home the whole summer so far. Isn't that great \nthough? I always tell myself when I'm on vacation, \"There's no place like \nhome.\" Anyways, I've been on HF the whole time. Honestly, I love \ncoming onto HF, and I love working for the News Team. It's a great \nexperience and it's just fun to write. Most likely I'll go somewhere later \non, but for now, I'm home. Hopefully I'm not the only one staying \nhome either!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=692131][i]-Vanilla[/i][/url][/align]\n\n[i]\"My summer so far has been quite still. I just got off of school a \nweek ago, and nearly repeated the semester in History and Math. \n(lol) In the end, everything worked without a hitch, and I'm free to \ndo anything without the worries of next semester. The summer rains \nhave really quenched everything here, and frankly, I'm okay with that. \nYou may have an idea that summer is all about the heat and fun at \nthe beach/pool, but not where I live. It's the rainy season, and \nalthough it puts many of the people I know in a bad mood, I enjoy \nit. I don't mind dancing in the rain. :3 I've been off HF for quite a \nwhile now, due to academic issues, but I intend to catch up with \nanything I've been missing, and start contributing to the forum now. \nIt feels a bit awkward for me to have more or less 600 posts in \nonly a year :P But hey! We all have our reasons don't we? To \neveryone, may you all have a memorable vacation. Happy \nsummer to all of you!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1376915][i]-๖ۣۜEmperor Palamecia[/i][/url]\n\n[align=right][i]\"Currently my summer is the same as last year, \nsitting around playing video games browsing the internet. I \nhowever have 2 goals for this summer vacation. To learn how \nto ride a skateboard and to get a summer job. I will be getting \na summer job at my parents workshop and get $20/h. Hopefully \nI will get off my lazy butt and do something even more productive.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=874827][i]-Skwillex[/i][/url][/align]\n\nThe topic for next week is \"What do you think of the two most recent groups?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jt8zvcWASdwiA.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ibi02hFuZUH4NW.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbgT0f4nbbOTe0.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/EaWTKv4.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/81iykZc.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.akimbocomics.com/comic/2013-06-30-Eat_Shit_And_Die_225.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.toonhole.com/comics/2013-07-01-pimptax.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jlltcZhXLjBbZ.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=121196]Natha[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=469528]Odin the Wanderer[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=190854]CarrotMilk[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692131]Anima Libera[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1050193]Connected[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1121679]SkyGuy[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=763021]Retribute[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}