{
  "posts": [
    {
      "pid": "33216705",
      "uid": "515249",
      "dateline": "1370924011",
      "message": "[align=center][IMG]http://puu.sh/2zTjo[/IMG][/align]\n\nThe edition you are currently reading is the [color=#E42217][b]146th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://puu.sh/2zSXL[/img][/align]\n[color=white][b]Black Diamonds Have Evolved[/b][/color]\nThe Black Diamonds group has now officially opened, owned by the amazing [url=http://hackforums.net/member.php?action=profile&uid=526511][b][ M ][/b][/url]. This group was previously known as Terror, which was owned by BV1. Black Diamonds are focused on both online and offline marketing. The official description of the group is as follows: \"Black Diamond consists of skilled members that excel in both online and offline marketing. Our group consists of rare individuals who are extremely skilled at what they do. We consist of entrepreneurs, coders, writers, general masters at their niche, and other successful people who have an unyielding necessity to profit from their endeavors.\" Unfortunately if you're excited about the group and wanting to join, your hope may just become shattered as Black Diamonds is currently an invite-only group. Check their official thread out here: http://hackforums.net/showthread.php?tid=3528397\n\n[color=white][b]NSFW Cname Implemented![/b][/color]\nThis week [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] chose to implement NSFW (Not Safe for Work) Cname. Some of you may be wondering, well, what is NSFW Cname? To explain the basics of it, it has been implemented for a bandwidth save, otherwise known as an alternative to users who don't have the highest speed internet. If you feel this suites you and think using NSFW Cname would benefit you, you can openly use it by visiting this link: http://nsfw.hackforums.net/\n\n[color=white][b]Thread Titles Filter Enabled[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has announced that thread titles are now filtered. For example, you will no longer be allowed to post some/most special characters in thread titles; the marketplace is a good example. The existing special characters will still exist until the threads are updated through the full edit function. Note that only some are filtered, as there are still a lot of edited threads remaining with special characters in the titles. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] included this example; BEFORE: █►ProxyX V2.6◄█ Google Passed ★★★ AUTOBUY ★ 300k+ Proxys ★ SOCKS5 & HTTP █►★◄█ AFTER: ProxyX V2.6 Google Passed AUTOBUY 300k+ Proxys SOCKS5 & HTTP You may read the official thread by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] here: http://hackforums.net/showthread.php?tid=3531763\n\n[color=white][b]Good Will Monday[/b][/color]\nThis week we had a recurring annual event known as Good Will Monday. This happens every first Monday of the month June, this has been done for three years in a row now. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] asked users to give out five positive reputations for good will, and asked members to not give any negative reputations unless they're related to scam reports. It was a good run, and we hope this continues to stay an annual event. The official thread can be seen here: http://hackforums.net/showthread.php?tid=3525096\n\n[align=center][img]http://puu.sh/2zSYx[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][b]xadamxk[/b][/url] hit 10,000 posts.\n[url=http://hackforums.net/member.php?action=profile&uid=515249][b]Sir[/b][/url] is now a moderator of the HF News subforum.\n[url=http://hackforums.net/member.php?action=profile&uid=128873][b]T3h Hack3r[/b][/url] is no longer a Staff member :(\n[url=http://hackforums.net/member.php?action=profile&uid=96230][color=black][b]Panik[/b][/color][/url] hit 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=#0066FF][b]Vitani's Mate[/b][/color][/url] hit 2,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=454666][b]adampelletgun[/b][/url] was promoted to Mentor. Again.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1108450][b]BagHead[/b][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1416099][color=#383838][b]Uncensored[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=837472][color=black][b]Lesson[/b][/color][/url], the notorious scammer, was repfucked. Huzzah!\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=956054][color=black][b]Emylbus[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1232842][color=black][b]#Skyline[/b][/color][/url] was banned for LQP.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=951772][color=black][b]Death Disturbance[/b][/color][/url] was banned for reporting Staff posts.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=721613][color=black][b]Derrick Rose[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=300035][color=black][b]N3oNight[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=58761][color=black][b]0mega[/b][/color][/url] was banned for posting a Marketplace style thread outside of the Marketplace.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1179086][color=black][b]_InSiDiOuS_[/b][/color][/url] was banned for posting a Marketplace style thread outside of the Marketplace.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1220475][color=black][b]dMDzn[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1349466][color=black][b]Alakazam[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=141275][color=black][b]aiir[/b][/color][/url] was banned for posting a Marketplace style thread outside of the Marketplace.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=954577][color=black][b]Dolan Duck[/b][/color][/url] was banned for trolling in the Griefing section.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1512567][color=black][b]‌Castiel‌[/b][/color][/url] was banned for trolling in the Griefing section.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1562072][color=black][b]QueeN-[/b][/color][/url] was banned for having Multiple Accounts.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=988486][color=black][b]Rubbers[/b][/color][/url] was banned for sending an insulting PM to [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1262623][color=black][b]Sacred™[/b][/color][/url] went on a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1416099][color=#383838][b]Uncensored[/b][/color][/url] had their account closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=96230][color=black][b]Panik[/b][/color][/url] was banned for LQP.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=837472][color=black][b]Lesson[/b][/color][/url], the notorious scammer, was finally banned with the reason: \"Your time has come.\"\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=526511][b][ M ][/b][/url] donated for the Master Donator and Bitcoinage awards.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=44755][b]'Snorlax[/b][/url] received the Cool award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1221644][b]IIMachavelli[/b][/url] received the Sticky Man award for [url=http://hackforums.net/showthread.php?tid=3525922]this[/url] thread.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=677529][b]Αnonymous[/b][/url] won the MOTM award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1323829][color=#0066FF][b]Fl0werpot[/b][/color][/url] donated for the Rich Bitch award.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=526511][b][ M ][/b][/url] is now the owner of Black Diamond.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=958628][b]VoxaDub[/b][/url] is now a leader of Black Diamond.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=848947][b]Madness[/b][/url] is now a leader of Innovation.\n[/list]\n\n[align=center][img]http://puu.sh/2zT0l[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=878768][b]SomeWhiteGuy[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3521192]Halo 3 Tournament - Xbox 360.[/url]\n[url=http://hackforums.net/member.php?action=profile&uid=81075][b]Robbieava[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3528331]Cold shower 30 day challenge. [100 members + participating][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1429987][b]Tοny[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3526436]Guardians - Kerbal Space Program - Guide to the basics[/url]\n \n\n[align=center][img]http://puu.sh/2zSWU[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=7744]Peter L[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]:  Today we will be interviewing the 7744th member of HF! Welcome to your interview for the HF News Peter L! Let's begin! Any shout outs?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]:  Thanks for the oppurtunity Connected. I'd like to give one shout out and that is to Soliloquy. He's a genuine guy and a great marketer who has taught me a lot, and is definitely deserving of a shoutout.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]:  You're a 2008 member I see. How did you join HF and why?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: I originally joined Hack Forums because a member named Oreo Killa 225 introduced me to phishing. Phishing is now disallowed on HF, so I won't dive into the details, but essentially I wanted to learn how to hack other people's accounts on various websites. I was much younger back then (it was five years ago) and I really had no motive for what I was doing and unfortunately I stole many accounts. However, I've since discarded all those blackhat activies and they are a part of my past. I'm now on Hack Forums to learn and moneitze and am loving every minute.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: That's good to hear! You must have seen lots of changes since '08. Tell us something about back then that was changed (except phishing & blackhat activies being disallowed).\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: The biggest and most prevlant change is something that can not be accurately pinpointed nor can I say exactly when the change occured. But change is the atmosphere of the community. In 2008 when I joined, every member was fun loving and nobody was trying to impress others to protect their image. Imagine having a Hack Forums group of your favorite 25 people and then imagine those people being the only memebrs on HF. That is what it was like. Everybody used more smileys, everybody was more funny, there was less trolls, and back then there were no country blocks. Foreigners were very funny. But yes, that is the biggest change, in my opinion, Hack Forums has gone through. It is to be expected, and Hack Forums will continue to evolve, but thinking back and reading old posts from 2008 definitely gives a nostaglic feeling.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: Needless to say, it changed for the best. What do you like doing on the forums? Do you own any products for marketing purposes?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: Right now the majority of my time on Hack Forums consists of posting in my group's private subforums and advertising my Marketplace products. I'm currently in a lot of groups, and I am still getting a feel for each one. I anticipate that I will not be a member of all of them forever because I only want to be apart of a group that I am truly happy in, and it is still too early to judge that so I will remain an active contributor to each group. As for my Marketplace products I currently offer two active services/products. The first is a reselling service, where I use my marketing experience and trusted reputation to resell a customer's product in order to increase their profits. My much more popular product is called The Proxy Project which is an eBook program that teaches you how to make money through the method of owning a Proxy Network. Wtih the help of Soliloquy I have set up a killer sale thread and have made many customers happy, and have just purchased a sticky to reach out to a wider audience. I advise anybody who has a slight interest in earning money online to check it out before prices increase again.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: You're in five official groups! Do you have any tips for other members who want to get in their first group?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: Be genuine and show the leaders what you can provide to the group. I'll tell you this, if you honestly can not think of [b]anything[/b] you could contribute to the group you're applying to: you are not a suitable candidate as of yet. You should take this as motivation to develop relevant skills and to contribute to Hack Forums in the public forums, and then when your favorite group is recruiting again you should re-apply. Another piece of advice is this: add some content to your applications. No leader appreciates a short application, it can be offensive and shows you really don't care for the group. Try and flesh out your application, and expand on everything you mention. This will help you become a member of the groups you want to join. I had the forutnate oppurtunity to become active on Hack Forums when many groups were recruiting, so I saw it as an oppurtunity to teach, learn, and build connections on Hack Forums. Luckily with my talents and dedication, I became a member of multiple groups. You can do the same if you put forth the effort to better yourself.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: Nice tips mate! People better read this before complaining they haven't been accepted into the group they applied for! Anyways, do you have any goals HF-wise?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: Yes, I do have a few goals. I've thrown this \"bucket list,\" together and here it is. I'd like to: earn the Master Donator award and all other corresponding donation awards, become a leader of an official group, become a Mentor, become a reputable marketer on the forum, and earn the Businessman award. I'd like to have the donation awards because Hack Forums is expected to be my greatest source of income this summer, and I predict I will make much more than $500 so I feel a donation to Omniscient would be warranted. I want to become a leader of an official group because everyone has told me the experience was amazing and I always have wanted to lead something that important on Hack Forums. It'd be nice to be able to implement my own ideas with the other leaders in order to create and manage the best group as we possibly can. I want to become a Mentor because I have a good understanding of the Hack Forum rules and policies and it would be a great learning experience. It is a job that isn't nearly as demanding as staff, and you can still be treated as a normal member while in that position which is great. I want to become a reputable marketer and earn the Businessman award because they are two great milestones to achieve on Hack Forums. I couldn't see what any Marketer would want besides that (other than more money). So, yes this is my HF bucket list, and I feel like I can accomplish each one of these tasks and I know I will.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: You've got some great potential on HF Peter! As of now, do you make income online or offline?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: Right now, I'm currently making all of my income online. This summer I had planned on getting a part time job that I lined up during the school year, but if my eBook sales are as high as I expect I will not need to do that. I'm still deciding whether or not I will still accept the position for the working experience and for college, but money shouldn't be a problem for me this summer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: Nice! Do you have any hobbies IRL?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: My hobbies in real life include working out, playing Baseball, playing Basketball, paintballing, and anything that involes hanging out with my friends. I workout 3 days per week and have seen some nice gains, I advise anybody who is thinking of workoing out to do it. You will obviously be stronger and will feel much more confident in life. As for baseball/basketball I was a pitcher for my High School's Varsity team since Sohpomore year and I am heading into my Senior year to play for the 2014 season. I only play Basketball recreationally. I enjoy Paintballing, as well. If you've never played Paintball: do it! It is an expensive hobby, but going a few times per year will not kill your pockets. I have custom gear that includes a thermal mask and a Tippman A5 with response trigger, APEX2 barrel, and a 4000psi compressed air tank. I love Paintball! I also have a small group of friends that I absolutely love, mixed with both guys and girls. We can laugh about anything and it is a really great group of friends to be apart of. We do everything normal teenagers do, so I'll leave the rest up to your imagination.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#66FF00]Connected[/color][/b][/url]: Thank you for your in-depth answers Peter. I very much appreciate you letting me interview you! Any final words?\n[url=http://hackforums.net/member.php?action=profile&uid=7744][color=#FFD700][b]Peter L[/b][/color][/url]: Hopefully as a result of this interview, members who did not know me personally in the past have grasped enough information on me to form an opinion and possibly add my on Skype/PM me in order to get to know me more. I also hope the insights I've expressed in my replies have been informational enough that I have improved somebody's life or gave them motivation to start improving on their own. Thanks for the oppurtunity once again, Connected!\n\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1624866]MuzzyHF[/url][/font][/size]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Hello, HF News readers! For this edition we will be interviewing the member [url=http://hackforums.net/member.php?action=profile&uid=1624866]MuzzyHF[/url]! So, Muzzy, before we begin do you have any shoutouts you would like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] Hey! I'd like to give a shoutout to Perfect Cell, +Pirate, Ayden, Snapchat, Effexion and Wonders!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] I can safely say that they'll be extremely happy to hear those shoutouts from you! So, how did you come across Hack Forums in the first place and why did you decide to join?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] I'm sure they will. Unlike others, I didn't discover HF after being the victim of a RAT or other malware, I just stumbled across the site not long after christmas. I think the dark theme and eery feeling of the site when you first see it drew me in. As someone still new, I remeber how freaked out I felt registering; I can remember trying to connect with \"HideMyAss\" and just getting the block message.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Being a victim of malware is so frustrating! I'm so glad that I've signed up to Hack Forums because I've now learned how to defend myself from malware properly, haha. How did you choose your username for the site?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] I've actually gone through 2 personas on HF. The first being 'Tourqe', but this name really held no significance. It was an alias I'd never used before and it sounded decent so I rolled with it. My current alias, however, is inspired by the Monstercat media artist 'Muzzy'. I've been following him since his first upload to the channel, and I've always found his music to be the highest of quality. I was pondering over an alias change, and I just happened to be listening to one of his tracks (Kings of the city: Make me worse (Muzzy remix)) and I thought I'd give it a try.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Awesome! I'm a huge fan of Monstercat, myself! Muzzy is definitely one of their most talented artists, I always look forward to his releases. Anyway I see that you're currently a member of the group \"Void\". What do you think of the group? When did you get accepted?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] As of writing this interview, I've only been a member for a few hours. First impressions? Everyone involved is incredibly intelligent. There is not one thread in the sub forum that doesn't scream knowledge, and from my short time browsing the discussion, I've genuinely learned things. I look forward to my future with the group, and I hope that I can develop friendships with it's members.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Sounds interesting! I used to be a member of the group and I completely agree with you, it's full of some of the most intelligent users on the site! I see you're also in the group \"Innovation\", and you are in fact a mentor there. How is being a mentor working out for you?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] I'm having an incredible time in the innovation mentor program. I have 3 awesome students that are incredibly willing to learn, they're private messaging me questions, discussing in the Skype chat, interating with members in other courses; generally being enthusiastic for the program. The next 8 weeks will be a fun ride, and I hope to bring out the best in my guys.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] That sounds like fun, I am in fact a mentee in the program and I must say it's very nice idea that's definitely been carried out well, so far. I see you're a very active member in the \"Beginner Hacking\" section, what about it keeps you active there?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] Honestly? All that keeps my going in that section is knowing how bad it will become if the last of it's helpers leave. Props to Perfect Cell & tux1 for staying and helping in that section for as long as they have. The beginner hacking section is in an awful condition, with hundreds of questions being repeated weekly. I've spoken to Mr Kewl, Paradoxum and Factor8 and no one has been able to come up with a viable solution to fix that section. Honestly? I think it will always be the same, we'll just have to grit our teeth and do our best to help out.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] I must admit there is a lot of low quality posting that goes on in that section. Do you have any specific suggestions which you would like to see implemented?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] Paradoxum suggested that the section is run like the auctions section, so when a rule violating thread is posted the thread is locked and the user is warned. This will make members aware of the section's rules. The problem is, the beginners don't take any time to read anything and they just go straight ahead and make a thread, and as a result, it's hard to do anything at all to keep that section clean. The only solid thing I think would benefit that section is a sectional moderator, or a group of them. Factor8 described a sectional moderator as 'Someone that enforces sight policy while actively aiding in that section'. In my eyes, that would help the section immensely.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] I'm sure a dedicated sectional moderator would help. Paradoxum's idea also sounds like something interesting that could work, mind you. I'm sure that you're well aware about the transformation of the Marketers into a new group. Do you have any ideas as to what the new group, run by Cryptic & Connected, could be about? What do you think of it so far after what has so far been said?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] Honestly? I think they're completely over hyping it. Hexcidial was quoted saying 'With this kind of hype you'd think they're purchasing HF itself' and I could nto agree more. An entire announcement thread that pesters not only Codevade, but also Omni to confirm every minute detail? To me it just seems silly. A simple announcement thread stating that they're purchasing the group and what the group will be about would have been much nicer than a thread with no direct information on the group at all. To add to that, I fear that the group will evolve into another 'We are a group of very HQ repwhores that serve absoloutely no purpose at all' and will not benefit the site at all. Regardless, it's their money and they can do what they please with it. I wish them the best of luck.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Interesting to hear what you think of the group, so far. I'm fairly certain that it won't be a group full of \"HQ repwhores\" as you described, though. Anyway to finish things up, do you have any final words you would like to say before you're executed... I mean before we end the interview?\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][color=white][b]MuzzyHF:[/b][/color][/url] I'd like to thank you for the opportunity, Saged for the invite to his upcoming mentor program and Paradoxum for not banning me when we had our little disagreement. I'd like to ask that Connected and Cryptic don't sever my head for throwing out my opinions of the new group thus far. Have a good week all; I hope to see you around.\n[/spoiler]",
      "subject": "[6/9/13] - HF News"
    },
    {
      "pid": "33216710",
      "uid": "515249",
      "dateline": "1370924021",
      "message": "[align=center][img]http://puu.sh/2zSZG[/img][/align]\n[align=center]I'm sad to say that our recent loss of [url=http://hackforums.net/member.php?action=profile&uid=1108450][b]BagHead[/b][/url] as a Writer has likely marked the demise of the Minecraft News portion of the HF News.\nThe Minecraft News is not expected to return; however, if HackerCraft re-boots and retains importance to the community, opportunities will be discussed.\nThank you all for enjoying the Minecraft News.[/align]\n\n[align=center][img]http://puu.sh/2zT1G[/img][/align]\n[align=center]The Gaming News portion of the HF News has been relocated to Wednesday or Thursday. \nIn light of the upcoming E3 event, this mini-edition will be focused on releases noted at the conference as well as some short, extraneous articles.\nPlay on![/align]\n\n[align=center][img]http://puu.sh/2zT2g[/img][/align]\n[color=white][b]Syrian Army Retakes Golan Heights Crossing[/b][/color]\nThe Syrian army has occupied a previously UN-monitored crossing in the Golan Heights which was overrun by rebel forces, according to Israeli military sources. Tanks and armored vehicles were used in the raid. The fighting here began a day after Syrian troops supported by Lebanon’s Hezbollah militants retook the strategic town of Qusair after a three-week siege. Israeli officials have voiced increased fears of the Syrian civil war going beyond Syrian borders. They are worried that the Golan Heights could be used to launch attacks against Israel.\n\n[color=white][b]Six Dead as Building Collapses in Philadelphia [/b][/color] \nSix people have died and at least 14 have been injured after a building collapsed in Philadelphia, officials say. A four-story building  fell down, sending debris all over a Salvation Army shop. The collapse happened in the Center City neighborhood around 10:30 AM local time. The building was being demolished, however the cause of the collapse was unknown, according to officials. Initial reports said just one person died, but rescuers continued working to find others. Mayor Michael Nutter said five women and one man had died.\n\n[color=white][b]PM Erdogan to Return to Turkey from Foreign Trip[/b][/color]\nPrime Minister Recep Tayyip Erdogan is to return to Turkey from a foreign tour as mass protests against the Turkish government’s policies continue. Demonstrators have been rallying in Istanbul and other cities for a week, with many calling for the three-term prime minister to resign. A police officer died and three others have been killed along with thousands injured in the unrest. Mr. Erdogan has called the protests undemocratic but his deputy apologized for the police violence and met with representatives of the protesters from Istanbul’s Taksim Square. Many people remain injured and the protests continue on.\n\n[align=center][img]http://puu.sh/2zT4b[/img][/align]\n[color=white][b]Apple Devices Susceptible to Attack[/b][/color]\nA team from the Georgia institute of technology has recently managed to create a bogus Apple charger that is able to infect any Apple device in under a minute once plugged in. According to the team, if this charger was to become public it would affect many Apple users, as it works on any Apple device whether jailbroken or not, and it is very cheap to make; this team made theirs using a very basic bare bone computer called a BeagleBoard. Apparently, the team plans on making recommendations to Apple about how they can defend against this sort of thing, so it will probably cease to be a threat in the near future. \n\n[color=white][b]NSA’s Prism Surveillance Program[/b][/color]\nEver since the Prism was revealed by the Guardian and the Washington Post, there has been much talk about what the NSA’s top-secret program is. Some articles claim that Prism is not a tool for information collection, but is an internal tool used for the analysis of such information. Others have speculated that Prism operates through the interception of communication cables. Both of these theories seem to contradict internal NSA documents. Prism and the other surveillance operations are to be brought to light in the coming weeks and months.\n\n[color=white][b]HTC and Samsung Twitter Cat fight[/b][/color]\t\nHTC and Samsung took out their bitter rivalry for each other in a Twitter cat fight. It all started after Thursday night’s Mobile Awards ceremony at which HTC was awarded the “Hottest Phone of 2013” for the HTC One. From HTC’s UK Twitter account, HTC tweeted, “Last night we won the ‘Hottest phone of 2013’ at the Mobile Awards #HTCOne, Ouch @SamsungMobileUK” to which the Samsung Mobile UK team responded with “@htc_uk That’s okay guys, our arms were full with the other three awards we took home last night. You can have that one!” The cat fight soon escalated when HTC responded saying “@SamsungMobileUK all those students you paid to write fake reviews of your competitors finally paid off. Pay rise, maybe?” The cat fight seemed to calm down after that last statement.\n\n[align=center][img]http://puu.sh/2zT4J[/img][/align]\n[color=white][b]Daft Punk Scores Second Week at No. 1 on Billboard 200 Chart[/b][/color]\nDaft Punk's \"Random Access Memories\" is still holding the No. 1 spot on the Billboard 200 albums chart for the second week. As of now, this means the total copies that were purchased were over 432,000. Wow! This is a huge accomplishment. For the people who didn't know, the album originally had a huge order of pre-orders which helped boost sales a lot. As we speak, \"Random Access Memories\" is the seventh No. 1 debut this year to slip by more than 70% in its second week. The largest would have to be Justin Bieber's \"Believe\".\n\n[color=white][b]Eminem, Big Sean Brew Their 'Similar Tales' Into a 'Detroit Classic'[/b][/color]\nBig Sean has recently gotten a chance to rap in the studios with hometown hero Eminem this past April. Turns out, when the two were hanging out together, they had a lot in common. When asked about their new upcoming single, Big Sean stated, \"It's going to be a Detroit classic.\"\nSean stated how he remembers as a child that his parents would buy him rap albums, including Eminem's, from Costco. He said, \"Being in the studio, I just remembered when my mom bought me his [first] album from Costco or something a long-ass time ago, so you could just imagine going from that moment — being a lil-ass boy — then fast forwarding 20 years later and being in the studio with him. We talked for a few hours before we even worked on music. I was telling him my stories about how we were performing all around downtown Detroit and [it turned out that] he was performing in the same places.\"\nEven though Sean is in his younger years, unlike Eminem, they both share the same type of similarities and experiences.\nIn Sean's own words: \"Real G's...similar tales.\" Big Sean's latest singles have included the songs \"Guap\" and \"Switch Up.\" As of now, the latest album cut is expected to debut on June 19.\n\n[color=white][b]Meek Mill 'Graduates' to Higher 'Levels' with New Track[/b][/color]\nMeek Mill has also come a long way in his music career. He's been focusing on upward mobility, which is the concept behind his new single \"Levels\". During his interview, Meek Mill stated how Rick Ross has impacted his life completely. Without him, he wouldn't be where he is today. \"When I went to Ross' house for the first time, he had every car in the driveway and I ain't ever really know nobody that had all that stuff at one time. So you personally knowing somebody like that, you're like, \"They're really levels out here man.\"\"\n\n[color=white][b]Music Video of the Week[/b][/color]\n[spoiler=]\n[video=youtube]https://www.youtube.com/watch?v=uuZE_IRwLNI[/video]\n[/spoiler]\n\n[align=center][img]http://puu.sh/2zT51[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nOh man. Finals week. I believe most of you are completely finished with school for the year, others have a few weeks left. Me... I'm stranded in the middle of finals and would love to just check out. Oh well. Life goes on.\n\nRock on!",
      "subject": "*"
    },
    {
      "pid": "33216711",
      "uid": "515249",
      "dateline": "1370924031",
      "message": "[align=center][img]http://puu.sh/2zT6R[/img][/align]\n\n\"How do you feel about Omniscient's choice to allow the sale of 'The Marketers?'\"\n\n[i]\"I think the sale of the group Marketers opens a new gateway to getting rid \nof groups that have no use anymore. Instead of letting just an unusable group \nsit there, lay to waste and fester you could pass it on to someone who wants \nto pay for it. But of course, you have to worry about the scheming scammers \nwho are probably thinking of ways to pull one over on someone right now. AND \nTHEN you have to worry about the prices. From what I see, this could become \na good omen, or a bad one. We're just going to have to wait it out and see.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=865003][i]-kayy6688[/i][/url]\n\n[align=right][i]\"I actually have positive thoughts on this one. I am glad that \nOmniscient allowed the group to be sold, as if it were to continue, the groups \nreputation would decrease, and there would be many negative thoughts not \nonly to the group, but to Omniscient for allowing such an disgusting group to \ncontinue. I've seen so many Marketers members scam so easily on Hack Forums, \nit was disgusting. I believe [M] will definitely make the group a lot more harder \nto get in, and he has a good method behind it. So overall, I do believe \nOmniscients choice was a good one.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=768227][i]-Queens[/i][/url][/align]\n\n[i]\"I think it works out in favor of CodeVade for sure. Marketers was thought to \nbe gone for good, and now Omniscient is letting the group be sold. I think Omniscient \nis very merciful by letting CodeVade pocket around $5k when the group should have \nbeen deleted. The Marketers group has had its run, and it's time for a change. I'm \nwondering if it will keep the $50 buy-in, and what the group will be based around \nafter it's sold. All in all, Codevade is lucky, Omniscient is merciful, and The Marketers \nis getting changed for the better (I hope).\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1498588][i]-WaterSpice[/i][/url]\n\n[align=right][i]\"I personally think that it's ridiculous that Codevade, get to sell he's \ngroup when it was closed upon something he's group did wrong. I think it's fine that \nthe group-spot is being sold, but the fact that it's Codevade, thats getting the \nearnings is outrageous, Omni should sell it and get the earnings. It's codevade's \nown fault that the group was disabled, so he should not be able to sell it.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1616077][i]-Dybdal[/i][/url][/align]\n\nThe topic for next week is \"How was your Goodwill Monday? What did you do?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://puu.sh/2zT5K[/IMG][/align]\n[align=center][img]http://i.minus.com/iQf4mkhk8fdzg.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://puu.sh/2zT7U[/img][/align]\n[align=center][spoiler=][img]http://imgs.xkcd.com/comics/dwarf_fortress.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/pxU3bNf.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/8CIGTFt.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://puu.sh/2zT93[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=121196]Natha[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=469528]Odin the Wanderer[/url]\n[list][*]World News\n[*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692131]Anima Libera[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1050193]Connected[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1121679]SkyGuy[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=763021]Retribute[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}