{
  "posts": [
    {
      "pid": "42961284",
      "uid": "515249",
      "dateline": "1413955978",
      "message": "[color=transparent]space[/color]\n\n[align=center][IMG]http://i.imgur.com/G3gXBMM.png[/IMG][/align]\n\n[align=center]The edition you are currently reading is the [color=123123][b]210th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].[/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/aVaK6x6.png[/img][/align]\n\n[b][color=white]New Ub3r Feature[/color][/b]\nOn October 17th, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] created a new [url=http://hackforums.net/showthread.php?tid=4495182]thread[/url] about a new feature added for Ub3r members. This new feature is being able to see warnings given to members in the past 48 hours. The idea originally came from [url=http://hackforums.net/member.php?action=profile&uid=2031636][color=#EFEFEF][b]Popstar Ahri[/b][/color][/url] who made a [url=http://hackforums.net/showthread.php?tid=4495033&pid=42894595#pid42894595]suggestion[/url] in a thread located [url=http://hackforums.net/showthread.php?tid=4495033]here[/url]. You can read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient's[/b][/color][/url] thread [url=http://hackforums.net/showthread.php?tid=4495182]here[/url]. Ub3r members can go [url=http://hackforums.net/warnlog.php]here[/url] to see the warnings given to members. \n\n[b][color=white]Sponsored Member Forums Closed[/color][/b]\nOn October 7th, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] created a thread about the price of Sponsored Member Forums being reduced. The price was lowered to $200 with the addition of another moderator. The thread was closed with a statement from [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] saying, \"Due to lack of interest all SMFs are being closed once their monthly payment runs out.\" You can read the now closed thread [url=http://hackforums.net/showthread.php?tid=4479737]here[/url].\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/eBLLjui.png[/img]\n\n[yt]https://www.youtube.com/watch?v=welCvbtkTLQ[/yt][/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/c2aftti.png[/img][/align]\n\n[color=white][b]User News[/b][/color]\n[list][*] [url=http://hackforums.net/member.php?action=profile&uid=934881][color=#EFEFEF][b]Aceman[/b][/color][/url] hit 10,000 posts.[/list]\n\n[color=white][b]News Notables[/b][/color]\n[list][*] [url=http://hackforums.net/member.php?action=profile&uid=1495835][color=#EFEFEF][b]Aurа[/b][/color][/url] for his incessant dedication to the [url=http://hackforums.net/forumdisplay.php?fid=110][b]White Hat Help[/b][/url] sub-forum.[/list]\n\n[color=white][b]Bans[size=x-small]*[/size][/b][/color]\n[list][*] [url=http://hackforums.net/member.php?action=profile&uid=2153563][color=black][b]Αgent[/b][/color][/url] was banned for \"Cross Posting w/ Fake Signature.\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=867775][color=black][b]Нyреrion[/b][/color][/url] was banned for a reputation violation.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1729678][color=black][b]ScreemS[/b][/color][/url] was banned for repeated sales trashing.[/list]\n\n[color=white][b]Vacations[/b][/color]\n[list][list][*] [url=http://hackforums.net/member.php?action=profile&uid=2100618][color=black][b]2Pac™[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=2237950][color=black][b]Aqulaane[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1171567][color=black][b]Chieftain[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=2205246][color=black][b]EbolaTheGod[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=333869][color=black][b]Fanatic[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1413125][color=black][b]Shockley[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1231885][color=black][b]The Plague Doctor[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1787706][color=black][b]xhflhkeuhwguu34[/b][/color][/url] took a vacation ban.[/list][/list]\n\n[color=white][b]Closures[/b][/color]\n[list][*] [url=http://hackforums.net/member.php?action=profile&uid=1751197][color=#383838][b]0x03a8[/b][/color][/url] had their account closed for proxy selling.[/list]\n\n[color=white][b]Repfucks[/b][/color]\n[list][*] [url=http://hackforums.net/member.php?action=profile&uid=1751197][color=#383838][b]0x03a8[/b][/color][/url] was repfucked for proxy selling.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=867775][color=black][b]Нyреrion[/b][/color][/url] was repfucked for a reputation violation.[/list]\n\n[color=white][b]Awards[/b][/color]\n[list][*] [url=http://hackforums.net/member.php?action=profile&uid=74674][color=#00AAFF][b]Blazin[/b][/color][/url] received the Businessman award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1812679][color=#EFEFEF][b]Ninetales.[/b][/color][/url] received the DaBomb award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1822561][color=#EFEFEF][b]Тeen[/b][/color][/url] donated for the Bitcoinage award and received the Award Whore award.[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of the Monday prior to release.[/size][/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/bt0LlC9.png[/img][/align]\n\n[b][color=white]Leadership Changes[/color][/b]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1203712][b]iKinky[/b][/url] has been removed as leader of L'appel du vide.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1705455][b]Jason™[/b][/url] has been added as leader of L'appel du vide.\n[/list]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/K3V5vjJ.png[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1931708]Programming.[/url][/font][/size][spoiler=]\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Welcome to 210th edition of the HF News, today we're here with Programming. Any shout-outs you'd like to make before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Yes, shoutout to my friends Grievous, tvrp, and Popstar Ahri!\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Pretty interesting mix of people, how did you meet these members?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Too long of a history for me to remember, but long story short, I met Grievous in the marketplace, tvrp through Grievous, and joking around on one of my threads about a year back with Ahri.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] I look back at some of my online friends and think how the hell did I meet you. So I noticed you're in Enterprise, they've recently made some changes, what's in store for us from that group?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] I can't say much, but we're buying a few things here and there from the marketplace for resale. I'm personally working on a project for Enterprise but that remains a secret for now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] No juicy secrets for me, it's alright. How have liked the group so far? I've personally heard some mixed reviews and there is always a looming cloud of controversy surround Astonish's current group.\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] A lot has changed, I used to not be in favor of Enterprise either. After Grievous became a leader, we started becoming much more active, and we've recruited some high quality members for the marketplace.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] I'm not going to take a view on it in the news, but I was interested to see how Grievous was running it, I've personally seen more forum presence. So what do you do outside of the forums? Have any cool hobbies?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Well, I abandoned my social life and all my sports for HF. I ignore all my friends when they ask to hang out, and I'd say I'm pretty lonely. But I think $600-800 a month just off HF is worth it. (I'm 15 so I don't have anything to do with the money, as you can tell by my awards). On a serious note, the only real hobby I have is programming, though I'm not creative, I learn new stuff every day and re-visit my old projects and expand on them for fun.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] I'd say that's pretty good for being young. So what do you want to do with Programming? Do you plan on making a career out of it or just having fun and stacking cash.\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] I plan to make a career out of it, me and my friend are currently developing an iOS app which will remain nameless until it's released. Right now, it's just a hobby, it's fun helping people around the community, while making money doing what I love.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Well that's good to hear, so how did you end up find Hack Forums?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Like everyone else, I wanted to become a 1337 hacker I guess. I think the first time I saw it personally was on Google search for a source that I wanted to look at. Joined HF, and just stuck.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] So what keeps you on the forum aside from it being an income source?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] The community. I'd say there's a few assholes (which I don't feel like naming), but there's way more positive people here on the forums. I've also made a ton of friends here, and I realized how many I had when I planned on leaving the forums after my repfuck. Most of my friends are here on HackForums, and I personally don't see me leaving anytime soon.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] I'd agree that the community is pretty good aside from a few idiots. So do you have any Hack Forums goals?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Well, not really. I'd say my only goal is to turn my 700-800 m/o into 1k+ m/o.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Just got another question or two for you left, how do you feel about the recent OmniCoin craze? Recently Omniscient considered selling a group for 1,000,000 OmniCoins, do you ever think something like that would ever happen?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Well, I don't agree with this at all. It would create a rise in the coin for a month or so, and as soon as the new group is sold, no one will use the coin anymore and it will crash. As for the groups, I believe adding another will just lower the price of groups from around 9 - 10k to 7 or so, which I believe would greatly impact group owners.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Compared to other forums I like that Hack Forums has an exclusivity to their groups. Well I think that's all the time I have for this interview, is there any concluding remarks you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=1931708][color=#EFEFEF][b]Programming:[/b][/color][/url] Nope :)\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aura[/url][/font][/size][spoiler=]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Welcome to this week's edition of the HF news, today we're here with Aura! Any shoutouts before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] Hi Jay :) Oh God ... WAY too many shoutouts it's not even funny ... Let's see, first of all, shoutouts to every group members of the groups I'm in and also a bigger one for The Brotherhood. As for personal shoutouts, there's just way too many and I would feel bad naming people and forgetting others so I'm just going to keep it like that. People that I know and that I consider my friends know who they are and that's enough :) I know it sucks and that many people wants to see their names here most of the time, but I try to be as fair as possible.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Yeah, you're pretty popular, I'd assume you know quite a few members. So how did you start out here?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] Well, to make it short, I started out as a little newbie that wanted to get into hacking mostly to impress people in my program (CS/IT) and also to become a l33t h4x0r. But not only for that, I wanted to learn IT Security (a domain that interested me a lot and still interest me a lot today) via hacking. I thought that if I knew how to attack, how would know how to defend. And so I found HackForums by Googling the word \"hack\" with other words a few times and decided to sign up. I started by asking a few noobish questions and learned the basics quite quick, so I started to assist around in the Beginner Hacking section. I was quite \"known\" (if I can say it like that) at that time in this section, with other helpers like Blackjack, Pony, Goodies, Kevin, Extrnl, etc. But as the days passed, I found that section more and more boring, and so I decided to explore the other areas of HackForums and quickly found my way in the Computing area. I noticed the Windows section and started helping. It was quite easy for me to solve issues, since I've been on a computer my whole life and also I study in it. I quickly started to post and offer my assistance in every threads I could. Unfortunately, that section was much more inactive than the Beginner Hacking section, so there would be a lot of dead time. This is when I decided to move to the White Hat Help section, since a lot of issues posted there (and also questions) where Windows-related, and not malware-related. After that, long-story short, I started PM'ing Chief who told me about Corso, who later became my Mentor and taught me most the stuff I know today about malware removal (mostly the tools used and concepts). Under his supervision and advices, I started helping in the White Hat Help section and totally left the Beginner Hacking one, since I was focussing on being a real, 100% White Hat Helper, which I still am today and it seems to impress some people because I'm not interested by fame, gain, money, etc. There's much more to say I think but I guess this pretty sums up how I started on HackForums :)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] The expert in something was once a beginner, nice bio. So how do you handle all the members that come to you for help? I can't imagine how many there are.\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] Some people are still surprised when I ask questions in other sections, haha. I may be an \"Expert\" in my domain, but it doesn't mean that I am in every domains, nor do I know everything (except for Polymath 1.0, this guy knows EVERYTHING). And concerning your question, it really depends of if I'm free or not. Before, I used to deal a lot of via Teamviewer, since it was the easiest way for me to solve an issue or check if something was wrong on a system. I could assist 2-3 users at the same time on Teamviewer, hence I was handling a lot of requests. Unfortunately, my Teamviewer got limited (cannot connect more than 5 minutes to a computer, and have to wait 5 minutes after to reconnect) and I stopped giving remote assistance. Of course, there was a time where I use to create VMs and install Teamviewer in it to keep on giving that assistance, but I get limited after a week and I can't be bothered to re-create them weekly, hence I stopped. Now, I mostly offer assistance in threads and via posts. These are the easiest to handle, since I post a solution, and I wait for the user to reply.  Hence I don't have to worry about anything if he replies and I don't reply right away (I have a life too, like everyone on this forum). The hardest to handle are the ones that PMs me. Mainly because sometimes I'm on my phone, I'll read your PM but can't answer them right away and then later on when I get on the computer, I forgot. Also, it's hard to keep track of what steps we did to attempt to solve their issue via PM. Therefore, I prefer dealing in threads, post by post rather than dealing via PMs. But I have to handle boths. I close a few threads a days and receive a lot of PMs daily too for assistance requests. I usually have between 5 and 10 PMs when I wake up in the morning. When someone ask me to do a \"malware check-up\" on his system, I politely decline since the GeekU doesn't allow me to offer such services until I graduate. Therefore, I redirect the user to the MRT, and if they're full, to other forums that specializes in malware removal (via logs and tools) like GeeksToGo (where I'm training) and BleepingComputer. I guess that pretty much covers up this question :)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Wow, you run like a well-oiled whitehat machine! What was that deal about you being a blackhat?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] ... Why must this come out in an interview ? It's all Roger's fault ... Around 6 months ago, when I took the lead of the BHCPU (The Brotherhood Computing Sector) and introduced the different subsectors (which one is the White Hat Help subsector), he started teasing me saying that I couldn't lead that sector since I was a Black Hat. And from there, it all begins : \"Aura RAT people through Teamviewer\", \"Aura shelled me\", \"Aura infects the people he assists\", \"Aura is a Black Hat, undercover FBI agent\", etc. At first, only Roger was saying these stupid things, but soon enough, pretty much everyone in The Brotherhood jumped in and started saying it, as it was making me rage pretty fast. The member Nico (I think?) even made sang on a remix of \"Trouble\" by Taylor Swift (lyrics by Unknown) and posted the video on Youtube ... This joke never stopped, it's like a never-ending running gag and I have to face it at least twice a day. Everytime Roger says it, it makes me wants to rip his head off but I can't do anything as The Brotherhood needs two Leaders right now to keep things under control. Sigh.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Vouch, Roger is quite the pest. Speaking of the Brotherhood and BHCPU, how do you like being leader of the group?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] For a second, I read \"Roger is quite the best\" and I was about to go all out on you. Being a Leader can be stressful, despite how it looks like. You have to handle every issues there is not only inside of your group, but also outside and make sure that the reputation of the group isn't affected. I have no idea of what kind of Leader I am, I just do what I think is right for the group and to keep it rolling. A lot of people asks me for invites, wants to buy-in and such, but I deny them right away. The Brotherhood is invite/recruitment-based only, simple as that. If someone asks me for an invite and that he didn't apply for a Sector or wasn't accepted by a Sector Leader, he doesn't get in, simple as that. When you are a Leader of a group, unless you are the Owner you have to keep in mind that you are somehow managing money, and that money isn't yours, so you can't do anything you want with it. That's how I see it and that's how I lead The Brotherhood in consequence, so far it's doing good. Funny too since I got promoted to Leader a first time quite a while ago as a joke, got demoted for the revamp and then got re-promoted to Leader. To this day, my guess would be that I was promoted for the dedication I have towards The Brotherhood, and also maybe because the members respects me and sees me as someone who's neutral, non-biased. I quite a few high issues behind the doors, but in the end, it pretty much always ended well. My job as a Leader isn't to order people around, but to get everyone together and manage The Brotherhood in a way that will please it's members and in a way where everyone will be happy with the outcome. Simple as that. In the end, this group is still Cryptic's group and will always remain it till the day he decides to sells it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] I have to say, you're doing a darn good job as leader, keep it up! But it's sad to see all these old groups going for sale. If you had your own group, how would you run it? What would you do to make your ideal group?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] Thanks, I appreciate the compliment. Oh God ... If I had my own group, it would actually be a group for HackForums and nothing else. My group would recruit the best members in their domain : computing, programming, gaming, etc. but not only to have them in the group, but to put them to use. These members would be helping through the various sections of HackForums that suits them under the banner of my group. They would be recognized and professional helpers that could solve any issues they are facing and answer any questions. In fact, you could say that my group would be oriented in supporting HackForums and it's members, at the same level that I am doing in the Computing area. Imagine a group, composed of people like me that devote all their time on HackForums to help others. Wouldn't that be great ? Computing, Coding, Gaming, Webmaster, Graphics, etc. Every tabs would have their helpers from my group that would handle these areas and keep them rolling. That's how my group would be like. Buy-ins wouldn't be accepted, Leaders would be people of trust recognized by the community. The group would be organized into Divisions for every HackForums main tabs there is : Computing, Coding, Gaming, Webmaster, etc. Each Division would be composed of like ... 5-7 members who would handle Help Desks, create tutorials and videos and spread their knowledge across HackForums. That would be how my group would look like. No monetizing, no products, nothing of that sort. I'm not interested in making money and never will. However, I'll never get a group since like previously stated, I'll never invest online, and I doubt that Omni would gift a group to any member here other than for an exceptional reason/situation. So I can keep on dreaming eh.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] That sounds like the jack-of-all-trades of groups, I would love to see it happen. And who knows, there might be a reward for your dedication! Now, on to a popular topic: cryptocurrencies; what would you like to be done with OMC?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] I already got the White Hat Helper award, that's all I ever wanted to achieve on HackForums. The rest are only bonus, haha ! Oh God, you're not asking this to the good person since I have zero interest in Crypto-Currency, haha ! However, I would love to see some kind of trade system implement on HackForums with the OMC. You know, thread title effects (bold, italic, colored, icons, like there is on other forums since as d2jsp) or even bring back the attachments in posts, but it would cost OMC.  Omni's idea of selling a group for OMC wasn't bad too. We have a full community ready one of the biggest forum there is to use a brand new Crypto-Currency, there's tons of things we could do, all we need is the idea. I also liked the idea of making the 3p1c upgrade monthly payment, since it would make OMC's stable in a way where it would HAVE to be used continuously but that's just me. However, I don't know how it works, but I guess that all these ideas would require a direct implementation of OMC and OMC wallets in HackForums itself, which might give a lot of work to Omni, who have a lot in his plate, even more now with the project of reviving SupportForums.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Omni sure is a busy man, we'll just have to wait and see what he comes up with. I never really checked out SupportForums, what is it? The sister site to HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] He's the busiest man on HackForums, that's for sure ! I don't exactly the history of SupportForums, but it's a support dedicated to support (like the name states), support in every domain there is. See it as a forum with two kind of members : the helpers and the helped. A member who needs help in a certain domain will post his question in the right section in hope to receive assistance or an answer, and then a helper will post in his thread, assisting him. The difference between HF and SF in my opinion is that SF is totally dedicated to supporting and offering assistance, which means no real Marketplace, no money making tactics, no hacking, etc. Just your big forum where you can ask questions for pretty much anything and get reliable assistance for it. Well, that's my idea of SupportForums. With Omni's recent decision of reviving it, and the interest I always had in this forum (it matches me perfectly), I decided to register on it and give a hand to help Omni revive it. I never registered before because it was dead, but the concept, to assist others without expecting nothing in return always attracted me and pleased me, since I spend a lot of time on HF and other boards doing the exact same thing. Also, I expect only the best members to be recognized helpers on SF, and members that shares the same passion that I have for helping. I'm sure that SF's revival will be great and that the forum will rise back to be one of the best support forum there is, all we have to do is to wait for Omni's to start the revival and support him, and the forum at the best of our abilities.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Now it makes me want to join! So what do you usually do outside of HF? Any cool hobbies?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] You should sign up right away under my name for a referral, hehe. Oh about that ... Hum. Well, all my hobbies are pretty much on the computer. I watch animes while gaming (it makes it easier), and I mainly play Guild Wars II right now, but also Battlefield 3 & 4, League of Legends and Diablo III. I do malware testing and analysis on the many VMs I have, I keep up with my training at the GeekU and I watch movies (I have around ... 300GBs of movies I think). That's pretty much what I do everyday haha ! Otherwise, I do a bit of programming, although I hate what's being taught me at school and I test various security software. OH, and I do IT Support online and in real life too. As for outside activities, I love going out to play pool. It's something I started to do weekly about 3 months ago. There's also that comedy show every Thursday at a popular bar around my area and I go with friends to have a laugh. I also enjoy going to the movies, playing bowling and just chilling with friends at Tim Hortons (yup, Timmies is the best). I used to spend most of my time with my girlfriend but now that she's my ex (we broke-up) ... I guess you could say that I feel a bit lonely ... But it's my fault too so I'm the only one to blame for that. Anyway I guess that covers my hobbies ! OH and LAN parties, obviously !\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] You sound like the life of the party. Seeing those games you listed, are you a PC only gamer or do you play on console as well?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] PC Master Race, Gaming peasants can step aside. You could say that I'm a full fledged PC Gamer. I never owned a single console in my life (except from the Game Boy, which me and my brother owned because we used to go camping and the road was long sometimes) and never will as long as I live with my parents. They never allowed me or my little brother to have a console since they thought that we would spend all of our free time on it, haha ! It's not false but it's not exactly true either. Instead, we were on the computer and we were exchanging turn each hour (since we only had one). Oh God, that brings back so many memories. An hour to play your favorite game and progress as much as you can before your little brother comes barging in the room screaming for you to get out because it was his turn to play, haha ! Childhood memories eh. However, I still love console games too. My best friend pretty much had every consoles there is and I was always at his house, so I played many, many console games, more than PC games I guess. We had a thing me and him. We were completely obsessed by the \"Halo\" serie games and so, when I would go at his house for a sleepover, we would go to the store buy $20 of candies, then play Halo all night. We would complete the campaign in the two hardest mode there is then jump in the Multiplayer mode until none of us could stay awake. These were the good times, I miss these days. However, not having a console pushed me toward the PC and so I became a real PC gamer. Played pretty much every MMORPG there is : World of Warcraft (private servers, before the raid of Blizzard), Runescape, Maple Story, Diablo II & LoD, Guild Wars, etc. However, my favorite PC MMORPG serie is and will always be Guild Wars, hence why I'm so hooked up on Guild Wars II right now. Unfortunately, I don't have any friends IRL that plays it, so I'm alone. So if anyone wants to play with me, on Americas servers, feel free to send me a PM for my IGN. Other than that, I enjoy playing console games, but I'll always stay a PC gamer by heart, even when I'll move in by myself and buy a console, haha !\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] That sounds exactly like my childhood, we would stay up all night playing Halo at a friend's house. And sibling rivalries, oh boy. With your infinite big brother wisdom, what would you like to advise the members of HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] Infinite big brother wisdom, God I'm far from having that. Well, if we are talking about advice that is related to HackForums : when browsing, please use your brain, you have one, it ain't for nothing. You won't get rich via an e-book from the Marketplace, no one is interested in shitty crypters, RATs and booters, of course that free 5 years old FUD Keylogger is infected, yes this guy who wants to mentor you for CPA or whatever is called is linking you to a phishing webpage. You are on a hacking forum for fuck sake, most of the things you'll see here are either fake, infected or totally out of your control. If you really want to learn the real stuff, learn by yourself, not via shitty ebooks and methods that you see here. Self-learning and being mentored by the RIGHT members is the best way to learn. I've been mentored and I self-taught myself the rest, and I didn't turn that bad didn't I ? Please stop testing your fucking malware directly on your host system, use a Virtual Machine (VM) or AT LEAST Sandboxie. No the Computing area isn't the place to ask how to bypass the Admin password of a Windows laptop that is \"yours\" or that you \"just found\". Keep that shit out of here. To make it short, respect the areas and sections in which you ask assistance. Keep all the illegal stuff in the Hacking area. Helpers of the other areas are trying really hard to keep their area/sections clean from Black Hat stuff and seek to share knowledge and teach it to those who seek it. They spend their free time, without receiving anything in return other than skills, knowledge and experience, assisting other members. So when you come in their section and ask stupid questions or didn't use your brain, it's like insulting them. It's alright to ask advices or questions when you're not sure about something, but damn, Google exists, tutorials exists, common sense exists, etc. Use it. They are the best resources you have, put them into use. And if you REALLY want to get into something, must it be malware removal to C/C++ coding, be serious and passionate about it because if you're not, you'll never succeed nor will you accomplish anything worthy with it. What I'm telling you right now are common advices that maybe other members told you before, but if I'm repeating them it's for a reason : because you're not listening to them and if you were, you have no idea how different this forum would be.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1958081][color=#70B8FF][b] Justin Timberlake:[/b][/color][/url] Wise words my friend, I see that all too often. That's all we have time for, any closing remarks you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=1495835][color=white][b]Aura:[/b][/color][/url] Well, thanks for interviewing me first of all eh, I know it took a few days since we're both busy but we finally made it. Also, just to everyone that if you ever have any technical issues with your computer, laptop, cellphone, printer, etc., whatever it is, the Computing area and its sections are filled with skillful helpers ready to assist you at anytime, no matter what the issue is. I've been told a lot of time by members that I assisted that asking for help on HF in the Computing area was the best thing they did instead of going straight to the shop and paying money just to get their Windows reinstalled. I know HF is mostly about ... hacking and the Marketplace, but there's so many other areas and sections on it too that you can enjoy and learn a lot from. You have the chance to be on one of them most active forum there is with sections for any interests there is. Grab this chance and use it. Don't be afraid. We are a community and we should all work together in order to preserve the peace and the teamwork we have on here, let's not let it go to waste shall we?\n[/spoiler]\n\n[color=transparent]space[/color]",
      "subject": "HF News - 210"
    },
    {
      "pid": "42961286",
      "uid": "515249",
      "dateline": "1413955986",
      "message": "[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/pbX81lI.png[/img][/align]\n\n[align=center]Do you enjoy reading the HF News? Do you think others might enjoy reading the HF News? Do you want to show your support for what we do?\nWear our Support Signature and show us you care! Numerous members don't even know we exist, make a change!\n\n[spoiler=[b]Support Signature[/b]]\n\n[sp=[u]Example[/u]][align=center][url=http://hackforums.net/forumdisplay.php?fid=162][img]http://i.imgur.com/rIEO5r0.gif[/img][/url][/align][/sp]\n\n[sp=[u]Code[/u]][code][align=center][url=http://hackforums.net/forumdisplay.php?fid=162][img]http://i.imgur.com/rIEO5r0.gif[/img][/url][/align][/code][/sp]\n[/spoiler][/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/Wp00kGw.png[/img][/align]\n\n[b][color=white][u]Announcements[/u][/color][/b]\n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4495182][b]Ub3r Feature for Warning Logs[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#FF66FF]Omniscient[/color][/b][/url]\n[color=#333333]---[/color]A new feature was added for all UB3R users. Check it out!\n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4494963][b]SSL Poodle Exploit[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#FF66FF]Omniscient[/color][/b][/url]\n[color=#333333]---[/color]Omniscient explains why he will not add SSL/TLS encryption in the near future, if ever.\n\n[b][color=white][u]Entertaining Threads[/u][/color][/b] \n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4493711][b]How did you get your HF name/alias?[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=2102751][b][color=#EFEFEF]trvp[/color][/b][/url]\n[color=#333333]---[/color]Users discuss how they came up with their Hack Forums usernames. A few of these stories are hilarious.\n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4439728][b]Omniscient Is....[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1813061][b][color=EFEFEF]Stazzy[/color][/b][/url]\n[color=#333333]---[/color]A bizarre theory stating that Omniscient is, in fact, actually Dr. Eggman from the \"Sonic the Hedgehog\" video game series.\n\n[b][color=white][u]Contests & Giveaways[/u][/color][/b] \n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4487683][b][$50 Giveaway] Gift Award + x1 Copy of Profit Mania! [OPEN TO EVERYONE][/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1327245][color=#EFEFEF][b]zSerity[/b][/color][/url]\n[color=#333333]---[/color]Interested in some free cash? If so, enter this contest now!\n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4492903][b]1,000 League of Legends Referrals Giveaway.[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1622670][b][color=#EFEFEF]Carnality[/color][/b][/url]\n[color=#333333]---[/color]The user \"Carnality\" is giving away 1,000 referrals for the popular game \"League of Legends.\" Enter now!\n\n[b][color=white][u]Miscellaneous[/u][/color][/b] \n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4489323][b]Shot a gun for the first time[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=2217295][b][color=#99FF00]ViperCoder[/color][/b][/url]\n[color=#333333]---[/color]This user shares their first time using a firearm while others join in on the discussion.\n\n[color=#333333]---[/color][url=http://hackforums.net/showthread.php?tid=4493303][b]Ebola Prepared [/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#FF66FF]Omniscient[/color][/b][/url]\n[color=#333333]---[/color]Omniscient describes his preparedness regarding Ebola.\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/BI0iqPA.png[/img][/align]\n\n[color=white][b]Omnicoin Team Progressing on Omnicoin MyBB Plugin[/b][/color]\nTo help facilitate growth of Omnicoin, and allow its expansion as a MyBB-centric coin, the OMC team has begun work on an [b][url=https://github.com/Omnicoin-Project/MyBB-Plugin/]Omnicoin MyBB Plugin[/url][/b]. While the initial iteration of the plugin will be focused on allowing users to display and verify their Omnicoin addresses, there are plans to turn it into a fully integrated Omnicoin tipping system. You can keep up to date on the development via the [b][url=https://github.com/Omnicoin-Project/MyBB-Plugin/]Github repository[/url][/b], and the [b][url=http://hackforums.net/showthread.php?tid=4486383]official thread[/url][/b]. Feel free to contribute via pull requests on Github as well. \n\n[color=white][b] Weekly Highlights[/b][/color]\n[list][*][b][url=http://hackforums.net/showthread.php?tid=4486383][Official] Omnicoin MyBB plugin development[/url][/b] by [url=http://hackforums.net/member.php?action=profile&uid=2015410]ӍeshCollider[/url]\n[*][b][url=http://hackforums.net/showthread.php?tid=4494591]OMC highest volume in the last 24 hours![/url][/b] by [url=http://hackforums.net/member.php?action=profile&uid=1234585]Tweety.[/url]\n[/list]\n\n[color=white][b]New OMC Exclusives[/b][/color]\n\n[list]\n[*][b][url=http://hackforums.net/showthread.php?tid=4487114]\tEZ-VPN | AutoBuy | OpenVPN | PPTP | DDos Protection | No Logs |$1/Month|$9/Year[/url][/b]\n[*][b][url=http://hackforums.net/showthread.php?tid=4486963]>> jRAT | Up for 2 years+ | Cross-Platform [OSX/Win/Linux] | Coded in Java[/url][/b]\n[/list]\n\n[size=small]Click [b][url=http://hackforums.net/forumdisplay.php?fid=314]here[/url][/b] to start your shop for a chance to be featured in the next edition.[/size]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/P95vWUx.png[/img][/align]\n\n[color=white][b]Site Statistics[/b][/color]\n\n[list][*][sp=[b]Total[/b]]\n[list][*][u]Posts:[/u] 32,578,944 ( [color=#32CD32]+0.39%[/color] )\n[*][u]Threads:[/u] 3,059,330 ( [color=#32CD32]+0.40%[/color] )\n[*][u]Members:[/u] 451,400 ( [color=#32CD32]+1.78%[/color] )[/list][/sp][/list]\n\n[list][*][sp=[b]Average[/b]]\n[list][*][u]Daily Posts:[/u] 10,550 ( [color=#32CD32]+0.12%[/color] )\n[*][u]Daily Threads:[/u] 994 ( [color=#32CD32]+0.10%[/color] )\n[*][u]Daily New Members:[/u] 148 ( [color=#32CD32]+1.37%[/color] )\n[*][u]Posts Per Member:[/u] 70 ( [color=#FF0000]-1.41%[/color] )\n[*][u]Replies Per Thread:[/u] 9 ( [color=#FF0000]-6.34%[/color] )[/list][/sp][/list]\n\n[b][color=white]Ban Statistics[/color][/b]\n\n[list][*][sp=[b]Last Week's Bans[/b]]\n[list][*][u]Staff Bans:[/u] 85\n[list][*][i]... Change from Last Edition:[/i] [color=#32CD32]+33[/color][/list][/list]\n[list][*][u]Vacation Bans:[/u] 25\n[list][*][i]... Change from Last Edition:[/i] [color=#32CD32]+2[/color][/list][/list]\n[list][*][u]Combined Bans:[/u] 110\n[list][*][i]... Change from Last Edition:[/i] [color=#32CD32]+35[/color][/list][/list][/sp][/list]\n\n[list][*][sp=[b]Total Bans[/b]]\n[list][*][u]Staff Bans:[/u] 957\n[list][*][i]... Change from Last Edition:[/i] [color=#FF0000]-10[/color][/list][/list]\n[list][*][u]Vacation Bans:[/u] 90\n[list][*][i]... Change from Last Edition:[/i] [color=#32CD32]+7[/color][/list][/list]\n[list][*][u]Combined Bans:[/u] 1047\n[list][*][i]... Change from Last Edition:[/i] [color=#FF0000]-11[/color][/list][/list][/sp][/list]\n\n[color=white][b]Forum Counts[/b][/color]\n\n[list][*][sp=[b]Tab Counts[/b]]\n[list][*][b]Notable Sections[/b]\n[list][*][u][url=http://hackforums.net/forumdisplay.php?fid=25][b]Lounge[/b][/url] Threads:[/u] 401,560 ( [color=#32CD32]+0.27%[/color] )\n[*][u][url=http://hackforums.net/forumdisplay.php?fid=25][b]Lounge[/b][/url] Posts:[/u] 5,528,780 ( [color=#32CD32]+0.28%[/color] )\n[*][u][url=http://hackforums.net/forumdisplay.php?fid=2][b]RANF[/b][/url] Threads:[/u] 41,967 ( [color=#32CD32]+0.37%[/color] )\n[*][u][url=http://hackforums.net/forumdisplay.php?fid=2][b]RANF[/b][/url] Posts:[/u] 553,929 ( [color=#32CD32]+0.32%[/color] )[/list][/list]\n[list][*][b]General[/b]\n[list][*][u]Threads:[/u] 585,962 ( [color=#32CD32]+0.34%[/color] )\n[*][u]Posts:[/u] 9,143,455 ( [color=#32CD32]+6.81%[/color] )[/list][/list]\n[list][*][b]Hacking[/b]\n[list][*][u]Threads:[/u] 589,156 ( [color=#32CD32]+0.24%[/color] )\n[*][u]Posts:[/u] 5,198,352 ( [color=#32CD32]+0.22%[/color] )[/list][/list]\n[list][*][b]Computing[/b]\n[list][*][u]Threads:[/u] 176,763 ( [color=#32CD32]+0.29%[/color] )\n[*][u]Posts:[/u] 1,507,557 ( [color=#32CD32]+0.26%[/color] )[/list][/list]\n[list][*][b]Coding[/b]\n[list][*][u]Threads:[/u] 144,817 ( [color=#32CD32]+0.24%[/color] )\n[*][u]Posts:[/u] 1,260,719 ( [color=#32CD32]+0.22%[/color] )[/list][/list]\n[list][*][b]Gaming[/b]\n[list][*][u]Threads:[/u] 362,260 ( [color=#32CD32]+0.63%[/color] )\n[*][u]Posts:[/u] 3,799,481 ( [color=#32CD32]+0.60%[/color] )[/list][/list]\n[list][*][b]VIP Area[/b]\n[list][*][u]Threads:[/u] 108,791 ( [color=#32CD32]+0.22%[/color] )\n[*][u]Posts:[/u] 1,034,339 ( [color=#32CD32]+0.21%[/color] )[/list][/list]\n[list][*][b]Groups[/b]\n[list][*][u]Threads:[/u] 5,687 ( [color=#32CD32]+0.74%[/color] )\n[*][u]Posts:[/u] 253,050 ( [color=#32CD32]+0.87%[/color] )[/list][/list]\n[list][*][b]Webmaster[/b]\n[list][*][u]Threads:[/u] 68,540 ( [color=#32CD32]+0.25%[/color] )\n[*][u]Posts:[/u] 505,073 ( [color=#32CD32]+0.25%[/color] )[/list][/list]\n[list][*][b]Graphics[/b]\n[list][*][u]Threads:[/u] 116,858( [color=#32CD32]+0.21%[/color] )\n[*][u]Posts:[/u] 889,455 ( [color=#32CD32]+0.19%[/color] )[/list][/list]\n[list][*][b]Marketplace[/b]\n[list][*][u]Threads:[/u] 727,361 ( [color=#32CD32]+0.38%[/color] )\n[*][u]Posts:[/u] 6,820,043 ( [color=#32CD32]+0.42%[/color] )[/list][/list]\n[list][*][b]Money[/b]\n[list][*][u]Threads:[/u] 116,949 ( [color=#32CD32]+0.35%[/color] )\n[*][u]Posts:[/u] 1,602,035 ( [color=#32CD32]+0.30%[/color] )[/list][/list][/list]\n[/sp]\n\n[color=white][b]Membership Counts[/b][/color]\n\n[list][*][sp=[b]Groups[/b]]\n[list][*][b]Null[/b]\n[list][*]29 Members ( [color=#32CD32]+1[/color] )[/list]\n[*][b]Specialists[/b]\n[list][*]34 Members ( [color=#FF0000]-4[/color] )[/list]\n[*][b]Red Lions[/b]\n[list][*]23 Members ( [color=#32CD32]+1[/color] )[/list]\n[*][b]Zero[/b]\n[list][*]20 Members ( [color=#FFD700]~[/color] )[/list]\n[*][b]Polymath[/b]\n[list][*]40 Members ( [color=#32CD32]+4[/color] )[/list]\n[*][b]L'appel du Vide[/b]\n[list][*]146 Members ( [color=#32CD32]+15[/color] )[/list]\n[*][b]Phoenix[/b]\n[list][*]26 Members ( [color=#FF0000]-1[/color] )[/list]\n[*][b]The Brotherhood[/b]\n[list][*]89 Members ( [color=#FF0000]-23[/color] )[/list]\n[*][b]Enterprise[/b]\n[list][*]29 Members ( [color=#FF0000]-2[/color] )[/list]\n[*][b]Legion[/b]\n[list][*]40 Members ( [color=#FF0000]-1[/color] )[/list]\n[*][b]Instinct - *#@?&%![/b]\n[list][*]188 Members ( [color=#32CD32]+2[/color] )[/list]\n[*][b]Illuminati[/b]\n[list][*]38 Members ( [color=#32CD32]+17[/color] )[/list]\n[*][b]Studio[/b]\n[list][*]63 Members ( [color=#FF0000]-17[/color] )[/list]\n[*][b]The Revolution[/b]\n[list][*]19 Members ( [color=#FFD700]~[/color] )[/list]\n[*][b]Titans[/b]\n[list][*]27 Members ( [color=#FFD700]~[/color] )[/list][/list][/list][/sp]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of the Friday prior to release.[/size][/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/5RCD7IW.png[/img][/align]\n\n[align=center]Meh, one day late, not badfor how much had to be pulled together at the last minute.\nEach individual is now perfectly aware of their responsibilities, so I expect we shall be able to keep to our schedule.\n\nAlso, go check out and wear our Support Signature!\nIt'd mean a lot to us.[/align]\n\n[color=transparent]space[/color]",
      "subject": "**"
    },
    {
      "pid": "42961296",
      "uid": "515249",
      "dateline": "1413956026",
      "message": "[color=transparent]space[/color]\r\n\n[align=center][img]http://i.imgur.com/8CK4be5.png[/img][/align]\r\n\n[align=center][b]By [url=http://hackforums.net/member.php?action=profile&uid=1173142]Goodies[/url][/b][/align]\r\n[align=center][spoiler=][align=left]\r\n\n[color=white][b]3 Important 0-Day Vulnerabilities Caught in Wild by Microsoft[/b][/color]\r\nThe Windows Operating System, not particularly well known for its security, has been subjected to some serious attacks throughout the past 6 months. All currently supported windows versions up to 8.1 are affected by 3 major vulnerabilities. Once flaw, [url=https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-4114]CVE-2014-4114[/url], is an OLE Object exploit that allows Remote Code Execution on Microsoft Office products such as PowerPoint(tm) and Word(tm). [url=https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-4148]CVE-2014-4148[/url] is another Code Execution attack exploiting a processing function in TrueType Font (TTF) files. And finally, [url=https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2014-4113]CVE-2014-4113[/url] is a Privilege Escalation Exploit that creates a storage space in memory containing a function pointer that will be executed in Ring-0 Kernel mode, uses a known memory corruption exploit in the Windows Manager, replaces the Access Token of the EPROCESS structure with one from a SYSTEM process, and executes a command as NT Authority/System. All three have been patched as of [url=https://technet.microsoft.com/library/security/ms14-058]MS14-058[/url].\r\n\n[color=white][b]POODLE Attack Becoming Popular[/b][/color]\r\nAn attack dubbed POODLE (Padding Oracle On Downgraded Legacy Encryption) has caught the attention of network administrators and web application developers. This is a Man in the Middle (MitM) attack that forces a connection encrypted with Transport Layer Security (TLS) to a Secure Socket Layer v3 (SSLv3) connection which is less secure and far more vulnerable. This allows plaintext data and cookies to be captured by attackers. Much like the recent ShellShock and the fairly recent HeartBleed attacks, there is nothing that a home user can do to prevent this attack other than not using websites that support SSLv3. Until these websites upgrade to a modern version of TLS, they are vulnerable to this attack.\r\n\n[color=white][b]The Snappening[/b][/color]\r\nHackers and security aficionados, with their linguistic perspicacity, have awarded the name \"The Snappening\" to the alleged interception of over 13GB of photos sent over the popular application, Snapchat. Over the last month, nude and risque celebrity images have been leaked in, what is now referred to as, \"The Fappening\". Snapchat was first breached in December, 2013 when 4.6 Million users' information was obtained. The source of The Snappening is believed to be a combination of the several months out-of-commission website. http://SnapSaved.com as well as the SnapSave application. The Snapsave application, or one or more of its servers, had been compromised and idly intercepted every image sent using the service. If more nude photographs are leaked, it will be another violation of privacy by hackers, and heavy legal implications are very likely to follow.\r\n[/align][/spoiler][/align]\r\n\n[color=transparent]space[/color]\r\n\n[align=center][img]http://i.imgur.com/9WqJ0sy.png[/img][/align]\r\n\n[align=center][b]By [url=http://hackforums.net/member.php?action=profile&uid=255459]Delirium™[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1500602]Bonfire.[/url][/b][/align]\r\n[align=center][spoiler=][align=left]\r\n\n[b][color=white]They Called Him \"The Bitcoin Founder\" And He Is Running A Fundraiser To Sue Them[/color][/b]\r\nDorian Satoshi Nakamoto, the man photographed and named \"the Bitcoin founder\" by Newsweek, is running a fundraiser in order to gather money to sue the magazine. After denying that he is the aforementioned person, he created a website in order to gather money to sue the sycophants. The article by Newsweek has caused a great disturbance in Nakamoto's life, since journalists and various paparazzi have been stalking him. Nakamoto has been described as a 65-year-old unemployed mechanic and his lawyer has stated that his client has indeed approved the fundraiser but has no clue, yet, about how his client is going to proceed with his legal actions.\r\n\n[b][color=white]A New BlackBerry Vulnerability Has Been Discovered[/color][/b]\r\nBlackBerry, one of the most secure mobile OS currently on the market, has been found to be vulnerable to a security hole in the BlackBerry World application. According to the Canadian company, the security hole exists on BlackBerry version 10 but the danger is limited by two factors; A user must be connected to a network controlled by a potential intruder, and must download an application deployed through BlackBerry world. Due to a bug, the malicious user can intercept the request and replace valid data with infected software. This could, theoretically, enable a malicious user to steal sensitive information,  but according to BlackBerry, the issue has been fixed. Users are requested to update their operating system.\r\n\n[b][color=white]Russian Cyber-Spying Team Targeting NATO In Ukraine[/color][/b]\r\nAn incident with a group of Russian cyber spies targeting NATO, Ukrainian and Polish government agencies and various other industries was mentioned in a report issued by a security company named \"iSight Partners\" last Tuesday. Sandworm, a zero-day exploit found by the aforementioned group and named by iSight Partners, appears to be of Russian origin. It targets Windows Vista, 7 and 8 machines. \"We can confirm that NATO was hit and we are aware, through various intel sources, that Ukrainian organizations were target as well\" was stated by John Hultquist, the head of anti-espionage department in iSight Partners. The group became known in September, when F-Secure and ESET released details about attacks performed by the Russian spy group.\r\n\n[b][color=white]Much Needed Fixes to Multiple Big-Name Products[/color][/b]\r\nDominant tech giants Microsoft, Oracle, and Adobe have recently sent out fixes with the hope to rid many of their products of a large number of newly discovered vulnerabilities. The patches include multiple repairs to many of the company's flagship products - including Java (developed by Oracle) and Flash Player (by Adobe). Two of the more prominent patched developments were Internet Explorer and the .NET framework, which include fixes for things such as ASP.NET, and Microsoft Word. Severity of the vulnerabilities range from privilege elevations to remote code execution. It is recommended that you keep all of your applications up-to-date, and always be on the lookout for any vulnerabilities that might affect you.\r\n\n[b][color=white]Phone Privacy Tensions Rise[/color][/b]\r\nLast Thursday, FBI Directory James Comey gave a talk about phone privacy, and how federal agents should be able to access private information in Washington D.C. Included in his speech was talk of reducing the privacy given to cell phone users, and it was suggested that companies should build \"front-doors\" in their products to allow access by federal institutions if the needs arose. Comey argued that \"Justice may be denied, because of a locked phone or an encrypted hard drive\" and urged law-makers to put measures in place to regulate openness among newer technological products. With predictions that companies will only strengthen security measures put in place to protect their users’ privacy, the FBI Director hopes to put a stop to the balancing of privacy rights and information shared with authorities.\r\n\n[b][color=white]Passphrases Over Passwords[/color][/b]\r\nAfter a large survey done by the government of the United Kingdom, it was revealed that over 75% of those surveyed did not follow common secure password conventions. The questionnaire also shows that 35% couldn't even remember their own relatively strong passwords. One example of a secure passphrase is “correct horse battery staple.” Passphrases like these are so abstract, that you’ll never forget them - and the 25-character alpha-numeric password would take years for the average thief to guess or crack. Adding random numbers and symbols makes your password, or hopefully passphrase much safer. You should be sure to always use secure and proper password/passphrase practices.\r\n[/align][/spoiler][/align]\r\n\n[color=transparent]space[/color]\r\n\n[align=center][img]http://i.imgur.com/vn6cLxV.png[/img][/align]\r\n\n[align=center][b]By [url=http://hackforums.net/member.php?action=profile&uid=1093501]Roger Waters[/url] & [url=http://hackforums.net/member.php?action=profile&uid=692131]Anima.[/url][/b][/align]\r\n[align=center][spoiler=][align=left]\r\n\n[b][color=white]Halo: The Master Chief Collection has a 20 GB Day One Patch[/color][/b]\r\nHalo: The Master Chief Collection executive producer Dan Ayoub revealed earlier this week that there will be a 20 GB patch available at launch for the game. The Master Chief Collection will require such a large download because there simply isn't enough space to fit the game on a single Blu-ray disc - which can only hold up to 45 GB of storage. “Yes, the update is large, but we weren’t about to cut corners to save disc space. This ensures that you are getting every bit of Halo goodness we can fit in. Our work is not done, however, as we continue to tune, tweak and optimize the online experience to ensure a smooth multiplayer launch. This will continue right up until launch day,” executive producer Dan Ayoub explained in an interview earlier this week. \"From the start, our philosophy has been to give Halo fans the best possible experience and not compromise the quality or features of the collection. The result is that Halo: The Master Chief Collection will take up almost all of the usable space of a single Blu-ray (45 GB), and we will also issue a content update at launch that is estimated to be 20 GB. You’ll be able to start playing Campaign and more as the content is installing, with some features and multiplayer content being added via the update.\" It was also later revealed that Spartan Ops, the co-op experience found on Halo 4, will not be available at launch, but will be included in an update in December - in order to allow the development team time  to make “technical enhancements to that experience to make sure it’s smoother and even better than before.” Halo: The Master Chief Collection will be released on November 11, 2014 for the Xbox One.\r\n\n[b][color=white]NBA 2K15 Available on Mobile[/color][/b]\r\nHave you ever been in the middle of an NBA match when you are called away?If you are forced to leave for boring work or anything else that takes you away from the game at home, don't fret. NBA 2K15 can now be purchased for $8 on your iPhone and Amazon devices. Sadly, you cannot continue the game from a console or PC directly onto your phone, but gamers should still enjoy the game on the run. Same teams, same concept. NBA gamers will be able to play against their favorite teams and battle it out on the court. Although the graphics won't be top notch, that shouldn't stop you from playing. The mobile version even includes the gamemodes fans know and love, such as \"quick game\" and \"My Career\" modes. No announcements have been made, on whether or not 2K15 will be available on android devices. Game on!\r\n\n[b][color=white]Advanced Warfare Upgrades Announced[/color][/b]\r\nFans of the Call of Duty series know the various different and fun killstreaks - simple as a radar for finding enemies, to an advanced streak such as an AC-130 Gunship - which can be added to the game. In the newest game of the series, Advanced Warfare, players should be expecting a killstreak system like the one in Black Ops 2. Streaks won't be earned only by kills, but also by other scores earned in that single life too. An example would be capturing a flag in Capture the Flag, or even earning an assist. Advanced Warfare will also be offering a \"pick 13\" system. Call of Duty veterans have used the \"pick\" system in the past, and should know what to expect. In AW, the killstreaks are customizable for each different playing style. In addition to these features, you will also be able to chose four streaks instead of three! Furthermore, each streak can be upgraded with modules that \"layer in additional functionality.\" Are you ready for some training? To see a video from Sledgehammer Games co-founder Michael Condrey himself, click [url=https://www.youtube.com/watch?v=m3lRz9x-kYU]this[/url] link!\r\n\n[b][color=white]Possible Mass-Murder Game in the Making[/color][/b]\r\nRecent videos and articles have speculated on a possible new mass-murder game being made, where players are allowed to roam the world given to them, and cause chaos and destruction. In past games, there have been horrible mass-murders like in Modern Warfare 2, No Russian. This is completely different. Your soul purpose is just to run around killing anyone and everyone. Cops and civilians, shooting up houses, and even the ability to go on a genocide spree in the mall. This is no joke either. In the possible game \"Hatred\" or \"Edge\" you play as a person who sees no purpose in life. He hates himself, he hates others, and he will kill anyone without a thought. He's a psychopath, and if you're such horrible things worry you, then it's definitely not  a game for you. Creators of the game, Destructive Creations, state a warning for those intended on getting this game: \"Just don't try this at home and don't take it too seriously, it's just a game. :)\" Recently school shootings have become more and more popular and its not a joking manner. Various tweets have been sent out in reply to the trailer for Hatred/Edge, which can be seen [url=https://www.youtube.com/watch?v=RrX7G-1xPLs]here[/url]. (Viewer discretion is advised)\r\n\n[b][color=white]Release Dates for the Week of October 18, 2014:[/color][/b]\r\n[list]\r\n[*]F1 2015 - PC, Play Station 3, Xbox 360 - October 21, 2014\r\n[*]Need For Speed Rivals: Complete Edition - PC, Play Station 3, Play Station 4, Xbox 360, Xbox One - October 21, 2014\r\n[*]The Legend of Korra - PC, Play Station 3, Play Station 4, Xbox 360, Xbox One - October 21, 2014\r\n[*]The Walking Dead: Season Two - Play Station 4, Xbox One - October 21, 2014\r\n[*]Civilization: Beyond Earth - Linux, Mac, PC - October 22, 2014\r\n[/list]\r\n\n[align=center][sp=Gaming Video of the Week][yt]https://www.youtube.com/watch?v=tf3--Cg2SGI&list=UUshoKvlZGZ20rVgazZp5vnQ[/yt][/sp]\r\n[/align][/spoiler][/align][/align]\r\n\n[color=transparent]space[/color]\r\n\n[align=center][img]http://i.imgur.com/i1QkwoE.png[/img][/align]\r\n\n[align=center][b]By [url=http://hackforums.net/member.php?action=profile&uid=649674]Eternal.[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1698590]Abide[/url][/b][/align]\r\n[align=center][spoiler=][align=left] \r\n\n[b][color=white]Android L Announced, Dubbed Lollipop[/color][/b]\r\nThe mysterious L behind the new Android OS has been named Lollipop - ending much speculation from Android fans about the name. The new operating system adds more material design and many developer additions such as thousands of new API's for app developers. Android L will be released on the new Nexus devices first - the Nexus 6 which is a phone with a 5.96\" screen, and the Nexus 9 being a tablet with a 8.9\" screen. Both will be available for preorder in late October, and the official release date is set for November 3rd.\r\n\n[b][color=white]HBO To Release HBO Go As Standalone Streaming Service[/color][/b]\r\nHBO has announced that in 2015 it will release a standalone version of HBO Go. As of right now, you have to subscribe through your cable company to get HBO go, but soon, the previously deterrent contracts will be removed. The decision was made by HBO, after analyzing data showing people opting out of  cable TV subscription to instead use streaming services, at a staggering rate. They wish to reach out to those who no longer have cable, as well as those who never had HBO in the first place, by competing with Netflix, Amazon Prime Movies and others. It will still be a subscription based service, but will be much more affordable than cable TV - a welcome change for consumers.\r\n\n[b][color=white]Apple Announces 5K Display On 2014 iMac[/color][/b]\r\nApple announced in October that they have made 5K displays for their new iMac, which is quite amazing considering the praise surrounding current 4K displays. Though other 5K displays have been around since September - released by companies such as Dell and Ultrasharp - the base price for the monitors will be around the same as the entire iMac, making it a much more cost effective purchase. The new iMac has a 5120 x 2880 resolution and will be powered by an AMD Radeon R9 M290X, which makes this a perfect gaming computer and the perfect computer for those who work with graphics in general. The new iMac will be available in December.\r\n[/align][/spoiler][/align]\r\n\n[color=transparent]space[/color]",
      "subject": "***"
    },
    {
      "pid": "42961325",
      "uid": "515249",
      "dateline": "1413956216",
      "message": "[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/7LtTESs.png[/img][/align]\n\n[align=center]Every week - assuming we get enough submissions - the HF News will feature the best submitted battlestation.\nSend Sir a message by clicking [url=http://hackforums.net/private.php?action=send&uid=515249&subject=HFN%20Battlestations&message=Here%20is%20my%20submission%20for%20the%20HF%20News%27%20Battlestations%20section:]here[/url] with an imgur link or youtube video of your battlestation![/align]\n\n[align=center][b][url=http://hackforums.net/member.php?action=profile&uid=515249]USER[/url]'s Battlestation[/b][/align]\n[align=center][spoiler=]There were no Battlestations submitted this week![/spoiler][/align]\n\n[color=transparent]space[/color]\n\n[align=center][IMG]http://i.imgur.com/tT0G4mm.png[/IMG]\n[url=http://hackforums.net/member.php?action=profile&uid=1775114&subject=gallerysubmission][img]http://puu.sh/clH6y/1da90b4b0d.png[/img][/url]\n[align=center][size=x-small][url=http://hackforums.net/private.php?action=send&uid=1775114&subject=artgallerysubmission]^ click here or the gallery to send in artwork ^[/url][/size][/align][/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/XdF7VYi.png[/img][/align]\n\n[align=center][size=large][color=white](1)[/color][/size][spoiler=][img]http://jimbenton.com/page14/files/JimBentonComic-StupidShit.jpg[/img][/spoiler][/align]\n\n[align=center][size=large][color=white](2)[/color][/size][spoiler=][img]http://nedroid.com/comics/2014-08-28-beartato-newphone.png[/img][/spoiler][/align]\n\n[align=center][size=large][color=white](3)[/color][/size][spoiler=][img]http://41.media.tumblr.com/7c715b7abcc0aecac54b6ce5e6b04739/tumblr_mm5595sZUf1qchpilo1_500.jpg[/img][/spoiler][/align]\n\n[align=center][size=large][color=white](4)[/color][/size][spoiler=][img]http://40.media.tumblr.com/aff3a0a4d04f16b3989a1e5b556c6149/tumblr_ml2d1evWyJ1qchpilo1_500.jpg[/img][/spoiler][/align]\n\n[align=center][size=large][color=white](5)[/color][/size][spoiler=][img]http://forlackofabettercomic.com/img/comic/13.png[/img][/spoiler][/align]\n\n[align=center][size=large][color=white](6)[/color][/size][spoiler=][img]http://www.loadingartist.com/wp-content/uploads/2012/10/2012-10-25-my-first-convention.png[/img][/spoiler][/align]\n\n[color=transparent]space[/color]\n\n[align=center][img]http://i.imgur.com/QRw4mT0.png[/img][/align]\n\n[list][*][color=white][b][u]Editors[/u][/b][/color]\n[list][*]1st Editor\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1108450]Baghead[/url][/list][/list]\n[list][*]2nd Editor\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=96230]Panik[/url][/list][/list]\n[list][*]3rd Editor\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url][/list][/list]\n[list][*]4th Editor\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1453009]Raptor.[/url][/list][/list]\n[list][*]5th Editor\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=2015410]ӍeshCollider[/url][/list][/list][/list]\n\n[list][*][color=white][b][u]Compilers[/u][/b][/color]\n[list][*]1st Compiler\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=44755]Snorlax'[/url][/list][/list]\n[list][*]2nd Compiler\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=2181647]Turtle[/url][/list][/list]\n[list][*]3rd Compiler\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1422600]Fox™[/url][/list][/list]\n[list][*]4th Compiler\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1161771]#Beau[/url][/list][/list][/list]\n\n[list][*][color=white][b][u]Journalists: Post One / Two[/u][/b][/color]\n[list][*]Headlines\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=969003]Troye[/url] & [url=http://hackforums.net/member.php?action=profile&uid=777]Cooligan[/url][/list][/list]\n[list][*]Podcast\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1108450]Baghead[/url][/list][/list]\n[list][*]User News\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1320406]Froggy[/url][/list][/list]\n[list][*]Site News\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692605]Nivarka[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url][/list][/list]\n[list][*]Group News\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url] & [url=http://hackforums.net/member.php?action=profile&uid=992067]Nobility[/url][/list][/list]\n[list][*]Omnicoin News\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1088934]Crypto™[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1439038]Doctor Blue[/url][/list][/list]\n[list][*]Notable Threads\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1446355]Trust[/url][/list][/list]\n[list][*]Interviews\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url], [url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url], [url=http://hackforums.net/member.php?action=profile&uid=797403]630[/url], & [url=http://hackforums.net/member.php?action=profile&uid=1958081]Justin Timberlake[/url][/list][/list][/list]\n\n[list][*][color=white][b][u]Journalists: Post Four[/u][/b][/color]\n[list][*]Sir's Second\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list][/list]\n[list][*]HFN Support\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list][/list]\n[list][*]News Letters\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list][/list]\n[list][*]Top Comments\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list][/list]\n[list][*]Battlestations\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list][/list]\n[list][*]Art Gallery\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1775114]Renium[/url][/list][/list]\n[list][*]Comics\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1138866]Rivalry[/url][/list][/list]\n[list][*]Credits\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list][/list][/list]\n\n[list][*][color=white][b][u]Members[/u][/b][/color]\n[list][*]Graphical Artist(s)\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1775114]Districts[/url], [url=http://hackforums.net/member.php?action=profile&uid=1290620]Designer[/url], & [url=http://hackforums.net/member.php?action=profile&uid=1138866]Rivalry[/url][/list][/list]\n[list][*]Reserve Writer(s)\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=789677]Grin[/url][/list][/list]\n[list][*]Task Manager\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url][/list][/list]\n[list][*]Overseer\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url][/list][/list][/list]\n\n[color=transparent]space[/color]",
      "subject": "HF News - 210"
    }
  ]
}