{
  "posts": [
    {
      "pid": "7822102",
      "uid": "136025",
      "dateline": "1290317245",
      "message": "[align=center][img]http://min.us/icFot8.png[/img][/align]\r\n[align=left]\r\nIt has been an interesting week for everybody on Hack Forums. Omniscient has notified people about a \"New DB Server\" which will stop all the bugs and glitches as-well as complaints that people have been repeatedly reporting. Hopefully he can choose just the right DB Server, so that HF will be as good as always. [url=http://hackforums.net/showthread.php?tid=824662]Click here to read further.[/url]\r\n\r\n\r\n[b]SUPER STRICT ROBOT STAFF WEEK![/b] It has come to the attention of the community that there have been many user's who have been \"Warn Fucked\" because everyone was demanding proper justice in the warning system. In the actions of staff's doings, a lot of people requested they stop and go back to the old system as almost everybody were receiving infractions for the simplest things such as \"Bad Grammar\".\r\n[/align]\r\n\r\n\r\n\r\n[align=center][img]http://min.us/icAP7c.png[/img][/align]\r\n\r\nSadly, Omniscient has decided to ban quite a few members this week. Checkster has been \"RepFucked\", and permanently banned by Omniscient as he is no longer welcomed to HackForums. Another known member Mia has been caught \"Ban Evading\" by our very special agent Saged. Mia has received a permanent ban.\r\n\r\n\r\nOn the other hand, we would like to welcome back a few people.\r\nVerdande's two friends, Sold and EctoPlasm has put so much effort into Personal Messaging Omniscient with details into Verdandes ban that he has now been unbanned and has recovered from a permanent ban!\r\n\r\nSolidify has now recovered from his 1 week ban, and so we wish him the best on his stay on HackForums. \r\n\r\nNofear1999 has also came back from a permanent ban so we wish him the best of luck and hope he enjoys his stay!\r\n\r\nOn the positive side, there have been quite a lot of new \"High Quality\" tutorials both In the lounge and in the Rules, Announcements, News and Feedback Section. \r\n\r\nI would like to reward them by putting their names on the HF News so they can be recognized for the following tutorials:\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=234024]Deities[/url] has made a tutorial on [url=http://hackforums.net/showthread.php?tid=811458]How to properly report a post.[/url]\r\n\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=154374]Catch-22™[/url] has made a wonderful tutorial about [url=http://hackforums.net/showthread.php?tid=814717]Teamviewer, and how to secure it![/url]\r\n[/list]\r\n\r\n\r\n\r\nThe past few days people have been complaining about a lot of bugs and glitches that have been occurring on HackForums.[url=http://hackforums.net/member.php?action=profile&uid=136025]The Elite[/url] has taken the time to compile a thread on \"Database Anomalies\". To read more, view [url=http://hackforums.net/showthread.php?tid=815006]THIS[/url] thread. \r\n\r\nThe Administrator of HackForums [url=http://hackforums.net/member.php?action=profile&uid=2103]Crow[/url] has decided to go hunting for a Pig, so he can accomplish his \"Goals for life\" by eating all the edible parts of a Pig. Pictures to come soon.\r\n\r\n[align=center][img]http://min.us/ieZ6M.png[/img][/align]\r\n\r\nƝymph has created a thread with pictures of snow around his house and so for all you fellow HF members who do not get snow but would like to see it, [url=http://hackforums.net/showthread.php?tid=834100]VIEW THIS THREAD.[/url]\r\n\r\nMega™ posted a very nice thread on \"Tell us a secret you know because of your work that others might not know.\" I have learned a lot of new things that happen in workplaces that I was not aware of. If you are interested in checking the thread out [url=http://hackforums.net/showthread.php?tid=828405] CLICK HERE.[/url]\r\n\r\n[align=center][img]http://min.us/icBmY2.png[/img][/align]\r\n\r\nI only had the time to get one interview from someone, and since many users ask questions and mention this user. I requested Solidify to take part in this interview.\r\n\r\n\r\n\r\n\r\n[color=#FF1493]EctoPlasm:[/color] Hello Solidify! Lets start off by asking how did you feel when you got banned from TRRS?\r\n[color=#98FB98]Solidify:[/color] I felt it was rather arbitrary considering I had clearly mentioned my intentions for having created that [url=http://hackforums.net/showthread.php?tid=804347]thread[/url]; \r\n\r\n[quote=Solidify]I'm not asking for anything to be done nor am I trying to make a point. I'm simply asking a question. [/quote]\r\n\r\nAdditionally, I found the manner in which TRRS flamed me to be rather childish, to say the least. Staff are instructed to resolve issues in accordance with our rules. Regardless of my inquisition on that thread, would it have been so difficult to settle the issue in a civilized fashion? What gave him the authority to be exempt from our warning system without further punishment after he [url=http://hackforums.net/showthread.php?tid=804347&page=5]flamed[/url] me?\r\n\r\n[color=#FF1493]EctoPlasm: [/color]When did you first visit HackForums, and what motivated you to register?\r\n[color=#98FB98]Solidify:[/color] I first visited HackForums at the time of my registration, as indicated above. At the time, I was fairly overwhelmed by the concept of 'host booting' and 'hitting kids offline', and shamefully, joined with intentions to learn more about doing so. Both members that introduced me to this forum were XBL buddies. They're names are [url=http://hackforums.net/member.php?action=profile&uid=49178]-Solace[/url] and [url=http://hackforums.net/member.php?action=profile&uid=67544]FoOk iTz LeGaCy[/url]. \r\n\r\n[color=#FF1493]EctoPlasm:[/color] How did you feel when you were contacted by Omniscient to become a Lounge mod.\r\n[color=#98FB98]Solidify:[/color] I wasn't contacted, I was promoted without consent, which led me to assume that I could not be held liable for any resulting issues related to moderating The Lounge, considering the following expert from our rules;\r\n\r\n[quote=Rules]Then an invite is sent to the member asking if they would like to be on the staff. [/quote]\r\n\r\nWhile the previous extract was intended to be used for staff promotions, I'm sure the same concept of dignity can be applied to moderators and their promotions.\r\n\r\nI have much to say about my promotion but sadly, none of which Omniscient would like to hear me rant about. I've truly learned how rules and regulations are followed on this forum and sadly, they're not to my standards. But who am I to say what's right on Omniscient's forum? And for that reason, I'll leave this response as is. I've learned my lesson the hard way; with a cold-hearted ban.\r\n\r\n[color=#FF1493]Ectoplasm:[/color] If omniscient were to give you Lounge Mod back again, would you take the job? Also, what if the same situation happened again as last time?\r\n[color=#98FB98]Solidify:[/color] The only way I'd accept to be re-instated would be if Omniscient made a public appeal addressing his forum that this promotion would be within his terms and for The Lounge's well-being, not as a means of penalizing me. \r\n\r\nRegardless, Omniscient clearly mentioned that my chances of being upgraded to staff or a moderator of [i]any[/i] section, for that matter, are slim to none.\r\n\r\n[color=#FF1493]EctoPlasm:[/color]Who are some of your favorite members on the site?\r\n[color=#98FB98]Solidify:[/color] At first glance, The Elite and I were mere enemies, but as I grew to know him a little better, we developed a common ground. Now, he has had and I will have his back as long as he needs me to.\r\n\r\nAnother favorite, although I don't speak to him very much, is Paradoxum. I envy all of his accomplishments among this forum, both as a exceptional role model for so many crew enthusiasts and as a high quality leader.\r\n\r\nLastly, this someone has always been nice to me, even when I was a [i]wee-little-hacker[/i]. Skill, in my opinion, is the staff member that gets the most intimate with his mentees. He doesn't look down upon us, he speaks to us and not at us, unlike most staff, sadly. And for that reason, I admire him. He didn't forget about the driving force behind this forum when he was promoted and that, is a tough thing for most people to do.\r\n\r\n[color=#FF1493]EctoPlasm:[/color]Who was your first ever inspiration and or friend on Hack Forums?\r\n[color=#98FB98]Solidify:[/color] To make a long story short, Paradoxum. Very likely for the same reasons indicated above. He makes this place feel like more than an internet\r\nforum. He gives the allure of a school, when anyone can learn, beyond their expectations, free of charge. When I realized how many individuals are unprivileged to be schooled, I understood why this is so important to them.\r\n\r\n[color=#FF1493]EctoPlasm:[/color] Thank you very much for taking this interview. To finish this interview, is there anything you would like to say to the HackForum's community? \r\n[color=#98FB98]Solidify:[/color] If not a very good public speaker but if there's anything I'd like my fellow members to know is that [i]the expert in anything was once a beginner[/i], just as mentioned in my signature. Having said that, if you set yourself goals and are thereon quickly disappointment by the outcome of your efforts, keep at it until you've achieved something that satisfies you.\r\n\r\nHope everyone enjoyed this week's news!",
      "subject": "[11/15/2010] - HF News"
    }
  ]
}