{
  "posts": [
    {
      "pid": "19387323",
      "uid": "515249",
      "dateline": "1327554655",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]77th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[b]New group[/b]\nThe new usergroup, Propitious is finally here. The final payment was made on the 25th by both of the leaders, iNviZ and TheHackersLove. At this time it is unknown when the recruitment will be open for the new group, however it was stated in their FAQ thread that the recruitment will be shortly after the opening of the group. To view the Propitious FAQ thread follow this link: [url=http://goo.gl/1NBQq]goo.gl/1NBQq[/url]\n\n[b]Censored word[/b]\nYet another word, mega-upload (without the hyphen), was censored. The reason behind this is most likely due to the fact that the file sharing website was shut down and the owner was arrested and could be facing an extensive time of 20 years in jail. Like HackForums, many other websites have been making changes after the removal of mega-upload, such as [url=filesonic.com]filesonic[/url].\n\n[b]Bug fixes[/b]\nThere have been a few major and minor bug fixes on HF in the past week. Omniscient has been working hard and managed to fix the PM exporting bug, which he later found to be a problem in many other MyBB forums. In the same day he tweeted that he had McAfee change the red rating into a yellow in hopes of clearing up some problems that a few members were having.\n\n[b]Delayed upgrades[/b]\nIt is time of year when it seems half of the world has become ill and unfortunately Omniscient has fallen into that category. After being sick for 7 days and counting he is still making time to occasionally come online and deal with whatever is needed. However with the limited time between being sick and dealing with the world around him he may not find the time to come online, so all members who have recently purchased an upgrade are advised to be patient as he is doing his best to make time for HackForums.\n\n[b]New hacking section[/b]\nAs tweeted by Omniscient \"Pentesting and Forensics forum being added under Hacking tab. Discussions on server vulnerabilities and security research go there.\", there is a new section under the hacking tab of HF. This section seems to be directed towards the improvement and research of server security, however the section isn't currently open to new threads so for now we will have to wait until further progress is made. To view the new forum click this link: [url=http://goo.gl/jQHGd]goo.gl/jQHGd[/url]\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=661940][b][color=white]bugga[/color][/url][/b] - reached the great milestone of 1000 reputation!\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=#0066FF]Diabolic[/color][/url][/b] - was repfucked for the 3rd time for a reputation violation.\n[url=http://hackforums.net/member.php?action=profile&uid=274613][b][color=black]Яǝʌǝɹsǝ[/color][/url][/b] - was banned for not posting in the Marketplace.\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b][color=black]xerotic[/color][/url][/b] - mentor of HF was banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=127956][b][color=black]Plutonium[/color][/url][/b] - was banned for breaking the rule then continued to make a new account to ban evade.\n[url=http://hackforums.net/member.php?action=profile&uid=943830][b][color=black]Being Human™[/color][/url][/b] - was banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=707090][b][color=black]WARZONE[/color][/url][/b] - was banned by Judge Dredd for the reason \"Hello darkness, my old friend. I've come to talk with you again.\"\n[url=http://hackforums.net/member.php?action=profile&uid=1270566][b][color=black]X EnCrYpTeD X[/color][/url][/b] - an Ub3r member who was banned for not posting in the Marketplace.\n[url=http://hackforums.net/member.php?action=profile&uid=807886][b][color=black]Anthrax[/color][/url][/b] - received a ban for vacation earlier this week.\n[url=http://hackforums.net/member.php?action=profile&uid=731778][b][color=black]Lemonde[/color][/url][/b] - the HJT member was banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=388560][b][color=black]Øueen[/color][/url][/b] - was banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=524451][b][color=black]Yellows[/color][/url][/b] - received a ban for needlessly grave digging.\n[url=http://hackforums.net/member.php?action=profile&uid=371170][b][color=black]OVO™[/color][/url][/b] - our music news writer was banned by Omniscient for the reason \"Being Reviewed\".\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Ub3r Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2016220]|| UB3R Giveaway Program || | Join Us[/url] - [url=http://hackforums.net/member.php?action=profile&uid=309536][color=#0066FF][b]Verilog[/b][/color][/url] - This is a giant project started by Verilog, if you are wanting Ub3r or to help someone out, check out this thread.\n\n[i][b]Youtube Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2102747][Guide] Youtube gaming partnerships[/url] - [url=http://hackforums.net/member.php?action=profile&uid=91473][color=white][b]Coffee[/b][/color][/url] - If you're interested in getting a partnership with youtube, you should read this guide, it will give you an edge.\n\n[i][b]Middleman Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2051226]Red Lions Official Middle Men Team[/url] - [url=http://hackforums.net/member.php?action=profile&uid=613009][color=white][b]Morchid[/b][/color][/url] - Now I'm not saying you can trust these guys 100% but if you need a middle man and you don't know who to ask, this could be the right place for you.\n\n[i][b]FAQ Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1978946]Hackforums FAQs Answered(A must see for newbies)[/url] - [url=http://hackforums.net/member.php?action=profile&uid=678298][color=#0066FF][b]Kamz89[/b][/color][/url] - For anyone who is new to Hack Forums and its terms, they should read this thread to understand more about the way things are run.\n \n[i][b]Cheat Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2144245]How To Cheat On Scantron ~ I Tested It Today[/url] - [url=http://hackforums.net/member.php?action=profile&uid=811057][color=#0066FF][b]Wheelz[/b][/color][/url] - Taking a test soon that you're not so sure about? Maybe it's a final or maybe it's just a quiz, but this can give you an edge up.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Irise[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Irise! Thanks for taking the time out for this interview! Before we begin, would you like to give a shoutout to any special members?\n[b][color=#1466ff]Irise[/color][/b]: Well, I'd like to give a shoutout to my friend Hakuna Matata, great friend, especially on Minecraft. \n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fantastic! I personally can't play Minecraft alone, so I always have a friend with me! So Irise, What lead you to Hack Forums and why did you stay?\n[b][color=#1466ff]Irise[/color][/b]: Well, I was originally lead to from another forum, FuckJagex, to gather some tools usable for hijacking accounts and the such. I didn't find what I was looking for, but I did find a community that was great to be in.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Ah, started with Runescape, I see! A great community you certainly did find! Why is your name \"Irise?\"\n[b][color=#1466ff]Irise[/color][/b]: When I made my account, I intended to take the username \"Iris\" but it was taken, so I simply added an e to the end and I guess it just stuck.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: It's a great name in my opinion, since people can interpret it however they want. If you could change one thing in the world, what would it be, and why?\n[b][color=#1466ff]Irise[/color][/b]: This might sound stupid to others, but I don't want a goverment ruling over people. I want a land where everyone can do what they please, because it's their life.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: After all the nonsense recarding NDAA, SOPA, PIPA, and ACTA (So many acronyms!) I can understand why! What do you do outside of HF?\n[b][color=#1466ff]Irise[/color][/b]: Well, if I'm not on HF, I'd be gaming, and when I'm gaming I'm mostly on my Xbox or PC.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I would love to play with you sometime. I mainly play CSS and the COD series. If you could have any one thing, what would it be?\n[b][color=#1466ff]Irise[/color][/b]: I would want the power of ubiquity, to be anywhere and everywhere.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Interesting, a little like Omniscient, I suppose. What's your favorite section on Hack Forums?\n[b][color=#1466ff]Irise[/color][/b]: Well, I'm torn between several other forums, such as the lounge, the gaming section, or even the OSX section. I also can't forget the free items and giveaways section. Really, I can't decide\n\n[b][color=#1466ff]Michael Westen[/color][/b]: We certainly have a large choice on Hack Forums so I understand your inability to pick just one. That wraps it up on my side! Do you have any closing words?\n[b][color=#1466ff]Irise[/color][/b]: Well, it was an honor to be interviewed, thanks for taking the time to do so.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Legacy.[/font][/size][/color][spoiler=]\n[b][color=white]Respect.[/color][/b]: Hey, Legacy.! How are you today? I'm glad you could take the time to have this interview with me!\n[b][color=#1466FF]Legacy.[/color][/b]: Hey! I'm excellent. It's not a problem man, I'm glad to be doing it!\n\n[b][color=white]Respect.[/color][/b]: Well, before we begin is there anyone you'd like to give a shout out to?\n[b][color=#1466FF]Legacy.[/color][/b]: Of course. Let's see. There's Enterprise, OnTheFly, Pyrostat, Diabolic, Reminiscent, Creatxre, Ignite, and anybody else I talk to on a daily basis. I'm sure I forgot some.\n\n[b][color=white]Respect.[/color][/b]: Yeah, a lot of people tend to not get everyone. I don't think I could either. How did you find or come across Hack Forums?\n[b][color=#1466FF]Legacy.[/color][/b]: That's a tough one. I think my friend Enterprise just told me about it one day and I've loved it ever since.\n\n[b][color=white]Respect.[/color][/b]: Oh, I see. Enterprise is a great member, I actually did an interview with him a few editions back. So, how's Reverence? You're known across Hack Forums for mainly being the Reverence Gaming Mentor correct?\n[b][color=#1466FF]Legacy.[/color][/b]: Yeah, that was a great interview. I read it. Reverence is awesome, I encourage anybody who wants to write awesome tutorials to join Reverence. It's fun being the gaming mentor, I don't know if I'm that \"known\" for it though.\n\n[b][color=white]Respect.[/color][/b]: Yeah, Reverence is a great group. I see a lot of high quality tutorials and passages from them. What is it like being a 'Gaming Mentor'?\n[b][color=#1466FF]Legacy.[/color][/b]: I come up with what the tutorial will be about and assign each of my members to do a different task.\n\n[b][color=white]Respect.[/color][/b]: Oh, that sounds cool. Do you enjoy doing it? Also, how did you get your name, 'Legacy'.\n[b][color=#1466FF]Legacy.[/color][/b]: Yeah, I enjoy it a lot. After the reformation, the group has changed a lot. There are still quite a few people that dislike Reverence though, I'm trying to change that. My username however, I have no idea. I guess I just like the word.\n\n[b][color=white]Respect.[/color][/b]: I can relate to that. I always change my username, whenever a cool word pops in my head. Influence, Respect, Innocence, etc. Anyways, what do you see yourself doing in a few years relation to HF?\n[b][color=#1466FF]Legacy.[/color][/b]: I'd really like to join HJT, writ3rs, and reviewers. They're all my dream groups. I'd also like to start selling something, like an eBook or booter.\n\n[b][color=white]Respect.[/color][/b]: Very cool. Do you see yourself with a job in relation to any knowledge you've gained at Hack Forums? For example; a programmar, etc.\n[b][color=#1466FF]Legacy.[/color][/b]: I'd love to have a job in programming, that would be excellent. I'm still in the basics though, I can't do anything major.\n\n[b][color=white]Respect.[/color][/b]: That's cool. Everyone started out at the basics. If you could add, remove, or change one thing about Hack Forums... What would it be?\n[b][color=#1466FF]Legacy.[/color][/b]: Honestly, a moderator to the Minecraft section. I never even look at it any more, it disgusts me, you'll see like 7 Minecraft account giveaways on the front page, they're all in the wrong section.\n\n[b][color=white]Respect.[/color][/b]: Oh, I feel you there. I used to be in the Minecraft section daily. Helping people out, making servers, etc. I barely even go on Minecraft anymore though anyways. What do you think of SOPA and PIPA? \n[b][color=#1466FF]Legacy.[/color][/b]: Eh, they'll never pass in my opinion.\n\n[b][color=white]Respect.[/color][/b]: I completely agree with you. I just think something is wrong with Congress and generally the Judicial branch of our government. Why even bring up that kind of a bill anymore? It would also execute many of our rights as americans and also be unconstitutional. Well, I think that just about wraps up everything I wanted to talk about. Anything you'd like to discuss with me? If not, feel free to say a few last words to wrap up this interview! \n[b][color=#1466FF]Legacy.[/color][/b]: Not that I can think of. Thanks for having me, it was a pleasure.\n[/spoiler]\n",
      "subject": "[1/25/12] - HF News"
    },
    {
      "pid": "19387348",
      "uid": "515249",
      "dateline": "1327554723",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\r\n[color=white][b]Facebook[/b][/color]\r\n[i]Facebook's recent Timeline feature has recently been forced on all users.  While previously having the option to use either the old profile page, or the new timeline; Facebook's 800 million active users  are now exposed to their past years bringing back old regrets.  [/i]\r\n\n[color=white][b]Solar Storm[/b][/color]\r\n[i]NASA reports that a major solar storm is heading towards earth which will result in minor interference with satellites but no major damage over all.  This will also result in an interesting aura of natural lights in the sky in many regions.  [/i]\r\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\r\n[color=white][b]GeoHotz - Facebook[/b][/color]\r\nHacker GeoHotz has quit working for Facebook. This guy is responsible for jailbreaking the PS3 and bringing the first ever unlock for the iPhone. His exploits for iOS have helped many people jailbreak their iOS devices with his limera1n untethered exploit. Now that he has quit working for Facebook, does it mean he will become a full time hacker?\r\n\n[color=white][b]iJailbreak Progress[/b][/color]\r\nThe Chronic Dev Team and iPhone Dev Team with the help of @pod2g and @planetbeing have released an iPhone 4S and iPad 2 untethered on iOS 5 for Windows, Mac, and Linux. The team has also warned people that they should stay on 5.0 to still have chances of an unlock for the 4S. Make sure to save your Blobs and backup everything.\r\n\n[color=white][b]iFuture[/b][/color]\r\nIPhone 5? Yes the company that manufactures iDevices FOXCONN has announced that the next iPhone is ready for production. This could mean a release in summer or maybe the November following the trend of releases. Also the iPad 3 could be released in early or late march possibly. \r\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\r\n[color=white][b]Rihanna[/b][/color]\r\nSinger Rihanna recently aquired a tattoo of \"Thug Life\" on her knuckles, and is setting a bad example for her fans. Many people are telling her to remove it, but she refuses.\r\n\n[color=white][b]Interesting New Hip Hop Artist[/b][/color]\r\nThis new hip hop music video starts off as a movie for about 6 minutes. \r\n[url=http://www.worldstarhiphop.com/videos/video.php?v=wshhSf8TfzL2r6mr86q6]What are your thoughts on this?[/url]\r\n\n[color=white][b]Drake says he wants to \"beat up Common\"[/b][/color]\r\nRappers Drake and Common have had a 'beef' for a few weeks now. A local radio station in Atlanta acquired information from Rapper \"French Montana\" that Drake wants to 'Fuck Up Common'. This is against what OVOXO is all about.\r\n\n[color=white][b]Ne-Yo leaves Def Jam to become Motown Executive[/b][/color]\r\n'I'm honored that I've been given such a prestigious title,' Ne-Yo says.\r\n\n[color=white][b]Music Videos of the Week[/b][/color]\r\n[spoiler=]\r\n[video=youtube]http://www.youtube.com/watch?v=icyV50OIfvQ[/video]\r\n[video=youtube]http://www.youtube.com/watch?v=svcu08Ea4U0[/video][/spoiler]\r\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\r\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\r\n---\r\nWe're all trying to live up to expectations and finish what needs to get done, but it seems like the time for relaxation and reflection has passed. A long ways back on the timeline, reflection and spiritual enlightenment were key parts of any society, now, they're a joke. People laugh or make fun of the few groups of people that still cling to the old ways, but why? I can't tell you the answer to this, but I can say that it's important we delve in to ourselves and understand who we are. Even now, if you are actually reading this, you may scoff at that idea. That's exactly what I am talking about, just try it, we're all too caught up with the roller-coaster that is life, we need to go back to our roots and slow down.",
      "subject": "*"
    },
    {
      "pid": "19387366",
      "uid": "515249",
      "dateline": "1327554783",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about PIPA and SOPA?\"\n\n[i]\"The idea behind of the said bills is to stop online piracy by changing the phrase \n\"innocent until proven guilty\" to \"thought of being guilty until proven innocent\". Just \nas that we could face criminal charges IF they only suspect us infringing thei\n\ncopyrighted work. This is so wrong on so many levels if you actually think about it.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=11985][i]-Synthius[/i][/url]\n\n[align=right][i]\"As a society we have gotten used to our own government bending us\nover and fucking us up the arse... inflation in fuel prices... economy fails... oh well there\nis we can do about it so what do we do? we just accept it... does our government really\nthink they will get away with this one though? Nah i don't think so massive companies are\nalready taking a stand and the law hasn't even passed yet... the protests about this SOPA \nand PIPA bullshit are gonna be 100 times bigger than occupy wall street... the funny thing is\npiracy of movies and music is pretty much free advertising... some people just can't be fucked \ndownloading... the option is there and its free... plus if people like the movie they have pirated \nchances are they will probably go out and buy it... oh but thats right... the media companies \nare all owned by Jews and i think we all know that the Jews that run the country are all just \nmoney hungry greedy fucking thieves... they miss out on the tiniest bit of money so they go and \nmake up this bullshit law? now what i don't understand is that there are other problems in the \nworld much bigger than this fucking online piracy... every american citizen has the right to own a \ngun... THATS FUCKED... guns can be used to kill people thats much worse than using the internet \nto ileagaly download movies... 80 percent of parliament are jewish... with changed last names... \namerica owes the world reserve bank over 4 quadrillion dollars... the world reserve bank is own by.... \nyou guessed it... HAHAH jews -_- What this world needs is another Adolf Hitler. If you are offended \nby any of this... than you truly are an idiot and i really don't give a fuck so go bitch about it \nelsewhere I'm not interested in hearing about it... truth hurts get over it...\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=150496][i]-Derwin[/i][/url][/align]\n\n[i]\"The whole idea of PIPA and SOPA is insanely stupid. I don't think they have any idea just how \nmany people this will affect. Pirating isn't stealing, if we stole from them, they wouldn't have it any \nmore, we're merely copying it. The extent of this bill is even more ridiculous, preventing Lets plays, \ncommentaries, walkthroughs etc, this is ridiculous, so much infact that even bigger websites such \nas wikipedia and reddit simple refuse to let this pass. If you haven't already, please sign the petition.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=994516][i]-Graveee[/i][/url]\n\nThe topic for next week is \"Which sections are you most active it? Why?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/ESQnK.jpg[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/oax9b.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/qTCea.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=ELgPQEjzwCs[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url] is no longer leader of the RATs Crew or Eminence.\n[url=http://hackforums.net/member.php?action=profile&uid=588781]Hуѕтєяιa X™[/url] is no longer leader of the Red Lions.\n[url=http://hackforums.net/member.php?action=profile&uid=613009]Morchid[/url] was promoted to leader of the Red Lions.\n[url=http://hackforums.net/member.php?action=profile&uid=734805]Glassy[/url] was promoted to leader of the Red Lions.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/YQXAV]OVO™[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Innocence.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}