{
  "posts": [
    {
      "pid": "12519712",
      "uid": "295848",
      "dateline": "1307591524",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNMain.png[/IMG][/align]\n\n[color=#98FB98][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\n\nThe edition you are currently reading is the [b]45th full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNHeadlines.png[/IMG][/align]\n\n[align=justify]Another interesting week here in Hack Forums land, so let's get you filled in!\n\nThis week we saw the return of Good Will Monday, which was a tradition started last year on the first Monday of June. On this special occasion [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] asks that you forget your hateful comments and try to hand out 5 positive reputations. He stated, \"I'm hoping to do this every year and really hoping this brings up the mood around here.\" Check out the announcement thread [url=http://hackforums.net/showthread.php?tid=1354903]here[/url].\n\nLike awards? Then you'll love this -- [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has recently posted a new Awards Story thread in The Lounge. Make up your own creative stories using award icons to fill in for words and you can end up with a nice little surprise right under your warning level ... *hint hint* You can check out the thread and let your imagination flow [url=http://hackforums.net/showthread.php?tid=1356705]here[/url].  \n\nReading rant threads in The Lounge lately? [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has addressed the growing issue of rant and flame threads directed toward him in attempts of a \"Final Blaze of Glory\". He asks that you take it to PMs if you have an issue otherwise any posters of these threads will have their accounts come to a swift end. Read the whole thread [url=http://hackforums.net/showthread.php?tid=1356147]here[/url].\n\nStickies have been a popular topic for many aspiring members and now [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally laid down the official say in the matter. All stickies have been removed to make room for more updated ones. In addition, it is clearly stated now that all stickies will be chosen by Omniscient and he alone. There is also a sticky award now. To find out more click [url=http://hackforums.net/showthread.php?tid=1358781]here[/url].\n\nHack Forums's server has been moved! This should fix some latency problems as well as site slowdowns. To read the full report click [url=http://hackforums.net/showthread.php?tid=1346927]here[/url].\n\nGamers rejoice, we've gotten another sub section! The new Maplestory section where you can address all your Maplestory needs. Check out the new forum [url=http://hackforums.net/forumdisplay.php?fid=197]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] has chosen his new avatar! To check out his cool new avatar or look at all the cool entries click [url=http://hackforums.net/showthread.php?tid=1343739]here[/url].\n\nIn other news, a new brand new award has been added to HF. The [url=http://hackforums.net/myawards.php?awid=62]Qwazz Star[/url], an award that only [url=http://hackforums.net/member.php?action=profile&uid=295848][color=#AAAAFF][b]Qwazz[/b][/color][/url] can give out. There is also a limit of 10 of these awards so start kissing ass! Just kidding, but seriously Qwazz give me one of those now. Oh right, and you can check his thread [url=http://hackforums.net/showthread.php?tid=1346143]here[/url].\n\nThe creator of the Red Lion's logo, signature, and avatar you see all over the forums has finally shown himself. [url=http://hackforums.net/member.php?action=profile&uid=204984][color=white][b]Buzz Lightyear[/b][/color][/url] has been waiting for a long awaited thank you, and would like to let the HF community know who made it. We thank him for his work. If you would like any high quality graphics for low costs, just send a message his way.\n\nTh RAT's crew is now doing a weekly \"Tips 'n Tricks\" series in topics for RAT's (Remote Administration Tools) to help out the members of Hack Forums (also noob friendly) who want to learn just about anything to do with RATs. You can read their first two threads [url=http://hackforums.net/showthread.php?tid=1326112]here[/url], and [url=http://hackforums.net/showthread.php?tid=1349629]here[/url].[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNUsernews.png[/IMG][/align]\n\n[align=justify]A special thanks to [url=http://hackforums.net/member.php?action=profile&uid=277712][color=white][b]Cobalt+[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=153686][color=#0066FF][b]Fireren[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=515249][color=#0066FF][b]Sir[/b][/color][/url] for being the primary writers of this weeks edition of the HF News.\n\n[url=http://hackforums.net/member.php?action=profile&uid=175033][color=lime][b]xerotic[/b][/color][/url] has been the first and only member to receive the official Qwazz Star award at this point in time.\n\n[url=http://hackforums.net/member.php?action=profile&uid=384745][color=#0066FF][b]ScripT.[/b][/color][/url] was the first to find out (this year) that the /me command actually works! It has been discovered way back, but the credit goes to an unknown person. Be sure to try it out [url=http://hackforums.net/showthread.php?tid=1343983]here.[/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=823501][color=#0066FF][b]BurstMedia[/b][/color][/url] is somehow an Ub3r with 0 posts. Some think that the link to buy Ub3r was leaked to him.\n\n[url=http://hackforums.net/member.php?action=profile&uid=11953][color=#0066FF][b]Nyx-[/b][/color][/url] has been removed from the dead group, and is back. But is no longer moderator of the anime section.\n\n[url=http://hackforums.net/member.php?action=profile&uid=415712][color=#0066FF][b]NATASHAx[/b][/color][/url] has also been unbanned, and returned to the Ub3r status.\n\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=#0066FF][b]Vitani's Mate[/b][/color][/url] has made a record of 10k posts in less than 5 months.\n\n[url=http://hackforums.net/member.php?action=profile&uid=79121][color=#0066FF][b]Richie[/b][/color][/url] has put together a guide to living a healthy lifestyle. This guide will help anyone who is having trouble staying in shape or just wants to lose some weight. If you would like to read further click [url=http://hackforums.net/showthread.php?tid=1359156]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=621421][color=#0066FF][b]Dordelicious[/b][/color][/url] has created a thread describing Hack Forums official groups in much detail. Upon completion of this thread it was stuck in the [url=http://hackforums.net/forumdisplay.php?fid=52]Recruitment[/url] section, and he was given the Silver Medal award for his efforts.\n\n[url=http://hackforums.net/member.php?action=profile&uid=81119][color=white][b]Tsgh Mike[/b][/color][/url] has been a great and high quality member. And as a result of that, he is our newest Mentor. Congratulations!\n\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Xypher[/b][/color][/url] has surpassed $500 donated to Hack Forums. He was also awarded the award, DaBomb, which is only given to members who are \"down with Omniscient.\" After receiving his Master Donator award he requested the removal of his Youtube, Liberty Reserve, Rich Bitch, and Emerald Donator awards. Bringing him from 9 awards to 5 awards.\n\n[url=http://hackforums.net/member.php?action=profile&uid=616850][color=white][b]Atthackers[/b][/color][/url] a well known owner of such products as Attbooter and Attworm has received the Businessman award.\n\n[url=http://hackforums.net/member.php?action=profile&uid=258055][color=#0066FF][b]Industrialized™[/b][/color][/url] has received the Award Whore award, but at what expense? You can see the reasoning behind it by clicking [url=http://hackforums.net/myawards.php?awid=60]here[/url]. He seems to have gone a bit too far with this one.\n\n[url=http://hackforums.net/member.php?action=profile&uid=300616][color=#0066FF][b]Thoth[/b][/color][/url], a well known troll in The Lounge has been repfucked.\n\n[url=http://hackforums.net/member.php?action=profile&uid=588781][color=white][b]Hуѕтєяιa X™[/b][/color][/url] a co-leader of the Black Knights was 'compromised' this week. During that time the person on his account removed every member from the group.\n\n[url=http://hackforums.net/member.php?action=profile&uid=761955][color=black][b]Acid Spill[/b][/color][/url] claimed to have recently won a 40k jackpot while playing the lottery. After that he made a generous donation to HF, but was banned shortly after for faulty payment. There are still some questions as to what happened, but see his thread [url=http://hackforums.net/showthread.php?tid=1349295]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=96230][color=black][b]Panik[/b][/color][/url] was repfucked and perma-banned for simply expressing his opinion about HF. See his thread [url=http://hackforums.net/showthread.php?tid=1354545]here[/url].\n\n[url=http://hackforums.net/showthread.php?tid=1345735][color=grey][b]Carbon[/b][/color][/url] has been given the ultimate punishment, his account name changed, password changed, and moved to the unregistered group. This was brought on by his final complaint about Omniscient when the Qwazz Star was made. Read more about it [url=http://hackforums.net/showthread.php?tid=1345298&page=9]here[/url].[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNOther.png[/IMG][/align]\n\n[align=justify]I hate to start this section with bad news, but I have to. Since the US has made way fighting an E. coli outbreak, Germany has yet to make progress in stopping Salmonella. European scientists are rushing to find the source of the outbreak which has killed at least 20 and has infected more than 2,400. The particular strain has already caught the reputation of being “the deadliest outbreak … ever seen”.\n\nIn recent news, Nintendo unveils their newest console at this year's E3 Expo in Los Angeles. The Nintendo Wii U is scheduled to be released some time next year. This comes shortly after the group LulzSec claimed responsibility for its recent attacks on Nintendo. They are the same group that attacked Sony last week. The hackers claimed in a tweet that they \"mean no harm\" and have also stated that they in fact love Nintendo, saying they will not be pursuing any further attacks against the company. The only thing they took was a configuration file. For all those who are wondering if this is still exploitable, the vulnerability has already been patched.\n\nUnless you’re reading this HF News edition on a print out in the Wal Mart bathroom, you have an IP address. The most popular form of IP is IPv4. The problem is that IPv4 is only supping a limited amount of IPs, less than we need. As a result, the Internet Corporation for Assigned Names and Numbers (ICANN) has allocated the last of its unused blacks of IPv4 addresses. So, ICANN is going to turn on the new protocol, IPv6. IPv6 has much, much, much more IPs than IPv4 does. IPv4 has more than 4 billion addresses available and looks like 172.16.254.1. IPv6 has more than 339 undecillion addresses and looks like 2001:db8:0:1234:0:567:8:1. So, let’s celebrate that we no longer have to worry about running out of IP addresses anymore!\n\nIn less than 24 hours, iOS 5 has been jail broken. While iOS won’t be released until the end of the year, hackers have already jail broken iOS 5. Apple plans to repair the jail break hole, and hackers plan to break it again. Thankfully, the hackers are allowed to do this as jail breaking is legal and exempt from the DMCA.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNInterviews.png[/IMG][/align]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - Deities[/color][/font][/size]\nClick [url=http://soundcloud.com/boxing-hf/hf-news-interview-deities-1]here[/url] to listen.\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - Decoy[/color][/font][/size]\n[spoiler][align=justify][color=#0066FF][B]Aptitude[/b][/color]: Okay, first question: What has changed your Hack Forums experience the most? Any particular person, event, etc.?\n[color=#0066FF][B]Decoy[/b][/color]: Hmm, this is a tough one. I'd have to say becoming a part of the Reviewers has changed my experience at HF the most. From that point, I really strived to be as high of quality as I could be. It felt good to be a part of a group truly contributed to HF.\n\n[color=#0066FF][B]Aptitude[/b][/color]: I'm a new member of the Reviewers, it seems like a lot of work. Has being a high quality member on Hack Forums played a role on your life off-site?\n[color=#0066FF][B]Decoy[/b][/color]: Well, it's definitely dampened my social life. I believe it has helped me become a better writer, college seems much easier to me now. I spend a lot of time on HF, so it definitely has played a roll in my life off-site.\n\n[color=#0066FF][B]Aptitude[/b][/color]: You're in college, I didn't know you were that old. What college do you go to? What do you study? What's your career goal?\n[color=#0066FF][B]Decoy[/b][/color]: I go to a Community College in NY. My current major is Criminal Justice, although I strongly dislike it, and it's not something I plan on making a career out of. Two semesters ago I was taking Computer Science, I took a semester off, and registered late last January. Criminal Justice classes were all that was available to me. I'm 22 years old, and I have no idea what I want to do with my life.\n\n[color=#0066FF][B]Aptitude[/b][/color]: Okay, what has been your favorite thread in the past week?\n[color=#0066FF][B]Decoy[/b][/color]: I usually enjoy threads in the Deal Disputes section, although I haven't been active enough this week to point one out individually. I would have to say that Omni's Smoked Baby Back Ribs thread was my favorite. Those ribs looked so damn good! I'll be buying a smoker this week!\n\n[color=#0066FF][B]Aptitude[/b][/color]: I enjoyed that thread as well. What's been your favorite new award by Omniscient?\n[color=#0066FF][B]Decoy[/b][/color]: I haven't given much thought to the new awards, but I guess the Businessman award would have to be my favorite.\n\n[color=#0066FF][B]Aptitude[/b][/color]: Do you currently, or have you thought about selling a product or eBook recently? If so, can you describe it?\n[color=#0066FF][B]Decoy[/b][/color]: I'm always thinking about ideas for e-books, but I haven't come up with an idea worthy of the Marketplace yet. I'm currently selling laptops on HF, I just sold one the other day to a member here for $1450. Can't wait to ship it out to him!\n\n[color=#0066FF][B]Aptitude[/b][/color]: Oh, that sounds great. Do you have a job that allows you to make a lot of money? What do you plan on doing with the money?\n[color=#0066FF][B]Decoy[/b][/color]: I'm currently unemployed, but I do have means of income. I invest a lot of the money that I make, whether into the stock market, or on tangible items I can resell. I'm making very little profit on the laptop I mentioned above, if that's the money you are referring to.\n\n[color=#0066FF][B]Aptitude[/b][/color]: What would you like to see Omniscient change on Hack Forums?\n[color=#0066FF][B]Decoy[/b][/color]: I think Omniscient, and his Staff are doing a very good job running Hack Forums. The site is extremely profitable, and has a sold active memberbase. I would like to see changes within the Marketplace, it seems as if some members get away with murder because of their monetary contributions, and I don't necessarily feel that's the right way of handling things. Moreover, that's just my meaningless opinion.\n\n[color=#0066FF][B]Aptitude[/b][/color]: I agree with you. Do you think that Hack Forums Staff should moderate the Marketplace? Why or why not?\n[color=#0066FF][B]Decoy[/b][/color]: Well, they do moderate the Marketplace. They often junk threads, delete posts, infract users, and whatnot within the Marketplace. I would like to see them take action against scammers within the Deal Disputes section, but once again that's just my meaningless opinion.\n\n[color=#0066FF][B]Aptitude[/b][/color]: Omniscient opened the 'Suggestions and Ideas' section. What ideas have you liked?\n[color=#0066FF][B]Decoy[/b][/color]: I haven't really been following that section, but I have noticed some threads regarding rating threads. I'd like to see some type of limitation placed on what threads you can rate and whatnot. I see far too many users abusing that privilege. I can't think of any other suggestions at this time.\n\n[color=#0066FF][B]Aptitude[/b][/color]: What about reputation abuse? Do you think that reputation is taken too serious? What would like to see changed?\n[color=#0066FF][B]Decoy[/b][/color]: I don't have a opinion on reputation abuse. It's obviously a system that is abused frequently, but I can't think of anything that could prevent that. Reputation gives users an incentive to contribute to the community, I don't see any harm in that. As for it being taken to seriously, it probably is, but it is a vital part of Hack Forums, especially its Marketplace. Sadly, members with high feedback are looked at trustworthy members. That wouldn't be a problem if reputation wasn't so easy to build.\n\n[color=#0066FF][B]Aptitude[/b][/color]: Okay, last question: Is it true that Qwazz should make the 'Qwazz Star' the 'Qwazzy Star'. I mean, doesn't that sound much better?\n[color=#0066FF][B]Decoy[/b][/color]: Jeesh, that's a tough one. I kind of like \"The Star of Qwazz\".[/align][/spoiler]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNClassifieds.png[/IMG][/align]\n\n[align=left][url=http://hackforums.net/showthread.php?tid=1158830][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/Attbooter.png[/IMG][/url][/align]\n[align=right][url=http://hackforums.net/showthread.php?tid=1277828][IMG]http://i804.photobucket.com/albums/yy322/valik140795/LAL-1.gif[/IMG][/url][/align]\n[align=left][url=http://hackforums.net/showthread.php?tid=1234293][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/Cobaltebook.png[/IMG][/url][/align]\n[align=right][url=http://www.mskeys.in][IMG]http://i.imgur.com/X3GG1.jpg[/IMG][/url][/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNTeam.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\n[/list]\n[color=white][b]Publishers Assistant[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\n[/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url] - Other News\n[*][url=http://hackforums.net/member.php?action=profile&uid=153686]Fireren[/url] - Headlines\n[*][url=http://hackforums.net/member.php?action=profile&uid=515249]Sir[/url] - User News\n[/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=129444]3x0r_$c0rPi0n[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=114470]F4T4L 3RR0R[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=629674]Waldo[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url]\n[/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=137080]Boxing[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=92059]Security™[/url]\n[/list]\n[color=white][b]Editor[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[/list]\n[color=white][b]Graphic Designer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url]\n[/list]",
      "subject": "[6/8/2011] - HF News"
    }
  ]
}