{
  "posts": [
    {
      "pid": "15099357",
      "uid": "0",
      "dateline": "1314414723",
      "message": "[align=center][img]http://goo.gl/GbyQv[/img][/align]\n\nThe edition you are currently reading is the [color=#e37000][b]56th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\n[url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] is well aware of the Cloudflare, MyBB, and MySQL errors. Anyone posting \"I got an error\" thread will be warned. You can read more about this new rule [url=http://goo.gl/07G9e][b]here[/b][/url].\n\n[url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to make the role of staff clear. If you want to know what the role of a staff is and what they are not supposed to do, click [url=http://goo.gl/BU258][b]here[/b][/url].\n\nDynamic images are no longer allowed to be used in signatures. This rule also applies to avatars. For further details, click [url=http://goo.gl/xqUzL][b]here[/b][/url].\n\nThe voting for this month's Member Of The Month is now up. Go and vote for the member who you feel is the most deserving amongst the 10 nominees. Click [url=http://goo.gl/aA8GA][b]here[/b][/url] to cast your vote.\n\nThis week, the minimum post length has been lowered from 40 to 35 characters.\n\nIn an attempt to keep the PM table manageable, the PM box has been lowered from 100 to 50 for regular members.\n\nThe [i][b]C# Programming Language[/b][/i] sub-section has been created under the [b]Visual Basic and .NET Framework[/b] section. This is the result of a suggestion given by [url=http://goo.gl/KM9i7]BaussHacker[/url] which can be read [url=http://goo.gl/0YwKj][b]here[/b][/url].\n\n[url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to permanently remove the dead.php feature. Dead group has 63k users in it and he feels that it is useless to everyone.\n\n[url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to forbid the sale of hosting in the [b]Hosting[/b] section under the [b]Webmasters[/b] tab. You can read more about it [url=http://goo.gl/Usrpy][b]here[/b][/url].\n\nA new private group, named [b][color=white]Haunter Gang[/color][/b] was setup this week. The group is owned by the member [url=http://goo.gl/OSsaU]Time[/url]. You can find their recruitment thread [url=http://goo.gl/7jAhG][b]here[/b][/url].\n\nLast, but not the least, [url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] has reached 3000 reputations this week. Kudos to him!\n[color=transparent]zExPZcBh71I[/color]\n[align=center][img]http://goo.gl/0zRhM[/img][/align]\n\n[url=http://goo.gl/jEHix][color=#AAAAFF][b]๖ۣۜPink ๖ۣۜFloyd[/b][/color][/url] released the first ever Ace of Spades server on Hack Forums. Be sure to play it and join the server [url=http://goo.gl/rh8d4]here.[/url]\n\n[url=http://goo.gl/x0pTI][color=#0066FF][b]๖ۣۜΗ α x O r ♥[/b][/color][/url] was able to hack RankMyHack.com, proof is shown [url=http://goo.gl/nbBju][b]here.[/b][/url]\n\n[url=http://goo.gl/O2PhA][color=#0066FF][b]n4z1[/b][/color][/url] created another guide pertaining to hacking, this time a guide to all things \"h4x0r\". If you'd like to read it, see it [url=http://goo.gl/x7Vcl][b]here.[/b][/url]\n\n[url=http://goo.gl/7g1HW][color=#0066FF][b]SeaNanners™[/b][/color][/url] created an... interesting thread on how to enlarge your penis. Guys, this is for [url=http://goo.gl/Dtq05][b]you.[/b] [/url]\n\n[url=http://goo.gl/8DVUN][color=#0066FF][b]Cam G[/b][/color][/url] is the new assistant leader of the esteemed group, the Reviewers.\n\n[url=http://goo.gl/8KlIG][color=#FFCC00][b]DΣxus[/b][/color][/url] updated [url=http://goo.gl/UBIf3][color=#0066FF][b]Dordelicious[/b][/color][/url]'s original thread explaining each group. See the updated version [url=http://goo.gl/nlTmP][b]here[/b][/url], and the original version [url=http://goo.gl/FJ1ra][b]here.[/b][/url]\n\nBoth [url=http://goo.gl/8Tcl9][color=#0066FF][b]Not Here[/b][/color][/url] and [url=http://goo.gl/e8ESW][color=white][b]Ruggish[/b][/color][/url] received the [url=http://goo.gl/Nox0E]YouTube[/url] award even though it is supposedly not given out anymore. \n\n[url=http://goo.gl/WkknA][color=#FFCC00][b]Taylor Gang[/b][/color][/url] received the [url=http://goo.gl/vevMr]White Hat Helper[/url] award for assisting people who needed help.\n\n[url=http://goo.gl/5NeIz][color=white][b]Sync™[/b][/color][/url] received the [url=http://goo.gl/qA9rz]Fish Err Man[/url] award for having a \"nice clean aquarium.\"\n\n[url=http://goo.gl/Onpol][color=white][b]iNviZ[/b][/color][/url] was the second member to receive the [url=http://goo.gl/reSOM]FPS Gawd[/url] award.\n\n[url=http://goo.gl/26PB9][color=white][b]Saged[/b][/color][/url] decided to open an interesting thread involving the characteristics of you as a Forum Member, he seemed to get many people spot-on. Check it out [url=http://goo.gl/vVdti][b]now.[/b][/url]\n\n[url=http://goo.gl/bd64E][color=black][b]Sparky[/b][/color][/url] a leader of Haunter Gang and [url=http://goo.gl/iUhSs][color=black][b]iZan[/b][/color][/url] a member of Haunter Gang were both banned for targeting Staff IPs through the Sub-Forum.  [url=http://goo.gl/bd64E][color=black][b]Sparky[/b][/color][/url] was also repfucked.\n\n[url=http://goo.gl/3d4kb][color=grey][b]Cute[/b][/color][/url] was placed in to the dead group for a l33t reversal.\n\n[url=http://goo.gl/uuRo][color=Grey][b]Da Loser[/b][/color][/url] had over ten accounts, and just decided to post them all and get them deleted. See his confession thread [url=http://goo.gl/PFHqE][b]here.[/b][/url]\n\n [align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nIn what could possibly be one of the [b]strongest earthquake to strike the eastern United States[/b] in more than a century, shook up downtown Washington on Tuesday causing evacuations from many of the skyscrapers in New York. The eastern seaboard is quite free from earthquakes most of the times, so when the quake did hit, it hit hard and not many people expected it. This earthquake's magnitude at 5.8, rivals the largest one ever recorded in Virginia — a 5.9 quake that shook the state in 1897.\n\nFirst hand reports and authorities have stated that there were minimal casualties and damage, but the quake in it self was a bit alarming. A fellow HF member, [url=http://goo.gl/7AAlH]๖ۣۜExordium[/url] shares his experience:\n\n[quote]Well, around 2:00 PM Eastern Time Zone, I was sleeping in my bed. I heard shouts but I put a pillow on my head as I wanted to sleep. Next thing I know, shaking going on and I've never been in a earthquake and a 5.9 (which I guess is strong) gave me a spine-tingling feeling. I woke up when it happened then saw people screaming to run outside, so I tried to evacuate even though I was half asleep. But yeah, I'll never forget that earthquake feeling.[/quote]\n\nThe boot-trembling quake was felt in New York, Maryland, North Carolina, Ohio, Georgia and the epicenter being a small town named Mineral in Virginia. The earthquake was even experienced up north by the residents of Toronto, Canada.\nMore on the aftermath of the event can be found [url=http://goo.gl/ZqrKU][b][color=#FFDAB9]here[/color][/b][/url].\n\nThe apple never falls far from the tree and in recent news, the tree decided to resign. On the 24th of August, [b]Steve Jobs resigned[/b] from his position as CEO of Apple Inc. and handed over the reigns to Chief Operating Officer Tim Cook. Apple said Mr. Jobs submitted his resignation to the board of directors on Wednesday and \"recommended Mr. Cook as his successor. Steve Jobs, at the age 56 years, has been elected chairman of the board and Tim Cook will join the board, effective immediately, the company said.\n\n\"I have always said if there ever came a day when I could no longer meet my duties and expectations as Apple's CEO, I would be the first to let you know.\" Mr. Jobs said in his resignation letter. \"Unfortunately, that day has come.\" \nThis marks the end of what had been the most illustrious tech career in recent history. Steve Jobs, widely known for his showmanship and flair on the stage, decided to resign after feeling he could not live up to the duties of CEO after his health became his major concern. However, he will be playing a prominent role in Apple Inc. as the new chairman of the board and will most likely be involved in upcoming October release of the fifth-generation iPhone.\n\nCanadian politician and the Leader of the Official Opposition, [b]Jack Layton[/b], died on August 22, 2011, at the age of 61, after suffering from a type of cancer which is not yet disclosed to the public. \nFollowing Layton's death, his family released an open letter, written by Layton two days before his death. In the letter, he expressed his wishes regarding the NDP's leadership in the event of his death, and addressed various segments of the Canadian population. \n[quote]My friends, love is better than anger. Hope is better than fear. Optimism is better than despair. So let us be loving, hopeful and optimistic. And we'll change the world.[/quote]\n\nHe was indeed a visionary and a man who stood up for the public regardless of how dangerous the fight got. His contributions and work for the Canadian public will always be remembered.\n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n\n[align=center][img]http://goo.gl/zIzEM[/img][/align]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - Oldies[/font][/size][/color] [spoiler=]\n[Color=black]Diabolic:[/color] Hello Oldies, thank you for letting me interview you for this weeks edition of HF News.\n[Color=yellow]Oldies:[/color] Anytime, it is a pleasure to be part of this canned speech interview. <3\n(Love you Dia.)\n\n[Color=black]Diabolic:[/color]  Ha-ha, I love you also. So it's a quesiton that is asked all the time on interviews and that's how did you first find out about hack forums?\n[Color=yellow]Oldies:[/color] UUHH. Well, it all started in when I wanted to have a large e-peen. See, I used to co-own a big time MapleStory private server called MapleFresh, which was continually ranked at #4 on a server ranking site. We got hacked one day, and I wanted to learn to hack back.\nUnlike most people, I didn't find it while trying to hack a game. I wanted to be a black hat. c:\n\n[Color=black]Diabolic:[/color]  Mhmmm interesting, So what sections did you first sink into when you joined?\n[Color=yellow]Oldies:[/color] I instantly started to dive into programming, literally after about two days of being on the forum, I decided to drop my intentions of being a hacker, and started to pursure VB.Net\nI also got into the opposite of black hat hacking, the WHH board.\n\n[Color=black]Diabolic:[/color]  Ah right so your intentions changed almost as soon as you joined, Have you made any enimies along the way?\n[Color=yellow]Oldies:[/color] JerZee.\nHe is really the only one I would consider my enemy on the forum, though I couldn't care less about him.\n\n[Color=black]Diabolic:[/color]  So you only have had one enemy so that's good. Have you got any plans for your future on Hack Forums?\n[Color=yellow]Oldies:[/color] Not anymore, I used to want to be staff, but hell, who didn't have that moment on the forum? I'm over it at this point and now I just want to post and learn.\n\n[Color=black]Diabolic:[/color]  Since the new post count rule I see you went up quite a few posts, what are your opinions on that new rule?\n[Color=yellow]Oldies:[/color] I like it, a lot. Call it my post whore side, but when someone makes a post, it issa post. Your post count is to represent how many posts you made. Not how many posts you made + this exception and this exception, it is the total post count in general.\n\n[Color=black]Diabolic:[/color] Mhmm, I also liked the new rule althought I only went up by 300-400 posts, what do you think of the rise of activity in the past few weeks on hackforums?\n[Color=yellow]Oldies:[/color] I haven't noticed a change, maybe it is just my limited area of sections I visit.\nI've basically limited myself to the Visual Basic .Net section, The Black Knights section, the News and Announcements, annnnd the lounge.\n\n[Color=black]Diabolic:[/color] The lounge has become so active after the post count rule, I believe you have a new forum would you like to tell us a bit about it?\n[Color=yellow]Oldies:[/color] Oh, LifesForum.net. Well, I started it for two reasons. The first reason being that I enjoy to run forums, that is a huge enjoyment of mine. The second reason being that there aren't many forums that discuss real life. Lifes Forum allows people to discuss all the major aspects of real life.\\\nPeople need a friendly place to discuss things like relationships, cooking, and all of that.\n\n[Color=black]Diabolic:[/color] Oh so that's good to hear, I have signed up to your forum. Is there any personal shoutouts or anything else you wish to say?\n[Color=yellow]Oldies:[/color] God, so many people, but just a shout out to Wolves, Deities, Carbon (I know you are out there 😑 ), Tasemu, Exordium, Cute, Reece, Paradoxum, Kitten, Harvey, and Skill. Love you guys, go rape some shit with you massive (tiny in Kitten's situation) e-penis'.\n\n[Color=black]Diabolic:[/color] Ha-ha, well thanks for allowing me to interview you for the 56th HF News Edition. I have been friends with you for ages and I liked interviewing you.\n[Color=yellow]Oldies:[/color] Welcome sexy ;).\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 3 - iNviZ[/font][/size][/color][spoiler=]\n[color=white][b]Positive:[/b][/color] Thanks iNviZ for letting me interview you for the 56th edition of HF News. Anything you have to say before we get started?\n[color=white][b]iNviZ:[/b][/color] Hello HF.\n\n[color=white][b]Positive:[/b][/color] Ahaha. To start things up, why did you join Hack Forums? Do you know any hacking?\n[color=white][b]iNviZ:[/b][/color] I joined cause i love to learn and HF seemed like the place for me. I do a bit of everything but would like to know more in certain areas such as coding.\n\n[color=white][b]Positive:[/b][/color] I see you have recently recieved the 'Da Bomb' award from our admin, Omni. For the reason \"Nothing better than meth heads dancing to 80's tunes.\" What is the reason for this?\n[color=white][b]iNviZ: [/b][/color] Went on vacation to Vegas and to be honest, I thought it would fun to hang out with him. Which it was of course. He took me to Freemont St. where there was a live band and methheads dancing.\n\n[color=white][b]Positive:[/b][/color] Sounds interesting. Some people on HF take Omni as a meany (excluding me.) Is this true? Or is he different outside of Hack Forums?\n[color=white][b]iNviZ:[/b][/color] I mean everyone has their job. Their is fun time and work time but I see him as just a very responsible fun guy and he was a blast to hang out with and was very helpful.\n\n[color=white][b]Positive:[/b][/color] Now seeing that you have hung out with Omni, would you ever do it again? Was it a fun experience?\n[color=white][b]iNviZ:[/b][/color] Yes, hell yeah. He showed me the best of Vegas, and taught me a bit about gambling.\n\n[color=white][b]Positive:[/b][/color] Wow. Fun. Seeing that you came around 1-2011, has there been any changes you don't agree with?\n[color=white][b]iNviZ:[/b][/color] I see the hf growing tremendously and I am very easy going when it comes to changes cause I know Omni usually does it for the best and he knows his shit.\n\n[color=white][b]Positive:[/b][/color] Being here for a while can bring many friendships and many enemies. Can you name a few of both?\n[color=white][b]iNviZ:[/b][/color] I have no enemies and made some great friends here that have taught me alot including \"Wolves\", \"Positive\", \"TheHackersLove\", \"Omniscient\", \"Valik\" & \"Gumper01\"\n\n[color=white][b]Positive:[/b][/color] Awe. Back on topic, what's your strongest section? What section are you always in? Things your good at? \n[color=white][b]iNviZ:[/b][/color] The \"Marketplace\" section. I find myself in the \"Gamertag\" section alot nowwa days. Also, the groups I am in, I am mainly in those sections. I am good with servers (vpses, dedicated) and my social engineering skills. Aswell as I do learn fast. eBooks have also been my thing lately.\n\n[color=white][b]Positive:[/b][/color] Do you have any set goals on hackforums? Anything that you strive to accomplish?\n[color=white][b]iNviZ:[/b][/color] I do strive to learn C++ and VB .NET. My main goal would be to code a program that will help the Hack Forums community.\n\n[color=white][b]Positive:[/b][/color] Good luck. Anything we should expect from you in the near future? Any eBooks? Tutorials?\n[color=white][b]iNviZ:[/b][/color] Yes I am currently working on 2 eBooks that will be free, so look forward to them soon.\n\n[color=white][b]Positive:[/b][/color] Ahaha, ok. Any shoutouts or comments before we end this interview?\n[color=white][b]iNviZ:[/b][/color] I would like to shout out to the \"Black Knights\".\n\n[color=white][b]Positive:[/b][/color] Well, thank you iNviZ for letting me interview you for this week's HF news.\n[color=white][b]iNviZ:[/b][/color] No problem, and thank you sir.\n[/spoiler]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n\n[url=http://goo.gl/3cDOZ][img]http://goo.gl/8r0pM[/img][/url]\n[align=right][url=http://goo.gl/sLsk6][img]http://goo.gl/0veBz[/img][/url][/align] \n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]\n",
      "subject": "[8/26/11] - HF News"
    }
  ]
}