{
  "posts": [
    {
      "pid": "18584803",
      "uid": "515249",
      "dateline": "1325129188",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]73rd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]Youtube Award[/b][/color]\nThe almighty Omniscient was feeling rather generous this Christmas and decided to give HackForums a present by giving out a few youtube awards. Members who wanted to obtain the award were asked to make a video wishing everyone around them a merry Christmas. A few deserving members did get it however Omniscient is no longer giving out the award.\n\n[color=white][b]New groups[/b][/color]\nThere has been talk of two new groups on HF, Brotherhood and Propitious. Neither of these groups has been entirely paid off, so it is still unconfirmed whether or not they will become official. Propitious however, is planned to be open to recruitment on January 10th.\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=589027][b][color=#0066FF]Stay Plural[/color][/url][/b] - has been repfucked for giving positive reputation to a ban evader.\n[url=http://hackforums.net/member.php?action=profile&uid=723224][b][color=#0066FF]h3x3n[/color][/url][/b] - received a repfuck for PM'ing Omniscient a suggestion, this is his 2nd repfuck in 2 weeks.\n[url=http://hackforums.net/member.php?action=profile&uid=551252][b][color=black]AdonisG[/color][/url][/b] - he has taken a vacation ban and will be returning just before new years day.\n[url=http://hackforums.net/member.php?action=profile&uid=911957][b][color=black]JustinH[/color][/url][/b] - received a ban for Ub3r Junk Abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=905109][b][color=black]Rainbow_Dash[/color][/url][/b] - Rainbow has taken a ban for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=447912][b][color=black]the professional hacker[/color][/url][/b] - has been banned for Threatening and Flaming members.\n[url=http://hackforums.net/member.php?action=profile&uid=450827][b][color=black]The Holy[/color][/url][/b] - has been repfucked for unknown reasons, but many users believe that his Xbox 360 Kinect service is a scam. He was in the dead group, but has been moved to the banned account group.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align][color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Christmas Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2047611]Merry Christmas HF[/url] - [url=http://goo.gl/q9Qcg][color=#00BFFF][b]Omniscient[/b][/color][/url] - Merry Christmas everyone! Omniscient made a thread saying \"Merry Christmas\" to all of Hack Forums. This was also one of the only ways to get the Youtube award, you had to make a video response.\n[i][b]Heartwarming Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2048921]Member from here destroys guys Xmas [Update day 3 27th December][/url] - [url=http://goo.gl/F4eeA][color=white][b]Black Shadow[/b][/color][/url] - Black Shadow is trying to help a member reclaim his account from a hacker, he is standing up for someone else and doing all he can for them.\n[i][b]Interesting Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2046296]Types Of HF Members[/url] - [url=http://goo.gl/HDDiH][color=#FFCC00][b]Mr. Sky[/b][/color][/url] - Mr. Sky has decided to make a thread that kind of explains each of the types of members, if you're interested in a laugh, you should check it out.\n[i][b]Scam Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2057679]Scammer protection.[/url] - [url=http://goo.gl/kT0gT][color=#0066FF][b]bugga[/b][/color][/url] - The Holy was in the dead account group but has now been moved in to the banned account group. This is bugga's thread about his scamming.\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Reliable's Mate[/font][/size][/color][spoiler=]\n[b][color=white]Kottonmouth[/color][/b]: Hello Reliable's Mate! I'm glad you could take the time to have this interview with me.\n[b][color=#1466FF]Reliable's Mate[/color][/b]: Glad to be here.\n\n[b][color=white]Kottonmouth[/color][/b]: Reliable's Mate; Is there anyone you'd like to make a shoutout to before we begin?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: I would like to shout out to Biz, Reliable, Publicity, Grin, Genuine, Eminent, Ignite, Jimmy, Kottonmouth., and anyone else who I talk to on a daily basis. I would also like to shout out to everyone in reverence,  red lions, techsperts, Eminence, marketers, and the black Knights.\n\n[b][color=white]Kottonmouth[/color][/b]: So, to start off.. I believe your permanent name is Enterprise.. So, let's talk about that; How did you come up with that name?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: Well the name enterprise was suggested from a friend of mine who said that when he was l33t he would like to change his name to Enterprise so i asked him if I could keep that name and he was fine with it. Also i am interested in marketing so it fit really well.\n\n[b][color=white]Kottonmouth[/color][/b]: How did you find Hack Forums, and why did you decide to stay?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: I came here on an adventure to learn more about minecraft and then i decided to leave that one section of the forum and realized what hackforums was really about.\n\n[b][color=white]Kottonmouth[/color][/b]: What do you have to say about the new usergroup \"P0W3R\" being added?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: I feel that Omniscient is doing a great thing. He is trying to convince members to use LR which I think is great. The perks are also great being able to +5 or -5 will really make a difference.\n\n[b][color=white]Kottonmouth[/color][/b]: In the future, do you see good or bad changes happening to Hack Forums? Based on what's being changed now, happening, etc?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: I see many things. We have a great amount of dedicated members that will help hackforums through any rough patch so I think that hackforums and all of its members shouldbe optimistic.\n\n[b][color=white]Kottonmouth[/color][/b]: What's your full opinion on all the groups of Hack Forums? What groups would you remove, and / or change?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: Honestly I think that groups were meant for people to help out other members. Some have kept continued traditions on but some are just there because they would like to be there. I am not against any group.\n\n[b][color=white]Kottonmouth[/color][/b]: You're in 6 of the 14 official Hack Forums groups. How did you pick up the determination to get into so many? Do you manage to sustain your job in each one every day?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: Honestly, at times yes it is hard but I feel as though I contribute to each group equally. Honestly, when Hysteria upgraded me to ub3r as a sign of kindness I immediately knew I had to join the Red Lions in the Red Lions I really see the family feeling so I ended up trying to get into each group so I could help everyone out and that we would help eachother no matter what.\n\n[b][color=white]Kottonmouth[/color][/b]: Alright, well I think that raps up this interview. Is there anything you'd like to say to rap it up?\n[b][color=#1466FF]Reliable's Mate[/color][/b]: Thank you for interviewing me. Merry Christmas and Happy Hannnukah from Enterprise.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Poppins[/font][/size][/color][spoiler=]\n1. Would you like to give any shoutouts?\nMy boy thoth and jim francis.\n\n2. Why did you join Hack Forums?\nMet a friend of the family on holiday who taught me how to do SQL injections and drive-by attacks on servers so I came home and googled 'underground hacking forum' lololol.\n\n3. Where'd you get your username?\nA chick called me it because I held her umbrella for her.\n\n4. Why were you banned and are you glad to be back?\nI've been banned quite a bit. Last time was for not posting in the marketplace. Yeah I'm glad to be back because it was a stupid ban.\n\n5. Where'd you get the idea for your signature?\nSaw that little kid and instantly thought of it.\n\n6. What's your favorite section on Hack Forums and why?\nWould've been the lounge but that's gone to shit so probably the SRPP section because it makes me think.\n\n7. Do you have any opinions on the loss of the SE section and the creation of the DREDD section?\nI used to like the SE section. Never noticed there was a DREDD section haha.\n\n8. Where do you see yourself in 5 years, in relation to HF?\nWith -2000 rep and a black name\n\n9. What do you like to do when you aren't on Hack Forums?\nI just go out and live life I suppose. Either that or design/coding.\n\n10. Do you have any words for the members of HF?\nCheck yourself before you wreck yourself, bricks to the face are bad for your health.\n[/spoiler]\n",
      "subject": "[12/28/11] - HF News"
    },
    {
      "pid": "18584814",
      "uid": "515249",
      "dateline": "1325129215",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Kim Jong Il Deceased[/b][/color]\nOne of the worlds most infamous leaders has died and leaving Korea unattended to. Kim Jong Il’s death on Saturday has sparked a 13-day mourning period in North Korea as thousands converged on Pyongyang to pay their respects to their \"Dear Leader.\" When Mr. Il was found dead, an autopsy was performed. They found that he died from over exhaustion. For South Koreans, Kim Jong Il’s sudden death drove home an unsettling disparity between them and their neighbors, a gap that could spark turmoil, if an unstable North Korea were to collapse. At this point, some in Seoul say, North and South Korea hold nothing in common but a language. \n\n[color=white][b]Megaupload Being Sued[/b][/color]\nAnother month, another copyright lawsuit from adult media outfit Perfect 10. This time the company is chasing file-hosting service Megaupload and its owner Kim Schmitz, associated companies such as megarotic.com, megaporn.com, megavideo.com, and megaclick.com, and other businesses and affiliates. \n\nAs song has been made by multiple artists, you can view this [url=http://www.youtube.com/watch?v=o0Wvn-9BXVc][color=white][b]here[/b][/color][/url].\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[color=white][b]New iJailbreak - Pod2G[/b][/color]\nAfter months of hard work Pod2G (@pod2g) has finally released--with the help if the iPhone Dev Team and Chronic Dev Team--an untethered jailbreak for all devices running A4 processors and below (iPod touch 3G,4G iPhone 3gS, 4, and iPad 1) running iOS 5.0.1. The jailbreak can be obtained either by downloading a quick Cydia debain called \"Corona\" from the Chronic Dev Team or using redsn0w 0.9.10b1 to jailbreak untethered. The A5 devices (iPhone 4S and iPad 2) are still being exploited. The main problem with them at this current time is that they need to find a way to inject the untethered exploit. More when Pod2G updates.\n\n[color=white][b]Smartphone Sales[/b][/color]\nThis holiday season was a huge hit for cellphone companies. According to \"Computerworld.com, the activation of Android and iOS products jumped by 142% on Christmas Day. This is a huge increase since from Dec 1st-20th, the sales were only 1.6 million and on 25th, the activation jumped to [u]6.8 MILLION[/u]. The two platforms are at the other's throat to dominate the charts on which product consumers like better.\n\n[color=white][b]Common Thief[/b][/color]\nHere we have an unusual site, [url=CommonThief.com]Common Thief[/url]. This website is run and operated by one of our own, [url=http://goo.gl/Zid0h]Ampix0[/url]. He has put together a great area for members to get a hold of some unusual items. At the moment, his store is a little bit on the small side, but he hopes to expand even further. (Do note that this is not advertising, I contacted Ampix0 about this article to see if he would allow me to add it in) For anyone looking for tech that's hard to find, the Common Thief will pick your pockets.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]Jay-Z And Kanye Bag £4m For Birthday Bash[/b][/color]\nRappers pocket £1.9m each for Arab billionaire daughter's 16th...\nJay-Z and Kanye West have more than likely added some serious bling to their collection this Christmas.\nThe rapping pair reportedly enjoyed a £4 million Christmas bonus for performing at a 16th birthday bash.\nAccording to The Sun newspaper, Jay-Z and Kanye were paid £1.9 million each for playing to the daughter of an Arab billionaire and her lucky friends.\n\n[color=white][b]Lady GaGa Fans Treated To Explicit Xmas Tweet[/b][/color]\nLittle Monsters get a five-minute, uncensored song for Crimbo...\nLady GaGa's Little Monsters were treated to a special X-rated Christmas treat on Sunday when the singer tweeted an unreleased song entitled Stuck On F** You.\nGaGa tweeted her devoted fans a link to the song, along with a message by way of explanation.\n\"So excited for you to hear your Xmas present monsters!\" she wrote. \"5 hrs and 28 minutes away! I love you all so much, you're the greatest gift to me.\"\n\n[color=white][b]Military Wife Slams Internet Bullies[/b][/color]\nSamantha Stevenson shocked by online taunts over tattoos...\nOne of the voices of this year's Christmas European number one has been subjected to online abuse over her tattoos.\nSamantha Stevenson, one of the Military Wives currently enjoying the top spot in the Official EU Singles Chart, revealed that internet 'trolls' have been taunting her, calling her body art \"vile and disgusting\".\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nPeople nowadays are so rude, it's a well known opinion. Life is going by so fast, there is no time for leisure and relaxation until you're retired and tucked away in a small corner of society. I think that the need for speed is the main reason as to why people just don't care for each other. For example, when you're driving to work--or even the grocery store--people will cut you off and drive right in front of you. That's just one small instance, there are thousands of others in thousands of different scenarios. In my opinion, the entire population is becoming more self-centered. It's a shame that life has come to this, and it bears witness to the ideas that humanity is coming to a fall. No, I'm not saying that we will cease to exist. I'm saying that humanity in the sense of right and wrong, good and evil--the basis of humanity--is coming to a close.\n---\nThat's just a tidbit of something I'd like to say, if you feel like commenting, do so.\nPlease don't turn it in to a hateful discussion, it's just an opinion. None of the above is proven or a fact.",
      "subject": "*"
    },
    {
      "pid": "18584832",
      "uid": "515249",
      "dateline": "1325129268",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about the death of Kim Jong Il and what it will mean for the future of North Korea?\" \n\n[i]\"In my opinion, Kim Jong II was a mad man. \"Testing\" rockets that\n could hit any country. Hopefully, Kim Jong II's son will build a better relationship\n with countries like South Korea and USA and lower tensions of nuclear warfare.\n Maybe North Korea will become an open country one day?\"[/i]\n[url=http://goo.gl/cMv6r][i]-Infinity∞[/i][/url]\n\n[align=right][i]\"Regardless of the fact that Kim Jong Il was a terrible man, I loved him Being the\n Funnyjunk fanboy that I am. Kim Jong Il is the mascot of Funnjunk and the face of\n admin. I'm wondering what's going to happen to the fututure of Funnjunk without\n Kim Jong Il. As for the fate of North Korea, I believe there will be a global thermonuclear\n war over his glasses. ;D\"[/i]\n[url=http://goo.gl/f1yJs][i]-Purple Haze[/i][/url][/align]\n\nThe topic for next week is \"Do you think that new usergroups are good for the site? In what way do that affect HF?\" \n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.minus.com/j3RhvjVa6Xj1E.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Kris/tab.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/8AfLm.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=Kbb9v2wPatM[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[url=http://hackforums.net/member.php?action=profile&uid=371170][b][color=#0066FF]OVO™[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=36]Cat Lover[/url] award.[url=http://hackforums.net/member.php?action=profile&uid=656453][b][color=#0066FF]ReactioNz[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=50]Master Donator[/url] award.[url=http://hackforums.net/member.php?action=profile&uid=656453][b][color=#0066FF]ReactioNz[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=25]Cool[/url] award.[url=http://hackforums.net/member.php?action=profile&uid=402384][b][color=white]Riggs[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=58]Businessman[/url] award.[url=http://hackforums.net/member.php?action=profile&uid=555364][b][color=#0066FF]EatSleepCode[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=49]Grammar Nazi[/url] award.\n\n5781 userscript installs\nChristmas and thread\nMOTM nomination\nSE section always talked about\nThe Holy scamming - http://hackforums.net/showthread.php?tid=2057679\nSOPA\nDecompiling, Reverse Engineering, Disassembly, and Debugging - 104 Threads  -  Posts: 1,156\n[/spoiler]\n\n[hr]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]0OTF[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/jZvPh]TheHackersLove[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/aJS0l]Diabolic[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Kottonmouth.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}