{
  "posts": [
    {
      "pid": "23583683",
      "uid": "515249",
      "dateline": "1339873982",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]96th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]New section coming soon[/b][/color]\nAfter a suggestion thread was created 5 months ago [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally decided it's time to create a networking section. Although it has not been implemented yet he has confirmed that will be in the future. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s response to a recent similar suggestion click the following link: http://goo.gl/9CQvW\n\n[color=white][b]Coder's new userbar[/b][/color]\nAs a part of their revival the coders have decided to change the groups userbar. There are mixed opinions on this change however the leaders do not seem willing to make any further changes. To view the group's new userbar click the following link: http://goo.gl/m6Xj8\n\n[color=white][b]Usergroup Root sold[/b][/color]\nThe somewhat new usergroup root was sold to an unknown user earlier this week. The group sold for $3000 in an auction held by Castle Bravo. The new leader will be officially announced soon, and when he takes over the group all current members will be kicked. To see the group auction thread click the following link: http://goo.gl/uTmP6\n\n[color=white][b]Lounge cleanup[/b][/color]\nFor unknown reasons there have been well over one million posts deleted from the lounge section on HackForums. This was most likely just an ordinary post prune, however [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has not many any statement on this. To view the stat page for HF click the following link: http://goo.gl/O1M1M\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=734805][b]Glassy[/b][/url] has been promoted to Mentor. This was bound to happen sooner or later, congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=295848][b]Qwazz[/b][/url] celebrated his birthday this week. You can wish him happy birthday [url=http://hackforums.net/showthread.php?tid=2591053]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=361543][color=black][b]Scooter[/b][/color][/url], previously a member with over 2000 reputation, was repfucked and banned. We will greatly miss your thorough feedback on this weeks news edition.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=119173][color=black][b]Xenochrist[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=510910][color=black][b]Nickpooz[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=944024][color=#0066FF][b]Neal Caffrey[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=361543][color=black][b]Scooter[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=493159][color=black][b]Prominent[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1042274][color=black][b]-๖ۣۜDivine-[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=510910][color=black][b]Nickpooz[/b][/color][/url] was banned for posting outside of the marketplace.\n[*][url=http://hackforums.net/member.php?action=profile&uid=897447][color=black][b]Kiss.[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=119173][color=black][b]Xenochrist[/b][/color][/url] had his account closed.\n[*][url=http://hackforums.net/member.php?action=profile&uid=857963][color=black][b]Burn™[/b][/color][/url] was banned for requesting vouch copies.\n[*][url=http://hackforums.net/member.php?action=profile&uid=127732][color=black][b]I Smoke Loud[/b][/color][/url], A.K.A, `P R O D I G Y™, was banned for scamming.\n[*][url=http://hackforums.net/member.php?action=profile&uid=361543][color=black][b]Scooter[/b][/color][/url] was banned for complaining about a repfuck.\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453][color=black][b]Chris[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=942731][color=black][b]Skrillex[/b][/color][/url] was banned.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/showthread.php?tid=2584023][b]malichi[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2584023][b]Too young for pot?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1171778][b]RIPPER[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2578745][b]Dictatory or democracy[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2575842][b]Tomb raider sexual assault scene, remove it?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=65167][color=#FFD700][b]Horkos[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2575429][b]Why our lives are pointless and redundant[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1099423]Jae[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Hello Jae,\nThanks for participating in the 96th edition of HF News, any shout outs to other members before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=1099423][color=white][b]Jae[/b][/color][/url]: Thanks for having me here, I'm honored. But I'd like to give a shout out to Diabolic, Dan, Bugga, Vinnie, Hosman and to all my fellow group members. I could keep going but we would be here forever haha.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well Jae I'm sure all of the people you named there are going to appreciate it. Now I see you're in a lot of groups on HackForums, do you think people consider you as a group whore ?\n[url=http://hackforums.net/member.php?action=profile&uid=1099423][color=white][b]Jae[/b][/color][/url]: Yes I am many groups and I take pride in all of them. I know for a fact that people consider me a group whore, I constantly receive private messages and rep simply because I'm in 8 groups. I personally don't like the term \"Group whore\" because I take it as an insult. Groups are just something that have grown on me. Every group is like a family; your learn so much, meet great members and it helps keep you active on this wonderful forum.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well that's wonderful man, I know people might send you pm's all the time saying \"GROUP WHORE\" but if you're showing dedication to the groups then it's worth it. Now what is your favourite thing around HF ? what do you do the most ?\n[url=http://hackforums.net/member.php?action=profile&uid=1099423][color=white][b]Jae[/b][/color][/url]: That exactly how I feel, as long as I'm dedicated to my groups then I should be okay. And when I first joined this site my favorite thing used to be the gamertag section. Selling and trading original tags brought in a nice amount of money. Now I'd have to say my favorite thing to do is to hang around all my groups sub forums. TechSperts lounge raiders are also a great group of active members that I love to be around. Lately I've disconnected myself self from the community because my Grandfather passed last week but once I fully get back you guys will see the old me. And oh my, how could I forget about going on Tinychat almost every single day of the week. That is another section that I've meet some amazing people and I would recommend every member to check it out whenever they get the chance. I've had some great times in there as you may know SoulZeh haha. \n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well sorry to hear about your Grandfather bro. Yea we've had some laughs in tinychat ;) be good to get you back too. If you could change one thing around HackForums what would it be and why ? \n[url=http://hackforums.net/member.php?action=profile&uid=1099423][color=white][b]Jae[/b][/color][/url]: Its okay, I understand that everyone's day will eventually come and that's just something I have to live with. And yes we've had great times in Tinychat and I promise I'll be back as soon as possible. If I could changed one thing on hackforums it would have to be nothing. Omni is doing a great job running this forum with the help of his fellow staff members and mentors. I wish there was a way though to eliminate all the LQ members from stepping foot into this site although that's impossible. Staff try's their best, but they just keep on coming.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Yeah, you have to move on in life, there is a lot of things around the corner unexpected. I agree omni does do a fine job running the site with Staff/Mentors and Fellow Admins. What annoys you the most about HackForums ? \n[url=http://hackforums.net/member.php?action=profile&uid=1099423][color=white][b]Jae[/b][/color][/url]: Hm I wanna say what truly annoys me but I wouldn't want the thread to become a debate about mods, but what grinds my gears is when Ubers/Leets take advantage of non upgraded members. I think the main reason people want Uber is just simply because they want to be able to install fear with the -3's. It's almost like wanting to become a cop just to get a gun. In my opinion with Uber comes great responsibility. I'm sure many non upgraded members look up to use and hope to wear the Uber userbar with pride. Ubers need to stop deteriorating our image and remember that Omni accepted us for a reason, we could've simply been declined. Another thing that I hate to see is when Ubers scam. I expect so much more from Ubers. We need to lead by example guys.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Fantastic man, great answer, I have to agree with you on that one man. Right before we finish up here, you got anything else you want to say? \n[url=http://hackforums.net/member.php?action=profile&uid=1099423][color=white][b]Jae[/b][/color][/url]: I'd like to thank you for having me here once again, I'm honored. Love all you guys.\n[/spoiler]\n\n[color=#00BFFF]Interview - [/color][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]\n[spoiler=]\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] Good afternoon Grammar Rays, and thanks for participating in the 96th full edition of HF News. Any shoutouts before we get started?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] Shoutouts to PyroStorm (Awesome guy), Judge Dredd (my PM bitch), and everyone on Learn Forums.  I've probably missed out a lot of good friends but they will understand I still love them. :)\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] Haha, I'm sure they will be ecstatic about seeing their name on the News! So Grammar, you have been on HF now for over 2 years. What originally attracted you to the forum?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] Regrettably I joined to make a quick buck selling tenth prestige lobbies, however that didn't go to plan and I decided to leave for a short time.  2-3 months later I came back with the intentions to achieve something out of my time on the Internet.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] Sounds like a rewarding failure! What were your intentions when originally returning, and have you achieved them to date?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] My original intentions included reaching 200 reputation, reaching 2,000 posts, being awarded the Grammar Nazi award, being appointed as a staff member, and generally helping as many people as possible.  Of all these I have still to achieve the last two.  These have been the same goals for my entire time at Hack Forums and have been stored in my Personal Notepad in the UserCP.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] I see. Those are some quite ambitious goals, but I suppose you won't get anywhere without pushing yourself! As many people would have noticed, the number of Bronies on HF has been rising. As, and I quote, \"the first gay-ass brony of HF\", what attracts you to such a show, in such an extreme way?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] Ambitious goals, yes.  But as you can see I have achieved 4 out of 6 so far. :)\nAs for the whole Brony thing, I must highlight and stress that it was my birthday and I was drunk. You could say that I am only a Brony by marriage, not by blood.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] Haha, dragged into the trend perhaps? As the summer approaches for many, do you have any plans for the holidays?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] I believe prior to the award there were just a small group of Bronies minding their own business, and once the award was created, WWIII broke out and people started to pretend to be part of this Brony group when really they were doing it for attention. I was drunk and saw the award being added.  What else can I say?\nMy plans for the the summer include a nice holiday and preparation for my college courses.  Which in itself includes Maths, Business Studies, Computing, and Economics, for those who are at all interested.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] Sounds like an interesting story, and promising plans for the summer. Before we round it up, where do you hope to see yourself after you complete college?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] After completing college I hope to progress onto further education.  I am looking into a few Universities already such as the University of East Anglia, the University of Liverpool, and a few others.  To sum post college up, I want to be successful in anything and whatever I do.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#1E90FF]Phytrix[/url]:[/b][/color] Keeping your ambitions open is always a great thing. Well, it's been an honour to interview you today, Grammar. Anything else you would like to add?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=298746]Grammar Rays[/url]:[/color][/b] I would like to thank you for interviewing me.  I read the HF News every week and I always wondered when this day would come.  Thank you to Sir for keeping the HF News running along with the team.   As for those reading this, don't forget to check out LearnForums.com and thank the HF News team for their efforts!\n[/spoiler]\n\n[color=#00BFFF]Interview - [/color][url=http://hackforums.net/member.php?action=profile&uid=847499]Brandenx781[/url]\n[spoiler=]\n[color=white][b]RDCA[/b][/color] Hello! Welcome to the 96th edition of the HF News, Brandenx781. Is there any shout outs you would like to give? \n[color=white][b]Brandenx781[/b][/color]: Greetings. I would like to just give a major shout out to my HJT Team and family.\n\n[color=white][b]RDCA[/b][/color]: I am sure they appreciate it. Speaking of the HJT Team, tell us how you came to be in the HijackThis Team. \n[color=white][b]Brandenx781[/b][/color]: Actually, I was a noob back then. I went to SupportForums, which was Omniscient's other website, and asked for help with my computer pertaining to a virus. I was then assisted by a user named Quintus, who is Paradoxum here on Hack Forums. After I was clean, I asked Quintus/Paradoxum questions pertaining on how you learn these types of things such as malware removal. I was later directed to a group application thread to the HJT Team over at SupportForums, where I did apply. A few days later, I have received a message that I was accepted into the HijackThis Team.\n\n[color=white][b]RDCA[/b][/color]: Seems like Quintus is a real amicable person then. So as some of us may know, you finished your training here at HF. How would you compare Support Forums training to Hack Forums. Also what was your best and worst moment with the team? \n[color=white][b]Brandenx781[/b][/color]: Correct, I did finish my training here. SupportForums training was very intense. Quintus was the only teacher. So, it was hard to get in a reply every minute. It was like one reply each day. Although the training there was long, it was a huge experience. We had a small family there. Transferring to HackForums, I didn't like the idea at first. Obviously I wouldn't get along with anyone, since I was only here to finish my training.\nHowever, I was able to get more replies in this site's training program, as there were active teachers at the time. I was introduced to the HF's HJT team by Paradoxum. I've met tons of new people, and teachers, and was accepted to be apart of the HJT Family here. I'd prefer to have training here, as you meet tons of active users in this community. The training at SupportForums was more rigorous than the training over here at HF, because of the teaching style of Quintus.\nMy best moment was the time when I was still undergoing training in SupportForums. We had an IRC set up, and it was only us 4. (3 Trainees including me, and Quintus as our teacher). We would just screw around in the IRC, and just have some fun moments together during our trianing. We had so much fun, and I wish I can go back to those days again, where we would just screw around in the IRC, and getting to know our teacher.\nMy worst moment? I can't say that I have one with the team. Honestly, I have gotten along with everyone and had no problems with my team. \n\n[color=white][b]RDCA[/b][/color]: I agree, those were some magnificent times, but don't forget about Solidus, he was there as well. Either way it is a good experience to see the team through your eyes. So now that you are a teacher here at HackForums, how do you feel about the students and teaching. Also what are your future plans at HackForums, if any? \n[color=white][b]Brandenx781[/b][/color]: Ah, I remember Solidus. I should pay him a visit on his forum sometime. I heard he returned again on iBruteForce. The new students are an interesting batch. They have complained multiple of times of my teaching, as I teach long. These students do not understand what the actual intent of this training is yet. Honestly, I think they race to graduate. During my teaching, I ask endless amounts of questions. The reason being, is that I don't want my students to just copy and paste answers without reading. I want to make sure they actual understand the material they are reading, so it'll help them during real malware removal. And in all honesty, I do not think the new students here understands that. Understanding the process of malware removal is a difficult thing. It's [i][u][b]not[/b][/u][/i] just about \"oh, scan ur pc with malwarebytes and ur good to go\". We use multiple of tools, that you have to interpret and analyze. If you cannot analyze a log for specific infections, then how will you make it as a malware removalist? That is why again, I ask tons of endless questions, during the training at the HJT Team. The more advanced students love my teaching, as they learn more things from the questions I ask. They take their time and research. I'm hoping in the future, that the new students will understand why I make training more intense. Teaching should not just be about giving hints, and giving students an easy way out. That's like cheating on a test. Teaching should be more about focusing on the student's point of view, and guiding them in the right direction to research, and find out about malware. I want to see how the training over here turns out as a new curriculum will be released. My future plans, is to remove viruses in the log Analyzer section in the WHH subforum, teach, and keep smiles on people's faces.\n\n[color=white][b]RDCA[/b][/color]: So you are in other groups besides the HJT team, how do you feel about the other groups you are in? \n[color=white][b]Brandenx781[/b][/color]: Besides the HJT Team, I am currently in The Alliance and TechSperts. I've been in The Alliance for some time now, and it's such a great pleasure being in the family of cats. Everyone there is so welcoming, and you do learn tons of things. It has such a great foundation, and I'm very proud to be apart of that family. You learn tons of stuff from the classes in that group, and participate in many different activities. I can't say anything about the TechSperts though, as I was only added to create a collaboration with their leaders about the basics of security and malware removal.\n\n[color=white][b]RDCA[/b][/color]: How do you think HackForums is progressing as a whole, and what do you think about the quality level, has it gone up, or down, or stayed the same? \n[color=white][b]Brandenx781[/b][/color]: I can't say much about the quality here, as I've spent most of my time teaching, and helping people in the \"HijackThis Log Analyzer and Tutorials\" section. Although I can't say anything about the quality overall, I don't like how it goes in the log analyzer section. Face it, most of the times is an idiotic user infection themselves, or that I'm helping infectors, clean themselves, so that they can infect more people. I am forced to help them, due to Omniscient's expectations for the HJT Team. It's really hard to find a true thread where a real infection lies in.\n\n[color=white][b]RDCA[/b][/color]:: Also, though there isn't much info available to the public, what do you think about the new teaching system coming to HF for the HJT Team? Do you have any fears about it? Another thing is, what are your opinions on the two new leaders of the HJT Team?\n[color=white][b]Brandenx781[/b][/color]: The new teaching system will be okay. Omniscient wants people to be a graduate and a helper in around 2 months. We went against him, but he would not change his point of view. Malware removal is not easy. Training should take more than around 3 months, ATLEAST. I fear, that if we limit the teaching to a faster curriculum that we're leaving out key-points of malware removal, then I fear that we'll create halfed-assed malware removalist. That is not what WE (HJT Team) wants. We prefer quality over quantity. I hope the training will be even more rigorous than before, and teach tons of different tools instead of the known ones.\n\nThe two new leaders are doing very well. I haven't heard much from Infallible, as he's busy on trips and vacation time. T3h Hack3r is very active. Very nice and welcoming during teaching, and also private messages. These two leaders have been doing tons of things, as us teachers assist in teaching, while they're busy getting the new curriculum up and going. Before they were leaders, they were my former teachers, and I absolutely have no problems with them being the HJT Leaders.\n\n[color=white][b]RDCA[/b][/color]:: I am sure they will understand eventually. Though this does wrap up our HF Interview, I would like to thank you for doing this with such short notice. Hopefully your future endeavors will be prosperous. Do you have any final questions, comments, or concerns? \n[color=white][b]Brandenx781[/b][/color]: Nope. Thanks for interviewing me and my life story here as a HJT Teacher.\n[/spoiler]",
      "subject": "[6/16/12] - HF News"
    },
    {
      "pid": "23595523",
      "uid": "515249",
      "dateline": "1339901674",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img]\n[img]http://i.imgur.com/3aHpb.png[/img]\n[video=youtube]http://www.youtube.com/watch?v=s3YhiObKCnQ[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=White][b]Sports[/b][/color]\nThis week a lot of different events have happened in sports the first is. The Los Angeles Kings won the Stanley cup. They are the first NHL team is history to win the Stanley cup from the eight and last playoff spot. It is also the first Stanley cup for the los Angeles kings. The Los Angeles kings defeated the new jersey devils in six games in the Stanley cup final. The kings also went an amazing 16 and four during the playoffs and only losing one game on the word during the entire playoffs. Also this week Rafael Nadal Defeated Novak Djokovic in four sets to win his seventh French open title. Rafael Nadal now holds the record for the most French open. This week there is also the U.S. Open gold championship. The U.S. Open is one of four major tournaments during the golf season. Currently four time winner of this event Tiger Woods is co leading with David Toms and Jim Furyk at one under par. Lastly this week the NBA finals are going on between the Miami Heat and the Oklahoma City Thunder currently the NBA finals series is tied at one game a piece in this best of seven series.\n\n[color=White][b]Greek Election[/b][/color]\nThis week there will be a legislative election happening in Greece. The election will happen on Sunday June 17th 2012. The election will elect 300 new members for the Hellenic Parliament. There was another election in Greece on may the 6th but none of the three largest partys were able to get a majority of the 300 seats on parliament. The three largest partys at the may 6th election were ND,SYRIZA and PASOK. The three largest partys at the June 17th election will have a chance to for a government and take power but if they cannot control will go back to the president of Greece. Currently the ND has 108 seats in parliament, SYRIZA currently has 52 seats in parliament and PASOK currently has 41 seats on the Greek parliament. The Leader of the ND party is Antonis Samaras, The leader of the SYRIZA party is Alexis Tspipas and the leader of the PASOK party is Evangelos Venizelos.\n\n[color=White][b]Hurricane Carlotta[/b][/color]\nHurricane Carlotta struck the western coast of Mexico this week. The hurricane was a category one hurricane on the Saffir-Simpson scale with 90 mile a hour winds. The hurricane has killed two people confirmed and is weakened to a tropical storm with an average of 45 mile and hour winds on the Saffir-Simpson scale. Hurricane Carlotta is planed to continue weakening of the next few days well it brings a large amount of rain to western Mexico. The hurricane is not forecasted to move much over the next few days. This is the 3rd tropical system and second hurricane so far in the pacific season which goes from May 15th to December 1st.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Microsoft's iPad (?)[/b][/color]\nYes, robust rumors are dribbling that Microsoft is to launch its own tablet on Monday. Many questions are being raised regarding this: will it be Windows 8? Will it have lovely tiles all over it? Will it have more GBs than Great Britain? Regarding the name, there has a few ideas, such as mPad, the SoftPad, the SoftTab, and the MicroPad. \n\n[color=white][b]Gold Ps3 Controller[/b][/color]\nSony Computer Entertainment officially unveiled the metallic gold Dualshock 3 controller for the PS3--due for release on October 19th. Launching exclusively through GameStop, the controller carries a hefty $54.99 retail price. \nHowever, we doubt that sum would stop the aspiring Auric Goldfingers of the world from getting one. We say this because its insanely easy to find most of the other PS3 controller colors sold online (and often at stores) for $40 or less.\n\n[color=white][b]Facebook[/b][/color]\nIn the wake of a rash of password leaks, Facebook wants to educate its members about how to make their accounts more secure and is asking for users' cell phone numbers as part of that effort.The social network has begun adding a message at the top of every member's news feed that suggests they \"Stay in control of your account by following these simple security tips.\" The message includes a link to Facebook's security page, where users are tutored on how to identify a scam and choose a unique password, and are also asked to provide a cell phone number where replacement passwords can be sent. It looks like Mark Zuckerberg, the CEO of Facebook wants his site to offer more security to it's users and their accounts--possibly to appease investors, due to the falling stock price.\n\n[color=white][b]Apple[/b][/color]\nMeanwhile, Apple has released two brand new Macbooks, namely, the Macbook Pro (with Retina Display) and the Macbook Pro (13/15-inch). These MacBooks include an Intel i7 processor in them, and as always, the price is a bit costly; it ranges around $ 2500 USD. But, it looks like a summer feast for all iDevice lovers.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Chris Brown Involved in Fight With Drake’s Entourage[/b][/color] Last night, at a New York City night club, artists Chris Brown and Drake reportedly had a verbal and physical fight. After the fight, Chris Brown had a deep gash on his chin and five other people were injured. Chris Brown later tweeted a picture of his gash following the fight, along with a message calling out Drake.\n\"How u party wit a rich n---a that hate? Lol…Throwing bottles like girls? #shameonya!” Brown tweeted. “N---a is p---y. Bottles? It’s nothing! Lol And I’m the singer?” N---a hiding in the bathroom b---h a-- n---a! Ok! N---a stand behind security!!! Ok! U don’t pay them enough! N---a throwing bottles! Y’all n----s weak!\"\nEven though Breezy and Drizzy have never had any public issues before, it has been reported that Drake has a thing with Rihanna, Chris' ex.\nSince no arrests or charges were made at the scene, the police are still investigating the matter.\n\n[color=white][b]Burglars Strike Kanye West's L.A. Home[/b][/color]\nThe LAPD were reportedly called to Kanye West's home by a member of his entourage when burglars were in his L.A. home. Kanye West wasn't at the scene himself since he is at the Watch the Throne European tour. It is currently not clear as to if and what items were stolen from West's mansion. The police as still currently investigating the break-in.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=SkTt9k4Y-a8&feature=g-music[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=QhDUSuLRQF4[/video]\n[video=youtube]http://www.youtube.com/watch?v=F15IjgyHd60[/video]\n[video=youtube]http://www.youtube.com/watch?v=A9_mfYPWF1w[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nAlright, I will get back to my own philosophical rants next edition, I just feel I should say some things first.\n\nρяιη¢є is our new Tech News writer\nMarkMare is our new Gaming News writer\nPhytrix and RDCA are both interviewers (for a total of three)\n\nI have also added\nPyroStorm as a proofreader, he will start on the next edition\nAvidWB as a webshow host\n\nThank you all for applying, I hope these new writers do their best!",
      "subject": "*"
    },
    {
      "pid": "23595540",
      "uid": "515249",
      "dateline": "1339901712",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you think of the new automated Ub3r system?\"\n\n[i]\"I believe that the new automated Ub3r System will stop people pestering \nOmniscient which ultimately gives him more free time to do stuff that will \nbenefit the forum in a far greater way. It's actually a well advanced but fairly \nsimple way of automating it and you get a straight answer from it once \nOmniscient has checked it which makes it more easier and a lot more fair.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=330676][i]-Diabolic[/i][/url]\n\n[align=right][i]\"What I like best about the automated Ub3r system is that it \nreally weeds out the people who don't help around the community. Omni posted \na thread about and threw up some numbers which surprised me, he rejects \nmore people than he accepts because of the new plugin.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=429652][i]-Toasted[/i][/url][/align]\n\n[i]\"I don't like the option because it means that anyone can apply for ub3r just \nlike that. By actually PM'ing Omniscient an application, the applicant has to prove \nthat they are worthy enough opposed to the member just simply clicking the \n'Apply' button. Omniscient probably briefly looks over the members profile and \ncould be mislead into thinking they are a HQ member which they could not be. \nThis could actually waste a lot of time for Omniscient and I'm sure he's very busy \nwith other stuff like decreasing downtime and working on other plugins etc.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=931610][i]-Hello Friends[/i][/url]\n\n[align=right][i]\"I think that the new Ub3r system is a great addition to the forum. It \nobviously saves Omni a lot of time, of which he can input int further improving the \nforum. It must give him a little more sleep, and help with file management also. It's \nalso better for forum members, as they don't have to worry about recording their \napplication dates, if disapproved.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][i]-Phytrix[/i][/url][/align]\n\nThe topic for next week is \"Which group do you believe is most integral to Hack Forums? Minus the moderator groups--Admin, Moderator, Mentor, Staff.\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iEXDdbnIYL0Ym.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://b4c0n.com/i/2239f.png[/img][/spoiler]\n[spoiler=][img]http://b4c0n.com/i/ec254.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=z_uilIOAvqM[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=379282][b]Bok1ca[/b][/url] purchased the Brony award. As if his user name wasn't gay enough!\n\n[b]Group Leadership Changes[/b]\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://goo.gl/nN5aK]RDCA[/url]\n[*][url=http://goo.gl/eswtU]SoulZeh[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/iIaDf]PyroStorm[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}