{
  "posts": [
    {
      "pid": "16595649",
      "uid": "515249",
      "dateline": "1318822932",
      "message": "[align=center][img]http://goo.gl/wijPX[/img][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]63rd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. Again I will say that Cobalt+ will be returning for the next edition, he was just too tired to get it all together this week.\n\n[align=center][url=http://hackforumsnews.com][size=large][b]Hack Forums News Website[/b][/size][/url]\n^Click the link to be redirected to www.HackForumsNews.com^\nJust in case you didn't see the User News, I would like to introduce you to our new website!\nThis is a joint venture between Cobalt+, .edit, and I.\nWe hope you enjoy!\n\nFor anyone interested in THL's little project, he is running a [url=http://twitter.com/#!/hackforumsnews]twitter[/url].\n[/align]\n\n[align=center][img]http://goo.gl/wwafo[/img][/align]\nThis week our fellow administrator [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#00BFFF][b]Judge Dredd[/b][/color][/url] was compromised. This meaning that his account was stolen. Luckily nothing had happened during the time the account was stolen. As of now we are unsure who did this unspeakable act, but the person who did made an account known as [url=http://hackforums.net/search.php?action=results&sid=46bbe4c2858dcf4ac480f060ec572ca7][color=#696969][b]Judge Dredd Hacked[/b][/color][/url]. He/she made a thread explaining everything he/she did, including pictures. You can view that thread [url=http://hackforums.net/showthread.php?tid=1818530][b]here[/b][/url]. A statement has been released by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] stating, \"[url=http://hackforums.net/member.php?action=profile&uid=4066][color=#00BFFF][b]Judge Dredd[/b][/color][/url] account stolen and recovered. Tweeting for historical reference. His account is secured and no damage was done to HF.\" Hopefully everything can stay that way.\n\nAs we realize this is older, it does need to be realized if it hasn't yet. Some of you now know that you can no longer 'stalk' an administrators profile. Now it has been updated so that not only can you not view administrators profiles, but you can now no longer view any staff members profile. This goes for anyone with staff userbar. You can view our fellow staff members [url=http://hackforums.net/stafflist.php][b]here[/b][/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] had a premonition about the user who hacked Selena Gomez's facebook being caught. As of October 12, 2011 this user was discovered by the police and has made a $10,000 bail. He is awaiting trial and is facing up to 121 years in federal prison. If you are interested in hearing more about this story [url=http://hackforums.net/showthread.php?tid=1818567][b]click here[/b][/url].\n\nWe have recently found out that the image hosting commpany [url=https://minus.com[b]min.us[/b][/url] has been blocked from usage here on Hack Forums. The main reason given is Avast has added minus to their domain blacklist. So now it has been censored until the issue is fixed. Many people contacted Avasts developers to correct the issue. Hopefully, it will be fixed soon.\n\nThe HF news team is recruiting for the first time! We are accepting interviewers only, you can apply [url=http://hackforums.net/showthread.php?tid=1825326][b]here[/b][/url]. Please take your time and be aware that we are only accepting two interviews. We only want serious members willing to work and apply themselves to the news team!\n\n[align=center][img]http://goo.gl/qBj6w[/img][/align]\n\n\"Do you think the vouch system will improve the quality of the Marketplace?\"\n\n[i]\"I think that, at first, the vouch system will be a good thing. People will use\nit to it's original purpose, and for the first ~ month it will be fine. After that initial\nmonth, I suspect that people will start communicating off-site and tit will start\nto become corrupt. People will do deals with each other, for the simple point of\nraising their vouch level. In the end, i think it may end up like the Reputation\nsystem; which is to say, corrupted by some members.\"[/i]\n[url=hhttp://goo.gl/S9Xxg][i]-+Pirate[/i][/url]\n\n[align=right][i]\"The vouch system will most likely improve the Marketplace. It\nwill have a unique affect on the scammers. But, I can assure everyone reading\nthat there will be less threads in the [url=http://hackforums.net/forumdisplay.php?fid=111]Deal Dispute[/url] section. Of course the vouch system\nis not going to stop scammers, but it will give us a warning. If anyone haven't\nnoticed, [url=http://goo.gl/veb4E]Time[/url], the owner of the group \"Haunter Gang\" has been banned\nfor disputing [url=http://hackforums.net/member.php?action=profile&uid=1]Omniscient[/url]'s payment. That just shows how trusted members\ncan go straight out & scam anyone. Member \"Claim\" to having there account\nhacked, but I think that they logout from their original IP address & use a public\nproxy and scam members. Then when they get banned, the next day they send\n[url=http://hackforums.net/member.php?action=profile&uid=1]Omniscient[/url] a email saying \"Oh my god, can't believe I was hacked, blah, blah, blah\".\nThey then get right back into the forums. So this is another good idea for the vouch\nsystem. I know it may cause some confusion against two different reputations on your\nprofile, but sooner or later, user's will be pro's at it.\"[/i]\n[url=http://goo.gl/3fcaX][i]-Genuine[/i][/url][/align]\n\n[i]\"The marketplace has been for lack of better words \"corrupt\" for awhile, users\nwith high rep have been considered trustworthy when they are not. Evidence of\nthis can be seen by strolling over to the deal disputes section, nearly half the threads\nsay \"scammed by Ub3r\" upgraded members with high rep are treated with great\nrespect (as it should be) but you cross the line of stupidity when you assume that if\nsomeone can pay $40 for an upgraded account that he is automatically a trustworthy\nuser. So, to answer the question, yes I think it will help the users who are ignorant\nenough to trust people solely based on rep and them being upgraded. Now, I don't\nknow the specifics of the vouch system but in my opinion the ultimate option would\nbe to make it similar to an ebay feedback system, where every transaction is logged,\nand feedback is left within a 7 day time period. This wont happen because it is to\ncomplicated to implement on a forum, and lets face it this isnt ebay, its a forum of people\nselling virtual goods, so there is bound to be scammers. Going back on topic, I do hope\nthat rep remains, and will be displayed in the remainder of the forum (not marketplace)\nand the \"vouch system\" will only be displayed in the marketplace. This keeps business\naffairs and personal affairs separate, the way it should be.\"[/i]\n[url=http://goo.gl/yAsQU][i]iceberg11hack[/i][/url]\n\nThe topic for next week is \"What do you think about the free groups getting removed?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[size=large][b]Alright, so here is where I will write my little \"memoir\":[/b][/size]\nI guess I'll start with the beginning. Anyone ever heard of Minecraft? Of course. I was on Minecraft Forums looking for a new server to play on. After many attempts, I finally found NexusRP which was run by [url=http://goo.gl/hSRyk]RadarX[/url]. I then found them talking about \"HF this\" and \"HF that\" eventually I just asked what HF was. Thoth then told me that it was \"Hack Forums\". Excited, I went to this website and made an account under the user \"Elysianman\" which was also my Minecraft username. For quite a while, I stayed in the Minecraft section, before it became \"Me Getz Accountzors Plox?\" and dropped in quality. The Minecraft section used to be my home, it was great. Then I saw the Reviewers were recruiting. After writing an intense review, I received my big break. I was invited to the Reviewers where I still stand today. From then on I started to go broader and eventually wrote the Gamers News back when there was still a Gamers group. Once I had been doing it for a while, Qwazz contacted me asking if I would like to do the User News. Of course I accepted. Many editions I wrote the User News until my trip to Europe over the summer. Upon my return, I found that Qwazz was turning over the news to Cobalt+. Then came the \"Hostile Takeover\", which was a pain in the ass and a stressful experience, to respond, Omniscient made the Writers (which has apparently been an idea for quite a while, the fiasco just pushed him to create it). We are hoping to do many things and improve the quality of the news immensely, in all honesty, we are waiting on Omniscient. People think that we are just being lazy and not changing things, but we are waiting patiently for our setup to be arranged and our abilities enlarged. Over much of my experience with the news I have devoted large amounts of my time to the and had to defend it against many people. One thing I can say, is a lot of those same people who attacked the news are now good friends of mine. After we talked on skype a bit, they really got to know me and saw how the shit they left on the news threads actually hurt more than helped because we had to deal with them instead of just do the news and move on. I hope everyone can come to love and respect the news. Thank you for reading, if any of you did.\n[size=large]\n[b]My Feedback:[/b][/size]\nSince this is my one year anniversary on hack forums or my \"HF Birthday\" I thought I might give some feedback or thoughts that have come with my experience.\n[b]Omniscient:[/b] Although I doubt you will ever even read this, I just want to say these things. I realize that it is stressful and time consuming to run hack forums and for that I thank you, but sometimes, you need to focus on the members that also devote their time. This isn't me saying \"focus on me\" but rather that for those who provide a service and spend large portions of their time giving back to the community, you should hear their thoughts and needs. The News team does this, yet has to fend off trolls and rude members as their reward. Now we aren't asking for any recognition, as posting it is enough, but maybe a little backing or when we are asking for some help to get things together, we'd love some of your time. Still, thank you for allowing us to keep the HF News.\n[b]Members:[/b] If you have a problem with the news, it is our hope that it can be spoken through constructive feedback and not flame wars. While it doesn't mean your suggestion will get used, we do enjoy reading your opinions and thinking on them.\n\n[align=center][img]http://goo.gl/JZcco[/img][/align]\nFor you Indy 500 fans, the two time winner, [url=http://goo.gl/5kwtu][color=#FFDAB9]Dan Wheldon[/color][/url], was killed in a crash involving multiple cars. This is heart crushing for any racing fans. The racers involved in the crashed were no doubt very emotional about the death of their opponent and friend. In honor of Dan, racers slowly did 5 laps while Amazing Grace was played. While deaths are expected for such a dangerous sport, no one can really prepare for the death of their loved one. Whether or not you liked racing, any death should be respected. Rest in peace. You can read more [url=www.cnn.com/2011/10/16/us/indycar-crash/index.html?hpt=hp_t1][color=#FFDAB9]here[/color][/url].\n\nLet's hope if you have kids they don't watch Sesame Street on YouTube. The reason? Recently, the children's show [url=http://www.youtube.com/sesamestreet][color=#FFDAB9]Sesame Street's YouTube[/color][/url] was hacked. Normally this isn't a big deal, but the big deal about this particular hacking was that pornagraphic material was uploaded to the channel. Shortly after, YouTube suspended the channel due to terms of service violations. The culprit hacker is unknown as of now, but the search continues. You can read more about this incident [url=http://goo.gl/l5WtH][color=#FFDAB9]here[/color][/url].\n\n[align=center][IMG]http://i.imgur.com/WtmSo.png[/IMG][/align]\n[align=center][img]http://goo.gl/y5zND[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Tasemu[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hello Tasemu and thank you for this interview. To start this interview off are there any shout outs you'd like to give?\n[b][color=#0066FF]Tasemu[/color]:[/b] Gday, thanks for having me. Id love to give a shout out to Black Hole, Happeh, Okazaki, Bamfon, Fox, Bugga, Nyx- and all the other regulars in Anime Adventures. ^^\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you find hackforums?\n[b][color=#0066FF]Tasemu[/color]:[/b] I found hackforums back in 09. I was interested in learning to hack like I'm sure many of the members who joined here were. I've never been an active member of a forum before and they didn't really interest me. Hackforums was the first community to drag me out and make me want to contribute back and this was definitely, because of the members and friends I have made.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you get so talented in graphics?\n[b][color=#0066FF]Tasemu[/color]:[/b] Well I started doing graphic design on hackforums. I wanted to make myself a signature and be unique. I got some decent feedback and this started me wanting to make more and more. Within months I was making roughly 7-8 signatures a day. After a long time I started developing my own styles and techniques, people began offering money for my work and I got my award shortly after. Since then I have been studying for my Bachelor in Graphic Design and I can easily say that the reason I chose this career is my experiences on HF.\n\n[b][color=#0066FF]Reported[/color]:[/b] When did you first discover and like anime?\n[b][color=#0066FF]Tasemu[/color]:[/b] I first discovered I loved anime when I was around five or six. We used to live out in the middle of the Australian bush so we had no television reception and only an old VCR player. Mum brought home an anime film called \"Ninja Scroll\" from her boyfriends thinking it was a cartoon. Ever since then Playschool just didn't cut it for me.\n\n[b][color=#0066FF]Reported[/color]:[/b] What gave you the idea for the AA Radio?\n[b][color=#0066FF]Tasemu[/color]:[/b] AARadio was in the works for quite a while before it was released on hackforums. I originally got the idea because of the threads made in Anime Adventures where members would share their favorite anime soundtracks, opening themes and jpop/jrock. The concept behind AARadio was to allow members to listen to the same music at the same time, chat, take part in competitions and also upload their own songs. The radio is a great success but I won’t deny that we have a fair few copies of Rick Astley floating around the playlist from members. ^^\n\n[b][color=#0066FF]Reported[/color]:[/b] How long have you been doing anime?\n[b][color=#0066FF]Tasemu[/color]:[/b] Since I was 6, never stopped and never will. At least 13 years so far.\n\n[b][color=#0066FF]Reported[/color]:[/b] When you were a beginner in graphics did you ever think you’d get this far and are the graphics you make challenging or time consuming?\n[b][color=#0066FF]Tasemu[/color]:[/b] When I was a beginner I never thought I would stick with GFX. It was always something I did when I was bored or randomly inspired to create something meaningful. Before I knew it years had gone by and it influences everything I do. The real point of no return was when I realized that if I wanted to get any better than I was I would have to dedicate my career to it. That was when I made the decision and went to a private university for graphic design. I rarely find my work challenging because once I start it just flows out of me and I don't realize that hours have passed. That also answers your other question, on some of my biggest works I have spent over 2-3 days working with only breaks for eating sleeping and lots of coffee.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you see yourself as an \"expert\" in anime?\n[b][color=#0066FF]Tasemu[/color]:[/b] Yes, if anyone ever wants recommendations for any genre feel free to shoot me a PM. I make it my mission to show people that anime extends beyond Naruto.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you have any special anime projects coming out soon?\n[b][color=#0066FF]Tasemu[/color]:[/b] I always have something in the works, I want to extend the Otaku Handbook even further, but I’m needing to contact staff every time I edit it. Currently I am making weekly threads very similar to HF News where I cover important things happening in the anime industry as well as interviewing members new to the Anime Adventures section so we can learn more about them and hopefully they feel included and want to contribute back to HF.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you have any friends on hackforums?\n[b][color=#0066FF]Tasemu[/color]:[/b] Yep, most of my mates into graphic design have long since disappeared but a few are still around. I spend all my time nowadays working towards the expansion of the Anime Adventures section. Everyone in AA is close, there is a sense of friendship and trust in AA that you don’t see in many other sections on HF. I consider everyone on HF a mate as long as they don’t troll haha.\n\n[b][color=#0066FF]Reported[/color]:[/b] What are your best graphics?\n[b][color=#0066FF]Tasemu[/color]:[/b] Well I have lost some of my older stuff but here are some of the few I really enjoyed making.\n\n[b]Paintings:[/b]\n\n[b]Large Arts:[/b]\n[code]http://i432.photobucket.com/albums/qq50/tasemu/save_me-1.png[/quote]\n\n[b]Signatures:[/b]\n\n[b][color=#0066FF]Reported[/color]:[/b] Why haven't you applied for the group graphic masters?\n[b][color=#0066FF]Tasemu[/color]:[/b] Uhm.. Well, I like some of the members of GM a lot, most of the people are really cool blokes. GM is a very competitive group and when it comes to graphic design I’m happy to chill on the sidelines away from the spot light and make what I love in peace. If the occasional person likes my work then so much the better.\n\n[b][color=#0066FF]Reported[/color]:[/b] Is there anything else you plan on learning for graphics?\n[b][color=#0066FF]Tasemu[/color]:[/b] Well I want to finish up my 3D design classes, but after that I’m going to try focusing more on the business and client management side of graphic design for a while.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you come up with your username “Tasemu”?\n[b][color=#0066FF]Tasemu[/color]:[/b] When I was a kid we had code names among friends. I guess mine just stuck. I even have it printed on the dog tags I wear. 🙂\n\n[b][color=#0066FF]Reported[/color]:[/b] What gave you the idea of your signature?\n[b][color=#0066FF]Tasemu[/color]:[/b] I wanted something that would catch peoples eyes and keep them there. Something colorful and mysterious. As I was messing around in Photoshop and it just sort of happened so I went with it and finished with that signature. Though I always get requests for people wanting me to change it back to the lesbian twins.\n\n[b][color=#0066FF]Reported[/color]:[/b] What program(s) do you use for your graphic’?\n[b][color=#0066FF]Tasemu[/color]:[/b] Adobe Photoshop, Fireworks, inDesign, Illustrator and Paint tool SAI.\n\n[b][color=#0066FF]Reported[/color]:[/b] Now to wrap this interview up is there anything you'd like to say?\n[b][color=#0066FF]Tasemu[/color]:[/b] Just thanks for the interview, it was good fun going back through some of my early stuff to find work. Appreciated.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Quantum.[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hellow Quantum. and thank you for accepting this interview. To start this interview off would you like to make any shout outs?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Thank you for taking the time to interview me\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you find hackforums?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] My friend revoke told me about it but I don't speak with him much anymore though.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you have any close associates on hackforums you call friends?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Yeah, Codevade and DiscipLе but they're the only ones I really talk to alot outside of hackforums\n\n[b][color=#0066FF]Reported[/color]:[/b] What do you think about Judge Dredd's account being compromised?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] I only found out today and as long as nothing was done to harm hackforums then I don't have much to say.\n\n[b][color=#0066FF]Reported[/color]:[/b] What do you think about the HF user Prokill being arrested and going to trial and possibly facing life for hacking?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] I was quite shocked when I saw the thread I also think that the max sentence he is facing is way to high.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you enjoy being a moderator?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] It's good being a moderator and it has it's perks obviously\n\n[b][color=#0066FF]Reported[/color]:[/b] What are the negatives from being a moderator?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Not having basic permissions like move thread ect.\n\n[b][color=#0066FF]Reported[/color]:[/b] If you could change one thing that began, because you're a moderator what would it be? For example, Less spam PM's, Less flame, Less kids saying \"F-U!\", Less responsibility, More work, etc.\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Nothing, I have enjoyed my stay here and as all sites they have their ups and downs.\n\n[b][color=#0066FF]Reported[/color]:[/b] Why did you receive the ass kisser award?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Now that would be telling.. :)\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you sell your signature to be advertised in?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Yes.\n\n[b][color=#0066FF]Reported[/color]:[/b] How many people PM you weekly asking you to advertise their thread, website, profile, etc. in your signature and what's the minimum price?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Not many actually. and I do $10 Per week\n\n[b][color=#0066FF]Reported[/color]:[/b] What do you think about the rumor going around saying \"The Rated R Superstar will be promoted to administrator\"?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Haven't heard anything about the rumor.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you think the reputation reset will make your job easier? Since you moderate some marketplace forums? Especially the Deal Disputes forum.\n[b][color=#AAAAFF]Quantum.[/color]:[/b] In most cases yes but as the hackforums rules stand, Hackforums can't do anything about bad deals made here\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you mind explaining how exactly it's possible the moderator of the marketplace forum can receive a warning for a marketplace violation? Did you remove a thread or close a thread on accident or something?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] It was a small mistake. I posted on a sales thread linking to somebodies open deal disputes. I don't agree with the warning but rules are rules.\n\n[b][color=#0066FF]Reported[/color]:[/b] Now to wrap this interview up. Is there anything you'd like to say before this interview ends?\n[b][color=#AAAAFF]Quantum.[/color]:[/b] Read the help documents.\n[/spoiler]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n[url=http://goo.gl/7M6h9][img]http://goo.gl/bT3g8[/img][/url]\n[align=right]\n[url=http://goo.gl/XNOmD][img]http://goo.gl/2frWD[/img][/url][/align]\n\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]",
      "subject": "[10/16/11] - HF News"
    }
  ]
}