{
  "posts": [
    {
      "pid": "14352859",
      "uid": "0",
      "dateline": "1312598576",
      "message": "[align=center][img]http://i.imgur.com/T9beq.png[/img][/align]\r\n     \r\n    The edition you are currently reading is the [b][color=#bad245]53rd full edition[/color][/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n     \r\n    [align=center][img]http://i.imgur.com/VPXBe.png[/img][/align]\r\n     \r\n    Some of you might not know, but [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#4DD0FC]Omniscient[/color][/b][/url] is the owner of 420forum.net and 420forums.net; and now he has even bought the domain 420forum.com. He is pretty happy about this new grab and is planning to get all this weed discussion off HF. You can read more about it [url=http://hackforums.net/showthread.php?tid=1549577][b]here[/b][/url].\r\n     \r\n    [url=http://hackforums.net/member.php?action=profile&uid=277712][b]Cobalt+[/b][/url] is now the leader of the HF News Team. He will be the Publisher and Head Writer from now on.\r\n     \r\n    The official groups [b][color=#FFFFFF]Techsperts[/color][/b] and [b][color=#1E90FF]Reviewers[/color][/b] have started recruiting once again. If you would like to apply, their recruitment threads can be found [url=http://hackforums.net/showthread.php?tid=1278242][b]here[/b][/url] and [url=http://hackforums.net/showthread.php?tid=1544652][b]here[/b][/url] respectively.\r\n     \r\n    [url=http://hackforums.net/member.php?action=profile&uid=588781][color=#AAAAFF][b]Hуѕтєяιa X™[/color][/b][/url] is now appointed as the moderator of the [url=http://hackforums.net/forumdisplay.php?fid=37]Melody, Harmony, Rhythm and MP3[/url] section of HackForums. We wish him a hearty congratulations and best of luck with his newly added responsibilities.\r\n\r\nWant to help with the HF News? Well, after a small kick, we are recruiting again! Apply [url=http://hackforums.net/showthread.php?tid=1535280]here.[/url]\r\n\r\n     \r\n    [align=center][img]http://i.imgur.com/EHUGP.png[/img][/align]\r\n     Tragically, [url=http://hackforums.net/member.php?action=profile&uid=661940][color=#0066FF][b]bugga[/b][/color][/url] has suffered a severe car accident. She was on her way to spend some time with [url=http://hackforums.net/member.php?action=profile&uid=30595][color=lime][b]The Rated R Superstar[/b][/color][/url]. Attached to her vehicle was a horse float. When a truck went to pass her vehicle, it clipped the float. While the float was tipping, the anti-theft bar prevented the float from coming off by itself, so her vehicle flipped with the float. The bar eventually broke leaving her vehicle to flip about 5 times. The truck driver left her hanging there with her legs squished. A nearby elder couple saw the accident and called for help. When she was cut out of her car, she was flown to Sydney for intensive care with a broken rib which made a small puncture in her lung, a few bruised ribs, some fractures in her leg and a fractured cheek bone due to the air bags. We are glad that she is much better now, and hope for her to continue to heal.\r\n\r\n    After having the Master Donator removed from his award list, [url=http://hackforums.net/member.php?action=profile&uid=63387][color=#0066FF][b]Black Shadow[/b][/color][/url] has managed to be added to the list of Master Donors once again. Such donations are what keep Hack Forums alive; we thank him for his generosity. To see a full list of the Master Donators, click [url=http://hackforums.net/myawards.php]here[/url].\r\n     \r\n    Do you think it is hard to rap about HF? Well clearly this user doesn't. [url=http://hackforums.net/member.php?action=profile&uid=766449][color=#FFD700]Black Chaos[/color][/url] has released a neat little song about HF's Trolls and Flamers. If you would like to see it click [url=http://hackforums.net/showthread.php?tid=1533978]here[/url].\r\n     \r\n    Yet another big accomplishment by another HF member. [url=http://hackforums.net/member.php?action=profile&uid=58642][color=#0066FF][b]нα¢кєя[/b][/color][/url]  has manage to find vulnerabilities in Facebook, Google, and a Microsoft website. Read more about it [url=http://hackforums.net/showthread.php?tid=1540179]here[/url].\r\n     \r\n    This week [url=http://hackforums.net/member.php?action=profile&uid=431105][color=#0066FF][b]Tɦɛ Gʀiɱ[/b][/color][/url] reached 1,000 reputation points. Only seventeen members in total have achieved this, that being said it's quite an accomplishment.\r\n     \r\n    [url=http://hackforums.net/member.php?action=profile&uid=657392][b][color=#AAAAFF]Astonish is NJ[/color][/b][/url] has finally captured what he has been waiting for the Cool award. If you would like to see the full list of these cool members click [url=http://hackforums.net/myawards.php?awid=25]here.[/url]\r\n     \r\n     \r\n    [b]This weeks Bans & Repfucks.[/b]\r\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=344143][color=black][b]Crayo[/b][/color][/url] has been banned. \r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=542851][color=black][b]Ωмεɢα[/b][/color][/url] has been ban for posting a member DOX site.\r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=148750][color=black][b]Paki Hacker[/b][/color][/url]  has been ban for posting a member DOX site.\r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=274613][color=red][b]Яǝʌǝɹsǝ[/b][/color][/url] has been limited for posting Adult Content.\r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=689024][color=red][b]Cystomatic[/b][/color][/url] has been limited.  \r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=154890][color=#0066FF][b]iMario[/b][/color][/url] requested to be banned while on vacation.  \r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=582964][color=#0066FF][b]Megan Foxxx[/b][/color][/url] requested to be banned while on vacation.\r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=182754][color=black][b]Orgy[/b][/color][/url] has been banned for stating that staff was corrupt.\r\n    [*][url=http://hackforums.net/member.php?action=profile&uid=416897][color=black][b]EctoPlasm[/b][/color][/url] has been banned for Re-posting threads after staff removed them.[/list]\r\n     \r\n     \r\n    [align=center][img]http://i.imgur.com/Ks7pe.png[/img][/align]\r\n     \r\n    [IMG]http://i1210.photobucket.com/albums/cc404/BlackChaos619/iconapple.png[/IMG] One of the most popular news items this week is the recent discovery that Apple has more money than the U.S. Government. After the recent wave of debts, the U.S. Treasury's cash reserve fell to $74 billion, but Apple stays strong as ever with a whopping $76 billion. It's not really common, but its not unlikely that the U.S. Government would ask Steve Jobs for a loan. I mean, it wouldn't be the first time.\r\n    For more information on the Clash between Uncle Sam and Steve Jobs, you can check out [url=http://www.latimes.com/business/la-fi-apple-cash-20110730,0,6198166.story]this article in LA Times[/url].\r\n     \r\n    [IMG]http://i1210.photobucket.com/albums/cc404/BlackChaos619/iconnet.png[/IMG] Oh, this one is a good one for you browser junkies. On a recent survey by AptiQuant, a web consulting company, they handed out IQ Tests to more than 100,000 participants monitoring which browser they preferred to use to take the test.\r\n    The result was, in a word, unexpected and at the same time, not shocking. Internet Explorer users scored lower than average, while Chrome, Firefox and Safari users were slightly above average. But surprisingly, users of the more obscure Camino and Opera browsers, as well as those using Explorer with Chrome Frame, had what AptiQuaint called \"exceptionally higher\" IQ levels.\r\n    To read more about this, check out [url=http://edition.cnn.com/2011/TECH/web/07/29/internet.explorer.dumb/index.html?hpt=hp_c2]the article on CNN[/url].\r\n     \r\n    [IMG]http://i1210.photobucket.com/albums/cc404/BlackChaos619/iconmoon.png[/IMG] And one of the biggest events of the week is the arrival of Ramadan, an auspicious month for Muslims. The ninth month of the Islamic lunar calendar, it's marked by the rise of the full moon as a signal to all Muslims around the world. During the month of Ramadan, Muslims all over the world abstain from food, drink, and other physical needs during the daylight hours. For more information on this, you can have a look [url=http://islam.about.com/od/ramadan/tp/ramadan-hub.htm]at this site[/url].\r\n    The HF News Team wishes all Muslims in the community a safe fasting and Ramadan Mubarak.\r\n     \r\n    [align=center][img]http://i.imgur.com/AMw16.png[/img][/align][hr]\r\n    [color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - Cobalt+[/font][/size][/color]\r\n    [spoiler=]\r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Hello Cobalt+, and thank you for participating in the 50th edition of the HF News. Would you like to make any opening statements?\r\n    [b][color=white]Cobalt+:[/color][/b] I'd like to thank you for interviewing me and Qwazz for allowing me to take over the HF News.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Well I am happy you took it over. Let hop right into it now. Why did you join HF?\r\n    [b][color=white]Cobalt+:[/color][/b] When I was on a class field trip, one of my friends showed my HF, and I didn't seem all that interested in it, but after like a month after, I decide to join HF. I really had no expectations for the site, and I had no idea what to expect.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Who was your first friend on Hack Forums and how did you get to become friends with him?\r\n    [b][color=white]Cobalt+:[/color][/b] I'm not exactly sure to be honest. I made some connections in the Human Manipulation forum with Clockwork, but I can't really remember my first friend. If I had to guess, I think it was some guy called \"BlueSocial\".\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] If you had to pick one person to give the Member of the Month award to, who would it be?\r\n    [b][color=white]Cobalt+:[/color][/b] It may just be me, but so far, no member has shown any extreme quality in the past month. If anyone I would say panDa. because he already did get it.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Well, how did you get involved with the HF news?\r\n    [b][color=white]Cobalt+:[/color][/b] Well I remember reading all of Yin's editions and The Elite's editions. The Elite made an HF News Crew, so I tried to join it, but he didn't allow me, then I wrote the edition after VanCliffe's edition because xerotic let me. A lot of people thought it was really thin, because it was, and I didn't have a lot of time put into that revision. Then like a month went by before Qwazz did the HF News, and he made a new team and I didn't even know it until I looked, but I was on it, so I started writing in the news from there.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Before you were recently granted Head writer, how did it feel to be on the team?\r\n    [b][color=white]Cobalt+:[/color][/b] Well I wasn't happy with how people were just thanking Qwazz, so each time somebody thanked Qwazz; I made sure they thanked the Team instead. Eventually people started thanking the team.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] How does it feel now to lead the HF news team?\r\n    [b][color=white]Cobalt+:[/color][/b] Well so far it feels pretty good. I've gotten at least 10 PMs congratulating me. I hope my edition will be superb.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Well so far you are doing a great job; I know you are really good at graphics. How did you get involved with the whole GFX thing?\r\n    [b][color=white]Cobalt+:[/color][/b] I remember doing a lot of weird logo things in Google Picasa, and then later I wanted to advance my skills, but I was big on the whole torrented software thing, so I got Paint.NET. I actually got into Graphic Masters using Paint.NET. Just before the massive GM kick, I switched to Photoshop. I advanced my skills while I was out of GM. I applied for Graphic Master using Photoshop, and I got in this time. Now I am the only person to have bought a sticky for a GFX service in the GFX Services forum. I have bought it twice.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] If you were giving the chance to lead one group on HF, which group would you want to lead?\r\n    [b][color=white]Cobalt+:[/color][/b] I would lead the only group that I know a lot about-Graphic Masters.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] That would be cool. What one piece of advice would you give to a new user joining HF?\r\n    [b][color=white]Cobalt+:[/color][/b] Don't fall into the depth of the lounge.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] That is a good idea. Well this went fast, but time to wrap it up; do you have any shout outs?\r\n    [b][color=white]Cobalt+:[/color][/b] No more than the arbitrary ones to Omni, Staff, etc.\r\n     \r\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Alright, thanks for this interview!\r\n    [b][color=white]Cobalt+:[/color][/b] Thanks for interviewing me. :D\r\n    [/spoiler]\r\n[hr]\n    \n    [color=deepskyblue][size=large][font=Monotype Corsiva]Interview 2 - Cam G[/font][/size][/color]\n    [spoiler=]\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Hello Cam G, and thank you for participating in the 53rd edition of the HF News. Would you like to make any opening statements?\n    [b][color=#0066FF]Cam G:[/color][/b] Well for starters I'd like to say hi I'm Cam G, on HF and off HF, for those who don't know me.  Apart from that, let's get started  .\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Lets jump right into it, why did you join HF?\n    [b][color=#0066FF]Cam G:[/color][/b] Well it's a story I've seen from others as well that's happened to myself. In short, a couple years ago or so, I was playing the game Counter-Strike Source. I had this friend called OneManArmy who always somehow managed to make people and CSS servers lose their connection. This made me curious and confused at the same time. I was 15 or 16 then, I hadn't really taken an interest in anything computer related, overall I just went on to play games, RTS, FPS, RPG, you name it. So I met this guy who was able to take things offline. I can't even explain why it interested me so much. I wasn't interested in doing exactly what he did, I didn't feel I needed an unfair advantage over other players on an internet game, but in a way just learning how to do it interested me. I asked my friend how he did it. He proceeded to tell me just about DoS attacks (not DDoS), and gave me this DoS tool which was called Ping of Death. At the time I had no idea what I was doing, no idea what a DoS attack was, but it still intrigued me. Eventually I forgot about it after a while, until about a year later after that one of my good friends who's on HF as well (DESU), that I've known for I believe over 7 years, told me about HackForums, and how you could learn about things that I was interested in such as DDoSing, DoSing, coding, keylogging etc. He joined a bit earlier before me, showed me where to sign up, so here I am.\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Who was your first enemy on Hack Forums and how did you get to become enemys with him?\n    [b][color=#0066FF]Cam G:[/color][/b] I wouldn't really call him an enemy, because I sort of laugh back at it now and realize he was right, but the person that had an issue with me was Irtehleet. I imagine if he reads this he won't even remember, but the story goes something like this. Cam G is not my first HF account, my first HF account was merged whilst Omniscient was offering to merge people's accounts a few months back. I honestly don't remember the exact name of my first account, but it was something like Senators1992 (favorite hockey team). Anyways I was the kind of member asking all sorts of questions, and I can understand that I must've gotten on some people's nerves. Irteheleet included. He ended up negative repping me saying I make stupid posts or something, and I got a little upset. Again I wouldn't chim an enemy, on the contrary I actually like him, I think iRtehLeet™ is a great member, and after that incident I decided to make a new HF account, tried not to make stupid posts and sort of just \"shadow\" and learn, rather than post a lot. Again, I hold no grudge, anger or anything towards him, that's just the first time I remember something that sort of upset me. (Yes I guess you could call me\n    a rep whore at the time)\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] Well now you have been here since 2009. Have you seen a change in the forum, if so how?\n    [b][color=#0066FF]Cam G:[/color][/b] I can't really give a direct answer to it, because even though the forum's changed, I've changed as well. Sections I used to post in a lot, I no longer visit. I suppose yes the forum has changed, I think in both a bad and good way. I know there will always be the people who say the forums changing for the worse, the days of old HF when I hadn't even joined were the best etc. To be honest I sort of\n    stay neutral within the whole situation. To answer more directly, yes the forum has changed. I've seen members I've liked go, members I've disliked go, as well as obviously forum updates, new members joining and so on. I honestly don't mind change, I think it's good as long as we're going forwards and not backwards.\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] If you had to pick one person to give the Member of the Month award to, who would it be?\n    [b][color=#0066FF]Cam G:[/color][/b] Right now I'd have to pick -BoodyE-. I've been fairly inactive the past few months, I've sort of gotten on HF each day or every couple days, posted a bit, maybe done a review or two, checked out the Wraith subforum and gotten off. He was recently promoted to Reviewer Leader, and he's the one member I've noticed during my inactivity that's been doing a great job as a new leader. Kudos.\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] What made you apply for the Reviewers and The Wraith?\n    [b][color=#0066FF]Cam G:[/color][/b] or the Reviewers I'd say it was one of the few groups in HackForums that felt like the group for me. I've always been the kind of person who likes producing quality (trying to I hope it's working), writing reviews, and stating my opinion. A professional group that serves HackForums. I believe in the next 2 weeks it'll have been a year since me and I believe 2 others (Biohazard and Honest) got in, making us the oldest surviving reviewers aside from Skill and Paradoxum. As for the Wraith, it all started off in the SRPP section. It was at the time when The Wraith would post their weekly questions to users in the section, and a best answer to the questions were picked. I was always intrigued and enjoyed answering the questions, and even got the best answer a couple times. A while after they stopped doing that, but I checked out the recruitment thread to see what\n    they were all about, and again it was just another one of those groups that I thought would be a good fit for me. It's a great bunch of people in The Wraith, a group I'd never dream of leaving.\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] How do feel being in the Reviewers the longest out of every current member?\n    [b][color=#0066FF]Cam G:[/color][/b] Well along with Biohazard and Honest, I suppose it's kind of cool. I've seen a lot of members come and go, all great people. I'm always excited when recruitment opens up, as I think it's nice to see new faces in the group as well. Being a reviewer for this long (a year) ,  I suppose you could say feels somewhat like an accomplishment, and I hope to be able to continue reviewing for years to come.\n\n    [b][color=#AAAAFF]Astonish is NJ:[/color][/b] What do you peffer the Premium Sellers Section or the Secondary Sellers Market?\n    [b][color=#0066FF]Cam G:[/color][/b] I honestly don't use the either very much, I've maybe sold and bought a couple things entirely, but when I do buy I use the Premium Sellers Section.\n\n    [b][color=#AAAAFF]Astonish is NJ[/color][/b] What one piece of advice would you give to a new user joining HF?\n    [b][color=#0066FF]Cam G[/color][/b] Don't care too much about reputation, post count, reported posts, any statistics at all to be honest. Just follow the rules, do or learn whatever it is you joined HackForums for and I'm sure it will be a rewarding experience.\n\n    [b][color=#AAAAFF]Astonish is NJ[/color][/b] This went by fast, but time to wrap it up, do you have any shout outs before we have to say goodbye?\n    [b][color=#0066FF]Cam G[/color][/b] Way too many members to mention, so instead of mentioning names I'll just put it this way:\n    - Anyone in the Wraith, if you've posted there in the time that I've been there, I've noticed you and you're probably someone I like.\n    - Anyone in the Reviewers, all a great bunch of people, I know I don't talk to every single reviewer personally, but to each and everyone one of you you're all great.\n    - Anyone I've talked to on Skype, or MSN, or PM'd on Hackforums. I didn't want to name names, because there's way too many for me to remember. With the exception of a few people, everyone I've messaged or PM'd I consider you a good member and a friend. Even people I've negative repped, some of them I know are great members, I hold no hard feelings or anything towards them. That's about it.\n    [/spoiler]\n  [hr]\n    [color=deepskyblue][size=large][font=Monotype Corsiva]Interview 3 - Rety'un[/font][/size][/color]\n    [spoiler=]\n    [color=white][b]Positive:[/b][/color] Thanks Rety'un for letting me interview you for the 53rd edition of HF News. Anything you have to say before we start?\n    [color=white][b]Rety’un:[/b][/color] Nada. Just practicing my epic rapping skills. ^_^\n\n    [color=white][b]Positive:[/b][/color] To start off, why did you join HF?\n    [color=white][b]Rety’un:[/b][/color] I joined HF to learn how to hack Runescape (all discussion banned on HF) (all discussion banned on HF), to begin with. I left for a few months, and came back in July of 09'.. I searched for the same thing.\n\n    [color=white][b]Positive:[/b][/color] As you have said, you have been here since the beginning of '09, any major changes done to HF since then?\n    [color=white][b]Rety’un:[/b][/color] Oh damn. There's been a few major overhauls from the deletion of the language forum, to getting rid of phishing and Runescape (all discussion banned on HF) (all discussion banned on HF). Then there's the hacker22 incident. Crazy and enjoyable stuff back then.\n\n    [color=white][b]Positive:[/b][/color] You are now a 'mentor' after being on 'staff' for a while. Are you happy with this change?\n    [color=white][b]Rety’un:[/b][/color] As happy as one could be with the limited abilities I suppose. I just miss warning the dicks in the lounge. Le sigh.\n\n    [color=white][b]Positive:[/b][/color] Seeing you have been here for a long time, have you made any really good friends/enemies on HF?\n    [color=white][b]Rety’un:[/b][/color] Lots of good friends: Robbievea, Paradoxum, iBruteforce, and most of the staff. I'd even go as far as Omni. Enemies: Meh, some idiots who think they're all that.\n\n    [color=white][b]Positive:[/b][/color] I have also gained alot of friends. Next question. If you could nominate one person to be a 'mentor' along side you, who would it be?\n    [color=white][b]Rety’un:[/b][/color] Paradoxum.\n\n    [color=white][b]Positive:[/b][/color] Nice. In your spare time, what would you call fun?\n    [color=white][b]Rety’un:[/b][/color] Reading, Writing, Rapping, Video Games, Swimming, the usual.\n\n    [color=white][b]Positive:[/b][/color] Sounds fun. We have some things in common. Now do you have any goals on hf? Any standards you want to meet?\n    [color=white][b]Rety’un:[/b][/color] Nothing at the moment. I've been staff twice, been a mentor for a while, led The Alliance for over a year, got the awards I was looking for. I've done okay for my self. If anything, I'd try for staff again.\n\n    [color=white][b]Positive:[/b][/color] Dang. Do you have any advice for members trying to achieve what you have done?\n    [color=white][b]Rety’un:[/b][/color] Hmm. Yeah, be yourself, be chill, help members, but super tip: Get Omni to notice you without being a douche,\n\n    [color=white][b]Positive:[/b][/color] Alright, well thank you very much for taking the time to let me interview you. Now I'll let you get back to your rapping.\n    [color=white][b]Rety’un:[/b][/color] I appreciate that.\n    [/spoiler][hr]\n    [align=center][img]http://i.imgur.com/80oJz.png[/img][/align]\n    [align=left][url=http://bit.ly/q5fSqc][img]http://i1210.photobucket.com/albums/cc404/BlackChaos619/xBOOTlogo2-2.gif[/img][/url][/align]\n\n    [align=center][img]http://i.imgur.com/GSfoJ.png[/img][/align]\n    [color=white][b]Publisher & Head Journalist[/b][/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt+[/url]\n    [/list]\n    [color=white][b]Publisher's Assistant[/b][/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\n    [/list]\n    [color=white][b]Journalists[/b][/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=545127]Joey Tribbiani[/url][list]\n    [*]Headlines[/list]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=766449]BlackChaos[/url][list]\n    [*]World News[/list]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=355307]chocothunda[/url][list]\n    [*]User News[/list]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=657392]Astonish is NJ[/url][list]\n    [*]User News[/list][/list]\n    [color=white][b]Reporters[/b][/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=129444]3x0r_$c0rPi0n[/url]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url]\n    [/list]\n    [color=white][b]Interviewers[/b][/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=657392]Astonish is NJ[/url]\n    [/list]\n    [color=white][b]Editors-in-Chief[/b] [/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n    [*][url=http://hackforums.net/member.php?action=profile&uid=234024]Deities[/url]\n    [/list]\n    [color=white][b]Graphical Editor[/b][/color]\n    [list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]\n",
      "subject": "[8/5/2011] - HF News"
    }
  ]
}