{
  "posts": [
    {
      "pid": "11179309",
      "uid": "295848",
      "dateline": "1302737368",
      "message": "[align=center][img]http://img193.imageshack.us/img193/2551/mainbannerf.png[/img][/align]\r\n\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 37th FULL edition. To read any older editions of the HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\n[align=center][img]http://img832.imageshack.us/img832/6712/headlines.png[/img][/align]\r\n\nOn April 1st a select \"few\" upgraded members were invited into a new moderator group also know has \"Lofo Prilas\" an anagram for April Fools. Soon after opening the application many members realized this was a joke, but many other members were fooled into filling out the entire application. If you would like to read further on this subject [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] has posted a thread on it located [url=http://hackforums.net/showthread.php?tid=1180990]here[/url]. All of the applications have saved if you would like to read some of them they're located  [url=http://hackforums.net/aprilfools2011.php]here[/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] has disabled avatar uploading temporarily due to a bug. This service will be enabled again once everything has been fixed and tested to ensure the bug is taken care of, if you would like to read further on this subject the thread has been posted [url=http://hackforums.net/showthread.php?tid=1205191]here[/url]\r\n\nThe Hack Forums official TinyChat plugin has been removed due to excessive flaming of members, and members impersonating others in an attempt to get them in trouble.  \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] has posted some old pictures of his gaming store in New York, if you would like to have a look pictures can be found [url=http://hackforums.net/showthread.php?tid=1172802]here[/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=2103][color=#00BFFF][b]Crow[/b][/color][/url] has officially opened his new website http://wizardforums.com/ It's a forum focused on philosophy, psychology, science, spirituality, and the esoteric arts in general. For more information on this visit his thread [url=http://hackforums.net/showthread.php?tid=1196056]here[/url] or simply go to the site itself.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=65784][color=lime][b]Xch4ng3[/b][/color][/url] has been reinstated as a site staff, everyone feel free to welcome him back.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=46373][color=lime][b]phire nuk3r[/b][/color][/url] has released his new chat site.  Users can gather here and talk about anything they would like, great social experience if you are looking to get to know some of the good members here on HF.  If you would like more info on this, feel free to visit his thread [url=http://hackforums.net/showthread.php?tid=1154756]here.[/url]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=#0066FF][b]Paradoxum[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Xypher[/b][/color][/url] the leaders of \"The Alliance\" have announced that they are still reviewing applications from their last recruiting thread. All applicants should be patient and not jump to any conclusions until all applications have been reviewed. If you would like to read the official announcement it's located [url=http://hackforums.net/showthread.php?tid=1207832]here[/url].\r\n\nThe \"Black Knights\" have three new leaders: [url=http://hackforums.net/member.php?action=profile&uid=588781][color=white][b]Cняιs ★ Hуѕтєяιa X™[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=295848][color=white][b]Qwazz[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Xypher[/b][/color][/url].\r\n\n[align=center][img]http://img196.imageshack.us/img196/300/usernews.png[/img][/align]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=604554][b][color=#0066FF][MBAMFan!] - Sync™[/color][/b][/url] managed to infect around 21 members with his free open VPN. It was stated to have a numerous amount of backdoored files, along with multiple detections of other malicious content, you can read more about the accusation [url=http://hackforums.net/showthread.php?tid=1177831]here.[/url] The user has also received a permanent ban, which was lifted shortly after. Senior members of the HJT Team analyzed the file in question and confirmed malicious content, along with the assistance of [url=http://hackforums.net/member.php?action=profile&uid=200751][color=white][b]Zach[/b][/color][/url] and other members of the RAT's Crew.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=58642][color=#0066FF][b]нα¢кєя[/b][/color][/url] found a way to completely deface Google, as a result of his findings was awarded $500, and his name will be listed in Googles hall of fame indefinitely. More info on this can be found [url=http://hackforums.net/showthread.php?tid=1194628]here[/url].  \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=588781][color=white][b]Cняιs ★ Hуѕтєяιa X™[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=234024][color=white][b]Deities[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=528934][color=white][b]iolaka[/b][/color][/url] have all donated $500 plus to this site, and have received the Master Donator award. This site wouldn't be what it is today with out people like these guys, all of Hack Forums thanks you. A full list of Master Donators can be found [url=http://hackforums.net/myawards.php?awid=50]here[/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=237516][color=black][b]Glamour[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=88465][color=black][b]Taiga[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=326128][color=black][b]Time[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=183981][color=black][b]Sin ♥[/b][/color][/url] have all been banned for 4 days due to a large flamefest in the lounge on march 10th. Ub3r members can check the [url=http://hackforums.net/bans.php]bans.php[/url] and you will notice that all of them have the same reason for banning. \"Flaming and offtopic ( 8 pages )\"\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=137645][color=#0066FF][b]mothered[/b][/color][/url], who is already known as being the member with the most posts on Hack Forums now has over 20,000 posts, and shows no sign of slowing down.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=132817][color=white][b]S70N3R[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=279955][color=black][b]Happeh[/b][/color][/url], recent leaders of \"Black Knights\", have both lost their leadership positions as well as their membership in the group due to a conflict with the founder [url=http://hackforums.net/member.php?action=profile&uid=15433][color=white][b]hackdeveto[/b][/color][/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=295848][color=white][b]Qwazz[/b][/color][/url] has been declared the winner of the [url=http://hackforums.net/forumdisplay.php?fid=122]MOTM[/url] (Member of the Month) Contest for March. \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=168826][color=white][b]Tyler777[/b][/color][/url] has created a thread in the marketplace discussions compiling all the reputable \"shell booters\" to clear up confusion and false advertising. If you're interested in either buying or selling an item like this check out the thread [url=http://hackforums.net/showthread.php?tid=1119831]here[/url].\r\n\n[color=white][b]ProKill[/b][/color], who is known for hacking Selena Gomez's personal Facebook profile has announced he is in the process of hacking Justin Bieber as well. We all await his upcoming video evidence, more information on this can be found [url=http://hackforums.net/showthread.php?tid=973000]here[/url], along with his previous work on Selena Gomez [url=http://hackforums.net/showthread.php?tid=969703]here[/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=109620][color=black][b]Mike.[/b][/color][/url] has been banned for two weeks, with the reason simply stating \"Whatever fag\" and other Nonsense. None the less he continues to sit online viewing the permissions page. \r\n\n[align=center][img]http://img16.imageshack.us/img16/6619/othernews.png[/img][/align]\r\n\nOn April 7th a magnitude 7.1 earthquake hit Japan. That is less than a month after the magnitude 8.9 earthquake hit on March 10th causing even more extensive damage to what was already considered a disaster of epic proportions.\r\n\nAvast antivirus software had a bad update causing it to have many false positives, and lead many users to think it was malicious. After 45 minutes this was patched and the software is up and running once again. More details on this issue have been posted [url=http://hackforums.net/showthread.php?tid=1205650]here[/url].\r\n\n[align=center][img]http://img801.imageshack.us/img801/1076/interviews.png[/img][/align]\r\n\n[font=Monotype Corsiva][size=large][color=deepskyblue]Interview 1 -  S70N3R[/color][/size][/font]\r\n[spoiler]\r\n[b][color=white]ROCKST★R:[/color][/b] Alright let me start us off with a pretty easy question. Why did you join Hackforums?\r\n[b][color=white]S70N3R:[/color][/b] I seen a guy in my tech class on it so I thought I'd check it out. \r\n\n[b][color=white]ROCKST★R:[/color][/b] Who were your first friends on Hackforums if you had any?\r\n[b][color=white]S70N3R:[/color][/b] It would have to be \"Blair\", he was the only one who I talked to allot on msn at the time. \r\n\n[b][color=white]ROCKST★R:[/color][/b] What is different about Hackforums now from when you joined?\r\n[b][color=white]S70N3R:[/color][/b] Hackforums rules, so much has changed to what is aloud now. I'd say there is going to be a few more rules added in the near future. \r\n\n[b][color=white]ROCKST★R:[/color][/b] Do you have any current goals on Hackforums? Awards, Rep, Posts?\r\n[b][color=white]S70N3R:[/color][/b] I don't really have any interest in awards, rep or posts. \r\n\n[b][color=white]ROCKST★R:[/color][/b] In a cival way would you mind telling us how you feel about The Black Knights incident. \r\n[b][color=white]S70N3R:[/color][/b] Basically Omni said we could vote hackdeveto out of the group by the majority decision so we went ahead with that, next morning I ain't leader nor is Happeh so I asked Omni he basically changed his mind. Hackdeveto does nothing and never has done yet he tried to talk down to me after being removed as leader which wasn't happening since he doesn't do shit, allot of people agreed with me on that some didn't even know he was a leader.\r\nHackdeveto never answered a single question of mine when I attempted to sort it with him even though I answered all his. \r\n\n[b][color=white]ROCKST★R:[/color][/b] What is your favorite section on Hackforums? Least favorite?\r\n[b][color=white]S70N3R:[/color][/b] Favourite: Black Knights   Least favourite: Bragging rights \r\n\n[b][color=white]ROCKST★R:[/color][/b] Are there any members on hackforums that inspire you or that you lookup to?\r\n[b][color=white]S70N3R:[/color][/b] No. If you look up to someone then you aren't really being yourself. \r\n\n[b][color=white]ROCKST★R:[/color][/b] If you could change one thing on hackforums what would it be?\r\n[b][color=white]S70N3R:[/color][/b] Remove the ignore on PM so I could get a reply from hackdeveto.  \r\n\n[b][color=white]ROCKST★R:[/color][/b] Any final advice or comments for the new Hackforums members? \r\n[b][color=white]S70N3R:[/color][/b] Don't make rep a goal.[/spoiler]\r\n\n [font=Monotype Corsiva][size=large][color=deepskyblue]Interview 2 -  Xypher[/color][/size][/font]\r\n[spoiler]\r\n[b][color=white]ROCKST★R:[/color][/b] Hello Xypher, thanks for agreeing to take part in an interview for hackforums news. \r\n[b][color=white]Xypher[/color][/b]  Thank you for choosing me, it is an honor.\r\n\n[b][color=white]ROCKST★R:[/color][/b] When you first joined the forum did you have any friends?\r\n[b][color=white]Xypher[/color][/b]  Nope, I was \"that skid that leeches everything.\"\r\n\n[b][color=white]ROCKST★R:[/color][/b] Many things have changed since hackforums opened. Do you think things have changed for the better or worse?\r\n[b][color=white]Xypher[/color][/b]  Honestly I think it is for the best. Jesse isn't some 15 year old hoping to run a successful forum in one try, he is one of the most experienced web masters out there. Sure, maybe a couple decisions (none come to mind instantly) may not have been the best, but if they were honestly horrible decisions, would we still be where we are today? The bans on warez and serial keys, how many people ACTUALLY quit HF because of that? I'm positive no one did.\r\n\n[b][color=white]ROCKST★R:[/color][/b] In multiple posts you said your trying to get the Master donator award, aside from that award are there any more achievements or goals you would like to reach?\r\n[b][color=white]Xypher[/color][/b]  I have a few goals, the seemingly endless one would be remaining here for the life of HF. That one is obviously dreaming large, but yeah. Out of the awards that I can earn, my ultimate goal is really to earn two awards, Diamond Member and Silver Medal. A lot of people have asked me why silver, not gold... well, I dislike the look of gold. >.> My other goals would be I am hoping to reach 15k posts or so by the end of Summer, though I doubt I will even hit 10,000. I would also like to really become a successful business man here, but I have a long way to go with that.\r\n\n[b][color=white]ROCKST★R:[/color][/b] What is your opinion on the whole black knights \"situation\" \r\n[b][color=white]Xypher[/color][/b]  Honestly, I don't care about what happened with S70N3R and HD. It is over with and I hate to be cocky because that isn't who I am, the group is now in a good place. Qwazz, Hysteria, and I have made the group boom in active in under a week. Qwazz and I bringing in our veteran experience and Hysteria just bringing himself. He has turned out to be a great leader, especially for not having any group leader experience (referring to HF groups).\r\n\n[b][color=white]ROCKST★R:[/color][/b] What is your favorite section on Hackforums? Least favorite?\r\n[b][color=white]Xypher[/color][/b]  My favorite would have to be The Alliance sub-forum. Mostly because the people I am closest with are there, for the most part. Least favorite would be The Lounge. Sure I post there a decent amount, but the members there are pathetic.\r\n\n[b][color=white]ROCKST★R:[/color][/b] Are there any members on hackforums that inspire you or that you look up to?\r\n[b][color=white]Xypher[/color][/b]  Qwazz, Robbieava, Reece, Paradoxum, Valiant, Kutmustakurt, Vorfin, Omni, iBruteforce, AeonHack, Saged, Carbon, Phire Nuk3r, VipVince, N3w_2_H@Ck1n™, Kn1ght, AsSaSs@iN, Etheryte, Skill, Deities, Ethereal, Rhythm, Tasemu, Harvey, and many more.\r\n\n[b][color=white]ROCKST★R:[/color][/b] We all have things we would like to change but if you had the power to change one thing on hackforums what would it be?\r\n[b][color=white]Xypher[/color][/b]  Group Sub-forums and the way they work. Most groups have stickied threads and they need certain threads unstuck or stickied later on which can turn into an inconvenience for staff. I think it would be a lot better if the owners of each group were the moderators of their groups sub-forum. It would make things way easier. Lucky for me, Skill has offered himself openly to help with TA since he used to own it, but I still feel bad asking him.\r\n\n[b][color=white]ROCKST★R:[/color][/b] What advice would you give to the new members of Hackforums?\r\n[b][color=white]Xypher[/color][/b] Just be nice. Stop trying to troll for rep, stop giving shit away for rep, stop flaming for rep, it doesn't make you cool, it makes you pathetic. If you are yourself, rep will come on its own. I mean, yeah give stuff away, but because you want to, not for rep.\r\n\nWell Xypher this concludes our interview thanks for taking part in the hackforums news.[/spoiler]\r\n\n[align=center][img]http://img818.imageshack.us/img818/4691/creditsz.png[/img][/align]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=295848][color=white][b]Qwazz[/b][/color][/url] - Writing, Content, layout\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=277712][color=white][b]Cobalt[/b][/color][/url] - Content\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826][color=white][b]Tyler777[/b][/color][/url] - Content\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=246042][color=white][b]ROCKST★R[/b][/color][/url] - Interviews\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=566671][color=#0066FF][b]panDa.[/b][/color][/url] - Banners\r\n[/list] ",
      "subject": "[4/13/2011] - HF News"
    }
  ]
}