{
  "posts": [
    {
      "pid": "62792222",
      "uid": "2331053",
      "dateline": "1753729941",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/w-green.png[/img]\r\n\r\n[b][size=xx-large][color=#ffffff][u]Hack Forum News - Edition Seven[/u][/color][/size][/b]\r\n\r\n[b]Hack Forum News is back this week with another update on the weekly news to keep you up to date on the latest news on site and around the world. If you have never heard of Hack Forum News, dont worry we have you covered. We are a team of members from the Hack Forums community who are journilists and writers, and we are here to keep you in the loop of the changes around the site and now even around the world.[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/headlines.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=121196]\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6304160][color=#ffffff]New Hide Awards Feature (Individual Awards)[/color][/url][/size][/b][/u] By [mention=1]\r\n[mention=1] has announced an exciting update to the Hide Awards feature. Users now have the ability to individually select which specific awards they'd like to hide, giving you more control and customization over your profile display.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6303889][color=#ffffff]Set Display Group as Registered[/color][/url][/size][/b][/u] By [mention=1]\r\nIn response to requests from members seeking a more minimalistic profile, [mention=1] has now introduced the option to hide your userbar. As a compromise, users can also choose to set their usergroup to 'Registered' for a cleaner appearance.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6303661][color=#ffffff]Group Automated Welcome Private Message[/color][/url][/size][/b][/u] By [mention=1]\r\nGroup leaders can now customize a welcome PM that is automatically sent when a member is accepted into their group. This feature is intended to help share important information, such as group rules and guidelines, with new members.\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/statistics-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=121196]\r\n\r\n[img]https://i.imgur.com/DqoH9PQ.png[/img]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/awards-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n[color=#ffffff]\r\n\r\n[b]Quick reminder, the donation awards page has had a bit of a change. Some of the classic awards are back up for purchase. If you would like to check out what is new, head over to the donation award page to snipe up some of the awards today.  Or [url=https://hackforums.net/buyawards.php][u]Click Here![/u][/url][/b]\r\n[b]\r\n\r\n[mention=5568595] Has obtained the \"Speaker of the House\" award - [award=3]\r\n[mention=5526553] Has obtained the \"Green Apple\" award - [award=78]\r\n[mention=1555761] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=4189082] Has obtained the \"Green Apple\" award - [award=78]\r\n[mention=4189082] Has obtained the \"Dicey\" award - [award=97]\r\n[mention=4189082] Has obtained the \"SportsBook\" award - [award=133]\r\n[/color][/b]\r\n\r\n[hr]\r\n\r\n[img]https://i.ibb.co/k64yXgSW/header.gif[/img]\r\n[css=46][size=xx-large][u]H4CK3R$ x Hack Forums News Team[/u][/size][/css]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[img]https://i.imgur.com/3g70tlJ.gif[/img]\r\n\r\nIn this week's edition, we have a very special inside view of the group known as [css=46]H4CK3R$[/css] and we are here to give everyone an inside view of what is happening behind the group for those who are not aware or unable to join the group.\r\n\r\nThis week we were given access to the group to have an internal view of what the group has been doing for the site and the projects they currently have going on. And we were not expecting so much content from them, but it clearly has set the standards very high for other groups to compete with.\r\n\r\nThe group is a selection of very skilled members who are all dedicated to using their skills to create a prestigious, tight-knit collective of skilled hackers, researchers, developers, and infosec hobbyists. They have the goal of promoting meaningful contributions to hacking and cybersecurity on the forum. Award recognition through ranks, hats, and rewards and always maintain a mature and focused hacker culture on site.\r\n\r\nThey envision a trusted force of members who not only build tools, share exploits, and push the edge, but also represent the ethos of old-school hacker spirit. Our long-term goal is to remain HF's most respected group of hackers, offering help for new talents, internal collabs, Vendor partnerships, and exclusive content & rates.\r\n\r\n[hr]\r\n\r\nThe group has had a few mentions previously within our group and crew news section before, but they have contacted us to give them a bit more of a detailed version this week as a special edition where the HF News Team and the Hacker$ groups collab together and share a bit more for everyone to see if this is something they may be interested in getting into.\r\n\r\nAs for those who haven't really got into any of their threads around the site, we are just going to cover a few of the benefits of the group.\r\n\r\nBenefits of being part of the Hacker$ group:\r\n\r\nMembers get bonus Bytes\r\nMonthly Prizes\r\nLive point system\r\nSupport with hacking projects\r\nHacker$ exclusive prefixes\r\nVisibility and rank status\r\nGroup graphics\r\nGroup Awards\r\n\r\n[hr]\r\n\r\n[u][b]Live Scoreboard + Memberlist[/b][/u]\r\n\r\nSo one thing that stood out to the team was the live member list and scoreboard. Within their group, they have been using the HF API to gather everyone who is in the group and then also track everyone's activity on the site, which, in return, rewards the members with points which are used to allow the members to obtain group awards.\r\n\r\nBelow is the live scoreboard.\r\n[spoiler][img]https://hfapi.net/api/public/v1/groups/46/members/image?sort=points_this_month&fields=rank,username,role,level,points,points_this_month&header=1[/img][/spoiler]\r\n[u][b]Group Point System[/b][/u]\r\n\r\nAs mentioned within the live scoreboard, they are using their own in-house point system for the members of the group. Points are automatically calculated every 24 hours. This system tracks each member's participation and helps maintain a high level of contribution across the group and allows the leaders to keep everyone within the group active and enjoying the subforum.\r\n\r\nHow Points Are Gained Within The Group:\r\n+30 points — New thread in H4CK3R$ group\r\n+15 points — New post in H4CK3R$ group\r\n+5 points — New thread outside group (other group threads not included)\r\n+1 point — New post outside group (other group threads not included)\r\n+15 points — New thread in Hacking Section (currently only \"Hacking Tools & Programs\", more are set shortly)\r\n+5 points — New post in Hacking Section (currently only \"Hacking Tools & Programs\", more are set shortly)\r\n\r\nWith the points system, each month the top monthly point earner receives a $100 prize. This is a massive incentive for everyone within the group and I must admit I know the HF News Team would love to use this as a giveaway ourselves. If we get anywhere near this, we will be sure to start a giveaway ourselves.\r\n\r\n[u][b]Group Awards[/b][/u]\r\n\r\nCurrently, the group has three main awards for its members which, as mentioned, are gained from the current point system. These awards are gained by gaining points within the group, which, as mentioned above, are following the group scoreboard. Each award has its own special number of points needed to obtain such awards that we are not going to go into detail as the current scoreboard is still in beta and isn't final yet.\r\n\r\nCurrent awards from group ranks:\r\n\r\nBlue Hat: Indicator of TR41N33 - Trainee rank\r\nRed Hat: Indicator of 0P3R8T0R - Operator rank\r\nBlack Hat: Indicator of 3L173 - Elite rank\r\n\r\n[u][b]Projects[/b][/u]\r\n\r\nWe mentioned earlier that the group has a few notable projects that are currently ongoing. We spent some time looking into these and had a little test with them as well.\r\n\r\n[u][b]Project - HackHF[/b][/u]\r\n\r\nProject HackHF has been out now for a while and, with this, it is its own website where members can find ways to crack exploits or even easily find passwords to complete the task that is given. Similar to a quest or mission, some may even call it. This project has been public for a little while now and a lot of members have had their hands on it and given it a go. It's friendly to those who are new to hacking and can even help those who are well-experienced test their skills.\r\n\r\n[u][b]Project - H4CK3R$ CASINO[/b][/u]\r\n\r\nThis is a brand-new project that the group is working on that will bring a casino to HF in the short term. Currently, this project is at very early stages, but from what we have seen so far the project is looking very promising and shows that it will be a much bigger project in the future as they are currently working on bringing black jack, coinflip, and Guess the number games to the table. Right now, the project is in a closed group alpha stage, so there isn't too much to go off on what else could come from the project, but after having a little look at the project so far, the casino project will be using bytes from HF as a currency and allowing players to have the possibility to win big.\r\n\r\nThese are the most notable projects currently ongoing but we don't want to spoil it all and allow them to keep a few smaller projects hidden away for now, but we are sure they will be shown off a bit more very soon.\r\n\r\n[hr]\r\n\r\nThis concludes our internal review of the [css=46]H4CK3R$[/css] group. The Hack Forum News Team would like to thank [mention=6] & [mention=3740051] for allowing the team to have access to make this story this week and to everyone within the group who is behind the group work. As you can see, there are some great things within the group, and we are sure they have so much more to come!\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/groups-header.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\r\n\r\n[b][u]GROUPS FOR SALE AND SOLD[/u][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6241882]Succubus group[/url] is still listed for sale by [mention=3604010]\r\n[url=https://hackforums.net/showthread.php?tid=6302394]Olympians group & Benevolence [/url] are listed for sale by [mention=1342286]\r\n\r\nNo recent group sales.\r\n\r\n\r\n[B][u]RECENT GROUP CHANGES & EVENTS[/u][/B]\r\n[b]New & Exclusive Upgrade to H4CK3R$ & The Academy!\r\n[/b]\r\nAnyone wearing the userbar for either of these two groups will get a multiplier on bytes earned for posting and creating threads. H4CK3R$ will receive 10x bytes & The Academy will receive 5x bytes.\r\n\r\nhttps://hackforums.net/showthread.php?tid=6303358\r\n\r\n[b][size=large][u]RECRUITMENTS:[/u][/size][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6298855]Casino Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6226725]Pink LSZ Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6304113]Warriors Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6275486]Gamblers Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6294522]Legends Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6046141]Allegiance Buy-in[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6295130]Olympians leader recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6300585]The Academy Recruitment [/url]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/user.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[b]\r\n[size=x-large]Remember if you have reached an achievement on your account feel free to post about it on our weekly reports thread. That way we can add you to the news for the next edition. [u][url=https://hackforums.net/showthread.php?tid=6299864]Click Here To See The Weekly Reports Thread[/url][/u][/size]\r\n\r\nTWIXX Has been closed.\r\n[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/world-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][color=#ffffff]France to officially recognize Palestinian state[/color][/size][/b][/u]\r\n\r\nFrance has become the first G7 country to formally recognize Palestine, sparking both domestic and international debate.\r\n\r\n[b][url=https://feeds.bbci.co.uk/news/world]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Series of deadly European heatwaves & wildfires[/color][/size][/b][/u]\r\n\r\nParts of Europe have endured record-breaking heatwaves since June, with wildfires affecting France, Spain, Turkey, and Greece. These events have resulted in deaths, injuries, and widespread evacuations—France alone reporting over 119 injuries and Turkey evacuating more than 52,000 people.\r\n\r\n[b][url=https://economictimes.indiatimes.com/news/international/world-news]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Flash floods disrupt UK life[/color][/size][/b][/u]\r\n\r\nThe UK experienced severe flash flooding around mid‑July. Notably, heavy rains disrupted hearings at the Old Bailey and inundated large areas in Northern Ireland and the East of England, causing school closures, road and rail disruptions, and property damage.\r\n\r\n[b][url=https://en.wikipedia.org/wiki/2025_United_Kingdom_floods]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]US–EU trade deal reached[/color][/size][/b][/u]\r\n\r\nIn a breakthrough summit in Scotland, President Trump and EU Commission President Ursula von der Leyen agreed to freeze tariffs at 15% (down from proposed 30%) and increased EU purchases of American energy and military hardware.\r\n\r\n[b][url=https://www.thetimes.com/uk/politics/article/trump-eu-us-trade-deal-rt6x2sxnp]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Earth experiencing the shortest days on record[/color][/size][/b][/u]\r\n\r\nScientists have recorded unusually fast rotation in July 2025, including a day on July 10 that was 1.36 milliseconds shorter than typical. This phenomenon may have implications for timekeeping, GPS, and digital systems.\r\n\r\n[b][url=https://timesofindia.indiatimes.com/science/earth-is-spinning-faster-this-summer-july-22-among-the-shortest-days-ever-recorded-scientists-warn/articleshow/122829603.cms]Source[/url][/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/gaming-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=811]\r\n\r\n[color=#72FF84][b]Notable console & hardware releases:[/b][/color]\r\n\r\n[color=#FF5F54]Nintendo Switch 2 - Wave 2 Colors[/color] [color=#FFFF44](Released July 18, 2025):[/color]\r\n\r\nFollowing the successful launch of the console, Nintendo released two new color variations for the Switch 2: 'Superstar Silver' and 'Mushroom Kingdom Red'. These are standard models with no performance difference.\r\n\r\n[color=#FF5F54]Analogue duo - black edition[/color] [color=#FFFF44](Released July 11, 2025):[/color]\r\n\r\nAnalogue released a new production run of its high-end duo console in a limited all black colorway. The console plays original TurboGrafx-16/PC Engine/SuperGrafx game cartridges, Hucards, and CDs.\r\n\r\n[color=#FF5F54]Razer \"Viper V4 Pro\" gaming mouse[/color] [color=#FFFF44](Released July 22, 2025):[/color]\r\n\r\nRazer launched its next-generation lightweight competitive gaming mouse. Featuring updated optical sensor and improved battery life.\r\n\r\n[color=#FF5F54]SteelSeries Arctis Nova 9X headset[/color] [color=#FFFF44](Released July 15, 2025):[/color]\r\n\r\nThe latest wireless gaming headset from SteelSeries designed primarily for Xbox consoles, but also featuring Bluetooth. It has improved microphone clarity and a longer battery life compared to previous models.\r\n\r\n[color=#FF5F54]NVIDIA's GeForce RTX 5050[/color] [color=#FFFF44](Released July 2025):[/color]\r\nNVIDIA has officially launched the GeForce RTX 5050 GPU at a budget friendly price. This card has the most up to date technological advancements in GPU for this generation making it a \"smart\" GPU.\r\n\r\n\r\n[color=#72FF84][b]Notable News (July 2025)[/b][/color]\r\n\r\n[color=#FF5F54]Call of Duty Remote Code Execution (RCE) exploit[/color] [color=#FFFF44](Ongoing July 2025):[/color]\r\n\r\n[spoiler][u][i]Highly Vulnerable: Call of Duty: WWII (PC)[/i][/u]\r\n\r\nWhen the publisher Activision was aware of this critical vulnerability PC servers went completely offline for emergency maintenance.\r\nTimeline of the event:\r\n\r\nJuly 2nd - 4th: This is when the community became aware of the issue. People began posting on Reddit and X warning other users that hackers began opening applications like Notepad and harassing players in-game.\r\nJuly 5th: Activision's official \"Call of Duty Updates\" account acknowledged they were investigating \"an issue\" and took the PC version of the game offline.\r\n\r\nA specific vulnerability \"CVE-2018-20817\" effected several older Call of Duty games as well. Hackers could exploit the game's authentication process, and execute code on your machine remotely.\r\n\r\n[u][i]Historically Vulnerable and Still Considered Unsafe on PC:[/i][/u]\r\n\r\n[list]\r\n[*]Call of Duty: Modern Warfare 2 (2009)\r\n[*]Call of Duty: Black Ops\r\n[*]Call of Duty: Modern Warfare 3\r\n[*]Call of Duty: Black Ops II\r\n[*]Call of Duty: Ghosts\r\n[*]Call of Duty: Advanced Warfare\r\n[*]Call of Duty: Modern Warfare Remastered (on official servers)\r\n[*]Call of Duty: Black Ops III (A patch was released in 2023 by Treyarch. Members of the COD community still advise caution and recommend community patches.)\r\n[/list]\r\n[/spoiler]\r\n\r\n[color=#FF5F54]Ubisoft Announces major restructuring[/color] [color=#FFFF44](July 21, 2025):[/color]\r\n\r\nUbisoft announced a significant internal reorganization into \"Creative Houses.\" This is designed to give its development studios more creative autonomy and streamline production following several years of underperforming releases.\r\n\r\n[color=#FF5F54]\"Wuchang: Fallen Feathers\" launches[/color] [color=#FFFF44](July 25, 2025):[/color]\r\n\r\nThe highly anticipated Soulslike action RPG launched on PC and consoles. While praised for its art style and combat, the release was plagued by widespread reports of performance issues. Especially on PC leading to a mixed rating on Steam.\r\n\r\n[color=#FF5F54]\"Ready or Not\" surpasses 1 Million sales on consoles[/color] [color=#FFFF44](July 23, 2025):[/color]\r\n\r\nDeveloper VOID Interactive announced that its tactical shooter, \"Ready or Not,\" sold over one million copies within its first week of release on PlayStation 5 and Xbox Series X/S.\r\n\r\n[color=#FF5F54]Supermassive games hit with layoffs[/color] [color=#FFFF44](July 22, 2025):[/color]\r\n\r\nReports confirmed that Supermassive Games, the UK-based studio behind \"Until Dawn\" and \"The Quarry,\" conducted a round of layoffs. The exact number of effected employees and the impact on future projects are not publicly disclosed.\r\n\r\n[color=#FF5F54]\"Grand Theft Auto VI\" marketing campaign[/color] [color=#FFFF44](Early July 2025):[/color]\r\n\r\nRockstar Games kicked off the official marketing campaign for GTA VI with the first in-game screenshots released via social media and several high-profile digital billboards appearing in cities like Los Angeles and New York.\r\n\r\n[color=#FF5F54]San Diego Comic-Con gaming reveals[/color] [color=#FFFF44](July 24-27, 2025):[/color]\r\n\r\nSDCC featured several gaming announcements, including the reveal of a new \"Friday the 13th\" video game, more details on the \"Magic: The Gathering\" x Spider-Man crossover, and an art book for the \"Marvel vs. Capcom Fighting Collection.\"\r\n\r\n[color=#72FF84][b]Game Releases - July 2025[/b][/color]\r\n[spoiler][list]\r\n[*]Mecha Break (PC, PS5, Xbox Series X/S) - July 1\r\n[*]Harvest Moon: The Lost Valley & Skytree Village (Switch) - July 3\r\n[*]EA Sports College Football 26 (PS5, Xbox Series X/S) - July 7\r\n[*]Every Day We Fight (PC) - July 10\r\n[*]Everdeep Aurora (PC) - July 10\r\n[*]Islanders: New Shores (PC, PS5, Xbox Series X/S, Switch) - July 10\r\n[*]Mycopunk (PC) - July 10\r\n[*]Patapon 1+2 Replay (PC, PS5, Switch) - July 11\r\n[*]Tony Hawk's Pro Skater 3 + 4 (PC, PS4, PS5, Xbox One, Xbox Series X/S, Switch, Switch 2) - July 11\r\n[*]Kaizen: A Factory Story (PC) - July 14\r\n[*]Destiny 2: The Edge of Fate (PC, PS4, PS5, Xbox One, Xbox Series X/S) - July 15\r\n[*]Edens Zero (PC, PS5, Xbox Series X/S) - July 15\r\n[*]Eriksholm: The Stolen Dream (PC, PS5, Xbox Series X/S) - July 15\r\n[*]Neverwinter Nights 2: Enhanced Edition (PC, PS5, Xbox Series X/S, Switch) - July 15\r\n[*]Hunter × Hunter: Nen × Impact (PC, PS5, Switch) - July 16\r\n[*]Worship (PC) - July 16\r\n[*]Donkey Kong Bananza (Switch 2) - July 17\r\n[*]Neon Abyss 2 (PC) - July 17\r\n[*]RoboCop: Rogue City - Unfinished Business (PC, PS5, Xbox Series X/S) - July 17\r\n[*]The Wandering Village (Switch) - July 17\r\n[*]Shadow Labyrinth (PC, PS5, Xbox Series X/S, Switch, Switch 2) - July 18\r\n[*]Kick'n Hell (PC) - July 21\r\n[*]Abiotic Factor (PC) - July 22\r\n[*]Misc. A Tiny Tale (PC, Switch) - July 22\r\n[*]Monument Valley 3 (PC) - July 22\r\n[*]Wildgate (PC, PS5, Xbox Series X/S) - July 22\r\n[*]Eat the Rich (PC) - July 23\r\n[*]Wheel World (PC, PS5, Xbox Series X/S) - July 23\r\n[*]Killing Floor 3 (PC, PS5, Xbox Series X/S) - July 24\r\n[*]Super Mario Party Jamboree (Switch 2) - July 24\r\n[*]Total Chaos (PC) - July 24\r\n[*]Wuchang: Fallen Feathers (PC, PS5, Xbox Series X/S) - July 24\r\n[*]No Sleep for Kaname Date (PC, Switch, Switch 2) - July 25\r\n[*]Ratatan (PC) - July 25\r\n[*]Wild Hearts S (Switch 2) - July 25\r\n[*]Grounded 2 (PC, Xbox Series X/S) - July 29\r\n[*]Tales of the Shire: A The Lord of the Rings Game (PC, PS5, Xbox Series X/S, Switch) - July 29\r\n[*]Ninja Gaiden: Ragebound (PC, PS4, PS5, Xbox One, Xbox Series X/S, Switch) - July 31\r\n[*]System Shock 2: 25th Anniversary Remaster (PS5, Xbox Series X/S, Switch) - July 2025 (Specific date TBD)\r\n[/list][/spoiler]\r\n\r\n🏆 [color=#72FF84][b]E-Sports[/b][/color]\r\n\r\nValorant Champions Tour 2025: Stage 2 Masters (Tokyo) - [color=#FFFF44](Concluded July 6, 2025):[/color]\r\nWinner: Fnatic\r\nLeague of Legends - LCK 2025 Summer Split - [color=#FFFF44](Playoffs ongoing, no final winner for July):[/color]\r\nStandings leader at end of July: T1\r\nLeague of Legends - LEC 2025 Summer Season Finals - [color=#FFFF44](Concluded July 20, 2025):[/color]\r\nWinner: G2 Esports\r\nCounter-Strike 2 - IEM Cologne 2025 - [color=#FFFF44](Concluded July 27, 2025):[/color]\r\nWinner: FaZe Clan\r\nDota 2 - Riyadh Masters 2025 at Esports World Cup - [color=#FFFF44](Concluded July 21, 2025):[/color]\r\nWinner: Team Spirit\r\nApex Legends Global Series: Year 5 Split 2 Playoffs - [color=#FFFF44](Concluded July 13, 2025):[/color]\r\nWinner: DarkZero Esports\r\nOverwatch Champions Series - Major Dallas - [color=#FFFF44](Concluded July 7, 2025):[/color]\r\nWinner: Toronto Defiant\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/tech-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][color=#ffffff]Google launches AI virtual try-on feature[/color][/size][/b][/u]\r\n\r\nNow users can virtually try on clothes by uploading a full-body photo. Google also previewed future AI tools for outfit suggestions and room décor planning.\r\n\r\n[b][url=https://www.ft.com/content/37d4b9ca-7034-4ed7-82cb-4fd1a52b434a]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]UK regulators target Apple & Google’s mobile dominance[/color][/size][/b][/u]\r\n\r\nThe UK’s Competition and Markets Authority has proposed sweeping reforms impacting the App Store, Safari, and the iOS ecosystem. Apple and Google may be designated as having “strategic market status.”.\r\n\r\n[b][url=http://technologynews.uk/]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]OpenAI partners with UK government on AI integration[/color][/size][/b][/u]\r\n\r\nA non-binding agreement aims to deploy AI tools across sectors like health and public services to improve efficiency and innovation.\r\n\r\n[b][url=http://technologynews.uk/]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]AI giants’ earnings underway: “Magnificent Seven” in focus[/color][/size][/b][/u]\r\n\r\nInvestors are watching AI-related results from Amazon, Google, Meta, Microsoft, Nvidia, Apple and Tesla amid ongoing tariff uncertainties. Nvidia’s earnings are pushed to August.\r\n\r\n[b][url=https://moneyweek.com/investments/stocks-and-shares/tech-stocks-magnificent-7-investing]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Neuralink implants chip in ninth patient[/color][/size][/b][/u]\r\n\r\nElon Musk's Neuralink has advanced its brain-interface program by enrolling a ninth trial participant.\r\n\r\n[b][url=https://timesofindia.indiatimes.com/technology/tech-news/elon-musks-neuralink-implants-brain-chip-in-ninth-patient-what-neuralink-is-doing-to-bring-the-matrix-to-reality/articleshow/122878747.cms]Source[/url][/b]\r\n[/align]",
      "subject": "Hack Forum News - Edition Seven"
    },
    {
      "pid": "62792238",
      "uid": "2331053",
      "dateline": "1753731454",
      "message": "[align=center]\r\n[img]https://hackforums.net/images/hfnews/contests.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6303368]$25 Crypto Contest | BTC / ETH / SOL | Ends Aug 15[/url] By [mention=5285563] [/color][/size][/b][/u]\r\n\r\nIf you are looking to get your hands on some free crypto, the user known as Sigma Boss has the thread for you. They have recently started a contest for everyone on site, and you can get your hands on an entry right now. All you will need to do is head over to the thread and follow the three steps to enter, and you could get your hands on that $25 crypto on the 15th of August. Good luck!\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6303945]$50 Crypto Contest || Celebrating my upgrade to Ub3r[/url] By [mention=5655318] [/color][/size][/b][/u]\r\n\r\nAnother contest is also giving away $50 worth of free crypto too. This member has recently just got themselves Ub3R on site and is celebrating becoming Ub3R by giving away to one lucky winner a $50 crypto. Once again, they have a few requirements for the contest, but everyone can easily enter this lovely contest and will get themselves an easy $50 to do whatever they want with it. Make sure you check this one out as it's worth checking it out!\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/comics-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[b][size=x-large][color=#ffffff]-1-[/color][/size][/b]\r\n[spoiler][img]https://www.boredpanda.com/blog/wp-content/uploads/2025/06/685e4f21bff77-png__700.jpg[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-2-[/color][/size][/b]\r\n[spoiler][img]https://scontent.fbrs5-1.fna.fbcdn.net/v/t39.30808-6/486506953_1391140658534110_1567214265171461291_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=127cfc&_nc_ohc=31rwrPj_V2gQ7kNvwEJY_V-&_nc_oc=Adl2n2fNvi4m4hIRz2QlCWbtosb9KxFZmyRKgRrVWPq1bNrS6SoTBlLyUiZnwezbFCFg-oSH-P8H39F0L9_hWnbl&_nc_zt=23&_nc_ht=scontent.fbrs5-1.fna&_nc_gid=emZiDZYh1GO4cS4CdRYSyg&oh=00_AfRt-d2NOPHJ6Sn08qtF4lM4Icr00sLGyeETfUB746w5IQ&oe=688B21EE[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-3-[/color][/size][/b]\r\n[spoiler][img]https://charmysarmy.wordpress.com/wp-content/uploads/2025/03/07july2025_charmy-week-29-0714-0720-stacked-color-web.jpg[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-4-[/color][/size][/b]\r\n[spoiler][img]https://featureassets.amuniversal.com/assets/22a7e4c03d79013ea926005056a9545d[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-5-[/color][/size][/b]\r\n[spoiler][img]https://pbs.twimg.com/media/Gv25pyla4AI0_vv.jpg[/img][/spoiler]\r\n\r\n[hr]\r\n\r\n[b]We would like to say a big thank you for you reading and a big thank you to the HF News Team members[/b]\r\n[mention=811] [mention=121196] [mention=2331053] [mention=57618] [mention=2890436] [mention=3929084] [mention=3725052]\r\n\r\n[hr]\r\n\r\n[b][size=xx-large][u]Support The Team by wearing our signatures[/u][/size][/b]\r\n\r\nIf you have enjoyed the read please consider wearing one of our signatures to support us!\r\n\r\n[img]https://hackforums.net/images/hfnews/support-blue.png[/img] [img]https://hackforums.net/images/hfnews/support-green.png[/img]\r\n[img]https://hackforums.net/images/hfnews/support-orange.png[/img] [img]https://hackforums.net/images/hfnews/support-purple.png[/img]\r\n[img]https://hackforums.net/images/hfnews/support-red.png[/img]\r\n\r\n\r\n[b][size=xx-large][color=#E82A1F]Red[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-red.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#0074D9]Blue[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-blue.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#2ECC40]Green[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-green.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#E86E04]Orange[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-orange.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#B10DC9]Purple[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-purple.png[/img][/url][/align][/code]\r\n\r\n[/align]",
      "subject": "RE: Hack Forum News - Edition Seven"
    }
  ]
}