{
  "posts": [
    {
      "pid": "15843604",
      "uid": "0",
      "dateline": "1316464332",
      "message": "[align=center][img]http://i1142.photobucket.com/albums/n610/HFNewsGFX/19thSep.png[/img][/align]\n\nThe edition you are currently reading is the [color=#dfdf59][b]59th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\nThe ban on Runescape discussions is now lifted. The Runescape sub-forum can be viewed [b][url=http://goo.gl/oKggi]here[/url][/b]. Be sure to read the rules which are listed [url=http://goo.gl/hxbbf][b]here[/b][/url].\n\nA forum rules compilation page has been created which lists all the forum specific rules. It can be viewed [url=http://goo.gl/D3s1P][b]here[/b][/url].\n\nCreation of threads involving buying/selling/trading in any section outside of the Marketplace will now result in a ban. To aid the implementation of this new rule, a new report option for \"Not In Marketplace\" is now added. The official announcement regarding this can be viewed [url=http://goo.gl/Kve0E][b]here[/b][/url].\n\nA [b]Post Activity[/b] link has been added to each member's profile link via which l33ts and ub3rs can see how many posts a member has in individual sections of HackForums.\n\n[b][url=http://goo.gl/vnGXg]Hackintosh Help[/url][/b] sub-forum has been added under the [i][b]Apple Mac and OS X[/b][/i] section of the Computing tab. This sub-forum is for those who hack the Mac OSX to run on non-Apple hardware. Hackintosh topics include setup help and build guides.\n\n[url=http://goo.gl/OJxK3][b]Partnerships, Hiring, and Personnel[/b][/url] sub-forum has been added under the [i][b]Service Offerings[/b][/i] section. If you're looking to hire staff or need a business partner, this section is perfect to post in. \n\n[url=http://goo.gl/7Z6d8][b]Virtual Game Items[/b][/url] section has been added under the Marketplace. You you can sell virtual items from games such as Runescape Gold, World of Warcraft equipment, and other gaming related items there. No account trading allowed in this section.\n\n[b][url=http://goo.gl/Ybieh][color=lime]Rusty_v[/color][/url][/b]'s account was compromised this week. Fortunately, not much damage was done. Most of their actions were reputation related; they had rep fucked 3 members and removed many reps on individual members. It also appears that they swapped some LR payment links in the marketplace with their own LR ID. The complete official announcement regarding this can be viewed [url=http://goo.gl/TNiqZ][b]here[/b][/url]. Unfortunately, he is no longer a part of the staff team at HackForums and is now a Mentor. No official reason has been provided for the demotion. \n\nA list of the countries which are currently blocked has been made [b][url=http://goo.gl/cFUMh]here[/url][/b]. These blocks represent problems with IPs originating from these countries. Country blocks are one effective way to eliminate \"bad traffic\". This list is not permanent and is subject to change.\n\n[align=center][img]http://goo.gl/0zRhM[/img][/align]\n\nYet another member, [url=http://goo.gl/ZvXnX][color=#0066FF][b]Scooter[/b][/color][/url], has joined those with over a thousand reputation, while [url=http://goo.gl/Lp5ut][color=black][b]тнєJσкєя[/b][/color][/url] is steadily climbing to second place right behind Omniscient for highest reputation.\n\n[url=http://goo.gl/LczjM][color=#0066FF][b]Vitani's Mate[/b][/color][/url] has reached twenty-thousand posts in nine months, with over eighty-five posts per day. He is less than two-thousand posts away from obtaining first place in highest post count.\n\nAs many know, [url=http://goo.gl/7g1HW][color=#0066FF][b]SeaNanners™[/b][/color][/url] wanted the Sushi Lovers award, so he made a thread with a video trying to show his \"First time eating Sushi\" [url=http://goo.gl/LtWNE][color=white][b]Defcon.[/b][/color][/url] later revealed it to be a lie and the video leeched. Be sure to see the original thread [url=http://goo.gl/gvnU0]here[/url] and Defcon revealing it [url=http://goo.gl/NgMDO]here[/url]. \n\nAnime Adventures has launched the AARadio, headed by [url=http://goo.gl/WtTLD][color=white][b]Tasemu[/b][/color][/url]. AARadio is basically a radiostation run by members of AA for members of AA. Anyone wishing to hear some delicious music check out their [url=http://aaradio.me/]radio[/url], otherwise, see their thread [url=http://goo.gl/AuBvj]here[/url].\n\nThere has been much hostility towards [url=http://goo.gl/oiX5A][color=#0066FF][b]Avante[/b][/color][/url]'s hosting, members like [url=http://goo.gl/xxFCP][color=white][b]Poliice[/b][/color][/url] have posted threads revealing the truth about Avante's Hosting. Read his hosting thread [url=http://goo.gl/0YPp9]here[/url] and the warning thread [url=http://goo.gl/qWXup]here[/url].\n\n[url=http://goo.gl/nJT9F][color=white][b]Sir's Bitch[/b][/color][/url] found a recent problem in the updates Omniscient has been trying to do, with the recent bans of the alt characters, to stop impersonation, it has also banned spaces in general. Hopefully this can be sorted out soon.\n\nThere have been about a pound and a half of leadership changes, but do not fret, those will be included in the Misc. edition. Also, I realize the user news was a bit short this time 'round, I apologize, it's just that all \"user news\" that I found, would technically go in the Misc. edition. Thanks.\n[align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nWe apologize for the absence of World News this week. I was unable to find a temporary replacement for BlackChaos. [s]If you would like to write World News for the next three weeks or so, just PM Me.[/s] Found one.\n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n\n[align=center][img]http://img534.imageshack.us/img534/2327/allstuffz.png[/img][/align]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - Disciple[/font][/size][/color][spoiler=]\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nOKay then, shall we begin. Hello DescipLe, thanks for participating in HF news interview.\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nHello Valik, I'm glad I could be apart of the HF news.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nHaha, so, do you have any shout outs to any of your friends on HF or anywhere else?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nFor sure, shout outs to Frida, Mewtwo and Wolves, that's about it.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nIm sure these people will be reading the news, so thats great. Since you have the gamer award, we are going to speak about gaming today. What is your favourite console/game? \n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nWell, I'm mostly and xbox gamer, I own an xbox 360, and mainly play Call of Duty, and Halo. I enjoy FPS games, and normally play them daily.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nSounds good, any particular games you are waiting for?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nDefinitely, I'm really anxious to see how MW3 (Modern Warfare 3) turns out, as I'm hearing good and bad things about it. I've seen multiple videos leading me to believe it's going to be great.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nTheir multiplayer trailer was great, aint it. Well, tell us a little about how you started gaming, what was your first game you played and the console you played on.\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nHonestly, it wasn't xbox, playstaion, or any console... The first gaming \"system\" I've ever played was a gameboy color, and believe it or not, pokemon yellow was the game that got me into gaming. The classics were always great, and I could go back and play them today and have just as much fun.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nHaha, i remember rocking on Pokemon Blue. What additions do you like to your gaming? Tell us about your setup and the music you listen while you playing, if you do.\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nGladly, I currently use a 42\" LG LED TV, with my Turtle Beach X41 surround sound headphones for sound. I have an HD PVR which I use to record and upload videos to youtube with. But when I'm playing any game, I need to be playing some music to keep me pumped and into the game. I normally listen to some dub-step or Wiz Khalifa.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nWow, sounds like you are a hardcore gamer ;). What type of player you are? Do you prefer Individual or Team Games? Do you do any competitive gaming, like GameBattles?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nTo be honest, I prefer individual games, alike free for all, and other \"lone wolf\" types of games, so I only have myself to blame if I mess up. And I do play GameBattles, in fact, I played another member's team from HF in a two versus two match. Unfortunately we lost but it was really fun. I like playing competitive games, they keep me excited.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nSounds good, but don't you think you are being selfish? What if someone asked you to play competitive with him, would you decline?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nNot at all, I like playing team as well, as long as I know I can rely on them. I would definitely accept a team invite, or something of that sort if I knew we were going to do good. As long as I can have fun, I'm down.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nVery true. Which one of us would like to be in a bad team? What do you think about mentoring players? Have you had any experience in actually teaching people how to play?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nNot really, I've played a lot with friends in real life, and helped them get better by telling them where to go...etc. But other than that, I don't think I've really \"taught\" anyone how to play, although I wouldn't mind starting mentoring players, it could be fun.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nAlrighty, well we are about to finish. Last question. If you had one wish, what would it be and why?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nThat's actually a really hard question to answer, I can't really think of one thing I would want over anything else atm. I guess all I could really want would be to keep my family and friends safe, that's about it...\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nThats really nice of you. Well you guys had a nice portion of 'gamers' talk and maybe some of you learned something new today. Thanks for your time, DescipLe and have a nice evening :).\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nThank you Valik, the same to you. Bye!\n[/spoiler]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n\n[url=http://goo.gl/7M6h9][img]http://goo.gl/bT3g8[/img][/url]\n\n[align=right][url=http://goo.gl/3cDOZ][img]http://goo.gl/8r0pM[/img][/url][/align]\n\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]\n",
      "subject": "[9/19/11] - HF News"
    }
  ]
}