{
    "posts": [
        {
            "pid": "5775989",
            "uid": "74244",
            "dateline": "1281665998",
            "message": "Sorry it's very very late.\n\nAnyway.\n\n[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\n[align=center]Edition 12 [/align]\n\n[size=large][color=#FF4500]Headlines[/color][/size]\n\nThis week, Omniscient split the Seller's Sections into two. He made one that is called \"[url=http://hackforums.net/forumdisplay.php?fid=107]Premium Seller's Section[/url]\" and one that is \"[url=http://hackforums.net/forumdisplay.php?fid=176]Secondary Seller's Market[/url]\". The Premium is only available to L33T and UB3R members. The Secondary, obviously, will contain all of the non L33T and UB3R sales. This change happened a few days ago, and many were pleased.\n\nNo other headlines this week. It was a quiet week. We did have a problem with the database for like 2 hours, in which the site was down. Quickly fixed by Omniscient, and we were back online.\n\n[size=large][color=#FF1493]User News[/color][/size]\n\nThis should be in next week's, but oh well. IFKU is staying up for 7 days straight! Yes, 7 days! He's going to update his mood and such every few hours! Check out his progress, and wish him luck [url=http://hackforums.net/showthread.php?tid=600783]here[/url]! Good luck IFKU, and don't.. die? Watch him on webcam [url=http://75.180.36.127/webcam.html]here[/url]!\n\nAnother one of the \"show your picture threads\" has been getting a lot of attention. In 6 days, it's gotten 280 or so replies. Go show your picture, your face, your butt, whatever you gotta do.. contribute! Share with members [url=http://hackforums.net/showthread.php?tid=594611]here[/url].\n\nGravityZ3r0 needs your help! How can he get his ONLY friend to stop cutting herself? He needs your help [url=http://hackforums.net/showthread.php?tid=591687]here[/url]! That's kind of sad though..? He only has one friend? Sad! I'll be your best friend Gravity! Really, I will!\n\n[size=large][color=#1E90FF]Other News[/color][/size]\n\nSorry this one is short and late, there wasn't really any news, so I slacked off on it. This week, I'll upload on Saturday morning. I'll work on it on Friday night. \n\nBy the way, Reviewer applications are OPEN! They have been for a bit, but some may not know..? Go apply [url=http://hackforums.net/showthread.php?tid=588051]here [/url].\n\nI think that's all for this week! This week I'll make an extra big edition for you all! It'll be extremely huge, don't worry! I'll be adding some \"hacking segments\" in which I show new tutorials, etc. Any other ideas for segments..?",
            "subject": "[8/1-8/7] HF News"
        }
    ]
}