{
  "posts": [
    {
      "pid": "36006901",
      "uid": "515249",
      "dateline": "1383094550",
      "message": "[align=center][IMG]http://i.minus.com/iFr3ysSi8zt0B.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFA52C][b]166th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/ibbtDZ715LhhGY.png[/img][/align]\n[color=white][b]And It's Back, Folks![/b][/color]\nAfter having been completely removed from the UserCP earlier last week, the \"Modern\" theme is back in full steam, sporting updates such as a new reputation page, member rank colors, stars, staff and admin userbar changes, and a fancy background. From the feedback received, it seems that a large portion of the comminity is warming up to the cool new theme, positively commenting that it decreases their page loading time in addition to being easier on the eyes. The [url=http://hackforums.net:8080/images/modern/logok3.png]main banner[/url] has also been touched with the wand of change, showing off a sleek font that could almost be considered cursive with the text \"Pimping the purple! Since '07\". On the [url=http://hackforums.net/showthread.php?tid=3826317]thread[/url] informing members of the change, [url=http://hackforums.net/member.php?action=profile&uid=1][b]Omniscient[/b][/url] reminds them that the old school theme remains available as an option in your UserCP settings. Additionally, he states that doing so will cause you to miss out of the fun of the new design implementations.\n\n[color=white][b]Free Userbars For One And All[/b][/color]\nIn combination with the modern theme being the new default, [url=http://hackforums.net/member.php?action=profile&uid=1][b]Omniscient[/b][/url] has made a [url=http://hackforums.net/showthread.php?tid=3825128]thread[/url] stating that every user owned group is allowed a free userbar for the modern theme. What stands out about this sudden opportunity is that for the first time since the forum started back in 2007, these new userbars will not require the use of the default template, allowing for the possibility of amazing graphics limited only by the proficiency of the designer. The size constraints remain the same at 136 by 42, along with a maximum filesize of 10KB. Keep in mind that animated userbars will not be allowed, and that the PNG filetype is preferred. It is not known how long this chance will remain up for grabs before the iron doors of generosity slam shut, so definitely do not wait too long.\n\n[align=center][img]http://i.minus.com/iyobmhGt2yol0.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=7807][b][color=#efefe3]VipVince[/color][/b][/url] has been re-promoted to Mentor status.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=515249][b][color=#efefe3]Sir[/color][/b][/url], our beloved and noble father, has reached 1,000 reputation points and 500 prestige points. We love you.\n[/list]\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1109186][b][color=#00aaff]SnowFox[/color][/b][/url] was repfucked.\n[/list]\n[color=white][b]Active Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1791844][b][color=black]๖ۣۜUltimo[/color][/b][/url] was banned for reputation abuse.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=766855][b][color=black][i]Black[/i] Froggy[/color][/b][/url]'s name took on a whole new meaning this week when banned for harassing members. Ha.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=144401][b][color=black]Kaleb[/color][/b][/url] \"demanded\" the addition of notifications when users are quoted. His demand was rejected. His ban was accepted.\n[/list]\n[color=white][b]Expired Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=909253][b][color=#00aaff]βlαcκ Lοτυς[/color][/b][/url] was banned for creating a thread in the incorrect section.\n[/list]\n[color=white][b]Vacations[/b][/color]\n[list][list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1759389][b][color=#efefe3]Tᴇɴᴀxɪᴜᴍ[/color][/b][/url] took a week off.\n[/list]\n[/list]\n[color=white][b]Closures[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1364125][b][color=#383838]#Sultan[/color][/b][/url] banned, repfucked then closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1122112][b][color=#383838]Lonephenom™[/color][/b][/url] was repfucked and closed.\n[/list]\n[color=white][b]Awards[/b][/color]\n[list]\n[*] \n[url=http://hackforums.net/member.php?action=profile&uid=712376][b][color=#00aaff]Jоey[/color][/b][/url] donated, in total, over $500. He was given both the Master Donator, and Businessman.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=787112][b][color=#efefe3]Saturday[/color][/b][/url] donated over $500 himself towards Hack Forums and was given the Master Donator and Dog Lover.\n[/list]\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1452196][b][color=#efefe3]-Nas[/color][/b][/url] is now a leader of the usergroup Complexity.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1759389][b][color=#00aaff]Makaveli The Don[/color][/b][/url] is no longer a leader of the usergroup Complexity.\n[*] \n[url=http://hackforums.net/member.php?action=profile&uid=1374951][b][color=#00aaff]Evangelist[/color][/b][/url] has been promoted to leadership within the usergroup Empire.\n[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of scheduled release date for the HF News edition.[/size][/align]\n\n[align=center][img]http://i.minus.com/ibtD6mgmzoGVeX.png[/img][/align]\n[b]Instructional/Educational Thread[/b] - [url=http://hackforums.net/showthread.php?tid=3812628][Dynasty] eLSB Steganography[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1114693][b][color=#efefe3]Keeper[/color][/b][/url] - Check out this thread detailing an in-depth explanation (and examples!) of steganography,  kleptography, and cryptovirology. \n\n[b]Fun Skills Thread[/b] - [url=http://hackforums.net/showthread.php?tid=3813040]Can you solve this puzzle? [HACKER PUZZLE][/url] - [url=http://hackforums.net/member.php?action=profile&uid=285755][b][color=#efefe3]Cody8295[/color][/b][/url] - With just two winners in more than two weeks, this Cicada 3301-like puzzle surely will make your brain squirm.\n\n[align=center][img]http://i.minus.com/iV2Z5H1KVQP4W.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url][/font][/size]\n[spoiler=][b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Welcome to the 166th edition of the News! Today we're going to interview Vade. So, tell me man - How are ya' today? Any shout outs before we begin?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] Feeling good man. No shout outs in particular, except for my brothas in Infamous.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] True, alright. How did you find out about HF? Did you find out through a buddy of yours, or were you just lookin' for some hackz tools like most of us here?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] Not exactly. Hack Forums wasn't my starting place when it came to hacking-related things. I started my path about 2 years before I even signed up to Hack Forums, modifying various games that ran in Python. I spent over a year and a half doing this. I heard about Hack Forums through a friend on AIM named Poison. From there I tried spreading some of my coding knowledge and trying to learn new things under the coding sections. My first thread to date was a coding-related thread. Since then I've lost interest in coding, sadly.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] You should of kept going with your coding! I can remember messing around with Python. (Didn't know what I was doing) Which games did you modify? Any big titles? Or was it some secret little indie game?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] A majority of them were small titles from unknown companies, but a few known ones would have to be Eve Online, and several Disney MMORPGs. I spent most of my time reverse engineering each game. When I got tired of one, I would go on to the next. I hadn't learned all this myself, of course. I made some friends on the way through my learning process that became lifetime friends; some very smart people. The thing that makes reverse engineering games (especially small-time games) difficult to start is the lack of public knowledge. A lot of the stuff I had to learn weren't in tutorials on YouTube. In fact, none of it was. What I learned was from people who heard something from someone else, or from myself. It was difficult at first, but my interest was so strong that it kept me from just giving up, and I'm happy that it did.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Glad that you made some friends along your journey throughout coding, too. What are your hobbies aside from Hack Forums?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] Aside from Hack Forums, I have an obsession over dogs. I like gaming once and a while, used to game a lot in between the years of 2006-2009. Just tired it out. I spend time with my girlfriend, of course. I love music; I listen to TrapandBass on YouTube a lot. My favorite genres are Chillstep, trap, and heavy bass music. I like orchestral-type music also. I used to use Skype and AIM daily to talk to a lot of the people I used to know, but I guess you could say the group of people I used to love split up. I became inactive on Hack Forums for over 3 months and sort of just left everything online. Started to be active again in June, only on Hack Forums, though.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] You have good musical taste man. I remember when you left us! D: Glad you're back though. A gamer too, eh? Do you plan on getting the new consoles, or are you more of a PC gamer?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] Sorry about that, but when everyone started to break up I just needed a break from this shit altogether. I remember when you were just a wee L33T. I'm back for good, though. PC, mainly. I may get a PS4, definitely not getting an Xbox One. I've grown sick of Microsoft.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Started from the bottom and now we're here, amiright? You better! I'm in a love/hate relationship with Microsoft at the moment. What are you opinions on the theme that is under construction now?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] I'm in a love hate relationship with the new Hack Forums theme. At the moment, I'm using the old school theme because I don't really like the new stars or username colors as much as I did with the old theme. It will take me a while to get used to it, personally I loved the old theme. It almost had a timeless feel to it in my opinion. I don't understand why people complained about it.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] I completely agree. The old HF theme has a certain retro vibe to it. Are you workin' on any projects for HF right now? I've noticed that you've made quite a few threads for helping new users.\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] Tons, honestly. Most of the time I only work on them on the weekends. I have a big one coming up dealing with an Infamous gaming faction; we'll be releasing a montage video of us playing various games on my YouTube channel, http://youtube.com/infamous (the design is under construction, as I already know the banner and avatar don't look the best). We'll be creating a thread sometime around Thursday in the groups general discussions subforum announcing the opening of the Infamous YouTube channel, which will include gaming videos, tutorials, guides, voiced interviews of each of our brothers, and whatever else we can think of. As always, I tend to give myself tons of work and little time to do it. Eventually, though, they will be finished, and I will be giving myself another list of things to do. I won't disclose any other future projects.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Nice youtube man! Lookin' forward to some montages and threads. Now, I remember you as Frenzy from back in the day. Was there some meaning to that alias?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] Funny you mention. Not a particular meaning. It was 2010, I was trying to think of some cool new alias like any other kid, and that popped into my head. I thought it had a nice ring to it. After choosing that as my alias, I realized it actually described my personality pretty well - [i]\"a state or period of uncontrolled excitement or wild behavior.\"[/i] The name just sort of stuck. You're one of very few on this site who know me as this. The rest are all social medium nerds, another big fascination of mine.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Oh, true! I see that you're really active in the appraising section, too. What sparked your interest in the whole scene? Having the youtube/infamous has to be cool, I imagine.\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] After leaving my interest in reverse engineering and coding, I was interested in social mediums because I had met some original AIMs and became friends with a few. I got to know several members of IC3D (http://ic3d.net) who hold some nice originals. I met Joker (Josh) back in this time when he was small in the whole social medium scene. He purchased the AIM \"CoD\" from Christy, I believe. I met him through Nick, a now frienemy of mine. I owned some real nice AIMs through 2011-2012. Most memorably: bass, hitler, cia, brown, red, blue, four, and slash. Some major drama went down a lot during this time, and I'd also not like to mention some of the people I met through this time because some are hated here. I left AIM eventually and went on to collecting YouTubes. That's where I met my buddy Zilla, one of the most prominent people in the OG YouTube \"scene\". He's now on HF by the name of Lord.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Seems like quite the adventure! I had an awesome time interviewing you. Have anything you'd like to say before we're done?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1289770]Vade[/url]:[/b][/color] It's not even close to over yet buddy. Thanks for taking the time to interview me.[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1992268]Thornzzz[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Hello and welcome to the 166th edition of the HackForums new. Today we're interviewing Thornzz. Do you have any shoutouts before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] My boys THL, iNViZ, Harlem, Lovol and Vade!\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Infamous brethren. Nice. So tell us a bit about what brought you to HackForums last month?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] Well, I found the forums while I was searching for a way to get hacks on MW1. Instead of finding them, I found a great comminuty with alot of nice friendly people.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] I see, well you certaintly accomplished a decent amount in only a month. You found yourself in one of the most prestigious groups on the foum. How did that happen? Do you know THL or iNviZ personally?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] Well, I posted on one of iNviZ's threads about artifacts. Shortly after we started talking over PM then he introduced me to THL. We talked for a good hour or two then they invited me to the group.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Well we're certainly glad to have you. Moving on, so I know you're a pretty big fan of Minecraft? Do you happen to play HackerCraft?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] I do, I currently run the Infamous faction on Hackercraft. I like offer my help to all the players and assist others as much as I can while I am on.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] So being the newer member that you are, what are your thoughts on the news team and what we do? Any suggestions?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] I think it's very cool, I like how you guys devote al ot of your time and come together to make the news. I honestly have no suggestions, you guys are doing really awesome with the news! Keep it up!\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Glad to hear. So I assume you've witnessed all this theme drama. What are your thoughts on the Modern theme and which one do you currently use?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] I use old school. I think Omni did a good job on the new theme, I just prefer old school because it is what I am used to. Both of them are good though!\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Fair enough, so aside from HF and Hackercraft, what do you like to do?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] I love playing Playstation. I tend to play alot of steam games like Worms, Papers Please, and TF2. Outside of the internet I like to use my spare time practicing for my wrestling meets and hanging out with friends.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] So you're a gamer eh? Are you excited for the PS4? Do you think the Xbox One will be the fan favorite or will Playstation outshine them?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] Well honestly I currently think it is 60% 40% in favor on the Playstation. I personally will be trying to buy both when I get the cash. In my opinion I think the xbox one will have better games just for their system, but I also think the Playstation will have a better controller and better day 1 drops.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] I personally have the Xbox One preordered so I'm excited for that. One last question, once again, you're pretty new here. Any goals you have set for yourself HF related?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] To help as many members as I can. I wish to give back to HF. I wish to return the favor to the members that helped me when I first joined.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Sounds like an awesome goal. Any closing statements?\n[url=http://hackforums.net/member.php?action=profile&uid=1992268][color=white][b]Thornzzz[/b][/color][/url] Thanks for spending your time to interview me. I hope everyone on HF enjoys it.[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=74674]Blazin[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Hello everybody! Welcome to this weeks edition of the HF News. Today we're interviewing the humble 2009 member, Blazin. Do you have any shoutouts you'd like to give before we proceed?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] Yep I would like to give #CYAN a shout out, and Omni for making this such a kick ass community & bringing us all together.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Splendid. So I noticed you've been providing some feedback in Omni's modern theme thread. How do you feel about the changes that have been made to the theme so far? Is there anything you'd like to see done differently?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] I really like that we have a new look on here. The old one was getting boring, and let's face it, copy sites are ripping the same theme. It's fresh and new and the forum feels alive. What I would like to see change is our stars back to actual stars or diamonds but on this new theme.. I think it would look sexy and a nice touch. Currently the admin user bar does not look good, but I'm sure that will change soon. This theme is a work in progress like anything else nothing new is perfect.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] You're absolutely right, these things take time. So tell us, what inspired you to sign up on HF? What made you stick around?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] I actually joined hf in 2009, right after I graduated high school in 2008. I was taking computer science & working as a IT Technician for dell doing warranty work and things of that nature. During the day @ work I would have tons of free time, I'd finish most my work by lunch, it was a computer shop place, so I could have free time a lot and get paid to browse HF. I Just liked the community and the content. I've been repairing pcs and stuff like that since like 10 or 11. After that I got into websites, and hosting, had my own chat room / website @ like 14. Overall, I liked the community & decided to devote time and money into it. Upgrading to leet, than uber plus all the donations and stuff I wanted to contribute not because they are \"Pixels\" @ Awards and what not. Why do I stick around? I feel like this site is a family, and I just keep coming back everyday, most days I just \"hit new posts\" over and over and frequent a few sections.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] That's awesome, I never knew you had such a technical background. What do you currently do for work if you don't mind me asking? \n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] Currently I have my hosting company, and my own a computer repair service on my spare time. I also do IT work for a company in my area. I hope to expand to a few more clients. I am in my 20's and I have a son. I am not young I guess like a lot of people here.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Sounds like you're a very busy person. I noticed that you're quite the rap enthusiast. Who's your favorite rapper and why exactly? do you prefer mainstream rap or are you more of an underground listener?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] Yeah I enjoy throwing some raps together when I'm bored kills time. I like underground & mainstream some of my favorite top rappers are.\n\n1. Eminem\n2. MGK\n3. Wiz Khalifa\n4. Tupac\n\nI respect underground rappers because they are following they're dreams. I respect mainstream because they made it and are successful.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Very wise. In many cases people struggle to appreciate both the underground artists and mainstream rappers so they end up favoring one side over the other. So what do you want to do with your music? Do you make your own beats?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] I thought about getting into music and uploading to sound cloud, and yeah I make beats and stuff on FL Studio 11 producer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] You should definitely do that, what's your style like?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] I'm mostly into Rap & Hip Hop & R & N & B.. and I guess Trance type/ Techno stuff. Anything with a nice beat I suppose. But I do enjoy Rock and heavy metal and stuff like that. Basically everything besides like Jazz & Country.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Variety, I respect that. So tell us, what goals would you like to see your self accomplish both here on Hack Forums and in real life?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] One of my goals is to be filthy Rich where I can help all my friends and family. :) Lol. I would also like to expand my knowledge in fields I already know information about as well as new things I have no idea about. I also like talking to members here & meeting new people. Some goals I'd like to do on HF is roll out with some new products & services such as a VPN service, Social media boosting and things of that nature. In real life my goals are basically just to be there for my son & be a good father make a mixtape (music) and..I'm currently in the process of getting back with my ex girlfriend. I'm sure I will have more goals as time goes on. I enjoy helping out members as well when I can.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url]  That all sounds very good. I bet it's an amazing feeling to be a father. If you make a mixtape, will you share it with the Hack Forums community?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] Yeah I will, because after I judge myself, I want others to judge me and hopefully give me constructive criticism. Also yes having a kid, is the best feeling in the world. To know that that child is half you.. I can promise anyone who does not have a kid, once you do you understand what REAL love is. I'm not talking about love for your girlfriend that may fade in 2-4 years, this shit is never ending, ever lasting... It's crazy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] It's nice to hear that you're a happy father and that you have so much love for your child. So if you could change one thing about Hack Forums, what would it be and why? \n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] If I could change one thing about hackforums.. let me dwell on this for a second. It would probably be all the negative people on HF That play the \"I'm smarter than you game\" And treat other users like trash. Everyone is smarter at something else than the next person people are specialized in different areas, different skill sets Negativity only brings failure. For example.. scientists come together... and build amazing things they couldn't do alone. Because when two smart people collaborate you get something even more amazing. Smart ideas and opinions need to be shared if we all ever want to grow. That's about all I'd change about HF. Omni has done a great job bringing us all together and making this forum just under half a million user base. I have to admit I'd be slightly sad to see this place go.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url]  We all would Blazin, we all would. Words can't express how true what you just said was. I'd like to thank you for allowing me to interview you today. I'll be sure to check out your mixtape when it's released and don't forget us when you're famous! Do you have any final thoughts you'd like to leave with us?\n[url=http://hackforums.net/member.php?action=profile&uid=74674=][color=white][b]Blazin:[/b][/color][/url] No more thoughts just would like to thank you for taking the time to interview me. I kind of thought the majority of members here over looked me. & I would like to thank anyone who reads this interview. And to all the new members who are out there to stay positive, good things happen for good people. Final note educate seems like a pretty relaxed down to earth guy thank you again for all the questions, it's quite nice.[/spoiler]",
      "subject": "[10/28/13] - HF News"
    },
    {
      "pid": "36006905",
      "uid": "515249",
      "dateline": "1383094565",
      "message": "[align=center][img]http://i.minus.com/iJLlX4wyRdaA7.png[/img][/align]\n[color=white][b]PS4 Day One Patch[/b][/color]\nSony has detailed the contents of the day-one patch on the PS4. The patch is about 300 MB and includes various features and functionality. The day-one update will add support for remote play and second screen functionality, share functionality, streaming and other PS Camera features. However, be wary if you do not have an internet connection; the DVD and Blu-Ray player requires this patch to work. Sony also stated that some other PS4 features will not be available at launch, including the popular suspend/resume mode. You could say that Sony is releasing an unfinished operating system. The PS4 launches in North America on November 15th.\n\n[color=white][b]Next-Generation Analyst Predictions[/b][/color]\nA known analyst from Robert W. Baird predicted that both the Xbox One and PS4 will ship around 1.5-2 million consoles each in North America, with around 2.5-3 million coming from other markets. \"While many forecasts still give an edge to Sony/PS4 in North America sales, we continue to expect similar or even slightly higher sales of Xbox One by the end of the launch window,\" Sebastian said. In the note to investors, Sebastian also stated that the significant mark-ups on eBay for both consoles show the popularity - \"Xbox One preorder sales on eBay are close to $800, while PS4 orders are going for around $600\", he said.\n\n[color=white][b]Pokemon X/Y Update[/b][/color]\nGamers have been stressing over a save-corrupting bug since launch. However, Nintendo has finally released an update to patch this issue. Nintendo are urging players to update as soon as possible. \"We strongly recommend that all Pokémon X and Pokémon Y players download and install this update data,\" Nintendo said in a statement. \"We apologize for the inconvenience.\" The new update also prevents errors that have occurred when players use certain functions in the Global Train Station. You can download the update by vising the eShop or by scanning a QR code on the Nintendo website. You can go to the link [url=http://www.nintendo.co.uk/Support/Nintendo-3DS-XL-/Games/Pokemon-X-and-Pokemon-Y/Pokemon-X-and-Pokemon-Y-Update-Data/Notification-About-Pokemon-X-and-Pokemon-Y-Update-Data-822619.html]here[/url]. \n\n[color=white][b]Video of the Week[/b][/color]\nMicrosoft has released a TV ad for their upcoming console, the Xbox One. The commercial features Star Trek's Zachary Quinto and Liverpool midfielder Steven Gerrard. The ad focuses on various aspects of the console and games such as Titanfall, Forza Motorsport 5, Dead Rising 3 and Ryse. \"This is an invitation to a new generation,\" a narrator says. \"Where your games and entertainment are no longer separated, but together, in one.\" The Xbox media blitz has started and was estimated to cost about 100 million dollars. The advertisement, or at least some sections, will be featured in 12 markets and will run during popular TV shows, shown on billboards and play at movie theaters. The Xbox One launches on November 22nd worldwide. \n\n[align=center][video=youtube]http://www.youtube.com/watch?v=_1mfIg1I3zE[/video][/align]\n\n[align=center][img]http://i.minus.com/iX3LnqNnUtm2v.png[/img][/align]\n[b][color=white]1.7.1 and 1.7.2 Pre-Release[/color][/b]\nTreated just like that of a snapshot, versions 1.7.1 and 1.7.2 have been made available to play by allowing experimental versions to be used when creating a new profile in the Minecraft launcher. In addition to the previously added new blocks (including stained glass, red sand, podzol, etc), new trees have been added along with new flowers to be found in some of the newer biomes. For the most part, though, as these are experimental releases, a lot of bug fixes have been addressed-- making the updates a bit more playable for everyone.\n\n[b][color=white]1.7.2: An Update to Change the World![/color][/b]\nFollowing [url=https://twitter.com/jeb_/status/393400494405980160]a tweet by Jeb[/url], Mojang's new Minecraft update is to be pushed on the 26th of October and furthermore change the world (of Minecraft)! In addition to tons of bug fixes, the new update is to add new biomes, new blocks (podzol, red sand, and stained glass), better biome generation (less oceans), better fishing (including new enchantments alongside new fish), better server management, server icons, and tons of technical stuff to say the very least. There are plenty more additions, but surely that's way too much to list in one article. To read more, however, visit [url=https://mojang.com/2013/10/minecraft-1-7-the-update-that-changed-the-world/]Mojang's blog post[/url] or [url=http://hackforums.net/showthread.php?tid=3826057]Brudin's HackForums thread[/url] regarding the update.\n\n[b][color=white]Minecraft's 360 Edition: A Halloween Texture Pack[/color][/b]\nAvailable from October 25th to November 3rd, 4J Studios released a free Halloween-themed texture pack for all players on the Xbox 360 edition of Minecraft. With the disguising of mobs, blocks in general, and even the environment (in terms of sky, precipitation, and flowing textures), players truly get a trick-- or treat-- of Halloween while playing Minecraft. Due to its limited-time offer, though, players are recommended to visit the Xbox Live Marketplace as soon as possible to download the texture pack.\n\n[b][color=#43a828]Hacker[/color][color=#9428a8]Craft[/color] [color=white]News[/color][/b]\nThe third edition of HackerCraft's news will be made available in the [url=http://hackforums.net/forumdisplay.php?fid=252]HackerCraft section[/url]. View it there upon its release!\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]PokeClash[/color][/b]\nEver play the Pixelmon modpack? If so, head over to Pokeclash today for a friendly environment, constant drop parties and gym battles, and new ranks. Heck, even if you haven't played the mod before (and you like Pokemon), you should definitely check out the server today at play.pokeclash.com!\n\n[align=center][img]http://i.minus.com/ibx5gFlLxx9bJ1.png[/img][/align]\n[color=white][b]NSA Head Defends Surveillance Programs[/b][/color]\nGeneral Keith Alexander spoke in an interview with the US Department of Defense blog about the reasoning and necessity of the United States' surveillance programs, recently leaked by Edward Snowden. Remembering the 9/11 commission, an internal investigation on the September 11th terrorist attacks that blamed the US intelligence community on failing to connect the dots, Alexander explained these surveillance programs are the solution and response to these shortcomings by compiling all of the information in ways that are easier to analyze. These programs, Alexander said, were akin to parents making their children wear seat belts in the car; they may not be comfortable and the children may not like it, but it is the best way to keep them safe. He also attacked the media who, in his eyes, misinterpreted the situation in an effort to sell more papers. The full interview may be found on the [url=https://www.youtube.com/watch?v=6Kc5Xvr24Aw]Department of Defense YouTube page[/url]. Keith Alexander will be retiring next year.\n\n[color=white][b]Earthquake Near Japan... Again[/b][/color]\nA 7.1 magnitude earthquake hit 200 miles off the coast of Fukushima, the location of the nuclear reactor damaged by a 2011 earthquake in the same area. Fortunately there was no damage to the power station and the subsequent tsunami warning has since been lifted.\n\n[color=white][b]NSA Monitors Foreign Leaders' Personal Phones[/b][/color]\nGerman Chancellor Angela Merkel called United States President Barack Obama last Wednesday over concerns that the US may have been tapping her phone, describing such methods as “totally unacceptable.” A US spokeswoman explained to reporters that “[t]he President assured the Chancellor that the United States is not monitoring and will not monitor the communications of Chancellor Merkel” (via [url=http://www.spiegel.de/international/world/merkel-calls-obama-over-suspicions-us-tapped-her-mobile-phone-a-929642.html][i]Der Speigel[/i][/url]). The White House refused to comment on whether or not the US monitored Merkel's phone in the past. Following this scandal, [url=http://www.theguardian.com/world/2013/oct/24/nsa-surveillance-world-leaders-calls ]the [i]Guardian[/i] published another Snowden leak[/url] that revealed 35 unnamed world leaders were under similar surveillance.\n\n[color=white][b]Saudi Women Fighting For Driving Rights[/b][/color]\nMany women throughout Saudi Arabia are taking a stand for civil liberties by driving out of protest of a de facto rule that disallows Saudi women from driving. Taking to the roads, the campaign reaches from the capital city, Riyadh, to the one of the country's most conservative towns, Buraidah. The Saudi Interior Ministry strongly noted that all laws “will be enforced” on the “female driving day” which was, as of this writing, planned for Saturday October 26th.\n\n[align=center][img]http://i.minus.com/ibnGw6pRzIThtL.png[/img][/align]\n[color=white][b]Samsung Patents Sports Glasses Style Smartphone[/b][/color]\nSamsung seems to be looking to cash out on the sudden influx of smartphones built into glasses. The technology company had recently submitted a design patent which was improved in South Korea. This design seems to have the look of sports glasses, but with rounded lenses. The design also has what appears to be earphones and a screen like area. There aren't many details out now, and only time will tell if this design comes to fruition.\n\n[color=white][b]AMD’s Radeon R9 290X Now Available[/b][/color]\nAMD is finally revealing details about their flagship graphics card, the Radeon R9 290X. This card is a huge step up from everything on the market now. The card is loaded down with 2,816 stream processors, a 512-bit memory bus, and 4GB of video RAM. AMD has stated that this card is built with 4k graphics in mind. This card is now shipping out to stores, and will have a price tag of $549.\n\n[color=white][b]New iPhones officially available in 35 more countries[/b][/color]\nApple has just started putting both new iPhones up for sale in 35 more countries. This comes after the launch last month, where many countries were left out. The countries include Russia, South Korea and most of Europe, including other countries. Apple also plans to release the iPhone 5s and 5c in 16 more countries come November 1st. \n\n[color=white][b]Pinterest Teaming Up With Getty Images To Provide Metadata To Your Pinned Photos[/b][/color]\nWith a wide variety of photos and users, Pinterest is coming increasingly popular. That being said, it should come as no surprise that the photo-based social network is teaming up with Getty Images to provide metadata on the photos you pin. The data includes the photographer’s name, the license type, the title and the caption. The company is paying an undisclosed sum for this data, but it will help the users of the site avoid any copyright complications that may have come about from using these images.\n\n[align=center][img]http://i.minus.com/i8dSB5532O5GV.png[/img][/align]\n[b][color=white]Lupe Fiasco to Childish Gambino: \"I watch more Anime than you\".[/color][/b]\nWhen did watching Anime become the cool thing to do in rap? The two exchanged in a Twitter back-and-forth back this summer, which Lupe eventually stated that it was a joke. According to MTV, \"when Gambino went on air with the Breakfast Club yesterday, the rapper and actor never clarified that it was indeed a fake beef, only saying that his eventual response was a verbatim quoting of Chief Keef's infamous tweet aimed at Lupe back when they had Twitter beef. He accused Lupe of \"sneak dissing\" him because he wasn't a street dude, unlike Keef.\" I wonder if they watch Machine-Doll wa Kizutsukanai... maybe loli?\n\n[b][color=white]Drawing Contest to Win Tickets to the Odd Future Carnival And Meet & Greet with MellowHigh.[/color][/b]\nMySpace is trying to become big again and has decided to hook up with Mellow High. The prize package includes tickets to the Odd Future Carnival (which takes place November 9) and a meet and greet with the group. To enter, you must draw Draw Domo Genesis, Hodgy Beats and Left Brain. Taken straight from Complex, \"submissions for this contest end October 29 and the winner will be announced on Halloween (10/31), which is also the day MellowHigh's self-titled album will be released.\" To learn more visit [url=https://myspace.com/discover/trending/2013/10/16/how-to-draw-mellowhigh-contest/]MySpace[/url].\n\n[color=white][b]Miley Vs. The Biebs[/b][/color]\n\"Miley Cyrus will take on Justin Bieber to determine just who is the Best Act in North America ... and the winner will represent the entire continent at the 2013 MTV EMA.\" It's a lose-lose situation for North America as we either get represented by the twerk monster or the guy who spit on his own fans. Miley has been nominated for the best U.S act and Bieber was nominated for the best Canadian act, eh? Seriously, out of all the talented artists, we get stuck with these two representing North America?\n\n[b][color=white]Music of the Week:[/color][/b]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=PeQWPRtxn-s[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/ih4DkNmH5M949.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nEat yer vegetables.",
      "subject": "*"
    },
    {
      "pid": "36006911",
      "uid": "515249",
      "dateline": "1383094586",
      "message": "[align=center][img]http://i.minus.com/ibvB54RmtuIUlF.png[/img][/align]\n\n\"What keeps you on Hack Forums?\"\n\n[i]\"What keeps on HF. Good question actually, because it is \nthe complete opposite of what I had ever thought upon \njoining this community. I was originally in the belief that \nHF would turn me into some l33t movie hacker, but soon \ncame to realize that, that was way too much to ask of myself. \nI then started talking casually to a lot of members, and I think \nthat those are the ones that make me stay. The members. The \npeople you meet on your way through the massive amounts of \nthreads. All the people you had a good laugh with, or even at. \nThe people you can relate to, the ones you disagree with and \nthat you can have discussions about everything from the meaning \nof life, to how dumb BagHead is. There is not a single member in \nFBN that makes me want to consider leaving this place. So to \nanswer broadly, the thing that keeps me on the forum, is the people.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=770060][i]-Invisus[/i][/url]\n\n[align=right][i]\"Hackforums isn't quite known for 'hacking' or \n'computing' - Rather, it's moved past that and formed a community, \nand the best part is that the community has many many sections, \nsuch as the programmers, hackers, lounge whores(Lord help them) \nor just general members flying around with ridiculous amount of \nposts meeting more and more people. The second I joined HF, I \nwas over whelmed, not that I didn't fit in, but because I didn't \nknow where to start, I could learn hundreds of skills just by reading \nthe threads posted by some of HF finests, been here for a few months \nand I still share that love that I had the day I joined. I don't choose \nto stay here, I stay here because I value learning.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1908096][i]-Mint.[/i][/url][/align]\n\n[i]\"I think it is the small tick that our brain gets when someone \ncontacts us that keeps us coming back to hack forums. Whether \nit be a reply to a thread we posted on, or that little green bar \nacross the top of our screen to signify that we have a new private \nmessage, we like to know that we're in contact with many people. \nMany of the people on hackforums, (such as myself), may have \ntrouble making friends or starting conversations with people in \n\"the real world\", so we resort to a forums like this one. When I \nsay \"resort\" I don't mean last resort. It may start out as that, \nbut as we make friends and share opinions we start to see that \na website suck as hackforums may offer the same of even perhaps \na better community than one we may find at school, work, or out \nin the world. Hack forums is a home of sorts to many people, and \nit always feels good to come back home.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1836722][i]-Chills[/i][/url]\n\n[align=right][i]\"The friendly atmosphere and the awesome people \nthat are always ready to help when you have run into a problem :) \nAlso the fact that it's not only focused on hacking, also having the \nComputing, Security and Education Nation sections have helped me \nout a lot. I think that once you're part of a forum like Hack Forums, \nyou don't really use any other forum, the theme design (Old School \nand Modern) are clean and easy to read. Once I joined Hack Forums \nI never thought that I would be so involved and helping people out \na lot of the time, Hack Forums has helped me in so many ways, and \ni'm glad I joined and i'm here to stay :)'\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1999586][i]-Defirence[/i][/url][/align]\n\nThe topic for next week is \"How do you like the updated Modern Theme?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/iD2yZbLEetACs.png[/IMG]\n[img]http://i.minus.com/ibgBhlPByqv631.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/ibvCM1Z22wtoEe.png[/img][/align]\n[align=center][spoiler=][img]http://lunarbaboon.squarespace.com/storage/comicswear125.gif?__SQUARESPACE_CACHEVERSION=1383042234707[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.smbc-comics.com/comics/20131029.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://31.media.tumblr.com/2a687e93207e09b8d909d86fb4a005a8/tumblr_mve4sp8Fxn1rlynuno1_1280.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.lefthandedtoons.com/toons/drew_inspiration.gif[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://24.media.tumblr.com/8fccf0e6b09799f864bcf9d830380215/tumblr_mvcxd19gmP1sd2kxeo1_1280.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/XrkUzXe.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/iOxJ1fCJvvnsB.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=956054]Emylbus[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=752389]drugs[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1653635]Educate[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}