{
  "posts": [
    {
      "pid": "17809628",
      "uid": "515249",
      "dateline": "1322708676",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]69th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[b]A couple of notices:[/b]\n[list][*]The webshow and more content will be added on the morrow.[/list]\n\n[align=center][img]http://i432.photobucket.com/albums/qq50/tasemu/Hf%20News/hfheadlines.png[/img][/align]\n\n[b]Hack Forums News team recruiting[/b]\nWe are currently looking for some new writers to add to our team, Sir has plenty of ideas in stock and is waiting for you to apply! Being a part of the Hack Forums News team means that you will be admitted in to the Writers usergroup and become a part of the weekly news. Please go see our recruitment thread [url=http://hackforums.net/showthread.php?tid=1970087]here[/url].\n\n[b]Kindle Sales Banned[/b]\nOmniscient informed hackforums this week, that selling Kindles in the Marketplace is now banned. Omniscient stated that there was most likely fraud involved in the receiving of these kindles. For More information regarding this topic, read [url=http://hackforums.net/showthread.php?tid=1953238]here[/url].\n\n[b]Social Engineering and Human Manipulation section re-opened[/b]\nLast Week Omni closed the Social Engineering and Human Manipulation section. In regard's to the reasoning of this, Omni stated that there was corruption in the section, and it needed to be close. This week it is was reopened.\n\n[b]Minnesota Nice hits 20,000 posts[/b]\nThe Member Minnesota Nice has been here since September of 2009. Today he is the 3rd member, behind mothered- and Vitani's Mate, to ever achieve 20,000 posts. He has helped the forum with graphics, and much more. You can read about it [url=http://hackforums.net/showthread.php?tid=1970120]here[/url].\n\n[b]Black Knights finally finished recruiting[/b]\nThe leader Amp™ said that recruitment was supposed to end on the 15th of november but it turns out took until November 29th until the members were added. You can read more about it [url=http://hackforums.net/showthread.php?tid=1970120]here[/url].\n\n[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"Do you prefer having less staff and more mentors, what is your take on the subject?\"\n\n[i]\"I prefer more mentors and less staff because they are usually more available and not \nflooded with so many PM's as much as staff are. That's because their name shows up \nnormally, and not green. They are moderators of the majority of sections and can save \nusers from getting warning levels by staff members.\nShout out to: xerotic, kutmustakurt, iNviZ, Kr4z1 <3\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=406243][i]-WiFi.[/i][/url]\n\n[align=right][i]\"Personally i think that it is better to have more staff. Staff are able to take more\n action in various parts of the forum; while in other parts where the mentors do not usually venture\n to; there is little or no action on their behalf. If you make a report post, then staff are able to see\n what it is and deal with it accordingly. This is an invaluable asset as they can see what people find\n inappropriate without having to find a mentor that is online and contact them. Possibly if the mentors\n were able to see the reports, but not who reported it, they could help out more.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url][/align]\n\n[i]\"In my opinion, having less staff is a lot better than having more mentors. Being part of the Hack Forums \nStaff is the ultimate privilege, access to all areas, and being ultimately respected. Mentors are a form of 'Jr \nStaff', which is good because it shows that they are sort of above others, but aren't on the same level as \nstaff whom give out warnings and bans. We don't need to have much staff, though we are a forum with \nhundreds of thousands of people, we can't give every Tom, Dick and Harry the ultimate honour of becoming \nStaff. The ranking system we have now is great, and doesn't need much tinkering.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=734805][i]-Glassy[/i][/url]\n\nThe topic for next week is \"How do you feel about the banning of Kindle sales in the Marketplace?\" \n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[align=center][img]http://i432.photobucket.com/albums/qq50/tasemu/Hf%20News/worldnews2.png[/img][/align]\n[color=white][b]Cairo calm as voters await results[/b][/color]\nTahrir Square was peaceful Wednesday as Egyptians awaited initial results of parliamentary elections, a break from the clashes that have gripped Cairo for much of the past two weeks. The Muslim Brotherhood and the Al Noor Salafi Muslim Party claimed a lead in ballot counting, but no official results were expected until Thursday at the earliest.  Voting took place Monday and Tuesday, the first elections since President Hosni Mubarak was overthrown in February. It is the first time some Egyptians -- young and old -- have ever cast ballots. Citizens are picking members of the lower house of parliament, which will be tasked with drafting a new constitution after three decades of Mubarak's rule. Some voters and human rights activists expressed hope that their votes will actually count, though some boycotted the elections saying they don't trust the voting will be free and fair.\n\n[color=white][b]British workers strike over retirement benefits[/b][/color]\nMass strikes swept across the United Kingdom Wednesday, with public sector workers walking off jobs in schools, hospitals and police stations to protest proposed pension reforms. The government said the majority of key public services remained open, however, although more than half of the country's schools were closed, affecting many families. The unions said up to 2 million public sector workers could go on strike but early indications suggested the total might be fewer. The proposed pension reforms have prompted wide anger among public sector workers, many of whom say they are bearing the brunt of austerity measures imposed to try to rein in Britain's deficit.\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i432.photobucket.com/albums/qq50/tasemu/gfxwalls/29-11-2911.png[/img][/align]",
      "subject": "[11/30/11] - HF News"
    },
    {
      "pid": "17809646",
      "uid": "515249",
      "dateline": "1322708716",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://goo.gl/UOfH1][color=white][b]Mark Webber[/b][/color][/url] - He had his wonderful birthday last Monday.\n[url=http://goo.gl/ZGZVw][color=#0066FF][b]Mono[/b][/color][/url] - Mono had his birthday this week, happy birthday!\n[url=http://goo.gl/jeUvc][color=#FF0000][b]fl3x[/b][/color][/url] - This user was repfucked and limited for impersonating staff.\n[url=http://goo.gl/GBKwE][color=#FF0000][b]Hopsin[/b][/color][/url] - Hopsin was repfucked, then limited for complaining about the repfuck.\n[url=http://goo.gl/oeu5d][color=#FF0000][b]๖ۣۜSkiller[/b][/color][/url] - ๖ۣۜSkiller was repfucked and limited for several reasons, mostly reputation abuse.\n[url=http://goo.gl/WzsjB][color=black][b]nidhish91[/b][/color][/url] - Nidhish was banned until 12-15-11 for his vacation.\n[url=http://goo.gl/DgcQ0][color=black][b]Ups.[/b][/color][/url] - Ups. has gone on vacation until 11-30-11.\n[url=http://goo.gl/ZvXnX][color=black][b]Scooter[/b][/color][/url] - Scooter was banned for the reason \"Nonsense with JD\" and he will be unbanned on 12-11-11.\n[url=http://goo.gl/3w1Dn][color=black][b]Existence[/b][/color][/url] - Existence requested a vacation ban, he'll be back on the 12-02-11.\n[url=http://goo.gl/UtHlv][color=black][b]Pali[/b][/color][/url] - He went on vacation and will be returning on the 12-05-11.\n[url=http://goo.gl/7xw4K][color=black][b]Prominent[/b][/color][/url] - Prominent left Hack Forums due to real life problems, whether he will return or not is still unknown.\n[url=http://goo.gl/HHxkV][color=black][b]Demoralize[/b][/color][/url] - He has requested a vacation ban until 12-03-11.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Gaming Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1966132]How to keep your Gamertag secured.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=878612][color=#0066FF][b]Stormy[/b][/color][/url] - If you are out there buying a stolen gamertag or trying to keep your own, this thread will help you secure it. If you play the 360, this is no doubt beneficial to you.\n[i][b]Interesting Thread[/b][/i] - [url=http://goo.gl/n44Nu]Very Interesting Video on the Universe, Society, and Reality in General.[/url] - [url=http://goo.gl/50DEy][color=white][b]Bankroll[/b][/color][/url] - This was just an interesting video and point that you should watch, he also provides some other videos to bide your time.\n[i][b]News Thread[/b][/i] - [url=http://goo.gl/tMjaD]Egypt New human case of avian influenza H5N1[/url] - [url=http://goo.gl/2I5un][color=#0066FF][b]Ŀucien Lachance[/b][/color][/url] - There have been startling cases of a new avian influenza in Egypt and Ŀucien has shared some of the facts with us.\n[i][b]Banner Thread[/b][/i] - [url=http://goo.gl/rVkym]Christmas Header[/url] - [url=http://goo.gl/hLc4U][color=#0066FF][b]Bentley[/b][/color][/url] - Bentley has created a compilation thread for all of the banners created by members in the hopes of it becoming the official Christmas day banner.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Ŀucien Lachance[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Daniel Faraday[/color][/b]: Thanks for taking the time to do this interview. Do you have any shout outs?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: Shout out to Nilef, mah scottish bro.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: So, how do you spend your time on HF nowadays? \n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: I don't spend much time on HF anymore. Usually lurk about the lounge when I do come online, but no so much the SSRP section, as it looks rather hopeless without moderation.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: Do you feel different now that you’re no longer a moderator?\n[b][color=#1466ff]: Ŀucien Lachance[/color][/b]Moderators don't have very much power at all, but I kept the section in tip top condition. But yes, I was only irritated that I was demoted over such a retarded thing, but today I care a lot less.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: Was it a pleasant experience, or have you had better times on the site?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: I think back when the lounge was unrestricted was a very hilarious time in HF history, and also a fun one - back in the day when I could stay on HF until 5 AM laughing my ass off. Not that being a moderator wasn't fun.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]Was the choice to leave was a personal decision?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: No. I had multiple accounts. My PC had a RAT or a keylogger, so I made another account to post HJT logs. I had another account when I didn't feel like retrieving my main password, and Omni demoted me for this.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: What do you think about the state of the SRPP forum?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: I think alot of the stuff is repeatative, with a few threads of original content every now and again. But apparently the majortiy of people like these repeatative threads, as they usually have the most posts. So when I was a moderator, would close threads on religion if the exact same thing was already being discussed recently.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: Do you think that activity in the forum will pick up?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: In SSRP? Yes, as the number of total members grows, I'm sure more people will come to the section, and some will leave too.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: How about future reforms? Will they be handled well and welcomed by the people who frequent it?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: Reforms so far have went smoothly. Omni is a rational man. He does things for a reason, and he listens to people. Tbh, if Omni were a dictator, I would want to live in that country.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: Well, if you could be moderator of a different forum, which would it be?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: Dunno, maybe a BF3 forum. \n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: What about if Omniscient made you your own forum?\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: That would be kewl. Even cooler if I got revenue. But I'm not a progammer like Omni, so outside of moderation I am retarded. If I had a choice, it would either be a drug forum, or a military forum.\n\n[b][color=#1466ff]Daniel Faraday[/color][/b]: Let’s wrap this up with a less serious closer. Omni, iBf, and Nyx- are in a cannon. Shoot one, marry one, secretly see one.\n[b][color=#1466ff]Ŀucien Lachance[/color][/b]: Do you think im one of them homersexual types?[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Orgy[/font][/size][/color][spoiler=]\n[b][color=#145ff9]Michael Westen[/color][/b]: Hey Orgy! Thanks for taking the time for this interview, I know you're a busy guy. Anyone you want to give a shoutout too? \n[b][color=#145ff9]Orgy[/color][/b]: QUERY LEMONS and of course, my buddy Sir.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: Umm, alright haha! I'm not familiar with him, if that is a person. I'm curious, why did you first join Hack Forums?\n[b][color=#145ff9]Orgy[/color][/b]: To skid it up, yo. Back then I was playing with some shitty rx bot, and my friend pointed me to this place. I immediately knew it was nothing but skids. But I was a skid back then and so I scooped up some free irc bots and started playing with those.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: I see - I guess some of that led to your future success. Speaking of success, why did you become a part of the Marketers?\n[b][color=#145ff9]Orgy[/color][/b]: It's where I belong. I don't know who all might have made more money than me here on HF alone, but I'm definitely in the top 5.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: Yeah - You're definitely known around the forum as the wealthy, but controversial, moneyman. Why did you pick the name \"Orgy?\"\n[b][color=#145ff9]Orgy[/color][/b]: Oh, that's a story I've told a lot. It's weird how many people ask me that. I used to go by Blade, which I picked up on Starcraft AGES back. Was playing some text based game, and I made a lot of enemies as Blade. I created the name Orgy on a whim, because it wasn't taken and I needed to 'go underground' to infiltrate my enemies. I actually ended up becoming friends with those enemies, and gained a lot of popularity on it, so I kept it.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: Interesting - It's always interesting to learn why people pick their name. I picked mine because it was the main character on my favorite TV show. What inspired you to start BooterDown?\n[b][color=#145ff9]Orgy[/color][/b]: Actually, BV1 started it. He built up the site and everything and then showed it to me. I figured it was a good idea, and passed it on to Lith in IRC. He advertised it on HF and it immediately gained a lot of popularity.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: Wow, awesome. Well it's definately been making ripples ever since it began to pick up motion. For those users who don't know what BooterDown is, would you care to summarize it?\n[b][color=#145ff9]Orgy[/color][/b]: We're the good guys. We're taking down all the booters run by people who shouldn't be running booters. Those that are ripping off their customers, etc.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: How do you think BooterDown has impacted our Marketplace?\n[b][color=#145ff9]Orgy[/color][/b]: I wonder sometimes if it has. Sure, we've gotten rid of a good number of booters, but it's difficult to keep them from coming back. We need more supporters. When we first started we had a lot of hype and a lot of people reporting booters, etc. Now it seems there's only a few people. Need to get that hype back.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: If you're interested in BooterDown, be sure to check it out - They need all the support they could get. If you don't mind me asking, how much have you made on Hack Forums?\n[b][color=#145ff9]Orgy[/color][/b]: Of course, I'm not sure of an exact number, but it's tens of thousands. I've made somewhere between $20k and $35k here.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: And to think I was proud of my $200! That's an impressive number, not to mention that it was all made online. This is more a personally motivated question, as we used to play Minecraft together. Why aren't you a part of the Minecrafters, knowing how active you are on Minecraft?\n[b][color=#145ff9]Orgy[/color][/b]: Actually, I applied to it last night in the UserCP. I'm not big on usergroups, only interested in joining those that seem to be more exclusive. I wish the Marketers were more exclusive. BV1 and I are thinking of buying our own group.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: I hope to see you in the group! I think another official Hack Forums group has a lot of potential - Best of luck! Do you have any words for the members of Hack Forums before we wrap this up?\n[b][color=#145ff9]Orgy[/color][/b]:Yes. For the love of any God that any one of you might believe in, stop posting in the Marketplace asking for PayPal support. Just go to PayPal support you stupid fucks. :)[/spoiler]\n\n[align=center][img]http://goo.gl/G1F5k[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[b]The webshow will be done on the morrow, there was not enough time.[/b][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n\n[/spoiler]",
      "subject": "*"
    },
    {
      "pid": "17809662",
      "uid": "515249",
      "dateline": "1322708743",
      "message": "[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aquarius:[/font][/size][/color][spoiler=]\nThis week you'll feel warm and loving to a friend or perhaps a group or a member of your group. You feel you can identify with them. They embody values you admire. This might even involve an old friend you haven't seen for a while. Whatever the case, be careful because arguments later in the week, about shared property, inheritances, debt, taxes or how a certain amount is spent, could suddenly turn nasty. In fact, because you are so hopeful and passionately identifying with someone, your disappointment might be even greater. You might feel let down or betrayed. (Always forgive your enemies, nothing could annoy them more.) [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Pisces:[/font][/size][/color][spoiler=]\nThis will be a memorable week. No question. Your relations with powerbrokers, authority figures, parents, teachers, VIPs and the police are very intense - and very meaningful to you. In one way, everything is wonderful and going swimmingly. But don't count your chickens before they're barbecued. Late in the week, arguments with partners and close friends might erupt. It's almost like too much of a good thing is tough to handle. But you can avoid this nastiness. Try for a middle-way approach to everything. Don't be happy nuts and don't be angry nuts. You're very emotional and sensitive. Keep your cool or others will think you are silly nuts. Which, of course, you aren't - but highly emotional behaviour about things that others don't feel emotional about is always questionable.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aries:[/font][/size][/color][spoiler=]\nThis week, most of you can stay out of trouble if you avoid arguments about politics, religion and racial issues. Actually, avoid arguments about publishing, legal matters, medicine, the media and anything to do with travelling or higher education. Hey, let's forget specifics - why not just avoid arguments? The name of the game is to be happy, right? You are definitely a passionate sign. You live your life with passion because anything else would be stale. Meanwhile, travel and philosophical issues are important right now and you're revved up about health issues or something at work. Oy vey. You're ready to go off with the slightest provocation. Remain calm. [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Taurus:[/font][/size][/color][spoiler=]\nYou have enormous financial savvy. No matter what you do for a living, you know how to parlay a little amount of money into something substantial. And even though you love your creature comforts and the good life, you are ever watchful about your cash and possessions. Perhaps this is why inheritances, shared property, taxes and debt are touchy subjects this week. It certainly looks like you can expect squabbles about sports, social expenses, child-related costs, vacations and wanting your fair share of something. But will fighting get you what you want? Probably not. Be patient but be smart. Think of your objective. (\"I want it all!\") [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Gemini:[/font][/size][/color][spoiler=]\nOh dear. This is the classic week for arguments with partners and friends. For starters, do yourself a favour and refrain from telling others how to improve their lives or how to do things, even though you can see you're right. (This will go over like a lead balloon.) Ex-partners, back on the scene, might also trigger arguments directly or indirectly. Furthermore, you are sensitized because domestic stress due to chaos and increased activity (renovations? family conflicts?) has you on edge. Calm down. Don't say anything you will later regret. Partnerships can be sexy! (Just remember: A woman's place is in the house - and the Senate.) [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Cancer:[/font][/size][/color][spoiler=]\nYou're luckier than some this week because where you feel aggravated is related to job, earnings and possessions. So for the most part, your private life, home and family will be buffered from this angst. (That's a relief.) Nevertheless, relationships with co-workers will be testy because of errors, mix-ups, delays and cancellations. (Of course, this is frustrating.) Nevertheless, resist the urge to introduce reforms or suggest better ways of doing things. Not good! (Also not smart.) Be low-key. Right now Mars is making you come on like gangbusters. You're more pushy than usual. This is one reason others react so strongly to you. Remember: You catch more flies with honey than vinegar. Sweeten thy tongue. [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Leo:[/font][/size][/color][spoiler=]\nA tricky week ahead. The areas you'll feel most passionately about are the areas you always feel passionately about, namely: romance, your kids, social events, the arts and your creativity. Fortunately, passion about these areas can be positive and thrilling or extreme agitation. Passion can always go both ways. Friction with finances related to these areas (like how much your kids cost) will be classic. You easily spend money on romantic partners, kids and entertaining. Just don't go overboard. Tighten your purse strings. And don't tell your kids how to live. (You know who you are, hopefully. It's tough being nostalgic with a bad memory.) [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Virgo:[/font][/size][/color][spoiler=]\nWow! You've got energy to burn. (That's because fiery Mars is in your sign now and it's gonna stay there for the next eight months.) This is energizing for you, but do be careful while you're struttin' your stuff because your cocky, confident attitude might trigger domestic disputes or arguments with family members. Of course, this doesn't have to happen, it's just a possibility. Many of you will throw yourselves with delighted abandon into redecorating and renovating projects or home repairs. You want to see improvements where you live, especially to plumbing, bathrooms and even garbage areas. (\"Let's do this recycling right.\") I think you have an excellent opportunity to use this passionate influence this week in a very positive way. You can improve your life! [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Libra:[/font][/size][/color][spoiler=]\nI mention in All Signs above that there's a particularly strong \"passionate\" influence this week. Some will more easily use it to their advantage, while others might be more challenged by all this emotion. Regretfully, you are in the latter category. The good news is it will make your writing, speech and communications with others very bold and passionate. If you're in law, sales, marketing, or you write, teach, act -you can really use this to be dramatically effective. However, this same influence can blind your logic and make you argue for the sake of arguing. You have to be right. Try to catch yourself if you fall into this because how silly you will look! And you're not silly. \"Let the Wookie win.\" [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Scorpio:[/font][/size][/color][spoiler=]\nThis week, there's a good chance your feelings will be all stirred up about finances, cash flow, earnings or how to get a job, or something to do with how you currently earn your money. Naturally, none of this is casual stuff - not right now. This could be why you're at odds, later in the week, with a friend or a member of a group. (Ouch.) Try not to avoid this because, essentially, (just ask yourself) how can it work in your favour? Quarrels with others, and especially burning bridges, cannot help you in the future. Meanwhile, you do have a chance to boost your income (and spend it). Do this by embracing something you really enjoy. This could be related to the arts or making things look better. Get in touch with previous employers for surprise opportunities. [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Sagittarius:[/font][/size][/color][spoiler=]\nYou will really relate to my comments in All Signs above about feeling passionate this week. You will feel passionate about romance and relationships. In fact, you'll feel passionate about life in general. However, guard against your passion mushrooming to the point where you end up arguing with authority figures - bosses, parents, teachers, VIPs or even the police. It's wonderful to feel bigger than life. But you still have to deal with everyone \"out there in the dark\"- remember Sunset Boulevard? Count on your good fortune with health, employment and your job scene. Don't alienate others this week, especially those in authority who might affect your future. (\"These are not the droids you're looking for.\") [/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Capricorn:[/font][/size][/color][spoiler=]\nThere appears to be something that you want very much to happen, and yet you're being silent about it. (Or you're just playing your cards very close to your heaving bosom.) You're working behind the scenes or alone on something that matters enormously to you. (In addition, some of you are dabbling in a secret love affair. Although I think dabbling is not the operative word - you're plunging in!) Well, whatever happens might affect travel plans or something to do with publishing, the law, medicine and higher education. Adverse possibilities could precipitate conflict - especially legal - in these areas. Tread carefully. Do not wake the sleeping giant. [/spoiler]\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/news.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list]\n[*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][url=http://goo.gl/aJS0l]Diabolic[/url][list][*]\n[*]Headlines[/list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list]\n[*][url=http://goo.gl/jZvPh]TheHackersLove[/url][list]\n[*]World News\n[/list]\n[/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/JJuWm]Daniel Faraday[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/gGUxd]Astonish is NJ[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}