{
  "posts": [
    {
      "pid": "4557624",
      "uid": "74244",
      "dateline": "1276377365",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\n[align=center]Edition 5 [/align]\n[size=large][color=#FFA500]\nHeadlines[/color][/size]\n[color=#1E90FF]\nThis week, [url=http://hackforums.net/member.php?action=profile&uid=65784]XCH4NG3[/url] became staff. This guy is definitely a great choice, and will fit in well. He's one of my favorite members on the forums, due to his positive attitude, and hard working abilities. Congratulations and may you strive as a staff member.\n[/color]\n[color=#FF4500]Another staff member was chosen this week, the other new one being [url=http://hackforums.net/member.php?action=profile&uid=47970]Rusty_V[/url]. Rusty has been a member who reports lots of posts, and posts a lot too. This is well deserved. Congratulations and may you be a good staff member for months to come.[/color]\n\n[color=#FF1493]This week, Omniscient introduced [url=http://hackforums.net/showthread.php?tid=466320]Good Will Monday[/url]. This is a day every first Monday of June (and next year June too), where your goal is to give 5 positive reputations to members of your choice who you think deserve it. Omniscient also asks you NOT to negative rep anyone, unless it's for scamming. This is a direct quote from Omni himself -\n\n\"Today I am declaring an official HF Holiday. Every first Monday of June will be Good Will Monday. On this day you'll be asked to give 5 positive reputations to members that you feel have been a positive and contributing influence to HF. This is the day when you stop all the negative crap and think positively by giving out some good vibes and positive reps.\n\nI ask that today you do not give out ANY negatives unless they are related to scam reports.\n\nAll rules for rep still apply. Don't ask for reps and don't use them to flame fellow members.\n\nI'm hoping to do this every year and really hoping this brings up the mood around here.\n\nEnjoy everyone. \"\n\nSeems like Omniscient is trying to get us to become a healthier forum in terms of relationships with other people.Together, we can lighten the mood of all HackForums members.[/color]\n\n[color=#FF4500]Three sections were made this week, in hope for new changes of HackForums. The first one we'll talk about is [url=http://hackforums.net/forumdisplay.php?fid=163]Marketplace Discussions[/url]. Marketplace Discussions is places to talk about the Marketplace, without making a thread in the inappropriate sections. It is also used for rules, policies, and feedback for the Marketplace. We suggest you read that section before conducting business to save yourself from getting warned.\n\n[/color]\n[color=#1E90FF]The next section added was the [url=http://hackforums.net/forumdisplay.php?fid=165]Virtual Machines[/url] section under Computing. This section is for protection, setup, and debugging for VMware, Suns VirtualBox, MS Virtual PC, Sandboxie, or any virtual environment you can think of. This was to put them in one section, as many of the times, they were in the wrong section. This should hopefully resolve some things.[/color]\n\n[color=#C71585]The final section added this week was the [url=http://hackforums.net/forumdisplay.php?fid=166]CyberGate[/url] section. CyberGate RAT is by far the most popular RAT in the hacker scene today. This section is to discuss everything from the knits and grits of CyberGate. This will clear up the section and make it cleaner, as a ton of the threads in the RAT section were about CyberGate.[/color]\n\n[color=#FF1493]This week, Omni posted a thread [url=http://hackforums.net/showthread.php?tid=474743]here[/url] explaining the changes to black hat activity. We are making a push to become a white hat only site, and with that, comes the first big change. There is a second forum which you can read the whole details on the thread, but here's a direct quote from Omni himself - \n\n\"Nearly a year ago HF was placed for sale. I had a buyer willing to pay me a reasonable price for the site. The final terms of the sale were not to my satisfaction and not in the best interests of this community. While a sale never did finalize a type of partnership agreement did surface. I am now going to implement my part of the agreement which is promote his new site. It should be of no surprise it's a black hat site. When I learned the buyer wanted to make HF black hat I had decided to turn down his offer. Our new arrangement is fairly simple and straightforward. Activity wedon't want at HF is going to be directed toward his site. What goes on there will not be related to what you do here. You'll need to register and agree to their TOS.\n\nSome new rules will be placed at HF shortly to further restrict certain activity here. The end goal will be to clean up much of the site and push it towards its more original purpose of being a computer enthusiast site. HF was never meant to be the place it has become. It's attracted certain elements I find highly undesirable.\n\nEffective immediately is no discussions about Zeus. It was brought to my attention how this tool is used strictly for stealing financial data. I'll be opening a Zeus subforums under Botnets, moving all threads, and locking it. Anyone discussing Zues will get a Financial Fraud warning and their thread moved. Eventually that subforum will be deleted entirely.\n\nOne way we hope to direct members toward the new site is from warnings. When you are warned for certain activity you'll get a PM automatically asking you to join the new site and not continue having discussions on HF on that topic.\n\nThe new site will also require a referral from me or m4v3r1ck who is the admin there. All memberships will have to be manually approved on that site. You can PM him here to ask for referral. All ub3r and l33t can get a VIP membership automatically on that site.\n\nI'm sure this post will raise a lot of questions and I'll do my best to provide answers. You might consider this the end of HF but I consider it a new beginning. I'll have other very wonderful and positive news to give members in the coming weeks. I'll continue to improve HF and make our community even stronger.\n\nThank you.\"\n\nPrepare for change, HackForumians.[/color]\n\n--\n[size=large][color=#FF0000]User News[/color][/size]\n[color=#FF4500]\nThe World Cup started this week. HackForums members have seemed to be so interested in this, that ONE game thread has 200 replies! The game thread was [url=http://hackforums.net/showthread.php?tid=474628]England vs USA[/url] which already ended, with a 1-1 score. HackForums is excited about the World Cup, for sure. There has also been a few contests lurking on HF for the World Cup! HackForums has a new favorite thing to talk about! Even low quality posters like Prone have been posting in these threads and showing support and input on the games! What a deal changer. The Lounge is now FIFA World Cup Lounge.[/color]\n\n--\n[size=large][color=#FF1493]Just Plain Weird[/color][/size]\n\n[color=#FFA500]Evilalex made his [url=http://hackforums.net/showthread.php?tid=476005\\]dad call 911[/url] after the popular crouching to pass out game. He tried it, thinking it wouldn't work, and landed 6 inches away from his PS3. He has a big cut on his wrist now. What a idiotic move! His actions have landed him a spot on Just Plain Weird![/color]\n\n[color=#32CD32]Far made a thread [url=http://hackforums.net/showthread.php?tid=474406]here[/url] about a game that you have to dodge the shapes while moving, and gradually getting faster. The thread was quickly liked, and people were trying the game like crazy. Then, things got heated between everyone, with them arguing over guys who got 2,000 seconds and were taking screenshots after photoshopping. Catch the latest of it in the thread.\n[/color]\n\n--\n[size=large][color=#FF4500]Bans of the Week[/color][/size]\n\n[url=http://hackforums.net/member.php?action=profile&uid=112997]Fusion[/url] was banned this week for not showing respect. This just shows you to respect the ones higher than you, or things like this could happen. You're the top ban of the week, congratulations! \n\n[color=#FF1493][url=http://hackforums.net/member.php?action=profile&uid=130373]\nKorrupt[/url] was banned this week for infecting members. His release date? Never. Bye Korrupt. Korrupt was sellers of many things here on HF. I reported his RAT as being infected, and turns out I was right. Good thing I reported it fast enough to make it only affect some people. Shame when people do things like that.[/color]\n\n--\n[size=large][color=#1E90FF]Other News/Information[/color][/size]\n\nWe need more suggestions for segment ideas, let me know in this thread what you have for ideas. This week was a headlined week, with more things to come in the following weeks for sure. I hope you liked this edition. Also, use the suggestion format -\n\nSegment it goes under-\nMore details about it -\n\nto get your news that you found posted. \n\nThanks.",
      "subject": "[6/6-6/13] HF News  [HEADLINE FILLED!] [COMMENT]"
    }
  ]
}