{
  "posts": [
    {
      "pid": "8399295",
      "uid": "0",
      "dateline": "1292644503",
      "message": "[align=center][IMG]http://min.us/icFot8.png[/IMG][/align]\r\n\n[color=#1E90FF]\"I tried for nearly 2 hours to get us online but table locks on the posts table were too much. After much frustration I knew the time had come.\" Omniscient has now upgraded HackForums to a whole new database server. This has had an amazing accomplishment for HackForums as there have been an significant decrease in complaints about downtime, lag time as well as bugs. He has found out that it was not the amount of people online that has caused this rather then massive overload of content on this forum. [/color]\r\n[color=#98FB98]\r\nThese are some of the features on the new database server:[/color]\r\n\n [list]\r\n[*][color=#FFFFE0]18GB of Ram, old server had 8[/color]\r\n[*][color=#FFFFE0]dual quad-core ( 8 cores), old server was single quad- core ( 4 cores)[/color] \r\n[*][color=#FFFFE0]10k Raptor Drive[/color]\r\n[color=#FFFFE0]\r\n\"Note: The additional ram is very important to DB usage as we have 3GB in Innodb tables.\"[/color]\r\n[/list]\r\n\n[color=#98FB98]The Next few projects Omniscient has towards the Site's functions are the following:[/color]\r\n\n[color=#1E90FF]\"So what's next for HF? I'll do a simple breakdown of things that I need to do.\"[/color]\r\n\n[list]\r\n[*][color=#FFFFE0]Upgrade us to MyBB 1.6x.[/color]\r\n[*][color=#FFFFE0]Review new HF and MyBB features for implementation[/color]\r\n[*][color=#FFFFE0]Setup a new HTTP server (nginx possibly) as our current one is also buckling from the load[/color]\r\n[/list]\r\n\n[color=#1E90FF]Omniscient had decided to revive the features that alot of members were requesting for. What this feature does is let the users know which users are viewing the same section as you. This could be useful for the \"trolls\" to know when to troll or not. 😠[/color]\r\n\n[spoiler= Image of feature][img]http://img72.imageshack.us/img72/4143/usersbrowsing.png[/img][/spoiler]\r\n\n[color=#1E90FF]To conclude the news with headlines the administrator \"Crow\" has unveiled part 2 in \"Taking Back Hacker - part 2\". To read more about this click [url=http://hackforums.net/showthread.php?tid=889555]here[/url]. [/color]\r\n\n[color=#98FB98]He has asked that For those of you who are willing to help, you can do so in the following ways:[/color]\r\n[list][*]Using the share buttons on it to share it with your friends on numerous social services such as twitter, Facebook, Google buzz, etc. etc.\r\n\n[*]Post links to it on any website where such thing isn't forbidden, with the keywords \"hacking, hacker, [url=http://whatishacking.org][b]what is hacking[/b][/url], etc.\" However, make sure you don't Spam websites that don't allow it, and don't just randomly tag the link where it would be completely out of context. For example, whenever you use the word 'hacker' or 'hacking' in a post of yours, you can make it an URL leading to the site. \r\n\n[*]Help us improve the design and content of the site. You can PM me with design suggestions, or articles you have for it, and I'll accept any change I find positive. Note that the site should always have a clear to the eye, minimalistic appearance, so any design-wise changes should be focused on simplicity and neatness. \r\n\n[*]Tell your friends about it, and have them contribute too, if they please \r\n\n[/list]\r\n\n[align=center][img]http://min.us/icAP7c.png[/img][/align]\r\n\n[color=#98FB98]\r\nTo start off, I would like to say that although this was not mentioned in last week's HF News, it will be mentioned in this addition.[/color]\r\n\n[color=#00BFFF]The User \"[b][url=http://hackforums.net/member.php?action=profile&uid=292686]Asus[/url][/b]\" a teenager in Manchester has been arrested after being caught selling a ‘booting tool’ used to attack and kick players of the hugely popular Call of Duty online game. \r\nTo read more you can either read more in a thread posted [url=http://hackforums.net/showthread.php?tid=883833&highlight=Asus]HERE[/url] or you can have a read on one of the news related site [url=http://news.techworld.com/security/3252725/teen-arrested-for-selling-call-of-duty-ddos-tool/]HERE[/url].[/color]\r\n\n[color=#98FB98]Unfortunately we have all been informed that a member of our forums that is registered under the name \"[url=http://hackforums.net/member.php?action=profile&uid=152441]+ad.QnA[/url]\" has passed away due to a tragic accident. May he Rest in Peace. 😭\r\n\n\"Austin Blankenship was killed early Tuesday morning while asleep in his bedroom when a man crashed a sport utility vehicle into a residence in the 4500 block of Ruddell Road in Lacey.\r\n\nRead more: http://hackforums.net/showthread.php?tid=897005\"[/color]\r\n\n[color=#00BFFF]Mute has gotten what we call \"The biggest repfuck\" In hackforums community. He achieved 714 rep before getting rep fucked and ending up at -11.[/color]\r\n\n[color=#98FB98]\r\n\"[url=http://hackforums.net/member.php?action=profile&uid=534708]rtpAmp[/url]\" has done a an [b][u]excellent[/u][/b] job at helping members with coding and every one of his posts are always informational and helpful. He never boasts about anythin,g and honestly he's a true model of a high quality member. We respect you bud! 🤗[/color]\r\n\n[color=#00BFFF]\r\nOmniscient has made a thread regarding Wikileaks and what they are all about. This has gotten to the point where it has almost gotten hackforums in trouble for some of the discussions being made on here. I myself have made quite a few but since he has told us not to make anymore we should follow this [url=http://hackforums.net/showthread.php?tid=883667]thread[/url] only.\r\n[/color]\r\n[color=#FFD700]Tate has made a bizarro-blog found at http://NamesTate.net. It's pretty controversial, a lot of members are mad about it, but even more members love it.[/color]\r\n\n[align=center][img]http://min.us/ieZ6M.png[/img][/align]\r\n\n[color=#FF6347]\r\nWithin Science, Religion, Philosophy, and Politics forum there is a constant bickering between religious and non-religious folk, atheists and Christians, so on and so forth. Saged has decided to put an end to it by setting the rules straight in that section. To read more click [url=http://hackforums.net/showthread.php?tid=901604]here[/url][/color]\r\n\n[color=#FFFFE0]Kewlhotrod has been going through alot of financial issues and is almost hitting rock bottom, he has described how his life has worsend through the weeks. To read more click [url=http://hackforums.net/showthread.php?tid=899733]here[/url].\r\n[/color]\r\n\n[color=#FF6347]Jenni* has mistakenly got her reputation fucked as Crow was trying to deal with the hacker on her account. Crow has made a thread suggesting if people who have repped her could read their rep as she should not have been repfucked. [url=http://hackforums.net/showthread.php?tid=891380]Read more here [/url][/color]\r\n\n[align=center][img]http://i.min.us/ibrMtM.png[/img][/align]\r\n[align=center][yt]http://www.youtube.com/watch?v=T2MUl-B167A[/yt]\r\n[/align]\r\n\n[align=center][img]http://i.min.us/ibrKlE.png[/img][/align]\r\n\n[align=center][color=#98FB98]Congratulations to [url=http://hackforums.net/member.php?action=profile&uid=126503]Techno [/url]for being promoted to Reviewer Leader. We wish him the best and hope he enjoys the position![/color][/align]\r\n\n[align=center]Happy birthday to the following Users:\r\n[list] \r\n[*][color=#00BFFF]nokia2mon2[/color]\r\n[*][color=#00BFFF]Mark Webber[/color]\r\n[*][color=#00BFFF]Tєchnology [/color]\r\n[*][color=white]Tears[/color]\r\n[*][color=#32CD32]Kn1ght[/color]\r\n[*][color=#00BFFF]Orgasm[/color]\r\n[*][color=#00BFFF]SoloDolo[/color]\r\n[*][color=#00BFFF]Death Trap™[/color]\r\n[/list]\r\n[/align]\r\n\n[align=center]Congratulations to [url=http://hackforums.net/member.php?action=profile&uid=137645][color=#00BFFF]mothered[/color] for reaching nearly 1000 rep. Your a damn bot, and you help everyone with anything![/url][/align]\r\n\n[align=center][img]http://min.us/icBmY2.png[/img][/align]\r\n\n[b]\r\n[color=#FF1493]EctoPlasm:  [/color][/b] To start off with the interview, lets first get this straight. Why does Omniscient like you so fucken much?\r\n[b][color=lime] Nyx-: [/color] [/b]  I dont know, I've never really talked to Omniscient outside of HF and on HF I've never had an actual conversation with him. The only thing I've noticed is once in a blue moon I might be arguing with somebody or state something in a thread and he 100% agrees with me etc etc. But then again I am sure hes seen the complete opposite from me also, so I really cant say why I am a keeper in Omniscients eyes.\r\n [b]\r\n[color=#FF1493]EctoPlasm:  [/color][/b] How did you feel like when you got chosen for Moderator?\r\n[b][color=lime]  Nyx-:[/color] [/b] I was more happy the Anime Section was being made because thats all I actually asked for, but being the first moderator on HF was pretty exciting, I even picked the color for the moderators name, and for awhile nobody else could be moderator because there were a few weird bugs and the rank wasn't fully tested, so I could see all the staff reports etc but not read them and other weird things, but now it seems the rank is fine and my section has grown to be an actual section, all it takes is a few months of me being the only one posting in their and flaunting my anime hobby as much as i can, and now i have multiple members who never watched anime before getting really really into it.\r\n[b]\r\n[color=#FF1493] EctoPlasm: [/color][/b] Since you Moderate the Anime section, what makes you like Anime so much?\r\n [b][color=lime] Nyx-:[/color] [/b]  Probably the fact their is plot lines and things that happen in anime that would be very very hard to put into 3d media. Also the fact I've grown out of American cartoons awhile ago but I HATE whats on T.V. the majority of it is gay reality TV shows and the what not, the only thing on mainstream TV i really like are documentaries and south park i guess.\r\n [b]\r\n[color=#FF1493] EctoPlasm: [/color][/b]Some people think you are related to Omniscient, are these rumors true?\r\n[b][color=lime] Nyx-:[/color][/b]My first reply should answer this one.\r\n[b][color=#FF1493] EctoPlasm: [/color][/b] Is it fun to piss the hell out of people in the lounge?\r\n[b][color=lime] Nyx-:[/color][/b]   Its one of my favorite past times, but its based more around me being right even when im wrong, and I just just like arguing with people, I've always been this way even when I was a kid, my parents said I should be a lawyer, but no thx..\r\n [b]\r\n[color=#FF1493]EctoPlasm: [/color][/b] Do you think you can achieve staff, and if Omni asked you would you take the job?\r\n[b][color=lime] Nyx-:[/color] [/b]  Me and Omniscient have already come to an understanding that I will never get staff. Everyone with common sense knows that if I had the power to ban I would use it in place for all the -reps I give out, and although it would make my time at HF alot better, and maybe a few others that weren't banned by me, but it probably wouldn't be good for the community considering i already got enough complaints about me being an abusive moderator when i dont even have staff powers. I have OPer in the IRC and I probably gline the most mainstream members from there.\r\n [b]\r\n[color=#FF1493]EctoPlasm:  [/color][/b]If there was one thing you can change about HackForums, what would it be besides me being IP banned?\r\n[b][color=lime] Nyx-:[/color] [/b]  I honestly would take away the lounge, I post in the lounge alot but I hate that sections guts and everything it stands for. The lounge used to be what the lounge is meant to be (2 years ago) and now its just an ocean of piss seeming with trolls and fags.\r\n[b]\r\n[color=#FF1493] EctoPlasm: [/color][/b]Who is your favorite member on HackForums and why?\r\n[b][color=lime] Nyx-: [/color] [/b] Probably Fallen because hes always been there to help me out, always been a very close part of my sub-community(malvager). Hes only 14 and i really really look up to him because of how smart and mature he is. He taught me how to program and alot about IRC. Then nanchan a.k.a. InfamousBytes because she got me into anime and hardstyle and is my hero.\r\n[b]\r\n[color=#FF1493] EctoPlasm:  [/color][/b] Which member do you hate the most and why?\r\n[b][color=lime]  Nyx-:[/color] [/b]  I dont really hate anyone, I despise people alot and when I see their posts it just reminds me of how annoying and how much I dont like them, but I cycle through arch nemesis's(lol) once every few months or so. Right now you are probably my most hated member, but I'll eventually forget about you and move onto some new fag who is trying to style up the lounge.\r\n  [b]\r\n[color=#FF1493]EctoPlasm: [/color][/b] To finish off with the interview, is there anything you would like to tell HackForums Community?\r\n[b][color=lime] Nyx-: [/color] [/b] malvager 4 life yo!",
      "subject": "[12/11/2010] - HF News"
    }
  ]
}