{
  "posts": [
    {
      "pid": "35735769",
      "uid": "515249",
      "dateline": "1381887369",
      "message": "[align=center][IMG]http://i.minus.com/iFr3ysSi8zt0B.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFA52C][b]164th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/ibbtDZ715LhhGY.png[/img][/align]\n[color=white][b]Modern Looks Make Way For The Old School[/b][/color]\nHack Forums was suddenly changed this week, to the avail of many and pleasure of others. The theme, now known as \"HF Modern\", replaced the \"HF Oldschool\" theme and featured optimized, static images that caused the site to load more quickly for most members. However, some are reluctant to change and immediately set out to amass followers for their new-theme hatred. Eventually, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] posted a thread that allowed users to contribute to the new theme by showing off their own banner creations, which can be viewed [url=http://hackforums.net/showthread.php?tid=3798895]here[/url]. Many excellent banners were posted, but the influx of negative threads about the theme eventually caused [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] to make a swift end to the fun. Before closing the discussion thread, he stated, \"Fuck it. No new theme. Members aren't open it[sic] it and I'm wasting my time.\". The now closed discussion thread may be read [url=http://hackforums.net/showthread.php?tid=3798861]here[/url]. Users may still change back and forth between the Oldschool and Modern themes by using the opton in [url=http://hackforums.net/usercp.php]User Control Panel[/url].\n\n[color=white][b]Sleep Soundly, Paranoid Members - 30+ Character Passwords[/b][/color]\nFollowing a suggestion thread by the member [url=http://hackforums.net/member.php?action=profile&uid=341617][color=#0066FF][b]Lakai[/b][/color][/url], members now have the option of creating more secure passwords. While the past length of a password was only 30, this limit has been lifted, allowing for immensely complex strings of letters, numbers, and special characters up to 64 in length. For those who make use of this feature, they will be able to sleep soundly at night, knowing that any attempt at bruteforcing their account would take hundreds of thousands of years with current day computational power. The original suggestion thread can be read  [url=http://hackforums.net/showthread.php?tid=3790714]here[/url]\n\n[color=white][b]The Latest and Greatest - MyBB Upgrade[/b][/color]\nThis week Hack Forums experienced approximately two hours of pre-announced downtime in order for [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] to have the time to upgrade to the lastest MyBB version: 1.6.11. The thread announcing the change can be found [url=http://hackforums.net/showthread.php?tid=3797980]here[/url]. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has requested that you notify him if you happen to notice anything that doesn't work correctly or any other bugs. The reason the edit took longer than usual for a MyBB forum is because Hack Forums has much custom code and templates, which would cause problems if the \"changed files\" package was used.\n\n[color=white][b]'Tis The Season To Be Frightened[/b][/color]\nAfter the entertaining banner change last week, it has been changed once again to commemorate the time of year. It's almost Halloween, and the scent of candy can be smelled in every grocery store you visit. This gorgeous animated banner was created a long time ago by the now inactive member [url=http://hackforums.net/member.php?action=profile&uid=32695][color=#0066FF][b]Etheryte[/b][/color][/url] back in 2011. The original post he made can be seen in [url=http://hackforums.net/showthread.php?tid=1862797&pid=16939805#pid16939805]this thread[/url]. Although inactive for over a year and a half, his work now stands proud as the centerpiece of this forum with over 2,000,000 registered members.\n\n[align=center][img]http://i.minus.com/iyobmhGt2yol0.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=797403][b]630[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=454666][b]adampelletgun[/b][/url] have achieved twenty-thousand posts!\n[*][url=http://hackforums.net/member.php?action=profile&uid=860828][b]Teh Afro[/b][/url] has achieved 500 prestige points.\n[/list]\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1810790][color=black][b]Diligence[/b][/color][/url] was rep fucked and banned for reputation abuse.\n[*][url=http://hackforums.net/member.php?action=profile&uid=650422][color=black][b]TwilightSpurkle[/b][/color][/url] was banned and rep fucked for trying to sell his account.\n[/list]\n\n[color=white][b]Active Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1810790][color=black][b]Diligence[/b][/color][/url] was rep fucked and banned for reputation abuse.\n[*][url=http://hackforums.net/member.php?action=profile&uid=837463][color=black][b]Viber[/b][/color][/url] was banned for possibly being comprised.\n[*][url=http://hackforums.net/member.php?action=profile&uid=63387][color=black][b]Black Shadow[/b][/color][/url] was banned for posting adult content.\n[*][url=http://hackforums.net/member.php?action=profile&uid=650422][color=black][b]TwilightSpurkle[/b][/color][/url] was banned and rep fucked for trying to sell his account.\n[/list]\n\n[color=white][b]Expired Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*]None.\n[/list]\n\n[color=white][b]Vacations[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1033713][color=black][b]Formula1[/b][/color][/url] has taken a vacation.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1382049][color=black][b]Prinzessin[/b][/color][/url] has taken a vacation.\n[*][url=http://hackforums.net/member.php?action=profile&uid=418772][color=black][b]Dоde[/b][/color][/url] has taken a vacation.\n[/list]\n\n[color=white][b]Closures[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=354242][color=#383838][b]Greyersting[/b][/color][/url] had his account closed after making a unneeded comment on HackerCraft. \n[*][url=http://hackforums.net/member.php?action=profile&uid=101228][color=#383838][b]Tate[/b][/color][/url] had his a account closed after being caught selling his account on another forum.\n[*][url=http://hackforums.net/member.php?action=profile&uid=12274][color=#383838][b]Aнонимный[/b][/color][/url] normally known as Yck was closed for harassing other members.\n[*][url=http://hackforums.net/member.php?action=profile&uid=87647][color=#383838][b]Fernandez[/b][/color][/url] was repfucked and had his account closed for disobeying the 35 character limit.\n[*][url=http://hackforums.net/member.php?action=profile&uid=972664][color=#383838][b]Verts[/b][/color][/url] was closed and rep fucked for trying to sell his account.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1082656][b]Mohatu[/b][/url] received the MOTM for the month of September.\n[*][url=http://hackforums.net/member.php?action=profile&uid=406243][color=#0066FF][b]WiFi.[/b][/color][/url] received Jokester award and the Award whore because he's a \"real nigga\".\n[*][url=http://hackforums.net/member.php?action=profile&uid=33319][color=#0066FF][b]SkullTraill[/b][/color][/url] received the DaBomb award for \"From 2008 you da real nigga.\"\n[*][url=http://hackforums.net/member.php?action=profile&uid=181208][b]Darkwin[/b][/url] received the Speaker of the House award for \"For all your good raps and rhymes. You spit well.\"\n[*][url=http://hackforums.net/member.php?action=profile&uid=1315784][b]Miki[/b][/url] received the Cool award for \"You're a little cool.\"\n[*][url=http://hackforums.net/member.php?action=profile&uid=1575886][color=#FFD700][b]Trill‌[/b][/color][/url] received the Sushi Lover award for his love of sushi.\n[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of scheduled release date for the HF News edition.[/size][/align]\n\n[align=center][img]http://i.minus.com/ibtD6mgmzoGVeX.png[/img][/align]\n[b] The Lounge [/b] - [url=http://hackforums.net/showthread.php?tid=3800652]What Do You Know About Sushi? [PICS][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1055259][b]Soccer[/b][/url] - Do you have a love for sushi? You better grab your chopsticks and dive in!\n\n[b] Science, Religion, Philosophy, and Politics [/b] - [url=http://hackforums.net/showthread.php?tid=3803234]Do Aliens Exist?[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1121653][b]KevinMcCormick[/b][/url] - Do you believe aliens exist?\n\n[b] Online Accounts [/b] - [url=http://hackforums.net/showthread.php?tid=3769994]Section Policies, Rules, and Information[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] - A subforum dedicated to only online accounts; here you will find all you need to know about this section.\n\n[align=center][img]http://i.minus.com/iV2Z5H1KVQP4W.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1]Omniscient[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Hello there readers, just casually interviewing my homie Omni for this week's edition of the HF News. Could you start by letting us know what you've been working on recently?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: HackerCraft has been my main focus these past few weeks.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Congratulations on HC! The server was revived somehow. It went from a state of left for dead to 30 members active almost all the time. How did you manage to revive it?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: I never felt it was a dead project; at least not emotionally. I knew deep down that its failure was more of a direct result of my own failure to give it the love it deserved. As a new Minecraft server admin I had much to learn and I still have an incredible amount more to learn. The key to its revival, though, was simply putting more effort and focus by me personally. In the first incarnation of HackerCraft I relied heavily on assistance from other members and players. This time around I've managed to have my hands dirty with the administration work myself. I feel HC will never bear fruit unless I'm the guy watering the grass.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: What are your future plans for HackerCraft? I know most people playing on the server already know a good amount of information about this but your answers might be their incentive to start playing as well.\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: I hope to continue growing the HC server. I'd like to see it having 80+ players regularly in-game. We currently do about 20-50 and we've been in the 60's during peak hours. When we starting averaging 70-80 I'll consider expanding some game aspects including more hardware resources.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Let's talk a bit about HF in general. First off, cheers to 2 million UIDs. Are you satisfied with the current rate of new member registrations? What about post activity?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: Thanks. I wish I was on that morning but I saw it after we were a few hundred over. Unfortunately the actual person with the 2,000,000th UID is a 0 post lurker who's account will get pruned. I'm a bit sad about that. And I'm very satisfied with the current registration rate. It's very stable. As for post activity that's a bit of a catch-22 scenario. It's easy to mistake less post activity as a declining HF but when I delve into the reasons why it's happening I realize that it's because of policies I've implemented that I don't want to reverse. Example would be post-to-pm policy which almost immediately cut posting down by 20%. But that was all garbage posting. I love seeing a very active HF but one of the complaints members had for years was the low-quality crap we often saw. Now that crap is greatly diminished and we appear to be less active but in fact we're just higher quality. When I think of what new policies or changes I might have I realize they would curb posting even more. Staff used to do about 1200 reports a day. Now they're down to just 400. That's significant in my view. Post activity is something every forum owner should want but when HF had 40,000 posts per day the work-load was nearly unbearable. I'm definitely more satisfied now with current activity even though we do have less posts.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Which are your favorite subforums on HF and why? HackerCraft aside of course. Hehe.\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: Well since I can't say HackerCraft I'll go with Suggestion and Ideas. Probably one you didn't expect but despite my often quick finger to close a thread there are some good reads there. I often find myself reading every thread on the first or second pages just to get a feel for what member are thinking and inevitably I find one or two things that I implement in some form. I know members think I don't read the section or care what they think but that's not true at all. I just have to pretend I'm not listening otherwise I'll get bombarded by them.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: What was the best thing that happened to HF in your opinion? And what about the worst thing?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: Tough question. I think the answer is groups as both the worst and the best. They obviously are an integral part of the site and helped to hook a lot of members here. Members wanted to join a group and then they wanted their own group. But somewhere along the lines they became a problem. I almost want to just delete them all but obviously I can't do that. The best I could do was stop selling them.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: What are some notable changes that happened since your last interview on 11/11/11?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: Well that's nearly two years ago. I would say two years ago HF was a wild place. I'm not sure we had handled the explosive growth of the previous two years. The past two years has been more about dealing with that growth and incorporating it into a manageable website. More backend things have changed these past couple years than anything else. The way we serve HF and the tools the staff and admins have to manage things. Most notable is likely the uptime. It's vastly improved from two years ago. To some that may not be important but it's difficult to manage a sites growth and to enhance features when your time is consumed by server management and uptime.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Yeah, I've noticed that the uptime has drastically improved over the past couple of months. Props for that. Any statements on stuff you'll be implementing soon?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]:  I'm too fearful to discuss anything I'm working on or giving dates. I've missed many of my own deadlines for features and I have a ton of half-done work everywhere. But despite certain projects not yet done there are still many things that are implemented.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Do you have any goals for the future of HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: I have a lot of goals for HF. More goals than fingers to type them with. My list of features I have in progress anywhere from the design phase to 80% coded is insane. I'll even code something out 100% then decide not to implement or use it. I'm a goal oriented person I believe and I can plan five years ahead and patiently execute while others are complaining they've waited a few months.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Would you like to add anything else related to HF to this interview?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: I guess I'd just like to say that HF will always continue to evolve. And those who are patient and willing to watch the grass grow will be rewarded with a lush lawn.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: How much time is a typical working day for you? I assume time management doesn't go too well, right?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: My time management isn't what most people would consider ordinary work hours. Being a stay-at-home dad and having the luxury of working from home my schedule can be really screwy. If it's during school days I'm normally up at 8 A.M. and once everyone is off to school and things are taken care of I'm on the computer for up to 16 hours. I'll take small 10 minute breaks to get a snack, use the bathroom, or stand in my backyard for fresh air. During the summer, even though HF can be pretty busy, I'm even busier. Between family vacations, time with friends, and just enjoying summer in Vegas I probably manage to work only about 40-50 hectic hours a week. Otherwise I probably do 60-80 hours of actual work online.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: What are your favorite hobbies?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: I enjoy time out at the clubs here in Vegas. I play racquetball when I have a partner. I enjoy bike riding a lot. And I've been going to the range lately to blow off some steam. I also enjoy my cigars and fine Whiskies I keep around. I have a fair amount of things I do and things I enjoy. I wouldn't say I have any obsessive hobbies right now though.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: By popular demand, what's your definition of a real nigga?\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: I'm not sure it can be defined. It's one of those terms with open ended meaning. I guess somewhere on the baseline it means someone genuine.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#7BFF00][b]Connected[/b][/color][/url]: Thanks for taking the time to participate in this interview, Omni! Good luck with your future endeavours.\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]: Bye.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Welcome to the 164th edition of the HackForums news. Today we have the lastest edition to the staff team, D3xus, for an interview. How's it going? Do you have any shoutouts before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] Shoutouts to members of The Alliance, Infamous, the Wiki Team and the MRT. My family until the end.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Quite the prestigious groups to be a part of if you asked me. Want to tell us a bit about how you found your way into those [i]families[/i], so to speak?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] I applied for The Alliance  more than a year ago. It feels like a lot longer but they have been my brothers for a long time. I was invited/recruited to Infamous as well. I took charge of the Wiki Team after Viral Dragon became ill, and I was recruited into the MRT after an intense process.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Sounds like a lot of work to juggle, not including your staff duties. Speaking of which, you became a full fledged staff member about a month or two ago? Tell us how that's going?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] Staff is going good. A lot of stuff to do but it's rewarding. I've tried to remain humble and down to earth, but sometimes it isn't easy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Well from personal experience you're definitely the easiest of the staff to get in contact with on short notice. Another thing I noticed is how fairly new you are to the forum compared to other staff. You've only been here for about 2 and a half years and have accomplished so much in such a short period of time. That's certainly commendable. What do you think it was that got you noticed as oppose to these much older members?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] I work for the benefit of the forum with knowledge, rather than giving things away. The norm these days seems to be that money will get you respect. I wanted to prove otherwise.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Unfortunately, I see that day by day. Anyway, what brought you to the forum a whomping 861 days ago?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] The generic things. Hacking Facebook and Xbox accounts. I realized that it wasn't so simple, and discovered the iPhone and iPod jailbreaking forum. I'm no longer big in it now, but it's still one of the top three forums for my posts.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] I was just about to bring that up. You have over 1500 posts in the iOS and iDevice section. I assume you're an apple fan just like myself? Any specific reasons you prefer it over Android?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] I'm now a dual iOS-Android fan. I rock an iPod touch and Galaxy S4. They both have advantages over each other, so the devices are complimentary so to say.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Ahh, I've never even given Android a shot. Always been an Apple fan. Moving on, it's almost Halloween and Omni's decided to change the banner. Not just that, but he's implemented a whole new \"modern\" theme to the site that the members can chose to use. There was a lot of controversy over this. What's your say in the matter?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] It's more simplistic and consistent. It reduces load time for me, although there seems to be something else making the forums a bit slow. He enabled the old theme for the nostalgic people, so I think he appealed to everybody.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] I have to admit, I'm back to the old theme for the time being. Just has that familiar feel to it, ya' know? But moving on, do you have any goals or milestones you wish to achieve by the New Year?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] Good question. Graduate from the MRT program is a goal. Perhaps do something big for Omni or discover a bug in MyBB. Get accepted to my top college of choice.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] All are achievable goals too; I like it. What college are you wanting to attend, if I may?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] Cornell University.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=white][b]Saturday:[/b][/color][/url] Well I wish you best of luck with your future, and hope everything goes according to plan. Any closing statements?\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus:[/b][/color][/url] Never look back unless you plan on going that way. And always stay in the know. Don't just accept something for what it's worth. Do the research.[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=947940]webdev77[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Welcome to the 164th edition of the HF News! Today we have the dedicated Alliance member, webdev77. Is there anybody you'd like to give a special shoutout to before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] I would like to give a shoutout to the one and only Paradoxum for being a wonderful leader of The Alliance. I would also like to give a shoutout to those of you that are active in the Computer Hardware forum. You know who you are.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Judging by your name I'm assuming you have experience in web design/development? If so do you have any websites/software you've been working on lately?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] I have been a support staff member at a rather popular free hosting website for over a year and a half now, but was working to become a staff member at this specific host for quite some time. I do not have any websites in operation, but I own a few domain names. Currently, I have put all personal web related projects on hold to take some time to learn more about Autodesk Inventor. I am actually majoring in engineering right now, so that eats up a lot of my time.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] I wish you luck on your Major, engineering can't be easy. So what made you want to register on Hack Forums?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] Thanks I appreciate that. I like it which makes it seem like far less work than it really is. A little over two years ago, I was playing around with some source codes that were of interest to me, and it just so happened that a similar project was in development on HF at the time. A few Google searches lead me to HF, where I registered to see the thread that contained the project I was interested in.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Oh cool, what was the project exactly?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] It was a rather simple bruteforce program, although I didn't want it to break into anything. I was looking at permuting characters to create a word scramble game.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] So tell us, what made you want to stick around the forums?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] I liked the fact that there was a near endless supply of information freely available in one place. I could use the search tool for days and days without ever running out of things to read about. That, combined with the fact that I enjoy discussing many subjects on HF, made me stick around, which leaves me here today where I am.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] It's awesome to hear that Hack Forums has provided you with so much information! You mentioned earlier that you're majoring in engineering. I'm sure a lot of other HF members may considers doing the same thing, what has that process been like and what advice would you give to those looking to follow in similar foot steps?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] The process is rather straight forward for the most part. Find a school that offers the discipline you are interested in and do some ressearch about their program. If it looks good or is to your liking, ask to speak with a student in the program. Get their personal opinion. Once you have gotten positive feedback from a student, I would say it's safe to send an application. Expect to do math. Expect to document every little thing you do and be ready to explain how you reached a solution. I would say the best thing you can do for yourself if you wish to go into any branch of engineering is to learn what it means follow a design process. Much like how you were probably told about how people use the scientific method in your middle school and high school science classes, the design process is the thing that engineering revolves around. If you understand the workflows, you should have very little trouble assuming you do your fair share of studying core concepts.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] That's some great advice, I'm sure quite a few members will appreciate it. So you've been registered at Hack Forums since August 22nd 2011. Since then, have you noticed any specific areas which you feel Hack Forums can improve on?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] I feel that the Windows XP, Vista, and 7 forum along with the 8, RT, and Surface subforum need a little bit of help. The 8, RT and Surface subforum is rather inactive with only a handful of posts per day, and few and far between are the correct answers to questions. I would like to add that I realize there is probably a reason for keeping it open since closing that forum is a denied suggestion, but I think the majority of HF users are not aware of what purpose it serves, including myself since quite a few people can't seem to find it or just don't use it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Well it's a good  thing you've pointed that out to everyone. Perhaps this will inspire other users to assist members in those sections. How did you feel about the recent theme switch? Which theme are you currently using?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] I like the fact that it shows that HF is being actively worked on. I am undecided as to which theme I will switch to for my regular browsing of HF. Currently I'm on the \"classic\" theme because I have yet to look for the option to change the theme in my control panel. I definitely will be checking out and exploring the new theme though. It's not out of the question for me, but I would like to see some changes to it. For what it's worth, during this interview changes are being made as we speak.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Very true. The banner could use a good swap in my opinion. So tell us about your involvement in \"The Alliance\". When and why did you join? Have you learned anything specific from that particular usergroup?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] I joined the group last year I believe right around the end of the year and was accepted as part of a recruitment thread. I joined to be a part of the Computer Hardware sector, which was one of the areas that the group specializes in. I have learned quite a few things being in the group, obviously related to computer hardware, and I hope to... well, you'll just have to wait and see what I hope to do. Things are happening. That's all I can say for now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] Sounds good! Are there any groups you'd like to join in the future? If so, why would you like to join them?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] There are no groups that I would like to apply for at the current moment. The only group(s) that I would consider accepting an invitation to would be one that is not a paid usergroup. It would have to be one set up for a specific site purpose. E.g. Writers or the Malware Removal Team\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Educate:[/color][/b][/url] I got ya, both of those usergroups do a lot of hard work to help make Hack Forums a more enjoyable experience for everybody. Anyway, thank you for taking time out of your schedule to do this interview and I'd like to wish you good luck with all of your academic pursuits! Do you have any final words before we wrap this up?\n[url=http://hackforums.net/member.php?action=profile&uid=947940=][color=white][b]webdev77:[/b][/color][/url] Thank you. I appreciate this opportunity and would like to thank all of the writers for putting so much time and effort into the HF news every single week. Since you are giving me the opporunity to add in whatever I'd like, I would like all of you to take a moment this week to take a look around the forums and explore the areas you do not often frequent. For a lot of you that probably means [url=http://hackforums.net/misc.php?action=help]this section[/url]. Once again, thank you. Keep up the good work.[/spoiler]",
      "subject": "[10/14/13] - HF News"
    },
    {
      "pid": "35735824",
      "uid": "515249",
      "dateline": "1381887650",
      "message": "[align=center][img]http://i.minus.com/iJLlX4wyRdaA7.png[/img][/align]\n[color=white][b]Rockstar Sending $500,000 GTA$ To Players[/b][/color]\nGTA Online had a very poor launch, with many bugs and glitches that prevented people from playing the game, or having their characters deleted. However, don't fret! Rockstar Games have announced they will be sending out a stimulus package to players of $500,000 in-game dollars. Rockstar has said that the money will come in two payments of $250,000 each. \"In order to keep the current worldwide in-game economy balanced,\" says Rockstar, \"we will be providing this GTA$ to players via two deposits of $250,000. We will announce specific dates as soon as possible, but are currently hoping to be able to make the first deposit by the end of next week (after we've confirmed that issues causing game progress loss have been fixed) with the second installment to happen by the end of the month.\" \"For players who experienced cloud server errors, connection issues, and lost game progress and characters in these first days of GTA Online, we hope this GTA$ helps to facilitate a fresh start or makes your continued life in Los Santos and Blaine County extra sweet.\" To receive the GTA dollars, players must download the patch coming this week which should clear up remaining issues. The money should appear in player's in-game bank accounts.\n\n[color=white][b]Xbox One Wont Automatically Record Achievements[/b][/color]\nAlbert Panello from Microsoft said the Xbox One won't automatically record achievements. It was previously believed the system would save footage automatically of a player unlocking an achievement. However, Panello has said that it is up to the developers on whether the console/game will record achievement footage or not. \"It won't be automatic for every achievement,\" said Panello on NeoGAF. \"It's a feature that Developers can unlock for achievements, OR, for instance, have hidden in the game for doing something cool or discovering something hidden. Basically we allow developers access to GameDVR and they can put conditions on an automatic recording. But not every Achievement will automatically be recorded.\" It will be interesting whether developers will choose the automatically record achievements in their games or not.\n\n[color=white][b]GTA V Breaks Guinness World Records[/b][/color]\nGTA V had the biggest launch of any video game or entertainment product in history. It was the fastest product to pass one billion dollars and in the process smashing previous records from Call of Duty and The Avengers. However, the game also produced many more records. \"GTA totally deserves to be recognized as an icon of modern British culture, and we're thrilled to be able to feature the game in the record books. Gaming is no longer a niche hobby, as GTA 5 has proved, and how exciting that it's taken on the might of Hollywood and won! I'm also doubly proud as a Dundonian to welcome this home-grown series back into the Guinness World Records book.”  Craig Glenday said. GTA V broke the follow records;\n[list]\n[*] Best-selling action-adventure video game in 24 hours\n[*] Best-selling video game in 24 hours\n[*] Fastest entertainment property to gross $1 billion\n[*] Fastest video game to gross $1 billion\n[*] Highest grossing video game in 24 hours\n[*] Highest revenue generated by an entertainment product in 24 hours\n[*] Most viewed trailer for an action-adventure video game\n[/list]\n\n[color=white][b]Video of the Week[/b][/color]\nRockstar is giving gamers $500,00 in-game cash... but how should you spend it? I think this video may be beneficial for you.\n\n[align=center][video=youtube]http://www.youtube.com/watch?v=islTyv7HRVg[/video][/align]\n\n[align=center][img]http://i.minus.com/iX3LnqNnUtm2v.png[/img][/align]\n[b][color=white]Snapshot 13w41b-- Long Awaited![/color][/b]\nAmongst other notable (and not-so notable) changes, stained glass has finally been added to Minceraft. Though only in a snapshot, one can expect/assume that said addition will see an actual version upon release of Minecraft's most-anticipated patch-- 1.7. The stained glass is crafted very similarly to that of the stained clay (eight glass surrounded by one dye makes eight stained glass) and can equally be crafted into glass panes. That being said, the proportionality is similar in that six pieces of glass will give you 16 glass panes. Lastly, the addition of server icons has been implemented, which allows users to add an icon next to servers on their list; not such a big thing, but seemingly many have been waiting for such.\n\nIn addition to the very long-awaited release of stained glass, many bug fixes have been included in 13w41b. Some of the more notable ones, however, include the ability to set your render distance at 16 chunks (whereas the bug limited you to eight), fixing game pauses, and making carpet once again flammable. It's very safe to say that with the aforementioned additions/fixes, 1.7 will see its light very, very soon.\n\n[b][color=white]Rewriting the Network Code[/color][/b]\nAs mentioned in a [url=https://twitter.com/Dinnerbone/status/384998161074634752]Tweet by Dinnerbone[/url], Minecraft's network protocols are to be redone in ways that are going to make things run smoother. Dinnerbone has stated that they'd be using Netty, a different type of server framework, which is notoriously known for its high performance protocols and servers. One can't really guess how much better the switch will make Minecraft for players, but surely we can take Dinnerbone's word.\n\n[b][color=#43a828]Hacker[/color][color=#9428a8]Craft[/color] [color=white]News[/color][/b]\nDue to a [url=http://hackforums.net/showthread.php?tid=3753361&pid=35596302#pid35596302]suggestion made by Omniscient[/url], the Hackercraft news will be allotted its own thread and thus more information will be presented along with different sections. Keep a look out for that in the [url=http://hackforums.net/forumdisplay.php?fid=252]Hackercraft section[/url]. Likely, there will be testimonials, places for users to show of their builds, headlines, faction news, award news, and raiding news so people can keep up with the server in a whole new way.\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]MineClash[/color][/b]\nMineClash is a server ran and operated professionally by some of HackForum's very own members. MineClash features popular server modes such as factions, creative, prison, and mini-games (such as sky wars, hide and seek, hunger games). Head over to MineClash today at play.mineclash.com!\n\n[align=center][img]http://i.minus.com/ibx5gFlLxx9bJ1.png[/img][/align]\n[color=white][b]Azerbaijan Released Election Results... A Day Before Voting Began[/b][/color]\nElection results were accidentally pushed to the official mobile application for the Azerbaijan presidential elections the day before voting was scheduled to begin. The pushed out data had the current president Ilham Aliyev winning by a whopping 73%, slightly less than the results of his previous elections. The data from the application was quickly removed with an explanation that the error was an application test using 2008 election results, however they did not explain why the results showed this year's candidates. Final tally (after voting day) found Aliyev winning with 80% of the vote.\n\n[color=white][b]Nobel Prize in Physics Awarded to Higgs Boson Scientists[/b][/color]\nPeter Higgs and Francois Englert, who led the team of physicists proposing an explanation for the association between matter and mass, were recently awarded the Nobel Prize in Physics for their work. In the 1960s, they predicted The Higgs Boson is a particle postulated by the scientists to be proof of the Higgs Field. It was discovered by the Large Hadron Collider last year.\n\n[color=white][b]Turkish Police Authorized to Arrest Any Possible Protester Without Warrant[/b][/color]\nTurkey recently pushed forward a new rules that allows police to detain any person who appears to be at a “risk of conducting a protest.” The policies appear to be specifically targeting groups that have a tendency to protest. Critic leader Semih Yalçın called the move “signs of police state” and warned that “[t]hese attempts might drag the country into chaos” (via [url=http://www.hurriyetdailynews.com/new-law-to-permit-police-to-detain-possible-protesters.aspx?pageID=238&nID=55790&NewsCatID=341]Hurriyet Daily News[/url]).\n\n[color=white][b]NSA Director Gives Bold Defense of Cyber Spying Program[/b][/color]\nNational Security Agency Director General Keith Alexander attempted to defend the agency's notorious domestic spying program during an interview this past week. He acknowledged that the agency “stumbled” when responding to the Snowden revelations, however emphasized that the issue was not the programs but rather the public misunderstanding, “[t]he way we've explained it to the American people has gotten them so riled up that nobody told them the facts of the program and the controls that go around it” (via [url=http://www.nytimes.com/2013/10/13/us/nsa-director-gives-firm-and-broad-defense-of-surveillance-efforts.html?pagewanted=all]The New York Times[/url]). When asked about a recent Snowden leak claiming that the United States participated in over 200 cyber attacks in 2011, Alexander responded “I see no reason to use offensive tools unless you're defending the country or in a state of war, or you want to achieve some really important thing for the good of the nation and others.” He did not expand on what he meant by “some really important thing” or who the “others” were.\n\n[align=center][img]http://i.minus.com/ibnGw6pRzIThtL.png[/img][/align]\n[color=white][b]Sony Xperia Z1 Leaks In Press Shot[/b][/color]\nThis past week, a well-known leaker posted an image of the Sony Xperia Z1. The image leak shows the back of the phone with the T-Mobile branding. Said phone was recently released in Europe and Asia, leading most to believe a US release should be soon. T-Mobile has neither confirmed nor denied this rumor as of yet.\n\n[color=white][b]Google Play To Show Tablet-Optimized Apps By Default On Large Devices[/b][/color]\nIn an effort to improve exposure of tablet-optimized Android apps, Google is going to be rolling out an update to help. When the update comes out, Google Play will automatically show a “Designed for tablets” list for people with those large devices. This is supposed to help people with large devices sift through the sea of apps and is slated to start rolling out November 21st.\n\n[color=white][b]Mad Catz Android Console Streams PC Games To Your TV[/b][/color]\nMad Catz has made pre-orders for its M.O.J.O. console live and with this, more details have come out about the console. When the pre-order page was live, the company seemed to accidentally put details up about PC game streaming to your TV. They quickly removed that information from their site, but soon after confirmed that the console will support PC game streaming to the user’s TV with an update shortly after launch. This $250 machine seems to be in competition with NVIDIA’s Shield and Valve’s Steam Machines.\n\n[color=white][b]FISA Renews NSA Permissions To Collect Call Metadata[/b][/color]\nSince the leak of the NSA collection of our phone call metadata back in June, people seemed to be more on edge.  This caused people to start talking about topics about our national security, which include PRISM, the collecting of our calls and emails, among other things. This past Friday, the Office of the Director of National Intelligence had announced their request to renew the PRISM program. The office had also announced that it was granted the renewal of the program by the Foreign Intelligence Surveillance Court. The NSA still claims that they can only collect data if there is “reasonable, articulate suspicion” that a phone is connected to terrorist activity. Many people are criticizing this announcement, wanting full transparency, but it is a step in a positive direction.\n\n[align=center][img]http://i.minus.com/i8dSB5532O5GV.png[/img][/align]\n[b][color=white]Eminem Releases Music Video to Call of Duty Ghost Song \"Survival\"[/color][/b]\nThat's right, Eminem released the music video for \"Survival\", an exclusive track he made for the new highly anticipated video game \"Call of Duty: Ghosts\". Eminem has been keeping busy as this music video came out exactly a month after his music video for \"Berzerk\", the first single from Eminem's upcoming \"The Marshall Mathers LP 2\". \"Survival\" is another track from \"MMLP2\" and a song associated by many with the video game \"Call of Duty: Ghosts\". The clip surfaced Tuesday (Oct. 8) on Eminem's VEVO. It features the Em in a warehouse while footage of \"Call of Duty\" plays in the background. It then flashes to Em performing live, before changing back to its warehouse setting. The video contains everything you would expect from the Detroit native grittiness, graffiti-ness, and video game-iness, all in one clip. Check it out [url=http://www.youtube.com/watch?feature=player_embedded&v=NlmezywdxPI]here[/url].\n\n[b][color=white]Macklemore & Ryan Lewis Lead American Music Awards Nominees [/color][/b]\nThis upcoming November 24 could be another slew of big wins for Macklemore & Ryan Lewis. After a spectacle at this year's MTV Video Music Awards, Macklemore & Lewis are the leading nominees at this year's American Music Awards, which will include performances from the twerk queen herself, Miley Cyrus, and Imagine Dragons. Macklemore was nominated an amazing six times, including Artist of the Year, which will put the duo against Rihanna, Taylor Swift, Justin Timberlake and Bruno Mars. Swift and Timberlake both won five nominations each, with Robin Thicke and Rihanna pulling down four apiece.\n\n[b][color=white]Nominations[/color][/b]\n[b]Pop/Rock[/b]\n[spoiler=]\nFavorite Female Artist: Pink, Rihanna, Taylor Swift\nFavorite Male Artist: Bruno Mars, Robin Thicke, Justin Timberlake\nFavorite Duo/Band/Group: Imagine Dragons, Macklemore & Ryan Lewis, One Direction\nFavorite Album: Take Me Home (One Direction), Red (Taylor Swift), The 20/20 Experience (Justin Timberlake)\nNew Artist of the Year: Imagine Dragons, Florida Georgia Line, Ariana Grande, Macklemore & Ryan Lewis, Phillips\nSingle of the Year: \"Cruise\" (Florida Georgia Line), \"Thrift Shop\" (Macklemore & Ryan Lewis), \"Blurred Lines\" (Robin Thicke)\n[/spoiler]\n\n[b]Hip-Hop[/b]\n[spoiler=]\nFavorite Artist: Jay Z, Lil Wayne, Macklemore & Ryan Lewis\nFavorite Rap/Hip-Hop Album: Magna Carta Holy Grail (Jay Z), Good Kid, m.A.A.d City (Kendrick Lamar), The Heist (Macklemore & Ryan Lewis)\nFavorite Soul/R&B Female Artist: Ciara, Alicia Keys, Rihanna\nFavorite Soul/R&B Male Artist: Miguel, Robin Thicke, Justin Timberlake\nFavorite Soul/R&B Album: Unapologetic (Rihanna), Blurred Lines (Robin Thicke), The 20/20 Experience (Justin Timberlake)\n[/spoiler]\n\n[b]EDM[/b]\n[spoiler=]\nFavorite Electronic Dance Artist: Daft Punk, Zedd, Avicii, Calvin Harris[/spoiler]\n\n[b][color=white]Lorde Praises Miley[/color][/b]\nWait, what? Lorde, who wrote \"Royals\", in which she completely bashed the lifestyle of Miley, now praises her? Lorde, sticking close to roots, mentioned \"Miley,\" she said, though she also gave it up for Demi Lovato. \"'Camp Rock' was great. I really enjoyed 'Camp Rock,'\" when asked about her favorite Disney star. Lorde, who got her start from Tumblr, and now flying to the top of the charts was also asked \"Would you rather be Blue Ivy Carter or North West?\" She responded, \"Oh. I would rather be the daughter of Beyoncé and Jay Z,\" she said. \"Because, if Beyoncé is your mom? No words.\" As a fan of Lorde myself, I can only hope she doesn't sell out. \n\n[b][color=white]Kanye Visits Jimmy Kimmel.[/color][/b]\nAs previously mentioned in last edition's music news, Kanye went on a Twitter storm completely tearing Kimmel apart because of the spoof Kimmel of Kanye. Well, Kanye finally visited Kimmel on his show and it didn't turn out as many would have expected. Kimmel was responding to Kanye West on Twitter with sarcastic remarks and it was safe to say that Kimmel was acting a bit cocky himself. Though on the show, Kimmel completely praised Kanye and cowered down; basically asskissing Kanye West. Many were expecting a huge argument, but it was relatively calm besides Kanye's death stare throughout the whole interview. Many including myself, were expecting Kimmel to stand his ground, but like Kanye said in one of his tweets, \"Kimmel is a pussy.\"\n\n[align=center][img]http://i.minus.com/ih4DkNmH5M949.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nAttraction. Ahh, what a double-edged sword. As humans, we can often be pulled away by thoughts of fantasy and willful imagination, but we must keep our wits about us. There simply is a difference between love and lust. We creatures are beings of spontaneity and action, so yield your impulses to thoughts and internal debates. Not only does this apply to the chemistry between two individuals, but also to any step in life. Think before you act.",
      "subject": "*"
    },
    {
      "pid": "35735842",
      "uid": "515249",
      "dateline": "1381887744",
      "message": "[align=center][img]http://i.minus.com/ibvB54RmtuIUlF.png[/img][/align]\n\n\"What makes you a real nigga?\"\n\n[i]\"Now this is the story all about how\nMy site got jacked, turned to a real nigga town\nAnd I'd like to take a minute, don't ignore like Santorum\nI'll tell you how I became the nigga of a site called hack forums.\nOn reddit, FK & LF: born and raised\nBrowsing HF where I spent most of my days\nMaking posts, trolling and getting awards all cool\nBecoming a forum God, making kids drool\nWhen a couple of oldfags where complaining some more\nStarted bitching that they weren't cool any more\nThey made one little thread and Omni posted there\nAnd said \"You're all real niggas, and I'm no multimillionaire\" \nHe went and changed the banner, up on the top\nSaid \"Reall Niggas welcome\" and I laughed \"Oh Omni, you gotta stop\"\nIf looked on and laughed, as the thread got bigger \nBunch of little kids wanna be \"real nigguhs\"\nI pulled up to Omni's profile about seven or eight\nAnd I checked his posts on the thread... damn they where great\nLooked at Wifi's profile: new awards for the chigger\nAnd at least, we where all real niggas.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][i]-Rogue[/i][/url]\n\n[align=right][i]\"What makes you a real nigga? Dafuq is dis \nshiz? Why are you questioning me Sir? I'm the realest \nbecause anyone can be the realest on the outside, but \nwhat is on the inside is what really counts. I'm always \nthere for my homies and they have my back aswell. You \nsee fellas, I am the realest nigga because on the inside, \nyou can never tell if someone is a nigga on the outside \nbecause the light never shines in and with that, you \nhave to be on the inside to know who is a real nigga. \nYou dig, motherf*ckas?\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1093501][i]-Roger Waters[/i][/url][/align]\n\n[i]\"What makes me a real nigga? The fact that HF has \nbeen such an inspiring and educating place! I dare say \nthat some days I learn more from here than I would \nlearn from Sixth Form in a week! HF has made me a \nreal nigga. Seriously, HF has changed the way I think \nand the way I look at things! Its helped me get out of \nsome deep deep shit and also helped me strive to become \nsomeone who has the ability to help others. Omniscient \nhas built HF into a paradise for people who genuinely \ncare about becoming a better person. Look at how many \nmembers have registered! Think about it! HackForums \nhas changed so many lives! Look at all the people who \nhave been on HackForums and require genuine support \nfrom others. There have been people who have been on \nthe edge of suicide and I have made so many calls on \nSkype in order to bring them back to caring about \nthemselves and their life! That's what makes me (and \nso many others) a real nigga. Without HackForums, dare \nI say that there wouldn't be as many people alive here. \nHackForums builds 'Real Niggas' and I'm glad to say \nthat I am a real nigga because of it.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=823754][i]-McDork[/i][/url]\n\n[align=right][i]\"If you wanna be a real nigga, you gotta be \nfrom the hood. You gotta spit lines so sick with a flow \nso deadly that niggas faint at your feet; and most \nimportantly, to be a hard ass real mo'fuckin nigga, you \ngotta be a member of #Wifigang and the hardcore \nunderground HACKFORUMS, yeee represent! Niggas \nbe like how he got so much swag? and I be like 'yo I \ngot this swag from a hacking forum, imma real nigga! \nI be like the omnigga, nigga!'\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1108450][i]-Baghead[/i][/url][/align]\n\nThe topic for next week is \"What do you think of the new theme?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/iD2yZbLEetACs.png[/IMG]\n[img]http://i.minus.com/icde0HIQO20uG.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/ibvCM1Z22wtoEe.png[/img][/align]\n[align=center][spoiler=][img]http://paintraincomic.com/comics/2013-10-16-ThatHandsomeFool.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://25.media.tumblr.com/8ad2d0572895750f545391c25fa66e01/tumblr_muiyo35JuB1qhnegdo1_500.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/YZtkbQ3.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://fc07.deviantart.net/fs71/f/2012/056/b/c/gamercat___sacrifice_by_celesse-d4qzx6z.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://24.media.tumblr.com/e61f95cda7bcc2d507598a0139d1efb1/tumblr_muqcfp60fC1qh0oogo1_1280.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/dvkjgJX.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/iOxJ1fCJvvnsB.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1452467]Morchid[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=956054]Emylbus[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=752389]drugs[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1653635]Educate[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1050193]Connected[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}