{
  "posts": [
    {
      "pid": "14078563",
      "uid": "295848",
      "dateline": "1311903062",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNMain.png[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=deepskyblue][b]52nd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNHeadlines.png[/IMG][/align] \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#4DD0FC]Omniscient[/color][/b][/url] has announced that post count in the [url=http://hackforums.net/forumdisplay.php?fid=133]Rate My Graphic[/url] section is now disabled. This was done to prevent low quality comments in that section. You can read more about this [url=http://hackforums.net/showthread.php?tid=1523439][b]here[/b][/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#4DD0FC]Omniscient[/color][/b][/url] has added a new feature to the reputation system, you may now select to view just your positives, negatives and even neutral reputations received. if you're interested in testing out this new feature head over to your User CP and check it out.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b][color=lime]xerotic[/b][/color][/url] was recently SWAT'd. However, this has not affected his activity in any way. This is all we can tell you about the event at this point in time.  \r\n\nAfter a short vacation, [url=http://hackforums.net/member.php?action=profile&uid=100071][b][color=lime]cobija[/url][/color][/b] and [url=http://hackforums.net/member.php?action=profile&uid=588781][b]Hуѕтєяιa X™[/b][/url] are back in full swing to perform their duties as a staff and Black Knights & Red Lions leader respectively.\r\n\nThe voting for this month's Member Of The Month is now up. The competition is getting tougher each second. Go and vote for the member who you feel is the most deserving amongst the 10 nominees. Click [url=http://hackforums.net/showthread.php?tid=1516275][b]here[/b][/url] to cast your vote.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=295848][b][color=#AAAAFF]Qwazz[/color][/b][/url] will no longer be publishing the weekly news, as well as stepping down as moderator of the section. He has chosen [url=http://hackforums.net/member.php?action=profile&uid=277712][b]Cobalt+[/b][/url] to be his successor. \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=234024][color=#AAAAFF][b]Deities[/color][/b][/url] has been promoted from leader to moderator of The Alliance sub-forum. This means that their sub-forum will now be controlled by some sort of Deities-magic. This is a shock due to the fact that [url=http://hackforums.net/member.php?action=profile&uid=70881][b]Paradoxum[/b][/url] is still considered the owner of said group. \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=215614][color=#AAAAFF][b]๖ۣۜPink ๖ۣۜFloyd[/b][/color][/url] has been promoted to moderator of the [url=http://hackforums.net/forumdisplay.php?fid=179]Minecraft[/url] section, this is after a suggestion he made about improving said section and adding another sub-forum. If you'd like to read his full suggestion it can be found [url=http://hackforums.net/showthread.php?tid=1526218]here[/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=566671][b][color=#AAAAFF]panDa.[/color][/b][/url] has been rep-fucked for illegibly attempting to bribe a staff member, but it all seems to be a huge misunderstanding while people still continue to point fingers.\r\n\nA new official group called [color=white][b]Marketers[/b][/color] is now established. It is led by [url=http://hackforums.net/member.php?action=profile&uid=209490][color=#AAAAFF][b]Codevade[/b][/color][/url], he is also a moderator of this sub forum. The marketers are a group focused on improving the overall quality of hackforums. By decreasing scams and selling better products and helping all members in any way that they can.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=731778][b]Lemonade[/b][/url] is now promoted as the co-leader of Reverence. Congratulations to him! We wish him the best of luck in handling his new responsibilities.\r\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNUsernews.png[/IMG][/align]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=115612][color=#0066FF][b]-BoodyE-[/b][/color][/url] has gotten the Star Award. Congratulations for being in the elite group of star award holders. This is surely a great achievement.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=234024][color=#AAAAFF][b]Deities[/b][/color][/url] has now full ownership of the YouTube channel http://www.youtube.com/HackForums. He has also hit the tremendous milestone of 1,000 reputation. \r\n\nUnfortunately [url=http://hackforums.net/member.php?action=profile&uid=63387][b]Blackshadow[/b][/url] has been removed from the MoTM because someone was asking for votes for him. It is unknown as if he was involved in this or not; [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#00BFFF][b]Judge Dredd[/b][/color][/url] has yet to post an official disqualification list.\r\n\nAs many people have noticed the game Transformice has become quite popular here on Hack Forums. If you're still having trouble learning the ropes of this game or just need some tips, [url=http://hackforums.net/member.php?action=profile&uid=413885][b]Fabiolin[/b][/url] has created a comprehensive guide on how to play the shaman role and actually succeed. His guide can be found [url=http://hackforums.net/showthread.php?tid=1519477]here[/url] for those who are interested.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=616850][color=#0066FF][b]Atthackers[/b][/color][/url] has been granted the golden upload award for his line of popular products here on Hack Forums. These goes to show that his products are both popular and have some quality behind them.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=64677][color=#0066FF][b]nofear1999[/b][/color][/url] has released a new shell checker. This will help all members out there creating booters to check their shells are either private or public. If you would like to check it out click [url=http://hackforums.net/showthread.php?tid=1506803]here[/url].\r\n\nOur very own [url=http://hackforums.net/member.php?action=profile&uid=520560][b]Pluto[/b][/url] will be having his birthday July 28th. Go wish him a happy birthday!\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=384745][b]๖ۣۜScripT[/b][/url] is going to have his birthday along with [url=http://hackforums.net/member.php?action=profile&uid=234024][color=#AAAAFF][b]Deities[/b][/color][/url] on the 30th.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=725160][b]McFlurry[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=731778][b]Lemonade[/b][/url] were promoted to co-leaders of Reverence.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=390455][color=#FFCC00][b]Bread[/b][/color][/url] has received the cool award. Congratulations to him! You can find the full list of \"cool\" people [url=http://hackforums.net/myawards.php?awid=25]here[/url].\r\n\n[b]This weeks Bans & Repfucks.[/b]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=622410][color=#0066FF][b]Oprah[/b][/color][/url] requested to be banned while on vacation.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=137080][color=#0066FF][b]Boxing[/b][/color][/url] was repfucked for abusing his reputation giving abilities.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=354672][color=red][b]Codad[/b][/color][/url] has been limited for posting adult content.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=344171][color=red][b]Halo Noob[/b][/color][/url] has been limited for reputation abuse.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=193471][color=red][b]The Pilot[/b][/color][/url] has been limited for disallowed black hat activity.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=689024][color=red][b]Cystomatic[/b][/color][/url] has been limited for disallowed black hat activity.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=752132][color=#0066FF][b]Blood[/b][/color][/url] requested to be banned while on vacation.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=407835][color=black][b]Kick Buttowski[/b][/color][/url] has been banned for threatening members in reputation.  \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=37251][color=black][b]Baked[/b][/color][/url] has been banned for payment reversal after his Paypal was limited.[/list]\r\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNOther.png[/IMG][/align]\r\n\nFor the first time since he was ousted from power this spring, former Egyptian President Hosni Mubarak will be brought to Cairo for a trial next week. He is going to be tried on the following charges: corruption and ordering the killing of protestors during the uprising against him. He is going on trial with his sons, Gamal and Alaa, also charged with corruption. Also being charged with ordering the killings of the protesters, former Interior Minister Habib el-Adly will be going to trial.\r\n\nFor all of you techies out there who debate the 'Browser Wars', PCMag has written a very interesting article comparing all different aspects of the three main browsers—Chrome, Firefox, and Internet Explorer 9. If you would like to read this very interesting article please click [url=http://www.pcmag.com/article2/0,2817,2389248,00.asp]here[/url].\r\n\nAmy Winehouse, the bee-hived soul-jazz diva whose self-destructive habits overshadowed a distinctive musical talent, was found dead Saturday in her London home, police said. She was 27.  Read more [url=http://today.msnbc.msn.com/id/43866337/ns/today-entertainment/?gt1=43001]here[/url].\r\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNInterviews.png[/IMG][/align][hr]\r\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - Black Shadow[/color][/font][/size]\r\n[spoiler][color=#AAAAFF][b]Astonish is NJ:[/b][/color] Hello Black Shadow and thank you for participating in the 52nd edition of the HF News. Would you like to make any opening statements?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] Yes I feel honored to be asked to take part in this weeks news \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Let's hop right into this one, Why did you join HF?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] Well the full story is this but I will keep it brief; my friend introduced me to Facebook in 2008. I did not even know what Facebook was at that time. It was to play zynga poker and after a while I built my chip count to 7 billion as I started \r\nselling them on e-bay, but I got hacked and lost it all, well there was $14000 gone, I had to know how this was done, \r\nhow had they taken it all, so I Googled hacking and found Hack Forums.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Who was your first friend on Hack Forums and how did you get to become friends with him?\r\n[color=#0066FF][b]Black Shadow:[/b][/color]Well I heard about keyloggers and wanted to try them out as this would be a good idea to hack other poker players to\r\nget back what I lost, so a member called Vaqxine had the best keylogger on here for sale at the time, he was a really\r\nnice guy took his time to answer all my nooby questions I learnt a lot from him, also he had the highest rep when I joined,\r\nhe made a good role model for me.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Well now you have been here since 2009. Have you seen a change in the forum, if so then how?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] Yes the changes have been major, Omni never wanted this to be a hacking forum but it was getting more blackhat each and every day to the point were now even the talk of black hat you are banned, the lounge is ridiculous now , everybody used to know each other back then its to overcrowded now, also a majority of the old school members have gone now.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] If you had to pick one person to give the Member of the Month award to, who would it be?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] I would pick KillαMuvz He is very HQ and one of the RATS Crew leaders\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Most of here know you were the first here to get the Master Donator award, How do you feel about that and some of us know you asked to get the award removed, why was that?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] Yes the day it came out I got it as it was originally my avatar but I thought it would look good with my other 3 diamonds\r\nbut it brought a lot of trouble with it getting begging pm's regularly and there was a lot of jealousy around it, I used my\r\nlast bit of cash to get it I am an award whore im not rich so I got it removed along with the gold medal as I got that for\r\nthe first to get 12 awards but I only had 11 with the diamond gone so I decided to let that go also \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] We all know on HF that you have the most awards (14) that is something some people would love to have, do you take this as a gift or a must have on HF?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] I was always fascinated by the awards other members had, when I first joined I just wanted to collect them like a hobby.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] If there was one award you can have on HF right now, which one would it be?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] I would like to get something that nobody else has, like I love the RAT award that's my dream but I know another member\r\nwho deserves this more than me.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] If you have to choose any age to be now, what age would you choose?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] I would like to be 16 again just leaving school but have the knowledge of what I have now.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] What one piece of advice would you give to a new user joining HF?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] I would say be HQ from day one learn and go about your posts and threads in a mature way, if you act like an idiot\r\nyou just lost the game, and as you learn teach others your skills you will be well liked for it, that's how I did it.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] This went fast, but time to wrap it up, do you have any shout outs?\r\n[color=#0066FF][b]Black Shadow:[/b][/color] Yes I am proud to be a member of this forum and will be here for a long time it will be bigger than ever soon, I have \r\nseen the rapid growth over the past 2 years and to thank Omni for creating it he is the best Admin you will find.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Alright, thanks for this interview![/spoiler]\r\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - Skill[/color][/font][/size]\r\n[spoiler][color=#AAAAFF][b]Astonish is NJ:[/b][/color] Hello Skill, and thank you for participating in the 52nd edition of the HF News. Would you like to make any opening statements?\r\n[color=lime][b]Skill:[/b][/color] Thank you for giving me the opportunity to be involved in the HF News. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] So why did you really join HF?\r\n[color=lime][b]Skill:[/b][/color] Believe it or not, unlike many other members I didn't join HF because I wanted to learn how to hack or do anything illegal. I joined because I had heard a number of people talking about the various topics of discussion that were held here, mainly including computers and so on, which I have a large interest in so I thought to myself \"Why not?\". From that day on I have been addicted to HF ever since. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Who was your first enemy on Hack Forums and how did you get to become an enemy with him?\r\n[color=lime][b]Skill:[/b][/color]From what I can remember, I don't think I've ever had an enemy here at HF. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Well now you have been here since mid 2009. Have you seen a change in the forum, if so how?\r\n[color=lime][b]Skill:[/b][/color] I have seen a number of changes since my arrival. Firstly, the member base and posting activity has increased dramatically; I remember when we first hit 1 million posts. Now we are currently nearing 12 million posts, and still rising! Secondly, there has been an addition of new forums and tabs, as well as the removal of the International section (which I never went to anyways, so it didn't make a difference to me). Thirdly, the upgradeable status' that we have here at HF have changed quite a lot of the years. Back in the day, HF L33T cost a very low $5, which has now increased to around 4 times its price, if I'm not mistaken. We also so the introduction of a new upgradeable status; HF Ub3r which has grown in member count quite a lot since its implementation. I could go on and on and on, but I'll leave it at that. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] If you had to pick one person to give the Dunce award to, who would it be?\r\n[color=lime][b]Skill:[/b][/color] If this includes past members, I would have to say Braco. He is by far one of the most persistent members we've had to deal with but in the end he always fails. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] You are the creator of the HQ group Alliance, but you are not leader anymore. How did you come up with the name Alliance and why are you no longer the leader?\r\n[color=lime][b]Skill:[/b][/color] As the original aim of The Alliance was to unite all members of the forum, no matter what their abilities, I thought The Alliance was a suitable name as it brought the members together, forming an alliance. Due to me becoming Staff, studying for college and then becoming the leader of Reviewers, I didn't have the time to juggle my schedule as much as I'd like to so I decided to resign from my duties at The Alliance, thus leaving Paradoxum in charge. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] How do you feel about being leader of one of the best groups on HF the Reviewer?\r\n[color=lime][b]Skill:[/b][/color] It feels like a great accomplishment and one that I am truly proud of. I've given everything I can do to the group and will do for as long as I can keep it up. I do sometimes feel as though it is a bit too much, especially taking into account that I have Staff duties to tend to but in the end it's all worth it. Knowing that the Reviewers is upholding the Ebook Bazaar, notifying potential buyers of what they are purchasing beforehand is something that keeps me going. I know sometimes our members make the wrong judgement but all in all, I think we've accomplished Omniscient's goals regarding the Reviewers group (at least I hope so).\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Would you consider yourself a harsh leader?\r\n[color=lime][b]Skill:[/b][/color] I am by no means a harsh leader, but when it comes down to the best interest of the group then I will do whatever is necessary to ensure the group and its members are kept in shape.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] I would love to have you as a leader anyway. Most people on HF know you as a staff member, How do you feel being a HF Staff member?\r\n[color=lime][b]Skill:[/b][/color] Just knowing that I'm doing my bit, be it dealing with reports, members complaints or any other issues, makes me proud of what I do and I wouldn't change it for the world. At times being on Staff is one of the toughest jobs you'll ever come across, sitting at your desk working hours on end trying to get the constant influx of reports down, but the end result is well worth it. Being able to help HF as much as I can, day in, day out; that's what keeps me going. \r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Do you enjoy banning members? \r\n[color=lime][b]Skill:[/b][/color] No, I hate issuing bans but if the member is blatantly breaking rules then I have to do what is necessary.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] This question might be tough for you to answer but if you had to pick one member to be able to join the HF staff team whom would you choose and why?\r\n[color=lime][b]Skill:[/b][/color] Paradoxum all the way. Myself and Paradoxum have worked together for as long as I can remember, both with The Alliance and Reviewers and he has given everything he can to maintain such respectable groups here at HF. His dedication to other members, especially when it comes to dealing with the HJT logs, is astonishing. He has a pure heart of gold.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] This went fast, but time to wrap it up, do you have any shout outs?\r\n[color=lime][b]Skill:[/b][/color] I'd like to give a shout out to all HF members. On a daily basis I hear nothing but praises from you guys and you are the main reason my activity at the forums remains as is. Thank you, from the bottom of my heart.\r\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Alright, thanks for this interview!\r\n[color=lime][b]Skill:[/b][/color] Thank you, it's been a pleasure.[/spoiler]\r\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNClassifieds.png[/IMG][/align]\r\n\n[align=right][url=http://hackforums.net/showthread.php?tid=1416451][img]http://i.imgur.com/2dExQ.png[/img][/url][/align]\r\n\n[align=left][url=http://www.mskeys.in][IMG]http://i.imgur.com/X3GG1.jpg[/IMG][/url][/align]\r\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNTeam.png[/IMG][/align]\r\n\n[color=white][b]Publisher & Head Writer[/b][/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\r\n[/list]\r\n[color=white][b]Publisher's Assistant[/b][/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\r\n[/list]\r\n[color=white][b]Writers[/b][/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=545127]Joey Tribbiani[/url][/list]\r\n[color=white][b]Reporters[/b][/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url][list]\r\n[*]Head Reporter[/list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=129444]3x0r_$c0rPi0n[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=355307]chocothunda[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url]\r\n[/list]\r\n[color=white][b]Interviewers[/b][/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=657392]Astonish is NJ[/url][/list]\r\n[color=white][b]Editors[/b] [/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=234024]Deities[/url]\r\n[/list]\r\n[color=white][b]Graphic Designer[/b][/color]\r\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]",
      "subject": "[7/28/2011] - HF News"
    }
  ]
}