{
  "posts": [
    {
      "pid": "38980628",
      "uid": "515249",
      "dateline": "1395199129",
      "message": "[align=center][IMG]http://i.imgur.com/VwAgunA.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#992828][b]186th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.imgur.com/TDDIvTi.png[/img][/align]\n\n[color=white][b]Polymath: Home of the Polyhistors[/b][/color] \nA brand new usergroup has arisen from the ashes of its predecessor this week, sporting the name \"Polymath\". A polymath, or a polyhistor, is a person whose expertise spans a significant number of different subject areas. As such, the group description is simple yet accurate; \"Polymath is a group of individuals with broad knowledge\". Led by the members [url=http://hackforums.net/member.php?action=profile&uid=42927][color=#EFEFEF][b]Lani[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=608523][color=#EFEFEF][b]Sh1eld[/b][/color][/url], the group no doubt aims to deliver a refreshing user experience for the members within, striving to be seen and considered a group of intelligent members who push their limits and wish to expand their knowledge in many areas of study. The group held several very short applications, allowing a lucky few the chance to apply while causing many other members who were potentially busy during those time to miss out on the opportunity. The application process is certainly something new, and time will tell how that works out for the future of the group. The name, description, and userbar can be seen by viewing the [url=http://hackforums.net/showgroups.php][b]groups page[/b].[/url] An announcement thread regarding the group can be found [url=http://hackforums.net/showthread.php?tid=4110475][b]here[/b][/url].\n\n[color=white][b]Scammer Embargo[/b][/color]\nIn response to a [url=http://hackforums.net/showthread.php?tid=4110472&pid=38853367#pid38853367][b]thread[/b][/url] crated by the member [url=http://hackforums.net/member.php?action=profile&uid=2157803][color=#383838][b]Legit‌[/b][/color][/url], site owner [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] has made it clear that scammers do indeed receive bans on a daily basis. He reminds members that neither he nor staff members should be expected to become involved in member deal disputes, stating that there will be no investigations of deal disputes to confirm the validity of a claim or the evidence provided. The largest problem, it seems, is the relentless return of scammers on new accounts. Many accounts are closed or banned every time the sun rises, yet like stopping an incoming tide, the battle is not an easy victory. Those deciding to make a trade are expected to carry out research prior to a deal, focusing mainly on the history of the potential customer or seller. A deal dispute serves to warn fellow members against a malicious member and does not double as a \"please ban\" form. Your deal is, after all, your own responsibility. A direct quote from his response sums up his feelings on the matter in a concise fashion; \"[i]So fuck you OP for not paying attention to some serious fucking facts. You choose to do any deal and you don't involve me. You don't come to me AFTER you're scammed and whine about it. MAN THE FUCK UP. If you came to me BEFORE you got scammed asking if you should do the deal...guess what I would tell you. NO DON'T FUCKING DO IT. I would tell everyone here...DON'T FUCKING DO IT. Make no deals. Trust no one.[/i]\". The member who posted the thread has also been closed for having a problem with how Hack Forums is run, a reminder that the forum is not a democracy. \n\n[color=white][b]Hackercraft Marketplace[/b][/color] \nThe long awaited and confusing topic of HackerCraft related sales has received a solution. Earlier this week, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url] agreed with a suggestion thread made by [url=http://hackforums.net/member.php?action=profile&uid=1807099][color=#EFEFEF][b]FeaturedBmx[/b][/color][/url] concerning clutter in both the HackerCraft section and the Marketplace Virtual Game Items forums. A new section has been added atop the HackerCraft section brandishing the name \"[url=http://hackforums.net/forumdisplay.php?fid=312][b]HackerCraft Market[/b][/url]\". The new section is a perfect place to buy and sell all things related to the popular MineCraft server for both real world currency and in-game \"EcoMoney\". Whether you are new to the server and wish to get a quick start, just a few thousand EM award from the HackerCraft Purple Award, or even a well seasoned member wishing to sell fully enchanted diamond god armor sets, this new section is the perfect place for you. The original suggestion thread may be read [url=http://hackforums.net/showthread.php?tid=4110361][b]here[/b][/url].\n\n[align=center][img]http://i.imgur.com/gIeGa1Z.png[/img][/align]\n\n[color=white][b]User News[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=44755][color=#EFEFEF][b]'Snorlax[/b][/color][/url] hit 1,000 reputation.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1336657][color=#00AAFF][b]Cubs[/b][/color][/url] hit 1,000 reputation.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=44755][color=#EFEFEF][b]'Snorlax[/b][/color][/url] hit 20,000 posts.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1320406][color=#EFEFEF][b]Froggy[/b][/color][/url] received a +10,000 from [url=http://hackforums.net/member.php?action=profile&uid=1][color=#FF66FF][b]Omniscient[/b][/color][/url].\n[/list]\n[color=white][b]News Notables[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=787112][color=#EFEFEF][b]Saturday[/b][/color][/url] snagged the 1st post in the 185th edition. Cutie.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1308266][color=#EFEFEF][b]Vodge[/b][/color][/url] snagged the 50th post in the 185th edition.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1743726][color=#00AAFF][b]Spyro The Dragon[/b][/color][/url] snagged the 100th post in the 185th edition.\n[/list]\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=2031528][color=#EFEFEF][b]Tracked[/b][/color][/url] was repfucked for nudity posting.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1054655][color=black][b]proddy3[/b][/color][/url] was repfucked for having an invisible username.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1614399][color=#99FF00][b]Fullscreen[/b][/color][/url] was repfucked.\n[/list]\n[color=white][b]Active Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=300035][color=black][b]N3oNight[/b][/color][/url] was banned for \"behavior problems\".\n[*] [url=http://hackforums.net/member.php?action=profile&uid=589027][color=black][b]Stay Plural[/b][/color][/url] was banned for harassing members.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1054655][color=black][b]proddy3[/b][/color][/url] was banned for having an invisible username.\n[/list]\n[color=white][b]Expired Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=2031528][color=#EFEFEF][b]Tracked[/b][/color][/url] was banned for nudity posting.\n[/list]\n[color=white][b]Vacations[/b][/color]\n[list][list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=796061][color=black][b]Aesthetics[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=44755][color=#EFEFEF][b]'Snorlax[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1278319][color=black][b]iNuke[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=153533][color=black][b]Assault[/b][/color][/url] took a vacation ban.\n[/list]\n[/list]\n[color=white][b]Closures[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=573871][color=#00AAFF][b]ibennz[/b][/color][/url] had their account closed, and then re-opened. \n[*] [url=http://hackforums.net/member.php?action=profile&uid=1043300][color=#00AAFF][b]Fresh Prince[/b][/color][/url] had their account closed, and then re-opened.\n[/list]\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1866420][color=#00AAFF][b]Cibor[/b][/color][/url] donated for the Master Donator award and received the Great Thinker award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=44755][color=#EFEFEF][b]'Snorlax[/b][/color][/url] donated for the Master Donator award and received the Mad Scientist award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1443720][color=#EFEFEF][b]Honey Singh[/b][/color][/url] received the Businessman award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1417555][color=#EFEFEF][b]Acroz[/b][/color][/url] received the Blackhatter award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1785476][color=#00AAFF][b]Shoppa[/b][/color][/url] received the Dancing Queen award.\n[/list]\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=42927][color=#EFEFEF][b]Lani[/b][/color][/url] is now a leader of Polymath.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=608523][color=#EFEFEF][b]Sh1eld[/b][/color][/url] is now a leader of Polymath.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1021070][color=#00AAFF][b]#Thunder[/b][/color][/url] is no longer a leader of The Empire.\n[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of scheduled release date for the HF News edition.[/size][/align]\n\n[align=center][img]http://i.imgur.com/WEQZm4K.png[/img][/align]\n\n[url=http://hackforums.net/showthread.php?tid=4101804][b]| GTA Online | Guide to GTA:O and everything you need to know |[/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=969003][b]Tom‌[/b][/url] - A HUGE GTA V mega-guide.\n\n[url=http://hackforums.net/showthread.php?tid=4111888][b][Tutorial] A Comprehensive Guide To Batch[/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=317312][b]White Light[/b][/url] - Just as the title says, check out this comprehensive guide to batch.\n\n[url=http://hackforums.net/showthread.php?tid=4101745][b]Ask the gays of HF. Discussions welcome![/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=969003][b]Tom‌[/b][/url] - Freely ask homosexuals some questions you may have in this thread.\n\n[align=center][img]http://i.imgur.com/133fXLG.png[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aura[/url][/font][/size]\n[spoiler=][b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color]  Hey, man. Welcome the this weeks edition of the news. What's good? How are you doin?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] I'm good Clique thanks. Just stressing a bit because I don't know if I'll have time to finish that MySQL homework (stored procedures, over 35 done so far) for midnight tonight, but it'll be fine ! How are you ?\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Best of luck! I'm doing alright dude. Any shout outs before we continue?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Of course ! Shout outs to my mates Chief, Corso, #Thunder, Goodies, Snorlax, Extrnl, Pony, Blackjack, Xen0n, KFC, George, BlueTigerSlayer, Thornzzz, Polymath 1.0, Phyber, Zeus and Bonfire ! I know I might have forgot a lot of people, but I don't think people would read a whole paragraphs of names, but you know I love you too guys ! Also a shoutout to my beautiful girlfriend that I love. I know I've not been really good to you lately, but I really love you and all I want to focus on right now is us so we can get back in our couple routine we had before. I love you.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Dang. Quite a list! Hello to them. So -- how are you liking your new leadership status on the group 'The Brotherhood'? Congratulations, by the way. 🙂\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Well Clique, it was rather unexpected to be honest ! It all happened really fast and at first, I thought it was a joke but I guess Cryptic was serious (even if he doesn't answer my questions on Skype, Cryptic, stop making money and answer meh). I can't say I did anything yet with that title in The Brotherhood, but one thing is sure, you'll see me handling the recruitement more than before. It's probably the reason that got me a Leader title as I started to review applications and tell a lot of members to step up their game (and their application) if they want to be considered to be accepted as a member of The Brotherhood. If you are to apply for a group, do it properly and respect the application form, it's all I can say.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] So it's safe to say that you're enjoying it? I'm glad that you're glad. Anyways, What's up outside of the internet? I remember you saying something about MySQL?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Of course I enjoy it, I never expected to climb up this far and I just really hope that I won't deceive Cryptic along with xflat and Snorlax and the members of The Brotherhood ! And yes, I'm working on a MySQL homework right now for one of my class. I just finished a 9 months internship and this semester, 4 (or 5?) of my classes are project classes, which means that we'll spend the whole semester working on a project, so no weekly homework or exams. The homework we have are all related to our project. For this class (Database), we have to create a social network application in Java, JavaFX 2 and MySQL. Right now, we're working on the database backend, the stored procedures to be exact and we're using MySQL for this. My other projects consists of developping a website like Doodle in ASP.NET using MVC4, developping an Android game application and set up a Ubuntu OpenStack VM that I'll configure so it will be deployed on the cloud. This won't be easy but I don't have a choice, I have to do all these projects and pass them if I want to pass my semester.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] At least you're keeping busy -- which is a good thing! What year of schooling are you in? Are you in University?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Well, I live in Québec, Canada, so I'm currently in Cégep (which could be seen as the equivalent of College I guess) and I'm a 3rd year IT student (even if we do a lot of programming/coding, more than anything else that is technical sided). I'll graduate next December. I still have to finish this semester, this summer I'm going back in an internship and then this autumn will be my last semester. After that, I plan to go to University, ÉTS (École de Technologie Supérieure, which could be translated to School of Superior Technology) where I'll go get a Bachelor in IT in order to become a Cyber-Security Expert, which is my dream. But I still have a long way to go. Sometimes I feel like giving up but I know I can't so I just get back up and continue moving forward. I must say that HackForums takes A LOT of time in my life too, haha!\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Keep chasing your dreams! Have any idear where you'll end up working? That's true, do doubt. Do feel that the forums is more of a distraction at times?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] I have no idea where I'll end up working, but if I could work for an IT Security firm, that would be the best ! I also thought about working for the Ministery of Defence, but I'll have to be one of the best in order to get a job there. HackForums IS a distraction. All day, everyday it's distracting me. The thing is that I don't go on HackForums to go in the Marketplace, post in the Lounge, learn now hacks, etc. In fact, I just stay in the Computing area and take care of the White Hat Help, Windows and Computer Protections and Security Alerts sections. If a new thread comes up, you can be sure that I'll be one of the first to reply in it and assist the OP. I just can't help it. If I see that someone needs help or have a question and I can help or I can provide an answer, I just jump on it, it's stronger than me. I also feel that I HAVE to be online and ready to help. I never know when someone will send me a PM or create a thread and expect a reply from me to help them, and I would help to deceive them. I feel like some people count on me and I don't want to let them down, but because I focus so much on HackForums, sometimes I come to negligate my real life and I have to change that as soon as possible. But like I said, I can't help it ... I consider myself the technical support guy of these sections and I feel that I have to be online 24/7 to assist anyone who needs help. But I'm working on changing that right now. See, I'm already focusing a lot on my homework tonight instead! Haha!\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] That sounds like a great plan. Hope it all works out soon. Also: about HF, and all -- has it influenced you to chase your dreams? Do you think  that you've  benefitted from your time spent here? (You're almost at your 2 year!)\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Well, it's HackForums that makes me want to go in Cyber-Security. At first, I joined to learn how to hack, like mostly everybody who joined. But after seeing the White Hat Help section and the MRT, I knew this domain was for me. I'm always ready to help people with their computing problem on HackForums, no matter what issue or problem they are having. And I've always loved \"security\". To be a good guy and fight off bad guys, and so I would love to be that good guy and help prevent the bad guys from comitting their crime in a way that I love and that I have experience in. I know that HackForums is a forum that focus on hacking, but if the community knew what the Computing area have to offer, I'm sure a lot of them would change their opinion on this forum. Me as well as a lot of other members spends all of our free time providing assistance in the Computing area. Some problems can easily be fixed in a few clicks, but most of the issues we encounter requires experience in the domain in order to be fixed. And this is what I've been doing since July last year. Believe it or not, but I when I started being really active on HackForums (in the Computing area), I was a regular member with not even 25 positive reputation, and look where I am today. When I started being active in the Windows and White Hat Help sections, they were pratically deads. The posts were either trolling, innaccurate or were not the answer the OP was looking for. Today it's the total opposite. If someone have an issue and they post in one of the section I'm active in, this person will get a reply under 2 minutes and I'll be ready to assist him with his issue or his question(s). Even if HackForums takes a lot of time in my life and it can be bad sometimes, I don't regret it. Why ? Because HackForums gave me two things, one that I value the most in life, experience, and knowledge. And I know that the experience and knowledge I acquire on HackForums will help me in the future, in my future job and therefore I don't regret anything that I've learned here and I hope to learn a lot more from this forum.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Interesting! No doubt. When you signed up originally, were you immediately drawn to those specific sections? Were you referred by a friend?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] I wasn't drawn to these sections at first no. Like I said, I signed up to learn more about hacking, like the majority of the community here. I started as a \"skid\" that didn't knew anything about hacking, to a potable member that started answering every questions in the Beginner Hacking section and stop posting in it at around 3,380 posts in it. If I could, I would purge all of these posts as I'm not proud of it. I feel that I wasted my time more than anything else in that section. I should had gone in the Computing area right away and work on getting them back on feet sooner. But like I said, I still acquired a certain knowledge and a few skills from helping/lurking the Beginner Hacking section, so I don't totally regret it too. And no I wasn't referred by anyone. I found HackForums in the most common way there is, Googling \"how to hack\". None of my friends actually use HackForums, except for my girlfriend which isn't so active. She just logins from time to time to go give advice in the Innuendo section (good advices too !). So I'm alone on this forum with the people I meet on it, but I don't really mind too. Some of my classmates makes fun (jokingly) of me for being on a \"hacking\" forum, but if they would sign up and lurk only for a few minutes, they would probably understand all the potential HackForums have to offer, and they would see what I really do on that \"hacking\" forum.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Would you refer this board to others with the same interests as yourself? I agree. There's tons of stuff here. 😉\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Of course I would ! Everyday I recommend to my friends and classmates to sign up on HackForums, to just give it a chance, to see all the potential it have to offer, but they won't. This forum is a great place to start sef-teaching yourself and also pratice what you've learned. It's also a great place to seek assistance in the domains convered and to help others. I think that's why this forum is still going strong after all these years, because there's a very helpful community. Yes, a lot of people are here only to do their thing, learn how to hack or make money in the Marketplace. But there's also a whole other group of people that are ready to help anyone who needs help and learn from the help they provide, and this is what keeps me on HackForums. I know that if I have a question, whatever the subject is : Computing, Coding, Marketing, Websites, etc. I can come on HackForums, post my question and I'll get the answer or help I'm looking for. HackForums isn't only a forum where people come on to seek resources, they can also PROVIDE these resources and that help that keeps it alive. And to all these people that helps day after day, no matter what the issue or the question is, you're doing a great job, keep up the good work. You are the people that make that forum a good forum and a good place to come to seek answers and resources. You are the people that make up for all the skids that signs up everyday and who just wants to know how to hack a Facebook account. Without you, the quality of this forum would have dropped a long time ago. Once again, good job and I'll continue referring anyone who seeks knowledge and a good forum to come get resources to this forum, the best of all.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Agreed. Best of luck on your future endeavors. Any closing statements before we're finished?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1495835]Aurа[/url]:[/b][/color] Well I would like to thank you for interviewing me of course, it's not like I've wanted it for a long time 🤫 I would also like to say thank you to Omni for creating and managing this forum. I know it must take a lot of time, but you do a really good job keeping that forum one of the best there is, no doubt on that. Also to everyone else, if you ever have any computing problem/issue or have computing-related questions, feel free to come in the Computing area of HackForums! We have tons of helpers ready to help you, they're just waiting for you! 🙂\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1092491]TheCause[/url][/font][/size]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Welcome to 186th edition of the HF News, today we're here with TheCause. Any shout-outs you'd like to make before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] Yeah, s/o to nyx, TwigX, the Tinyhat crew that put up with me every day when I was toe up from the flo up (that's science). TC crew wut it du?! My cuz 630, Reset, TOW, Wolves, and all my homies in the county in cell block 6. Oh, and shout out to Omni because I love business, poker, and could drink him under the table any day. I'm coming for you Omni. My liver looks worse than yours ever will shun. And I'm publicly calling you out to go shot for shot with me on Tinychat. I'll put $5 PP on it. Press 1 if you want to see this happen. A s/o to Sir too because he's a little intellectual machine, injected with infinite potential. Being like \"yo infinity, idk what you're doing in my math equations, but if I tried to comprehend every square inch of you my head would explode.\"\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Have you been drinking? Nevermind, don't answer that. Calling out Omniscient to a drinking match is a pretty bold claim, care to elaborate on that for me?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] Haha. I like to kick it with people and just act goofy. I think it would be awesome to drink with Omni. Have an intellectual conversation with him, and then slowly watch the quality of that conversation go straight out the window. I don't know if he can handle my cheap vodka though, because I probably can't afford a half gallon of whatever he drinks.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Last time I saw him drink on Tinychat he was drinking Johnny Walker Blue, that's $200 a bottle. So tell me about yourself, what do you do outside of the interwebs?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] Yeah... I can't do $200 a bottle. I'm majoring in Computer Science and minoring in Business in my second year in college. I'm also a radio DJ (and won an award for best newcomer last semester), as well as an aspiring turntablist. I bought a cheap set of decks to learn on, and have been progressively getting a lot better at spinning. It's awesome to be able to manipulate music with your hands. I want to start playing around with producing music as well. I grew up on a skateboard though, so that is one of my greatest passions in life. Gotta get some fresh air sometime. :)\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Nice. So you're an aspiring turntablist, what types of music are you into?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] As far as what I listen to, I'll listen to Fergie, I don't care. I have more Rock roots than anything, but I go through phases. Dance music runs in my blood, but I could very easily be listening to Country nonstop for the next month. When spinning I play mainly Deep House and Trance. It's easy to match two beats with those genres, and have a lot of fun with it. I try to stand out though, and make unique music. Ambient stuff is good to throw in there too. I'm still learning the basics.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] I do the same, I cycle through different genres of music. So what do you do on HF? Have any plans or money making projects in the works?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] Yeah man, I've got some big ideas for the future. They're pretty OP, I just would rather not say anything on HF that will saturate the market. As for HF, I have been mainly browsing the Instinct sub forum, the coding section and Hackercraft sections mostly here recently. That's where it's at. Those have been my main obsessions in life. Been killin it in Hackercraft, and currently learning as much ASM as I can cram into my brain.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] I noticed you rock the Instinct userbar, how do you like the group?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] It's been good so far. Man, with 420k members, you're bound to run into a lot of people that act like idiots. That's life, apparently. There are a lot of really cool people here though. There is always someone that is willing to help with any question. Tons of intelligent people, and some of the coolest people in the world. Can't beat that. It's been a pleasure.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] So what made you choose the name \"TheCause\"? Is there any special meaning behind that?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] It has a lot of personal meaning that is best if I don't get into. I will say that the brain is a reactive process. Basically like cause and effect, which builds into a collective consciousness, that the world goes by. Every action that our ancestors took brought us to where we are now. Miley Cyrus, Jim Morrison, Pink Floyd, Want to increase the size of your penis 110% in one week? One of the core traits that drives that collection of flabbergasting events that we call life, are things like ego. It's so deep in everyone. The way that they want to portray themselves, and wanting to be cool and fit in. Hell, look through my posts. It runs very deep in all of us. People will wake up one day and realize that we are all human, see the same world through the same eyes, and want the same things. To be happy. You don't have to kill random people for that to happen. I don't care if I have to get a YouTube video on the first page in every single language that explains the cores of life. I'm working on a blueprint to put the right people where they need to be, and teach them the right things. That's going to take at least 4 years, and more people than just me. And probably a lot of tears too. But I'm pretty tired of my friends being shipped to a country to fight a war for 4 years that they know nothing about.\nBefore I keep blabbering, I'll just tell you, I want to be that one cause that puts the wheels in motion. Therefore, I came up with TheCause.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Is there anything about Hack Forums that you would like to see changed?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] I was a fan of the Marketplace rep system that was going to be put in. Not sure what problems they ran into with that. I've never been scammed on HF, but I know it must suck. Anything that could help prevent scams would always be a plus.\nAnd as long as staff deal with the community as a whole the correct way (Sternly.), things should be fine and HF should continue to progress as time goes on.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#22C997][b]630:[/b][/color][/url] Well thank you TheCause I think we have enough for this interview. Do you have any final thoughts for us today?\n[url=http://hackforums.net/member.php?action=profile&uid=1092491][color=#EFEFEF][b]TheCause:[/b][/color][/url] We're all into technology. In this world where the NSA is insane, our governments are fueled by being a super power, and then our technology is just as crazy as all of that as well, people need to push themselves to have more morals, and just try to be better people. Stepping out of the cycle of what you would normally do can change a lot. It builds character as well. Life isn't a joke. It's pretty surreal. Please don't blow us up.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1559430]BlueTigerSlayer[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Welcome to this weeks edition of HF News. Today we're joined by my close personal friend, BlueTigerSlayer. How are ya bud? Any shoutout's you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] Doing pretty well. Shoutouts, uhh on the top of my head, Aura, big noob. :D\nHow bout you Clark?\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Good thanks. So, why don't you tell us a little bit about how you found HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] I found HF through Minecraft Griefing. It was a casual day, griefing this server using a bad client, met a terrible grief team, who showed me to Hf. Looked up griefing hack, and HF the first result.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Cool, minecraft lol. So I noticed you're into graphic design. What sparked your interest in that?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] I'm sure we all know Calibur right? His work was the \"thing\" back a while ago, and just recently looked at the graphics section, everyone's work inspired me to give it a shot. I heard you tried it too.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Yeah Calibur created some great work. I did try iy, and you were helping me via skype/join me. Thank you for that by the way. So are you still into GFX? Do you offer any GFX services?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] Yeah, I am still into it, just need to finish work for sectors. Over the summer, it is possible I may open a shop for my designs, but for now I do for free.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] That's very kind of you! So what other interests do you have? Are you into Computers? What about hacking or programming? \n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] Computing is my other interest. Ever since I was on any computer, it was very interesting, malware removal was always an interest cause im sure most of us when we were little downloaded everything we see. Hacking, not much, not into that stuff Programming I tried before when I was still griefing, didn't work out too well.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Yeah, malware removal is a great tool skill to have. So, how old are you? Are you in school? If so what are you studying?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] Yep I'm still in school and 15 right now. Gonna be 16 in a few months. Right now I'm gonna take a class in graphic design and on programming. I know I said it wasn't my thing, but I heard it pays more, so why not? \n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Best of luck with your academic pursuits. So how are you enjoying HF over all? Do you have any suggestions you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] HF has been great over the years, it has made a spot in my daily life. I don't know but I think im semi addicted to HF cause Im on it almost every day. I got one suggestion, why are the scammers still on hf, they are literally still on and scamming.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] I understand but Omni has his reasons. HF doesn't get involved with deal disputes. You're responsible for every deal you make through HF, and it's your duty to do some basic research on the user(s) you're dealing with to ensure that they are reliable and trustworthy. Omni + staff don't have the time to get involved with every dispute, and while HF has an extremely active market place, that's not the general focus of this forum. I'm not telling you this directly, but just as a general message to the readers. Do you often buy and sell a lot of items through HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] I used to sell this ewhore pack for 10 bucks, but then as time went by, it easily got nulled because there were other packs that were free and had more content, so I stopped trying. I also bought Ree's ebook for $50, and guess what didn't make a cent It required ebay and stuff. So, it was a waste of money. Now to me a majority of ebooks are complete bogus.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Do you still E-whore by any chance? \n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] I stopped after my first day, it didn't feel right. Made 50$ on my first day though. It just got weird seeing random pedo's adding me.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Clark:[/color][/b][/url] Haha, I respect that. Anyway, that's all of the time we have for today. Do you have any closing statements?\n[url=http://hackforums.net/member.php?action=profile&uid=1559430][b]BluetTigerSlayer:[/b][/url] See you on join.me later on, Clark?[/spoiler]",
      "subject": "HF News - 186"
    },
    {
      "pid": "38980634",
      "uid": "515249",
      "dateline": "1395199155",
      "message": "[align=center][img]http://i.imgur.com/wVhIMs6.png[/img][/align]\n\n[color=white][b]Why Target Really Dropped the Ball[/b][/color]\nSurely by now everyone has heard of Target's hacking back in December of 2013. While the the mass hysteria occurred where people began to think that companies had no protection, research shows otherwise. Earlier in 2013, Target installed a highly expensive monitoring system, which ran them a roughly 1.6 million USD price tag. This state-of-the-art system was completely capable of detecting the installed malware onto Target systems, and it even did! Not to mention in the software there is a feature designed to automatically remove threats like this, but it was turned off. Making matters worse, Target was notified of the exploit almost a month prior by the Indian company; however, due to slow response likely due to red tape and logistics, the issue was not handled. This points to negligence with respect to the situation, leading to over 4 million credit cards being compromised. This was a huge mistake on Target's part. Although this is not as means for ends, as the United States Government is looking into the situation, and credit cards are looking for more secure procedures. While there is still a silver lining to this, it truly shows how these market sector conglomerates can really drop the ball on such a crucial issue.\n\n[color=white][b]PWN2OWN[/b][/color]\nMarch 13th and 14th were to the two days of PWN2OWN. For those of you who may be unfamiliar, this is a real life event where numerous hackers give their best attempt to try to hack real life websites, operating systems, and applications, and get a huge payout for it. Taking place in Canada, during [url=http://cansecwest.com/][b]CanSecWest[/b][/url], several companies had their hard work cracked by some of the most brilliant minds in security. On the first day, a trifling 6 out of 7 attacks were successful. Day two was a similar situation, where Google had not only one exploit, but two! These giant companies do this to better their products and security. It is a true work of a white-hat hacker in action, and their works are admirable. Some of the more impressive would be the OSX exploit where they managed to run Calculator from root without permission. This puts an end to the completely incorrect myth that OSX is not exploitable, a very common misnomer. After day two, payments were made and a large portion went to charity. \n\n[spoiler=][img]http://sophosnews.files.wordpress.com/2014/03/results-499.png?w=499&h=240[/img][/spoiler]\n\nThat is some encouragement for all you white-hat hackers! Put your skills to good use and help people. Even these people give back to their communities as well, and a large sum of money was given to the Red Cross. Remember, people always need a helping hand, and one day it could be you.\n\n[color=white][b]Virtual Machines Take a Hit[/b][/color]\nOne of the core tools of any security researcher is a virtual machine. A virtual machine is a tool designed to emulate a PC, and be able to run an operating system. Two of the most notable are VirtualBox and VMWare. The prior is free, but the latter is paid and notably expensive. Many self-made security experts use VirtualBox, but recently Core Security has brought forth news of a potential exploit. VirtualBox depends on one of Google's libraries used for OpenGL. They posited a POC that would allow for memory corruption, and then it would run on the host machine. This could potentially be devastating to the community world. Basically, due to the fact that rendering is still done within the host machine, it can then be exploited to run malicious code. People should be at no alarm though, this requires a few things to do wrong. For starters, 3D acceleration needs to be enabled for the exploit to work. Also, you need to be using an outdated version of VirtualBox. This being said, there should be no panic. Simply update your VirtualBox and you shall be fine. The more important part about this is that people need to realize that, while rare, exploits [u]can[/u] exist within virtual machine software. \n\n[color=white][b]Security Tip of the Week[/b][/color]\nMBAM or Malwarebytes Anti-Malware should never be your first line of defense. People often think the paid version's scanner is on the same level as a true antivirus. While both technically are resident scanners, the prior is nowhere good as the latter. While I highly recommend MBAM as a tool, it should never take the spot of an antivirus. If you wish to still have MBAM in its pro version as well as an antivirus, you should disable MBAM's real-time protection.\n\n[align=center][img]http://i.imgur.com/RKmUG6A.png[/img][/align]\n\n[color=white][b]Icelandic Parliament Holds Closed Session to Discuss Auroracoin[/b][/color]\nAuroracoin, the Litecoin-forked cryptocurrency targeted towards Icelandic citizens, is being discussed behind closed doors by members of the Icelandic Parliament. However, notably missing from the session was the creator of Auroracoin, or for that matter, anyone with in-depth knowledge pertaining to Auroracoin or even Cryptocurrencies in general. The creator, Baldur Friggjar Óðinsson, claims that the Chairman of Iceland's Committee of Economic Affairs and one of the figureheads of the session, Frosti Sigurjónsson, is \"a staunch and vocal enemy of Bitcoin, Auroracoin, and other cryptocurrencies\". Sigurjónsson has penned a short blog post on his website suggesting that Auroracoin might be a scam. Translated to English, it closes by saying \"there is evidence, however, that this is [a money] scam and illegal\". This coin follows Iceland's 2008 financial crisis that sent the economy into turmoil. Coming up on Auroracoin's AirDrop initiative, a plan to give each Icelandic citizen 31.8 AUR, there is some worry that Iceland's Parliament may attempt to outlaw the fledgling cryptocurrency, though Óðinsson gave the following statement: \"They can make it illegal to own or trade Auroracoin. However, they will never be able to control such a decentralized system, or stop Icelanders from using the currency, without turning Iceland into a police state.\"\n\n[color=white][b]Several Companies Prepare for IPOs[/b][/color]\nMajor international companies are gearing up for IPOs this week. Alibaba and Weibo, two of China's biggest Internet companies are preparing for a US IPO, with Weibo filing for a $500 Million offering, and Alibaba for a $15 Billion offering. Weibo is best described as \"the Twitter of China\", while Alibaba is an eCommerce giant which invested $585 Million in Weibo last April. This news is accompanied by GoDaddy's second attempt at an IPO. Godaddy's initial attempt at an IPO occurred in 2006 was hindered by requirements that GoDaddy chose not to attempt to undertake at the time. \n\n[color=white][b]Australia-based Macro Energy's Stock Soars Following Bitcoin Deal[/b][/color]\nAustralian investment firm Macro Energy's stock soared following news of its entry into the Bitcoin ecosystem. Macro Energy recently announced their acquisition of the company Digital CC, and its subsidiary DigitalBTC. The deal will make DigitalBTC the first Bitcoin company to be listed on the Australian Stock Exchange. Macro Energy has also announced that it has commitments from investors who are planning on investing $9.1 Million into the company. The funding will be used to expand DigitalBTC's existing mining and trading operations, as well as expanding into Bitcoin-based retail products as well, such as mobile apps. \n\n[color=white][b]US Considers Regulating Bitcoin Under Commodity Rules[/b][/color]\nThe US is now considering placing Bitcoin into the same regulatory category as other commodities. The Commodity Futures Trading Commission is investigating whether or not it has the authority to regulate Bitcoin and other digital currencies. The Chairman of the CFTC, Mark Wetjen, stated that he could not predict what the outcome of the investigation would be, but there has been a suggestion that CTFC staffers believe that Bitcoin fits into the definition of a commodity reasonably well. However, any entity looking to regulate digital peer-to-peer currencies such as Bitcoin will face significant obstacles in terms of enforcement, due to the decentralized, pseudonymous nature of these currencies.\n\n[align=center][img]http://i.imgur.com/TF7PsyM.png[/img][/align]\n\n[b][color=white]Xbox Achievement Hunter Reaches 1 Million Gamerscore[/b][/color]\nRay Cox IV, better known as \"Stallion83\", has set a Guinness World Record. He is the first person to ever reach 1 Million Gamerscore on Xbox Live. After working hard for the past eight years to get every last achievement he could on Xbox 360, Xbox One, Windows, and Windows Phone game, he has finally reached it. Cox live streamed himself on Twitch last week, switching from Forza Motorsport 5, Battlefield 4, FIFA 14, and Titanfall attempting to get that last 50 Gamerscore that he needed to reach this achievement and eventually got it on the newly released game, Titanfall. This isn't the only big thing Cox received in the last few months, he received a lifetime Xbox Live Gold Membership and a rare white Xbox One, something only employees received at launch.\n\n[b][color=white]Amazon Gaming Controller Prototype Leak[/b][/color]\nWith speculation and rumors of an Amazon Android Gaming Console, photos of the controller have now appeared on the Internet. A series of photographs were found on by website Zatz Not Funny in a National Telecommunications Agency web database. The controller appears to closely resemble an Xbox One controller with some buttons appearing to have Android control buttons as well as some media control buttons, showing that Amazon could be pushing a gaming device with a focus on media playback along with it. Some have speculated that the controller is just a prototype while others speculate that it could be the final model of the controller. Photos of this controller can be found below.\n\n[align=center][spoiler=]\n[img]http://i.imgur.com/1zD3wdn.png[/img]\n[img]http://i.imgur.com/205qWUJ.png[/img]\n[img]http://i.imgur.com/acfzG9Y.jpg[/img]\n[/spoiler][/align]\n\n[b][color=white]Grand Theft Auto V's Potential Next-Gen and PC Release Date[/b][/color]\nThis week, more advertisements for the next-generation versions of Grand Theft Auto V have been found on an international retail site. These advertisements have shown a potential release date for not just the PC version of the game, but the Playstation 4 and Xbox One versions as well. The potential release date found on these advertisements June 2014. This isn't the first time information about a next-gen release was found on a retail website, a Czech retailer released information that they were expecting a June 13, 2014 release date. Perhaps June 2014 means something else for this game, could they be waiting until E3 to announce the release date? Only time will tell.\n\n[b][color=white]Wii U Outselling the Playstation 4 in Japan[/b][/color]\nIt is no surprise that Sony's Playstation 4 is going to go down as one of the best selling consoles of all-time throughout the world. As of right now it is selling more consoles than the company can manufacture, and the sale numbers are beating competitors Microsoft's Xbox One and Nintendo's Wii U by the thousands, if not millions. But what does this really show? It shows the worldwide sales, but NOT the markets where these consoles originate from. Aside from practically every market these consoles are sold in, the Japanese market for video game console sales show that the Wii U is a more popular and successful console in its originating country.\n\nA Japanese organization known as Media Create releases a weekly sales chart for every game and console sold in the country of Japan. In both Sony and Nintendo's home country, these charts show that Sony's Playstation 4 is far behind from Nintendo's Wii U in terms of sale numbers. In the first three weeks after its release, Sony sold around around 410,000 Playstation 4 units. Meanwhile, Nintendo sold around 560,000 units in the first three weeks after its initial release. What does this mean for the Playstation 4? Not much. The console is dominating any other Next-Generation console in practically any other market, and is on track to become the best-selling console of all time. What does this mean for the Wii U? It means a lot. Although the console has low sales in most markets after an earlier release than the other consoles, it has a market with strong sales; and for once, the company has a step over the other next-generation consoles.\n\n[b][color=white]Release Dates for the Week of March 16, 2014:[/b][/color]\n[list]\n[*]Metal Gear Solid V: Ground Zeroes - Playstation 3, Playstation 4, Xbox 360, Xbox One - March 18, 2014\n[*]Yaiba: Ninja Gaiden Z - PC, Play Station 3, Xbox 360 - March 18. 2014\n[*]Final Fantasy X-X2 HD - Playstation 3, Playstation Vita - March 18, 2014\n[*]inFAMOUS Second Son - Play Station 4 - March 21, 2014\n[*]Terraria - Xbox 360 - March 21, 2014\n[/list]\n\n[b][color=white]Upcoming Gaming Events:[/b][/color]\n\n[list]\n[*][url=http://hackforums.net/showthread.php?tid=4117082][b]Complexity Game Night - GTA V - Open to Everyone![/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=1093501]Roger Waters[/url]\n\nInterested in having your gaming event posted in here? PM [url=http://hackforums.net/private.php?action=send&uid=1093501&subject=Gaming%20Event&message=Hello,%20here%20is%20a%20link%20to%20my%20game%20event%20thread:]Roger Waters[/url].[/list]\n\n[b][color=white]Gaming Video of the Week:[/b][/color]\n[align=center][yt]http://www.youtube.com/watch?v=SLAmRChJrhw[/yt][/align]\n\n[align=center][img]http://i.imgur.com/DKzLqV9.png[/img][/align]\n\n[b][color=white]Snapshot 14w11b[/color][/b]\nSnapshot 14w11b was released last Thursday with the purpose of fixing crashes and bugs. This snapshot will be the last one for a little while since the Mojang staff is going to GDC. Some changes brought to this game include minecart mechanics, making furnace minecarts useful, and improved mob AI. All bug fixes and changes can be found at Mojang's official website, found [url=https://mojang.com/2014/03/minecraft-snapshot-14w11a/]here[/url].\n\n[b][color=white]Flying and more teased for Minecraft TU14 on Xbox 360 and PS3[/color][/b]\nThe next new title update for Minecraft will include new features and abilities for the Xbox 360 and Playstation 3 versions of the game. These features and abilities were found in a teaser image released by 4J Studios. These including the ability to kick, fly, turn, teleport, and the ability to become invisible. \n\n[b][color=#43a828]Hacker[/color][color=#9428a8]Craft[/color] [color=white]News[/color][/b]\nHackerCraft now has its own sub-forum for sales! You can sell the award, eco money, products, services, and items. It is located inside the sub-forum and anyone can post in it. This comes after [url=http://hackforums.net/member.php?action=profile&uid=1807099][color=#EFEFEF][b]FeaturedBmx[/b][/color][/url] suggested it on March 12, 2014.\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]SkyWars[/color][/b]\nLooking for a server with a skyblock? Looking for a server with PvP? This is the server you are looking for. The server features multiple maps, custom items, and a custom SkyWars plugin. This server is the largest standalone 1.7.4 SkyWars server, with the ability to hold 600 players with no lag at all. Join at SkyWars.com!\n\n[align=center][img]http://i.imgur.com/7zlNcBz.png[/img][/align]\n\n[b][color=white]MH370 Search Continues[/color][/b]\nMalaysia’s Defense Minister and acting Transport Minister, has found himself copping criticism from the world, as the search for the missing Malaysia Airlines MH370 enters the 12th day, producing frustratingly few results. The latest 'sighting', made from the Maldives, only adds to the confusion. Theories are being thrown around, and officials are urging the public not to partake in the spread of these rumors. So far, there have been claims of terrorism, sabotage by other countries, cockpit fires and maniacs being the reason for the missing passenger plane. Many have expressed their dismay at the international badgering taking place, claiming that the lack of international cooperation can only be detrimental to search efforts. The plane, which was headed to Beijing from Malaysia, vanished on the 8th of March, carrying 239 passengers and crew. Side note: Be careful what websites you are visiting, many cybercriminals have set up seemingly legitimate sites promising the latest news regarding the MH370, then stealing information from said users. \n\n[b][color=white]Oscar Pistorius Murder Trial[/color][/b]\nThe world watches as Oscar Pistorius defends himself in the courts of South Africa. The amputee sprinter is accused of murdering his girlfriend Reeva Steenkamp with three hollow-tipped bullets. On Tuesday, a police ballistics expert took the stand, explaining how the bullets were tracked with lasers. After saying that the 4 bullet holes were between 93.5 and 104.3 centimeters, he was cut off before his conclusion. With his prosthetic legs on, the runner's elbow height was roughly 96 centimeters. This contradicts his claim that he was not on his prosthetic legs at the time of the shooting. On the 13th of February, 2013, Pistorius shot his girlfriend Reeva Steenkamp, saying he \"mistakenly believed he was defending himself.\" In South Africa, premeditated murder carries a life sentence with a minimum of 25 years. If not found guilty of premeditated murder, Pistorius may receive a charge of culpable homicide, a crime based on negligence. \n\n[b][color=white]Suicide Bomber Takes 15[/color][/b]\nAt least 15 civilians were killed when a suicide bomber riding a rickshaw blew himself up near a market in Northern Afghanistan. No group has taken responsibility yet, but the area is teeming with Taliban and allied militant groups. The Taliban have already threatened to disrupt the presidential election, which takes place on April 5th, with violence. The suicide bomber had explosives hidden under the rickshaw, which were subsequently detonated near a checkpoint where cars were being searched. The casualties consisted mainly of vendors selling bread and shoppers. Deputy Governor Abdul Satar Barez has said that there are 15 dead, 46 injured, 27 of them injured. Many of the injured were women and children and employees of the nearby electrical department. Sad to say, this isn't the first or last time we'll hear about this. As the election draws closer, the amount of attacks will increase substantially. \n\n[b][color=white]Australian Parliament Members Calls for Indefinite Detention of Child Sex Offenders[/color][/b]\nAn Australian member of Parliament from the Sunshine Coast, Mal Brough, has called for indefinite prison sentences for child sex offenders, claiming predators like the man who murdered schoolboy Daniel Morcombe have lost their right to be free. Brent Peter Cowan was sentenced to a 20-year non-parole period in jail for murdering the 13 year old schoolboy in 2013. Cowan was released for previous child molestation charges. Cowan stated that \"Daniel Morcombe died because the judiciary failed him when a man like this did what he did.\" Hetty Johnston, leader of the child protection group Bravehearts, has her doubts, fearing it could push pedophiles underground. This raises several moral and ethical questions. Does the government really have the right to strip users completely of their freedom? Should child sex offenders have the same rights as the rest of us? Was this something inevitable? Leave a comment with your thoughts in the box below!\n\n[align=center][img]http://i.imgur.com/qIhVVNQ.png[/img][/align]\n\n[color=white][b]LG Lucid 3 Leaked[/b][/color]\nWell-known phone leak supplier [url=https://twitter.com/evleaks]@evleaks[/url] has revealed more about the LG Lucid 3. The image revealed shows both front and back shots of the phone itself, the front resembling Samsung phones, especially with its home button. It takes other characteristics from the Samsung Galaxy series, including the rounded corners, the placement of the speaker itself. The image doesn't give a lot, but it does include the carrier. The phone should be mid-range in price, and will hit Verizon sometime soon. You can find the image of the Lucid 3 [url=https://twitter.com/evleaks/status/444774198762672129/photo/1/large]here[/url].\n\n[color=white][b]Rick And Morty Posted On Instagram In 109 15-Second Clips[/b][/color]\nThe Adult Swim show Rick and Morty has been getting really popular recently, with its strange style. A lot of people want to watch the show as a result of this, but they may not have cable. Adult Swim has come up with a solution, by posting the most recent 22-minute episode. The episode is posted on the official Instagram @rickandmorty and has been posted in 109 segments. This could become a new way to watch shows you like if you cannot afford cable (or don't like watching from a TV), and so far the venture seems to be paying off for everyone.\n\n[color=white][b]Mozilla Stops Development Of Firefox For Windows 8[/b][/color]\nIf you remember, last month Mozilla had released a beta of Firefox on Windows 8, and development seemed to have been going well for the company. This all changes because as of this past week, they have officially cancelled the project. The reasons for the cancellation are cited as not having enough testers using the new interface to justify shipping a completed version. They were worried that the absence of feedback would result in a buggy build of the web browser. They haven't completely ruled out Windows 8 yet and may pick up development in the future.\n\n[color=white][b]Leaked Press Images Show Us Samsung ATIV SE[/b][/color]\nSamsung has a new smartphone supposedly coming out soon, the ATIV SE. This phone was passed through the FCC last month and this past week images were leaked of the actual completed phone. The phone itself resembles the ATIV S, which was windows-powered as well. The ATIV SE, much like a lot of phones coming out now, shares design elements of the Galaxy handsets as well, again with rounded edges. There is no date on when the ATIV SE will arrive at Verizon, but it is expected to drop sometime later this year with a 5-inch 1080p display. You can find the images of the ATIV SE [url=https://twitter.com/evleaks/status/445067536002863104/photo/1/large]here[/url].\n\n[align=center][img]http://i.imgur.com/5qRXOrG.png[/img][/align]\n\n[b][color=white]New Gene for Bipolar Disorder Discovered[/color][/b]\nWith the direction of scientists from the University of Bonn Hospital, the Central Institute of Mental Health of Mannheim, and the University of Basel Hospital, an international collaboration of researchers have discovered two new gene regions which are connected with the disorder. The study aims to identify and analyze how the genes work together to create such a disorder, a task that has proven to be difficult. Since no one gene has a significant effect on the disorder, it has been challenging to identify all of them; however, with the discovery of a new region, scientists are one step closer to discovering how this complex disorder affects the brain, and how they can cure it. Bipolar disorder involves stages of elevated mood to serious depression in matters of days. Approximately 10 percent of the population suffers from bipolar disorder and there is currently no known cure or treatment.\n\n[b][color=white]Decision-making Center of The Brain Identified[/color][/b]\nAlthough making simple decisions is a part of everyday life, little is known about what actually happens in the brain when such decisions are made. Professor of psychology James MacKillop at the University of Georgia wanted to find out how the brain weighs the pros and cons of drinking alcohol and in which part of the brain this function was taking place. The experiment asked the participants to either buy alcohol or save their money and not drink. When the decision to buy alcohol was made, several areas of the cerebral cortex activated. However, when the alcohol was no longer free, areas of the frontostriatal region activated, which is important for interplay between deliberation and reward value. The most brain activity came when the price of alcohol was increased and the least when it was free. These findings can significantly increase understanding of substance use disorders, and improvements to their treatment.\n\n[b][color=white]New Class of Antibiotics Discovered By Chemists[/color][/b]\nA new class of antibiotics to fight bacteria such as methicillin-resistant Staphylococcus aureus and other drug-resistant bacteria that threaten public health has been discovered by a team of chemists. The new class, called \"oxadiazoles\", was discovered in silico screening and has shown promise in the treatment of M.R.S.A. in mouse models of infection. M.R.S.A. has been a serious public health concern since the 1960's due to its natural resistance of antibiotics. More than 250,000 people in the United States are hospitalized due to M.R.S.A. and approximately 20,000 die each year. Not much has been said about how the new antibiotic works; however, it can penetrate the strong cell wall of M.R.S.A., which usually makes it so resistant to other types of drugs.\n\n[b][color=white]A New Simple Test For Cancer and Heart Disease[/color][/b]\nSimilar to a pregnancy test, a new test for the diseases has been designed at the Massachusetts Institute of Technology. First, a doctor gives the patient an injection. Later, the patient urinates on a special strip of paper. The paper will then change colors if a disease is present. Heart disease and cancer are two leading causes of death in the United States and other countries. With our current levels in technology and science, the diseases can be very difficult to diagnose. Due to this difficulty, diagnostics are usually late and treatment is not as effective. With this new cheap and effective test, people all over the world could test themselves and find the disease early, if it is present. This can prevent many deaths due to treatments being available for early stages of cancer and heart disease.\n\n[align=center][img]http://i.imgur.com/CeFKOBK.png[/img][/align]\n\n[color=white][b]Noah Banned in Middle East[/b][/color]\nNoah, an upcoming film depicting the story of religious prophet Noah, will not be shown in theaters in many Middle Eastern countries, because it could potentially offend viewers. Juma Al-Leem from UAE's National Media Centre commented on the decision to ban the film saying, \"There are scenes that contradict Islam and the Bible, so we decided not to show it.\" Admittedly, the film sparked controversy with many Christians in the U.S., causing Paramount Pictures to add a disclaimer to its marketing material saying that \"artistic license has been taken\" in telling the story. This is definitely not the first time a religious film has been banned in the Middle East. Passion of Christ, a film depicting the crucification of Jesus Christ, was also not shown in most cinemas in Israel and parts of the Gulf. This ban will certainly take a toll on the film's profits (pun intended). Catch this movie in theaters, in the United States that is, on March 28th.\n\n[color=white][b]Star Wars: Episode VII Casting[/b][/color]\nWith a saga like Star Wars, expanding through various generations and thirty years in the making, it's no surprise the leading roles of the next episodes are all the hype. Just recently a list of potential leading roles was leaked which included actors, John Boyega, Ed Speleers, Matthew James Thomas, and Ray Fisher starring as the young male protagonist. Yesterday (3/14/14), it was reported that Oscar winning, Lupita Nyong'o, has also taken at least one meeting with J.J. Abrams, the film's director and co-writer about playing a key part in the next chapter of the saga; a female role playing a descendant of Obi-Wan Kenobi. So far the only actor or actress guaranteed a part is Adam Driver, who will reportedly be playing the movie's villain. Although it is just speculation now, the movie has a release date of late 2015, so more news related to the topic will certainly be announced in the following months.\n\n[color=white][b]Hunger Games Walk-On Role Up for Charity[/b][/color]\nThe Hunger Games has received numerous accolades since the first release in 2012 and has even been placed as the most anticipated film of 2014 by Fandango. With two more films to be released (Mockingjay: Part I and II) before it all ends, the producers want to give back to the fans by hosting an auction to earn money for charity. Some auctions include a role as an extra in the film; a meet and greet with Jennifer Lawrence, Josh Hutcherson, Liam Hemsworth and other members of the cast; as well as a lunch with the cast and producers. These auctions are pricey, up to ten thousand dollars, but it is all being donated to the [url=http://sarcoma.com/]Kristen Ann Carr Fund[/url], which provides grants for cancer research and seeks to improve all aspects of cancer patient life.\n\n[align=center][img]http://i.imgur.com/eXQx0Yx.png[/img][/align]\n\n[color=white][b]2 Dead, 23 Injured At SXSW Outside Tyler, The Creator Show[/b][/color]\nPolice now have the driver in custody from this late-night incident. Two people were killed and 23 injured when a driver plowed his car into a crowd outside a Tyler, the Creator show at the SXSW Festival in Austin, Texas on Thursday. The Austin Police Department reported that five of the injured were in critical condition. The incident began shortly after midnight, when a motorist was stopped on suspicion of DUI and sped away from police, broke through a barricade and drove the wrong way down a one-way street crowded with festival attendees. When the car slammed into the crowd, it hit two people on a moped, who were instantly killed. Reuters reported that the driver also struck a taxi and a parked van before stopping his vehicle and attempting to escape on foot. \n\n[color=white][b]Tyler the Creator Arrested for Inciting Riot[/b][/color]\nWolf Haley was arrested on Saturday afternoon in an airport in Texas, for allegedly starting a riot at SXSW that caused injury to some. Check the video [url=http://www.tmz.com/videos/0_06uj67tb]here[/url], and read more about it [url=http://www.tmz.com/2014/03/15/tyler-the-creator-arrested-warrant-airport/]here[/url]. Check out Tyler's [url=http://ll-media.tmz.com/2014/03/15/0315-tyler-creator-mugshot-1.jpg]muggy[/url].\n\n[b][color=white]Albums and tracks to check out.[/color][/b]\nReal Estate have released their third album this week called [i]Atlas[/i] and Mac DeMarco's \"[url=https://soundcloud.com/capturedtracks/brother]Brother[/url]\" has been steadily climbing the indie charts. Lorde is featured on Son Lux's new track [i][url=http://www.youtube.com/watch?feature=player_embedded&v=3AlKUKxgg4U]Easy (Switch Screens)[/url][/i].\n\n[color=white][b]Lil B and Kevin Durant Beef[/b][/color]\nAnd so the beef continues. Last weekend, Lil B continued his long-running beef with Kevin Durant by releasing a new track called \"Fuck KD.\" He also put his now-infamous \"Based God's Curse\" back on Durant, which seemed to work wonders on Sunday afternoon when the Thunder inexplicably lost to the Lakers in Los Angeles. However, when KD was asked about Lil B on Tuesday of last week, he refused to acknowledge him. In fact, he even went as far as to say that had absolutely no idea who Lil B is; \"I don't know who that is. Who is that? He needs some attention, I guess. Whoever that is, he needs some help.\" Funny thing is, Durant tweeted [url=http://gyazo.com/566cabd8469686f7d0fe930c86756a86]this[/url] in 2011. So... I guess he does know who the Based God is.\n\n[color=white][b]SXSW 2014 Lineup[/b][/color]\nKanye and Jay Z recently performed, but who else is performing? A$AP Mob, Kendrick Lamar, Lil Wayne, Rick Ross, Nas, 50 Cent, Tyler, the Creator, Earl Sweatshirt, 2 Chainz, Future, Action Bronson, Childish Gambino, ScHoolboy Q, Gaga, Skrillex, We Were Promised Jetpacks, Clear Plastic Masks, Los Angeles duo Johnnyswim, Chance the Rapper, Ab Soul, and well... a lot [url=http://schedule.sxsw.com/?conference=music&lsort=name&day=ALL&event_type=showcase]more[/url].\n\n[color=white][b]Chris Brown Jailed[/b][/color]\nBreezy left rehab; and the deal was that if he did, he would be jailed. According to MTV, \"The judge in the Rihanna beating case ordered Chris to live in the Malibu rehab facility for 90 days to get anger management therapy, and he completed the stint earlier this month; however, at the last court hearing, the judge modified things and ordered Chris to stay in the facility while the Washington D.C. assault case ran its course.\" Brown was thrown out of rehab because he was caught having an inappropriate relationship with a female employee. He's being held currently in jail without bail.\n\n[i][color=white][b]Music of the Week:[/b][/color][/i]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=l_egDHn-TXg&feature=share&list=UUAxgvVWyrh2HvKlZNnhTFdA&index=7[/yt][/spoiler]\n\n[align=center][img]http://i.imgur.com/xKoxP9O.png[/img][/align]\n\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n-=-=-\nPerseverance. Sometimes if there's something you must do, you must give it your full attention and devotion. Nothing comes easily and what you put in defines what you get out. If there is risk, attempt to minimize it but do not let it set you astray with fear. Persevere.",
      "subject": "*"
    },
    {
      "pid": "38980640",
      "uid": "515249",
      "dateline": "1395199185",
      "message": "[align=center][img]http://i.imgur.com/xiFOC3t.png[/img][/align]\n\n\"What do you think of Respawn's Respawn?\"\n\n[i]\"I am never a fan of \"Gaming groups\" in any kind of \ncontext, but even moreso on Hackforums because many \ngaming groups fall down to people playing games and \ndemonstrating skill instead of as a group actually organising \nevents, creating servers or playing together. Aside from \ngaming clans or teams (which are a whole different subject), \nI've never seen a gaming group go as well as coding, design \nor marking groups because entire gaming groups is far too \nbig for it's potential uses; it's like something between a \nsmall organised clan/team and a larger, disorganised \ncommunity that have fun which doesn't work out.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1221375][i]-Ryuusei Cartwright[/i][/url]\n\n[align=right][i]\"It's a complete surprise to me ! It makes me \nwonder why the group went away in the first place but I'm \nactually pretty glad that it's back and that the owners are \nfeeling comfortable with the restoration of Respawn. This \nwill surely increase the (gaming) competition on HackForums \nand as long as it's all fun and games that is just fine by me. \nI really hope there won't be a hate war between gaming \ngroups and that they keep it civil although I have a feeling \nthat some people might take it too seriously. In any case, I \nhope they'll turn it into something great and I wish them \nall the luck in the world!\"\n[url=http://hackforums.net/member.php?action=profile&uid=1204034][i]-DeadLine[/i][/url][/align]\n\nThe topic for next week is \"How do you feel about Froggy's newfound reputation?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.imgur.com/N7zf1is.png[/IMG]\n\n[url=http://hackforums.net/private.php?action=send&uid=1775114&subject=gallerysubmission][img]http://puu.sh/7xdgS.png[/img][/url]\n[/align]\n\n[hr]\n\n[align=center][img]http://i.imgur.com/vfJtB5T.png[/img][/align]\n\n[align=center][spoiler=][img]http://i.imgur.com/AEu4TSu.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/v5afsvL.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://25.media.tumblr.com/6a33d398b3604848ac880b044ecd582d/tumblr_n2lpyrkTBJ1qhnegdo1_500.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/dF5wc6k.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/CX6vMXC.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://commonnerd.com/images/comics/68/6f7af42f8f5be9910cf9fc6d78dc82c02087813153.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.imgur.com/mvU7vPJ.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]'Maniac[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=891000]RDCA[/url]\n[list][*]Security News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1088934]Crypto™[/url]\n[list][*]Currency News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1093501]Roger Waters[/url]\n[list][*]Gaming News\n[*]Minecraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=944024]Neal Caffrey[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1171567]Chieftain[/url]\n[list][*]Scientific News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url]\n[list][*]Film News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=752389]eiqhtworks[/url]\n[list][*]Music News[/list][/list]\n[/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=797403]630[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1775114]Rinium[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=139340]Poseidon[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1172544]awhty[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=891000]Xerucide[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}