{
    "posts": [
        {
            "pid": "16487413",
            "uid": "515249",
            "dateline": "1318484167",
            "message": "[align=center][IMG]http://img713.imageshack.us/img713/5570/hfusernews5oct.png[/IMG][/align]\n\n[align=center][url=http://hackforumsnews.com][img]http://i1142.photobucket.com/albums/n610/HFNewsGFX/HfSite.png[/img][/url][/align]\n\n[align=center][img]http://goo.gl/9wMJo[/img][/align]\n\n[url=http://goo.gl/GT7Gk][color=#0066FF][b]S70N3R[/b][/color][/url] was kicked from The Alliance with a lot of other members, this came as a surprise as Stoner has been with the group for a long time.\n\n[url=http://goo.gl/vvfgv][color=#0066FF][b]PRIMAL RAGE[/b][/color][/url] asked Prominent to give someone a negative reputation, he was repfucked for reputation abuse.\n\n[url=http://goo.gl/gblIH][color=#0066FF][b]Burn Notice[/b][/color][/url] the repfuck was given for unknown reasons.\n\n[url=http://goo.gl/3fcaX][color=white][b]Genuine[/b][/color][/url]'s Eighteenth Birthday is on the Fourteenth! Happy Birthday! Speaking of Birthdays, Sir's HF Birthday seems to be on the Sixteenth! Be sure to congratulate Genuine and look for Sir's piece in the next main edition!\n\n[url=http://goo.gl/WV80F][color=black][b]Zitoku[/b][/color][/url] was repfucked and warned for reputation abuse. We don't know exactly what kind of reputation abuse he was doing.\n\n[url=http://hackforums.net/member.php?action=profile&uid=100071][color=black][b]cobija[/b][/color][/url] went on vacation for a month from the October Sixth to November Sixth. Hope you have a fun time!\n\n[url=http://goo.gl/E3rHv][color=black][b]Witness[/b][/color][/url]' account was stolen and his username changed it \"Just1n\" He also made a thread about it [url=http://goo.gl/OtJ0Z]here[/url].\n\n[url=http://goo.gl/LRFaj][color=black][b]Alabama[/b][/color][/url] was banned until the 16th with the reason being \"Take a break\" Lately Alabama hasn't been quite as interested in HF anymore, and decided that he didn't want to update his stickied thread anymore and asked Omniscient to remove his award. Thus, he needed to take a break.\n\n[align=center][img]http://goo.gl/6bjLl[/img][/align]\n\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Graphic Thread[/b][/i] - [url=http://goo.gl/1iUNr]Compilation - All helpful Graphic Tutorials! Constantly updated![/url] - [url=http://goo.gl/MeBdv][color=#0066FF][b]The Flying Dutchman[/b][/color][/url] - This thread holds a great compilation of the high quality and helpful tutorials for the GFX section.\n[i][b]Gaming Thread[/b][/i] - [url=http://goo.gl/D3e44]Most revolutionary game ever?[/url] - [url=http://goo.gl/7Bziu][color=white][b]Mr. Apple[/b][/color][/url] - Vote for the most revolutionary game, this thread has actually received quite a lot of attention. Go vote for the one you agree with!\n[i][b]Informative Thread[/b][/i] - [url=http://goo.gl/sTpcH]Suicide - Don't Waste Your Life[/url] - [url=http://goo.gl/HJ59H][color=white][b]Hуѕтєяιa X™[/b][/color][/url] - Hysteria wrote an inspiring thread on suicide prevention and how it really isn't worth it. Anyone and everyone looking for some guidance should read this thread.\n\n[color=#FFFFE0][size=large][b]SRPP Thread(s)[/b][/size][/color]\n[i][b]A Spin Debate[/b][/i] - [url=http://goo.gl/cpIZ7]Adolf Hitler The Great[/url] - [url=http://goo.gl/oy9jR][color=white][b]c00ldodo[/b][/color][/url] - This member puts an interesting spin on the person \"Adolf Hitler\" He brings up great points and backs them up quite well. An interesting read for anyone.\n[i][b]Most Interesting Topic[/b][/i] - [url=http://goo.gl/Y1dst]The Holy Bible is morally wrong.[/url] - [url=http://goo.gl/EVK3P][color=white][b]thought+inquiry=truth[/b][/color][/url] - While yes, this thread was written by a newer member, it was well detailed and explained. I guarantee this member will be able to put up a good debate.\n\n[color=#FFFFE0][size=large][b]Suggestion Thread(s)[/b][/size][/color]\n[b][i]Well-Thought Suggestion[/i][/b] - [url=http://goo.gl/QHo3Y]Replace the Forum Team and Group Memberships Link[/url] - [url=http://goo.gl/reEu6][color=#0066FF][b]Scooter[/b][/color][/url] - This member came up with a great suggestion to replace the Forum Team link on the footer with the Stafflist.php The suggestion was accepted by Omniscient.\n\n[color=#FFFFE0][size=large][b]Sales Thread(s)[/b][/size][/color]\n[i][size=xx-small]If you think your thread is worthy of being in the Sales  Thread area, send me a [url=http://goo.gl/dx0Sd][b]message[/b][/url][/size][/i]\n[i][b]Successful Thread[/b][/i] - [url=http://goo.gl/8NkRF]Gids Goldshop | Buy/Sell Rsgp | Sold 6b+ / Bought 4b+ | #1 Goldshop on HackForums[/url]  - [url=http://goo.gl/0br6U][color=#0066FF][b]Gids[/b][/color][/url] - Running one of the largest Goldshops on HF, Gids makes a large profit and has great service.\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Diabolic[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hello Diabolic and thank you for doing this interview. Now to start the interview off, would you like to make any shout outs?\n[b][color=#0066FF]Diabolic[/color]:[/b] Thanks for interviewing me and yes I'd like to give a big shoutout to Astonish, McFlurry and N3w_2_H@ck1n and all of Reverence especially iSeeDeadPixels and Cymraeg also Prominent and Simba haha.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you find hackforums?\n[b][color=#0066FF]Diabolic[/color]:[/b] I just stumbled across it while trying to find a big hacking forum to be apart of because when I first joined hackforums I was a black hat hacker and was very malicious and was into all kinds of illegal activity. Since being a member I have changed so much and my coding skills have improved massively!\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you become a reverence co-leader?\n[b][color=#0066FF]Diabolic[/color]:[/b] Well I have been a member of reverence for a while now and Astonish and I spoke about it for at least two months and then I got promoted to leader. It all came as a nice shock and I am loving be leader, I have been leader for almost three months now.\n\n[b][color=#0066FF]Reported[/color]:[/b] What's it like being a reverence co-leader and do you enjoy it?\n[b][color=#0066FF]Diabolic[/color]:[/b] I love it. I am the leader of the coders and an overall co-leader of reverence, I love getting to know all the members and welcoming the new ones. I especially love the MSN chat cause we get up to all kinds of things and sometimes when we do random skype calls between members it's pretty cool.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you have any special associates on hackforums that you call friends?\n[b][color=#0066FF]Diabolic[/color]:[/b] Yeah I'd class N3w_2_H@ck1n, Astonish is NJ, McFlurry, iSeeDeadPixels, Cymraeg, Simba, Prominent and XiX Eb0y XiX as my closest and there are loads more but can't name them all as, because I'd be here forever haha.\n\n[b][color=#0066FF]Reported[/color]:[/b] Are there any specific high quality members you'd like to thank for their contribution to reverence?\n[b][color=#0066FF]Diabolic[/color]:[/b] There are loads, I can't name them all as I'd be here forever but they're basically the members in the above question.\n\n[b][color=#0066FF]Reported[/color]:[/b] Are there any certain members you'd like to thank for their contribution to reverence?\n[b][color=#0066FF]Diabolic[/color]:[/b] I'd like to thank Prominent and Viral Dragon for the constant amazing tutorials they post in reverence and around hackforums I am sure you may have seen them.\n\n[b][color=#0066FF]Reported[/color]:[/b] How do you feel about alabama leaving reverence and being banned?\n[b][color=#0066FF]Diabolic[/color]:[/b] I was truly guttered as he was a great coder and I see that he has been recently banned. I don't know what to make of it to be honest, but I know the reason and that's good enough for me.\n\n[b][color=#0066FF]Reported[/color]:[/b] Will any members be receiving mentor or co-leader in the reverence group or are you thinking of promoting anyone?\n[b][color=#0066FF]Diabolic[/color]:[/b] There may be and there may not be this is all classified and I guess you'll have to all wait and see 🙂.\n\n[b][color=#0066FF]Reported[/color]:[/b] Is there anything you'd like to say to all of the hackforums members?\n[b][color=#0066FF]Diabolic[/color]:[/b] Without you guys I would not of stayed at hackforums so thanks for all the members that have made my journey amazing and continue to do so.\n\n[b][color=#0066FF]Reported[/color]:[/b] Alright now time to wrap this interview up... thank you for accepting this interview and is there anything you'd like to say before this is over?\n[b][color=#0066FF]Diabolic[/color]:[/b] Thanks a lot to the news team for giving me the chance to be interviewed especially you and Sir. Thanks a lot!!\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Astonish is NJ[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hello Astonish is NJ and thank you for accepting this interview. Now to start this interview off, would you like to make any shout outs?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] Yes, I would like to make a shoutout to N3w_2_H@Ck1n™, McFlurry, and Diabolic. You guys are the best leaders anyone can ask for. I would also like to shoutout to all Reverence members and all the VB.net section posters who make the section what it is today.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you find hackforums?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] Well it was one day I was on Xbox. I was in a party with my friend and we played Call of Duty together. We also played GameBattles together. When we use to play we use to play some people who would hit us off-line. So we knew we needed to know what they were doing to stay in the game. He searched up \"Hitting people off xbox\" and came across Hackforums. So he linked me to the site and I joined. We then bought Atomic booter and we were back in the game. I signed up in January but did not start posting to mid march.\n\n[b][color=#0066FF]Reported[/color]:[/b] What gave you the idea of the reverence group?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] I first was thinking of a group called \"The Coders\" but I found out that a group on HF in the past were called \"The Coders\" and they were deleted. So I knew that would not work and I thought what if we had two sections, one for coders and one for helpers. This was so the group would offer a better section of diversity.\n\n[b][color=#0066FF]Reported[/color]:[/b] Will you be coming out with any major updates for reverence? Such\nas new Mentors, Co-Leaders, Rules, etc.\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] Well I did just remove two leaders and added two more great knowledgeable leaders. For the future I can see all three of the leaders hanging in for a while. Mentors in Reverence are selected very rarely as we only need four. Rules are pretty much in stone. I will only add new rules as I see them fit.\n\n[b][color=#0066FF]Reported[/color]:[/b] What’s your opinion on the reputation reset?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] I think that there should be a reputation reset. Lately I've seen users that are abusing the reputation system. Members are taken the rep system the wrong way. So overall I can see a positive outcome if a rep reset took place.\n\n[b][color=#0066FF]Reported[/color]:[/b] What was your expression when you were invited to be a moderator?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b]  Excited.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you enjoy being a moderator and are there any cons from being a moderator?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] I really enjoy being moderator. I have so much fun as when I am on HF I have a job. Of course everything has Cons. Some cons consist of being flamed sometimes. When I close or Junk a thread sometimes the OP of the thread which was closed or Junked will PM me flaming me. But overall I love it.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you consider anyone on hackforums a good friend?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] To be honest not really. I feel I get on, do what I have to do and get off. I really do not have a \"best friend\" here. I am always talking to someone on Skype from HF and I would consider them my HF buddies but not my best friends.\n\n[b][color=#0066FF]Reported[/color]:[/b] What do you do when you’re off of hackforums?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] I’m really into Hockey. I play on a top team in New Jersey so that takes up a good portion of my time. I also am hanging out with friends or girls xD if not on HF.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you come up with your username “Astonish is NJ”? Do you live in New Jersey or something?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] Of course I live in New Jersey. I use to be Astonish on Xbox. Then I got sick and tired of just \"Astonish\" and changed my gamertag to \"Astonish is NJ\". When I came to HF I was just \"Astonish\" but once I bought Ub3r I quickly changed it to \"Astonish is NJ\" so I can represent where I live.\n\n[b][color=#0066FF]Reported[/color]:[/b] From when you joined hackforums to now, are there any changes that you like and dislike.\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] I do not dislike any of the changes Omniscient has made. I think they are all for the best. For example, I always say Omniscient knows what he is doing and everything he is doing is for the best interest in HF.\n\n[b][color=#0066FF]Reported[/color]:[/b] Alright now to wrap this interview up, thank you for doing this interview and is there anything you’d like to say before this ends?\n[b][color=#AAAAFF]Astonish is NJ[/color]:[/b] Thank you for giving me the chance for being Interviewed. I have one last thing to say, if you are a new member here on HF read the HF Help docs. They will take you a long way trust me. Peace out HF.\n[/spoiler]\n\n[align=center][img]http://goo.gl/zEtV9[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=nwt6lrcOdxs[/video][/align]\n\n[spoiler=[i]Written topics[/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Gids\n--Leadership\n---Wolves and Shinkirou demoted\n----Paradoxum promoted\n---itylernallen left\n---Peter Chao promoted Mentor\n--Awards\n---Quantum. (http://goo.gl/912yW) - Asskisser - Someone has to get it.\n---VeNoMz (http://goo.gl/pHIG0) - Master Donator - And the crowd goes wild...HOME RUN! Thanks. :)\n--Misc.\n---atthackers (_char)\nAtthackers one of the members of HF who came to HF to profit and make money decided to close this account, before asking \nto his account to be removed he changed his name to _char   Atthackers was the owner of many products that were\nsold here on HF, such as Attbooter a strong booter that lasted a few months, Attworm one of the best worms on the market\nthat eventualy the user WiFi. bought from him. And Aryan IRC Bot one of the best IRC bots that were on HF at the time.\nHe bought a group and could not pay off the rest so the group \"Informers\" got dismantled. Leaders of that group were\nValik and Atthackers and Qwazz ( qwazz for a short time). Its sad to see a good member go but it was his desisions.\n--Questions\n---\n[/spoiler]",
            "subject": "[10/12/11] - HF User News"
        }
    ]
}