{
  "posts": [
    {
      "pid": "38827889",
      "uid": "515249",
      "dateline": "1394514424",
      "message": "[align=center][IMG]http://i.imgur.com/VwAgunA.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#992828][b]185th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.imgur.com/TDDIvTi.png[/img][/align]\n\n[color=white][b]Interview Requests Live[/b][/color]\nAt long last, a medium to apply for an interview has been created. Head over [url=http://hackforums.net/showthread.php?tid=4110312]here[/url] for more information or to throw in an application.\n\n[color=white][b]The Respawn of Respawn[/b][/color] \nLed by [url=http://hackforums.net/member.php?action=profile&uid=657392][color=#EFEFEF][b]Astonish[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=1839274][color=#EFEFEF][b]Skitlz[/b][/color][/url], the usergroup Respawn has once again returned to the forum. With the return of Respawn, the group Innovation has been removed. Being a group focused on gaming, it will require potential members to be dedicated gamers. On the application form, there are multiple questions for each system, being PC, PlayStation, and Xbox. A few questions concerning experience with the game League of Legends are also included. The recruitment will accept new members as applications are posted, with the recruitment being closed on March 20th. Within the group, there will be multiple sectors members may join upon acceptance. The recruitment thread can be viewed [url=http://hackforums.net/showthread.php?tid=4104863]here[/url].\n\n[color=white][b]Viral Dragon's Second Campaign[/b][/color]\nHack Forums' very own [url=http://hackforums.net/member.php?action=profile&uid=23809][color=#00AAFF][b]Viral Dragon[/b][/color][/url] has not been having the best year. Since early 2013, he has begun having occasional seizures. After the continued reappearance of these seizures, it was decided to pay the hospital a visit in order to find out what was causing these disruptions, which turned out to be a lesion in his brain, as determined by the results of a CAT scan and an MRI. At a mere 1.3cm in size, it doesn't seem all that large, but his neurosurgeon still believes that it is the root cause of the seizures. Even though medication against the return of the seizures helps, they also have side effects, including severe irritation, affecting his culinary classes. Several other problems have also arisen over time, including light sensitivity and trouble concentrating. Viral Dragon has been a member of Hack Forums for over four years at this point, sharing his knowledge to others completely free of charge. Being a mentor, he is relentless in keeping Hack Forums a good place to be. Now the roles are reversed; Viral Dragon is the one who needs help. On the [url=http://igg.me/at/formattsmind/x/6004504]second Indie GoGo[/url] campaign started by his significant other, several ways of how members can help out are described, from sharing his story on social media to helping them diagnose the lesion and hopefully improving the quality of his life.\n\n[align=center][img]http://i.imgur.com/gIeGa1Z.png[/img][/align]\n\n[color=white][b]User News[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1495835][color=#00AAFF][b]Aurа[/b][/color][/url] has reached 1,000 reputation points.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=825700][color=#00AAFF][b]Staid[/b][/color][/url] has reached 1,000 reputation points.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=262695][color=#EFEFEF][b]Freddy Kruеger[/b][/color][/url] has reached 10,000 posts.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1264610][color=#EFEFEF][b]Greyhat.Infiltrator[/b][/color][/url] has reached 10,000 posts.\n[/list]\n[color=white][b]News Notables[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1585564][color=#EFEFEF][b]we33456y5[/b][/color][/url] snagged the [url=http://hackforums.net/showthread.php?tid=4097347&pid=38712663#pid38712663]first post[/url] of the 184th edition.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1084247][color=black][b]Mazzimo[/b][/color][/url] snagged the [url=http://hackforums.net/showthread.php?tid=4097347&pid=38725074#pid38725074]fiftieth post[/url] of the 184th HF News edition.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=40895][color=#00AAFF][b]DOOM![/b][/color][/url] snagged the [url=http://hackforums.net/showthread.php?tid=4097347&pid=38750679#pid38750679]one hundredth[/url] post of the 184th edition. Ha.\n[/list]\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1077919][color=#00AAFF][b]ZUEY[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=711588][color=#00AAFF][b]EvilMinD[/b][/color][/url] was repfucked.\n[/list]\n[color=white][b]Active Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1341017][color=black][b]Plaтiпuм[/b][/color][/url] was banned indefinitely as a precautionary measure.\n[/list]\n[color=white][b]Expired Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] None reported.\n[/list]\n[color=white][b]Vacations[/b][/color]\n[list][list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1213511][color=black][b]Onіx[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=802790][color=black][b]Xerif[/b][/color][/url] took a short vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1495835][color=#00AAFF][b]Aurа[/b][/color][/url] took a short vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1700066][color=black][b]Gаry[/b][/color][/url] took a short vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1430528][color=black][b]Xorex[/b][/color][/url] took a month vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1084247][color=black][b]Mazzimo[/b][/color][/url] took a short vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1055259][color=black][b]Gomba[/b][/color][/url] has taken a short vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1237824][color=black][b]The Man In Black[/b][/color][/url] took a two week vacation ban.\n[/list]\n[/list]\n[color=white][b]Closures[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1660764][color=#383838][b]Folds[/b][/color][/url] was closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=688479][color=#383838][b]Xylon[/b][/color][/url] was closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1043300][color=#383838][b]Fresh Prince[/b][/color][/url] was closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=2102397][color=#383838][b]The Prospect[/b][/color][/url] was closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1017442][color=#383838][b]Good Mood Dude[/b][/color][/url] was closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=83317][color=#383838][b]Automatic Coding[/b][/color][/url] was closed.\n[/list]\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1124063][color=#EFEFEF][b]BoomShot[/b][/color][/url] is a Rat Expert.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1763815][color=#00AAFF][b]syrah[/b][/color][/url] received the Qwazz Star.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1124063][color=#EFEFEF][b]BoomShot[/b][/color][/url] donated for Master Donator.\n\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1306528][color=#EFEFEF][b]xadamxk[/b][/color][/url] is February's Member of the Month. Well done, Adam!\n[/list]\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1839274][color=#EFEFEF][b]Skitlz[/b][/color][/url] is now a leader of Respawn.\n[*][url=http://hackforums.net/member.php?action=profile&uid=661940][color=#EFEFEF][b]bugga[/b][/color][/url] is now a leader of Infamous.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1342759][color=#EFEFEF][b]Pеter[/b][/color][/url] is now a leader of Complexity.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=797528][color=#EFEFEF][b]xflat[/b][/color][/url] is now a leader of The Brotherhood.\n[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of scheduled release date for the HF News edition.[/size][/align]\n\n[align=center][img]http://i.imgur.com/WEQZm4K.png[/img][/align]\n\n[url=http://hackforums.net/showthread.php?tid=4094990][b]Respawn is back[/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=657392][b]Astonish[/b][/url] - The [in]famous group is back and ready for action.\n\n[url=http://hackforums.net/showthread.php?tid=2751102][b]POST A PICTURE OF YOURSELF![/b][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1206954][b]Nickelodeon[/b][/url] - Though certainly not recently created, check out the now largest thread in The Lounge.\n\nWould you like your thread to be in the Notable Threads section? Have you seen a thread worthy of being mentioned here? Please report those threads [url=http://hackforums.net/showthread.php?tid=3673692]here[/url].\n\n[align=center][img]http://i.imgur.com/133fXLG.png[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=417076]Reset[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] Welcome to 185th edition of the HF News, today we're here with Reset. Any shout-outs you'd like to make before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] What an honor, sure here's a few people. 630, Vinnie, TheCause, AWHTY, and Sudsy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] Thanks for the shoutout! That's a pretty interesting mix of people. So tell us a little about yourself, how did you stumble across Hack Forums?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] A little about me, I'm a furry artist and my real name is Yano and I hail from Sweden. I originally found HF in 2009 while searching for a couple of new exploits and I really enjoyed the forum, unfortunately I lost access to my original account and it seems it either got merged and deleted so I made a new account called Reset since I was in the middle of resetting a password and needed a new username.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] That's an interesting story. I see you always have some pretty interesting furry artwork displayed on your profile, are you the artist of those?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] Unfortunately my current avatar isn't my work, I had to recently remove all my artwork from my profile which included a comic signature sliced up and animated to show scenes of my 3 most popular comics, but I'm relatively famous in the furry art world and it lead to some very disturbing and threatening confrontations with members and fans that overstep my privacy and I felt that I should remove it. My artwork generally revolves around gay furry comics and gay furry characters, but you occasionally see other pieces of art from me. Far as my fans know me to be, I'm a pretty kind and shy person that gets easily backed into a corner by rumors and because of this I needed to take a vacation from my work. Currently I draw using my other various aliases, but a person named Nathan seems to be stalking me constantly, even attempting to barge into my privacy and I'm forced to deal with him a lot so I haven't had much time to draw lately.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] Being famous in the furry world, can't say I envy you on that one. From what I've heard the furry community has some diehard fans. You were big into Hacker Craft, even a moderator member at one point in time, are you still playing Hacker Craft?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] I can't say I envy myself either, the fame was unwanted, but my fans seemed so kind at first and they slowly became vicious and unreasonably demanding as I started answering their questions one by one. I imagine any fandom has some diehard fans, but I can speak from experience and say that some of them are very diehard and even fit the stereotypes, but in their defense about the stereotype very little fit that, they're just extremely dedicated to the furry fandom. I suppose it's fair to say I was big into HackerCraft given my previous position, I played on the server for 3 weeks and immediately received the moderator position after a message from Omniscient asking if I would be interested. It was a very overwhelming responsibility at first as Omni scared the kittens out of me and failing him seemed like a very bad idea for me, but I quickly realized that a serious attitude isn't really needed and I quickly became a silly goofball moderator with the nickname Yoshi that everyone either hated or loved, but mostly loved. I don't mean to have an arrogant tone, but I think people really enjoyed my time spent as a moderator and I kept the place running like clockwork since my currently job allows me a lot of free time for hobbies and such, but after 6 months the headaches and troubles that came with it made me realize I needed a vacation. I stepped down from moderator position last month and I occasionally have regrets about it as I hear that the health of the server slowly started decreasing and it's hard for me to get on anymore and see how unresponsive staff are to the server anymore, I partially blame myself for stepping down, but I'm only human and can do only so much. Currently I rarely get on the server anymore, most of the original friends I had on there left and the 666 faction is still alive and well, but recent dramas and problems have made the server very mundane for me.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] Well I'm sorry to hear that you left Hacker Craft thinking less of the server, as a player I do miss your moderation. Outside of Hack Forums what do you like to do? Are there any particular hobbies or sports you participate in?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] Drawing is one of my constant hobbies, but I also enjoy sampling and brewing new and different types of tea leaves and flavors and I also enjoy 3D printing and I'm in the process of ordering a MakerBot Replicator 3D desktop printing machine so I can start printing out things like some of my favorite video game characters and possibly even some of my cast in the furry comics. I honestly have far too many hobbies to list and I'm constantly juggling them as the idea of boredom for me is a fate worst than death, but I also enjoy Basketball and Football (US Soccer) since you asked, even though I'm pretty bad at Football (US Soccer) and fairly decent at Basketball.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] Having a 3D printer sounds pretty fun, but expensive. What would you end up doing with the toys you make from it?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] I'll probably keep them honestly and maybe show them to friends and people that are interested, doubt I can sell the, but I'm fairly skilled in 3D modeling and I know that I could create almost anything I have in mind and I'm sure people will probably want to purchase some from me. I imagine that answer is going to make people laugh at me and feel disgusted that I would spend $3000 on personal entertainment like that, but money has very little personal value to me and if it's not used to entertain me somehow or benefit me I often leave it in my bank. I'm a rather strange one and I believe that boredom is the ultimate sin in life and that's why I don't mind buying something like that for a somewhat pointless reason, but those characters meant a lot to me as a child and it's worth the pretty penny to bring them into the real world for me so I don't mind.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] eah that sounds like a pretty big investment to me, but it's a hobby so I hope it works out for you. Do you have any Hack Forums related goals?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] Honestly no and maybe that's why I like Hack Forums, when the days almost all over and I get tired and my insomnia allows me to sleep finally, I usually take a break from my other hobbies and browse the forum looking at all the fun new post and boundless stupidity and entertainment that HF provides.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] The last question I've got for you today is what would you like to see changed or improved on Hack Forums.\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] I'd like for people to realize that groups are just groups and nothing more. It doesn't make you better than anybody else and it's not special to be in a group regardless of how exclusive it is, I find that people often try hiding who they really are in an attempt to impress people and they quickly realize how pathetic their attempts are. I would like peoples perspective on groups to change honestly, you're every bit HQ and cool as any other member regardless of your group status, don't be that fool that joins a group forcibly trying to agree with ideas of how things should be so you don't get kicked out, the groups that allow you to be yourself regardless of who you may be are the groups that you should join. I'm in Instinct and it's the only group I'm in, I understand by far that they're not seen as the most HQ envied group, but I'd rather be here with my friends while being myself than sitting in another group putting on a facade so I can stay in it, Instinct respects the ideas of being yourself and showing off a little group class, I wish that other groups could adopt this idea and I wish that people could see that their value or worth on this forum isn't affected by a shiny userbar, it's all about who you are that matters.\n\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#75EBB2][b]630:[/b][/color][/url] I couldn't agree with you more on the last statement. I just want to say thanks for letting me interview you Reset, do you have any final words for us?\n[url=http://hackforums.net/member.php?action=profile&uid=417076][color=#EFEFEF][b]Reset:[/b][/color][/url] Remember to be yourself and as Klonoa would say....WAHOO!!!!\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url][/font][/size]\n[spoiler=][b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color]  Welcome to this weeks edition of the HF News. How's it going man? How arr ya?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] Im doing great, just got back from a homies pad and made $100 today.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] No lie. Anyone that you'd like to give a shout out to before we begin?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] Sure, why not, shout out to AlreadyCoded, Tiszy, Cyph Jr, all my Instinct fam, Froggy (Saw your birthday alert on Skype), and anyone else that fucks with me.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Coolio. Tell us about yourself dude. What does thousands even do?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] I just browsed until about december and started Paypal holding and kind of managing a stresser, other than that i hang around the sellers section, gaming section, and currency exchange.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] How'd you like the stresser type of business? I tried making one with a bud ages ago. Didn't work out the way we planned. 😕\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] I myself hate the purpose of stressers, but they can turn into a total honeypot and rake in a ton of revenue. Sorry that you didn't get a chance to earn big bucks. 😝\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Do what ya gotta do to make money. Anyways. What made you sign up on the forum in the first place?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] II had a couple friends that would rat other members on Runescape to make money off items and gold, i never played Rs but i was still fascinated by the idea of ratting. I signed up last summer and made a lot of friends who knew there way around rat's and botnet's. I just fell out of it because i never really thought there was an easy way to make money from it. Other than that i changed from Blackhat to Greyhat when i started making steady profit from more legal methods.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Interesting. What do you do outside of all that? Off the internet. Are you currently employed?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] Not currently employed, currently attending Highschool and do a little computer repair work for this small community some relatives live in. Mostly virus removal and pc cleanup, I've been looking to check out the Whitehat and malware removal section one of these days.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] That's pretty neat, dude. Any thoughts about what you're going to be doing a few years from now?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] yeah thanks man, and I honestly have close to no idea. Maybe aim to become a stock broker, real estate agent, or start something of my own. who knows, check back in 10 years.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] True that. Anyways, what music are you into?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] Rap, I'm a total hip-hop head and like anything from old school to modern. Some favorites being MF DOOM, Schoolboy Q, 275, De La Soul, Drake, Kanye West, Chief Keef, and Joey Bada$$.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Speaking of SchoolBoyQ. What'd you think of his latest album? (Oxymoron) I thought it was Pretty different for his style -- not bad.\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] Its overall not that bad, some better than others but i truly think he took his time and is very talented.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Most def. What do you think of the site as a whole? Anything you'd change if you had the chance?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] I think the Hackforums community is hilarious and awesome, most people treat others very friendly and you can thrive in the marketplace. Other than little things here and there i would probably have admins look a little more into some scam reports and create consequences for those who are proven to scam.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Glad you're havin' a good time man. We've came to the end of our interview. Any closing statements?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=1852076]Thousands[/url]:[/b][/color] Thanks to you for the interview and the rest of the news team for there contribution to this forum. Have a good one everybody.\n[/spoiler]",
      "subject": "HF News - 185"
    },
    {
      "pid": "38827892",
      "uid": "515249",
      "dateline": "1394514441",
      "message": "[align=center][img]http://i.imgur.com/wVhIMs6.png[/img][/align]\n\n[color=white][b]Large Data Breach in South Korea[/b][/color]\nRecently in South Korea there has been news of an ongoing data breach which has lasted over a year. Hackers have stolen thousands of personal details from a South Korean telecom company. The data was then sold for well over $10 million USD. This data breach is only the most recent of hackings within South Korea, with a major one coming prior in January. Thus far, three men have been arrested and South Korea has shown they have no intentions of letting things like this go, even punishing credit card companies in the past. The data which was compromised is likely being used by telemarketers, so there may be a large influx of strange texts and calls for many people around the world.\n\n[color=white][b]Facebook Blocked from WhatsApp Data?[/b][/color]\nFacebook recently acquired a new shiny company, and more importantly set of data. With the constantly growing database of Facebook, this is a good change to obtain a true plethora of information; however, this has many security advocates reeling. The Electronic Privacy Information Center among other groups have filed a complaint to the Federal Trade Commission of the United States to try to block this blockbuster deal. Their claim reads as, \"We do not use your mobile phone number or other Personally Identifiable Information to send commercial or marketing messages without your consent or except as part of a specific program or feature for which you will have the ability to opt-in or opt-out.\" While this is just the basis of things, they are also pushing the idea of blocking the data obtained by WhatsApp. Their claim is based on the fact that previously WhatsApp did not collect data, and their hallmark of security was that they only saved messages for thirty days. Therefore, users could have not willingly given their data to Facebook. While this complaint is mainly trying to protect former data, anything from the time Facebook actually acquires WhatsApp and changes the TOS is theirs. Facebook is a company who willingly admits they collect, use, sell, and giveaway data. \n\n[color=white][b]Final Windows XP Update[/b][/color]\nYes, the time has come. Support for Windows XP is coming to an end, and the operating system will no longer be officially supported by Microsoft. On Tuesday, March 14 Microsoft rolled out their last ever update for Windows XP, or at least most versions. While the exact details of this patch are unknown, including whether or not they fixed some recent exploits. The exploit which has been getting a lot of talk lately, CVE-2014-0322, is what everyone is wandering if it has been fixed. Although, even if it hasn't Windows XP users aren't in grave danger, based on the image below thanks to TechNet:\n\n[spoiler=][img]http://sophosnews.files.wordpress.com/2014/03/iechart-500.png?w=499&h=203[/img][/spoiler]\n\nEither way, if users receive the updates their Internet Explorer should be automatically updated to the newest version possible. This is a practice Windows has been implementing in many of their recent updates. Either way, all 5 updates released should be installed by Windows XP users, as some of them were critical and others important. Keep yourself safe and update!\n\n[color=white][b]Tech Tip of the Week[/b][/color]\nMany people around the world are still using Windows XP. It is slowly becoming outdated and a major security risk. I strongly suggest anyone who has or know someone who has Windows XP to invest in a Windows 7 upgrade. If you see companies still using it with private data or things of that nature please be proactive in the security community and send them a letter telling them their security flaws.\n\n[align=center][img]http://i.imgur.com/RKmUG6A.png[/img][/align]\n\n[color=white][b]Bank of England Falls Under Scrutiny in Currency-Manipulation Scandal[/b][/color]\nThe governor of the Bank of England, Mark Carney, faces scrutiny in a scandal that claims that Bank of England officials knew that the foreign-exchange market was being rigged for the second time in as many years. This comes in light of an external review that released meeting minutes, suggesting that officials knew about the rigging for as long as eight years. This scandal marks a significant test of Carney's leadership abilities, as the Bank of England governor faces Parliament to confront the allegations, despite an internal review of the Bank of England suggesting that the staff had no involvement, albeit the Bank of England suspended an employee in relation to this matter. This news accompanies the United States' Securities and Exchange Commission (SEC) launching its own investigation into manipulation of the foreign-exchange markets by traders that spans across numerous banks, including Citigroup Inc. and Barclays Plc.\n\n[color=white][b]Hackers Claim to Have Released Mt. Gox Transaction Details, and CEO's Personal Details[/b][/color]\nFollowing Mt. Gox's filing for bankruptcy in early March, it has been subject to a myriad of attacks. The latest information from Mt. Gox comes from hackers, or possibly former employees of Mt. Gox, who claim to have managed to obtain records from Mt. Gox's own operational data, as retalliation against Mt. Gox, instead of allowing the Bitcoin community to get \"Goxed\" time and time again. It contains a myriad of data files showing that the exchange may still have nearly one million Bitcoins, as well as other damning data. However, this leak is also accompanied by two executable files. One for Mac, one for PC that are reportedly [url=http://www.reddit.com/r/Bitcoin/comments/200k30/the_tibannebackofficeexe_executable_is_wallet/]Bitcoin wallet stealing trojans[/url], not Mt. Gox's internal software as is suggested by the release itself. \n\n[color=white][b]The Hybrid Economy: A Marriage of Fiat and Bitcoin[/b][/color]\nBitcoin has had its fair share of detractors who will swear fiercely by fiat currencies. However, an op-ed published on Coindesk by Sean Neville suggests that a hybrid economy may be the way of the future for both Bitcoin and fiat currencies. Citing a demonstration by Alan Shapiro in which he analyzed the cost of exchanging $1,000 in USD for Euros for a merchant would cost approximately $50 by credit card, and $80 by bank wire. If the equivalent amount were exchanged at both ends, it would cost approximately $15 in fees, a fraction of what it would cost by traditional payment methods. Perhaps Bitcoin isn't here to replace fiat, but instead to turn it into fiat v2. You can see the entire op-ed by clicking [url=http://www.coindesk.com/forget-bitcoin-vs-fiat-welcome-hybrid-economy/]here[/url].\n\n[color=white][b]Spotify May Be Heading for an IPO[/b][/color]\nSpotify, the online music streaming service, has been negotiating nearly $200 million in additional credit with its banks. This has fueled speculation that Spotify may be heading for an IPO. The news comes following its acquisition of the algorithmic music analysis firm, The Echo Nest. This speculation is drawn from both Twitter and Facebook's behavior before their respective IPOs, also looking to extend their credit line, and even the acquisition of The Echo Nest is pouring more fuel on the speculative fires. Could Spotify be the next big tech IPO? Only time will tell.\n\n[align=center][img]http://i.imgur.com/TF7PsyM.png[/img][/align]\n\n[color=white][b]SCEA's President and CEO to Step Down, New Leadership for PlayStation America[/b][/color]\nWith his contract expiring later this month, Jack Tretton, the President and CEO of Sony Computer Entertainment America (SCEA) announced in a blog post on the company's website that he is stepping down. Tretton is going out on a high note, with the release of the company's record selling console, the Playstation 4, which has just reached the 6 million milestone within the last few weeks. During his nineteen years at the company, Tretton was involved with the development and establishment of many consoles and devices, including the Playstation 1, 2, 3, and 4 consoles, and the Playstation Portable and Vita.  Though his departure comes as a surprise for the company, they wasted no time to announce his successor, Shawn Layden. Layden was the EVP and COO of Sony Network Entertainment International. Tretton's contract is set to expire on March 31st, and Layden's contract will be put into effect on April 1st, 2014.\n\n[color=white][b]Xbox One March Update: A Preparation for Titanfall[/b][/color]\nAs Titanfall falls in a matter of days, Microsoft has released a big update. Fixes found in this update are improvements of the party system, matchmaking system, the friend's list, and the user interfaces associated with them. Shortly after the release of the Xbox One console in November 2013, Larry Hryb (Xbox Live's \"Major Nelson\") announced that there would be fixes to the console's major issues. Four months later, these fixes are finally released in this month's update. The update was released on March 4, 2014 in order to be out for consoles in time for the release of the highly anticipated game, Titanfall, which comes out on March 11. Here's a breakdown of the major features and improvements, detailed from the Xbox Wire: \n\n[list]\n[*][b]Get to your friends list faster.[/b] The friends list is now front and center on the homepage of the Friends app. Click the Social tile on Home, or say “Xbox, go to Friends” to see who’s online and what they're up to. From there you can quickly send messages and get into a party.\n[*][b]Party chat on by default. [/b]When you party up, chat audio is turned on by default.\n[*][b]Chat with friends playing different games.[/b] Party chat is now separated from people playing your game, so you can chat with your friends who are online or you can chat with everyone playing the game.\n[*][b]“Invite friends to game” option available in your multiplayer titles.[/b] Similar to Xbox 360 titles, when you're inside a game's menu you have a simpler and quicker way to set up your multiplayer battles. Selecting “Invite friends” lets you invite friends to your game and party.\nSee a list of “Recent Players.” This is a simple list that shows you Xbox Live members you've recently played with, making it easier to stay in touch with people, add new friends after your multiplayer sessions, or report a player for bad behavior.\n[*][b]Twitch live streaming support.[/b] The best broadcasting and spectating experience on any game console is on its way to Xbox One with the new Twitch app launching on March 11, just say “Xbox broadcast” to start sharing.  Xbox One is the only next-gen console that allows you to archive your Twitch broadcasts and view live Twitch streams regardless of their original source.\n[*][b]Dolby Digital sound.[/b] Optical out now supports 5.1 Dolby Digital, enabling devices such as sound bars and headsets with only optical in to be able to receive 5.1 Dolby Digital from Xbox One over optical. We're also adding support for Dolby Digital surround sound over HDMI. Now you'll be able to have the best sound quality no matter what speaker setup you are using.\n[*][b]Support for 50Hz output to Xbox One.[/b] You can set the live TV app to display at 50Hz for full or fill modes, fixing the frame rate issues some users in Europe have been experiencing while watching live TV on Xbox One.\n[/list]\n\n[color=white][b]Twitch Beats Pokemon[/b][/color]\nIt has been nearly 20 days since gamers have been introduced to a different spin on one of the world's most popular game series. The game, titled \"Twitch Plays Pokemon\", allows the viewers on Twitch to control what the character on the game does next, such as left or right, A or B. Naturally, the game was complete chaos with people spamming one button when people are spamming another button, but with newly implemented 'anarchy' and 'democracy' modes, the viewers were able to get progress done.  On Twitch's official blog, it was announced that 122 million commands were issued and there were 1,165,140 players in the 16 days it was up. With 'Pokemon Red' being complete, the stream has already moved on to playing 'Pokemon Crystal', and viewers are anticipating a whole new adventure.\n\n[color=white][b]Watch Dogs - Resolution Controversy and Release Date[/b][/color]\nUbisoft revealed a new trailer this week of the upcoming game, Watch Dogs. The trailer showed a newer build of the game from a next-gen console, though it appeared by many that there was nothing next-gen about it. They claimed that the appearance of the game seemed downgraded from previous trailers released by the company. A Public Relations and Event Manager commented on the accusations saying that nothing had been downgraded and that it looked \"incredible\". The trailer also revealed that the game was scheduled to launch on May 27 for PS4, Xbox One, Xbox 360 and PC. A Wii U release date has yet to be announced.\n\n[color=white][b]Release Dates for the Week of March 9, 2014:[/b][/color]\n[list]\n[*]Dark Souls II - PC, Play Station 3, Xbox 360 - March 11, 2014\n[*]Titanfall - PC, Xbox One - March 11, 2014\n[*]Towerfall - PC, Playstation 4, OUYA - March 11, 2014\n[*]Yoshi's New Island - Nintendo 3DS - March 14, 2014\n[/list]\n\n[align=center][img]http://i.imgur.com/DKzLqV9.png[/img][/align]\n\n[b][color=white]Snapshot 14w10a[/color][/b]\nSnapshot 14w10a has been released, which brings a slew of bug fixes, as well as some changes to the game itself for mapmakers. This snapshot doesn't seem to have anything for normal players, but without further ado, the bug fixes.\n\nQuite a few bug fixes in this snapshot have to do with texture problems, such as the door texture being inconsistent, and the cake texture being wrong as well. Other bug fixes include player arms not moving when watching someone mine or dig, block sounds being distorted, server scoreboard being bugged, and other command block bugs. On top of the bugs, there have been additions and changes for mapmakers, such a tweaks for some of the commands, overlapping item frames and painting, as well as adding a time since last death.\n\n[b][color=white]PS4 Release Date Coincides With 1.04 Update[/color][/b]\nThe development team of the console versions of Minecraft, 4J Studios, have given a bit more solid release date the PS4 release date of the game. They have said that the PS4 version will come out when the update 1.04 does, and while this isn't a specific release date, it is all we get for now. It seems like it will be like this for a while, since they are working on multiple versions of the game at the same time.\n\n[b][color=#43a828]Hacker[/color][color=#9428a8]Craft[/color] [color=white]News[/color][/b]\nHackerCraft has brought a whole new level of activity to the server with the addition of the new award. This award is, of course, the HackerCraft Purple award, which many players have earned already. In the coming weeks, expect to see the award given out a lot more with people selling and trading it, much like the original HC award.\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]GammaMC[/color][/b]\nGammaMC is a server that aims to give the best experience to their players. The servers themselves are equipped with high-end specifications as well as DDoS protection to guarantee 24/7 up-time. The server also has a variety of games to be played which include KitPvP, Skyblock, Prison and Factions. Connect today at GammaMC.net\n\n[align=center][img]http://i.imgur.com/7zlNcBz.png[/img][/align]\n\n(Due to confusion, the updated World News will be available soon.)\n\n[color=white][b]Venezuela Protests[/b][/color]\nVenezuela is a country with a population of almost 30 million located on the northern coast of South America. The country comprises a continental mainland and numerous islands in the Caribbean Sea. It borders Guyana to the east, Brazil to the south, and Colombia to the west. The government of Venezuela is a socialist government and has had multiple uprising since it's official labeling in 1999. Opposition leaders are taking a common \"regime-change\" strategy in which it's people start riots and then they put the blame on the oppressive government as the cause.  The latest official numbers have eight confirmed deaths of opposition protesters, but no evidence that these were a result of efforts by the government to crush dissent. At least two pro-government people have also been killed, and two people on motorcycles were killed (one beheaded) by wires allegedly set up by protesters. Eleven of the 55 people currently detained for alleged crimes during protests are security officers.\n\n[color=white][b]Crimea breaks ties with Ukraine[/b][/color]\nCrimea is a region that is typically considered the pro-Russian area of Ukraine, and just this week Russian soldiers have invaded the area to \"bring peace to the region.\" Ukraine has considered this a direct invasion to their country and has activated all military forces, causing extremely high tension in the area. On the fourth of March, 2014 Crimea has officially broken ties with Ukraine, and asked all soldiers to leave their bases and urges them to join sides with the new Crimean government. The money that has been supporting the new government is from unknown sources and the separation hearing will be held later this month.\n\n[color=white][b]Kim Jong-Un At It Again[/b][/color]\nThirty-three North Koreans face execution after being charged with attempting to overthrow the regime, the incident that led to this charge was them working closely with a missionary. They had received money to set up 500 underground churches, and they will be put to death at the State Security Department. Missionary Kim Jung-wook was arrested and jailed last year for allegedly trying to establish underground churches. Last week he held a press conference at which he apologized for committing \"anti-state\" crimes and appealed for his release from North Korean custody.\n\n[align=center][img]http://i.imgur.com/qIhVVNQ.png[/img][/align]\n\n[color=white][b]Chevrolet Adds Beats Music Streaming To In-Car System[/b][/color]\nBeats Music has officially opened up its API to developers, and Chevrolet has taken advantage of this. They have done so by integrating the music streaming service into their in-car app system. This could mean big things for this service, as well as the future of music in cars. While Chevrolet hasn't been the first to bring Beats Music into its cars, they likely won't be the last either. \n\n[color=white][b]Samsung Galaxy S5 Gets FCC Approval[/b][/color]\nAs most people know, the Samsung Galaxy S5 is dropping in April, and will supposedly be coming to the major carriers in the US. More details about this have surfaced recently, when a new set of FCC documents surfaced. These documents show a variant of the phone with AT&T-friendly LTE bands. The phone itself will also have GSM, GPRS, EDGE and UMTS, naturally. A lot of details are unavailable at this time, so we will just have to wait for April 11th when it drops.\n\n[color=white][b]HP Releases An 8-Inch Android Tablet[/b][/color]\nYou may have noticed HP trying to get in on the Android market by releasing low-cost devices with little to no buzz. This move is continued with their latest launch, which is a traditional 7.85-inch tablet, named HP 8. The device will cost you $170 and what you get in return is a relatively clean looking tablet that looks a lot like the Slate 7. The HP 8 has a worse resolution than the Slate 7, and it has fewer pixels spread out over a large screen. It is running a quad-core ARM chip and will ship with 1GB of RAM, 16GB of expandable storage, and Android 4.2.2.\n\n[color=white][b]London To Test Smart Crossing System[/b][/color]\nWhile pedestrian detection systems for cars are already in the works, London is going to try to keep folks even safer by installing a smart crossing system. This crossing system will use multiple cameras and sensors to detect when there are large crowds at a crosswalk, and will adjust the flow accordingly. These sensors will give people more time to cross the road while keeping things smooth. They are supposedly also going to be able to quickly change the lights after the pedestrians have safely crossed. While it is still in its early stages, they have already been testing it at two locations, and hopefully more will come soon.\n\n[align=center][img]http://i.imgur.com/5qRXOrG.png[/img][/align]\n\n[color=white][b]Early Treatment Is Found to Clear H.I.V. in Babies[/b][/color]\nA new aggressive drug treatment program has been shown to eradicate the life-threatening virus H.I.V. in newborn babies. The drug treatment was tested on two babies in the first 48 hours of life, and cured them of the virus without any additional medication following the procedure. Clinical trials are set to start in which 60 babies born infected will receive the aggressive drug treatment. If the drug treatment is found to be successful, over 250,000 new born babies can be treated and cured of the disease every year.\n\n[color=white][b]Bacterial Spores Offer a New Source of Renewable Energy[/b][/color]\nBacillus spores shrivel up in dry times and bloat with a blast of humidity. Biophysicists at Columbia University realized this could be translated into energy. The spores can be put onto a flat piece of rubber, roughly the size of a human hand, and when in dry conditions, the spores bend the rubber into a curve. Humid air would then be pushed against the spores, which would make them release. This continuous cycle can provide renewable energy and has created the first spore-powered generator.\n\n[color=white][b]N.A.S.A. Radar Demonstrates Ability to Foresee Sinkholes[/b][/color]\nNew analyses of N.A.S.A. radar data collected in 2012 indicate a huge sinkhole before it collapsed and caused the evacuation near Bayou Corne, La., last year. The findings suggest that if this data was to be collected regularly from airborne systems or satellites, it could foresee sinkholes before they collapse, decreasing danger to people and property. Sinkholes are depressions in the ground when the surface layers of the Earth collapse into caverns below. This data shows major ground deformations months before the sinkhole collapse. These deformations have previously been ignored as signs for sinkholes, but new data shows that they can precede sinkhole formations well in advance.\n\n[color=white][b]Nasal Filter Looks Promising For Allergy Sufferers[/b][/color]\nA nasal filter the size of a contact lens is able to block certain particles in the air, including pollen. A clinical study from Aarhus University concludes that this newly developed filter called 'Rhinix' appears to be significantly more effective against irritation and allergic reactions than a filterless placebo. Thus far, studies have also shown that Rhinix decreases nasal and throat irritation by upwards to 75%. A large-scale collaboration to test Rhinix is set to take place later this year. If Rhinix proves successful, it can help more than 500 million people worldwide suffering from pollen allergies.\n\n[align=center][img]http://i.imgur.com/CeFKOBK.png[/img][/align]\n\n[color=white][b]The Oscars - 86th Academy Awards[/b][/color]\nHosted by the lovely Ellen DeGeneres, The Oscars aired this week with quite a few surprise winners. 12 Years a Slave won best picture, which was shocking considering it went up against movies like American Hustle, Captain Phillips, Dallas Buyers Club, and Wolf of Wall Street; a full house of amazing films. Since the win, 12 Years a Slave surged in illegal downloads, according to TIME Magazine. Not just this, but Matthew McConaughey took home an Oscar for best actor in a leading role; an Oscar almost guaranteed to go to Leonardo DiCaprio for his performance in Wolf of Wall Street. McConaughey gave an extraordinary three minute speech thanking his dad and God, as well as calling himself his hero. To see the full list of Oscar winners, go [url=http://oscar.go.com/nominees]here[/url].\n\n[color=white][b]The Last of Us Hitting the Big Screen?[/b][/color]\nPopular PlayStation 3 video game, The Last of Us, will be getting movie treatment, Sony Pictures announced on Thursday (3/6/14). The game's creative director, Neil Druckmann, will be co-producing the film alongside Bruce Straley. The film will be produced by Sam Raimi's Ghost House Pictures Banner, and distributed by Screen Gems. This is exciting because Sam Raimi produced The Evil Dead, which is one of the most popular zombie films to date. For those unfamiliar with the plot of the video game, it is the story of Joel and Ellie's trek across America in a world overrun by a zombie outbreak. This is right up Raimi's alley, so we can expect big things from this film.\n\n[color=white][b]X-Men: Days of Future Past[/b][/color]\nYet another X-Men movie is scheduled for release this summer. This will be the eighth installment of the series since it all began in 2000. Fox Studios will be following up critically acclaimed X-Men: First Class with yet another highly regarded X-Men comic book story. As for casting, Hugh Jackman says it's inevitable he'll be recasted for Wolverine, as he's played the part seven times already. Jackman is, however, losing interest in the role which lands the inescapable question; how will Wolverine be put to an end? Perhaps a heroic death? Maybe a new actor casted entirely. Whatever the case, Fox shows no sign of stopping the stream of X-Men films they've been spewing out every other year or so. They've already made plans for two more after Days of Future Past. This film will be hitting theaters on May 23rd.\n\n[align=center][img]http://i.imgur.com/eXQx0Yx.png[/img][/align]\n\n[color=white][b]Michael Jackson's New Song \"Slave To The Rhythm\"[/b][/color]\nOn Thursday night (March 6th), a Timbaland-produced snippet of Michael Jackson's posthumous \"Slave to the Rhythm\" track leaked onto the internet. \"I have a lot of unreleased Michael Jackson,\" Tim told Revolt TV back in September. \"It would complete my legacy,\" he added about the impact this new album-would have on his career. Not an MJ fan myself, but I do like the funk-inspired beat with the blast of 808s. Listen to it [url=http://www.youtube.com/watch?v=gHCIDWOluDo][i]here[/i][/url]. Timbaland for some reason had removed the original song from his SoundCloud.\n\n[color=white][b]Coldplay's \"Ghost Stories\" Gets Help From Adele's Producer[/b][/color]\nIn a recent Q&A with fans, the band revealed that they worked with producer Paul Epworth on the album, who has spent the past decade behind the scenes on efforts like Adele's 21 and Florence and the Machine's Lungs. Mentioning the album as \"a collaborative effort,\" Coldplay went on to say that partners Jon Hopkins, Rik Simpson, and Dan Green were also involved in Ghost Stories, but added that bassist Guy Berryman \"did a lot of the production this time 'round.\" Ghost Stories offers nine tracks; it will arrive on May 19, and is currently available for pre-order on iTunes. Coldplay will also headline the opening night of the U.S. iTunes Festival at SXSW on March 11, with the performance streamed live and on-demand for free through the iTunes store. \n\n[color=white][b]Rapper Lil' Boosie Home from Prison[/b][/color]\nThat's right, Boosie is free and has just been released from prison (which kind of sucks for [url=http://cdnl.complex.com/mp/620/400/80/0/bb/1/ffffff/547748d94ba0505846d168b7b8f29a7e/images_/assets/CHANNEL_IMAGES/STYLE/2014/03/boosietat.jpg]this guy[/url]). Boosie has been released from Louisiana State Penitentiary, where he's been locked up since 2009 on drug charges. He was initially locked up for a marijuana charge in 2009, but during his stint in prison, he was busted attempting to smuggle drugs into prison. Following this, a judge added eight years to his original sentence.  He will be on parole until 2018. \n\n[color=white][b]Linkin Park's Surprise Release \"Guilty All The Same\"[/b][/color]\nA notable common trend among artists since Beyonce's surprise album release, where artists out of the blue with no warning release a single or album. The new track even involves a cameo from legendary rapper Rakim. Listen to this new release [url=http://www.audiomack.com/song/fistintheaircom/guilty-all-the-same-feat-rakim][i]here[/i][/url].\n\n[b][color=white]Music of the Week:[/color][/b]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=EQhzYuhtEvI&feature=share&list=LLvlJkDfgfG3J38pup6lvrPg[/yt][/spoiler]\n\n[align=center][img]http://i.imgur.com/xKoxP9O.png[/img][/align]\n\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n-=-=-\nI hope y'all can appreciate.\n\n-=-\n\nsmd fbn. \nUnrep was given complete authority over the creative process inside the Writers. \nHe was unable to decide on anything and make anything happen.\ngl.",
      "subject": "*"
    },
    {
      "pid": "38827921",
      "uid": "515249",
      "dateline": "1394514585",
      "message": "[align=center][img]http://i.imgur.com/xiFOC3t.png[/img][/align]\n\n\"How do you feel about the restrictions placed on SRPP?\"\n\n[i]\"I'm 100% certain that it will reduce the ammount of low \nquality posts and trolls in that sector but to be honest it's \nnot just the normal members who post Low Quality \ncomments/threads. L33T is a rank that everyone can buy, \nincluding the trolls. Lowering the symptoms does not cure \nthe disease. To some people it might even look like the \nforum is becoming more and more restricted and that they're \nbasically 'forced' into buying l33t if they want the true HF \nexperience but then again, I don't think Omniscient wanted \nthis section to be VIP-only. You can thank the bad apples for \nthat. They are the ones who force the administrators into \ndoing things like this and I will always fully support the \ndecisions of our staff. They are not just doing this for fun \nor because they want more money.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1204034][i]-DeadLine[/i][/url]\n\n[align=right][i]\"There were a few regular members that consistently \ntrolled the section with low quality replies, but some of the best \nusers on there were regular members as well. Even though the \nquality of the section will likely go up, it wasn't just the regular \nmembers who were trolling, or generally being low quality. I \nwon't name names, but certain l33ts and ub3rs lead discussion \nin the section with the aptitude of a drowning rat. As much as \nI appreciate the attempt to clean up the section, I am unsure \nhow much of a difference it will actually make.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1088934][i]-Crypto™[/i][/url][/align]\n\n[i]\"I think that Omniscient's decision came from a generalization \nabout regular members. Not all regular members are low quality \nusers seeking to make other people mad. Some regular members \ncame here to discuss interesting topics, and others just came to \nmake other people mad. I personally think that Omniscient also \ntook this decision due to the number of people complaining \nabout the conflicting beliefs of other users. One should not pay \nto be able to have a debate. Sure, there is going to be less trolls, \nbut at the price of loosing good, HQ debaters. Can't have \neverything in life.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1041189][i]-+Oblivious[/i][/url]\n\n[align=right][i]\"As massive of a F bomb of a surprise that SRPP became \nlower and lower quality with each troll whom had little or no \nvalue to the section arrived (either to avoid bans or just here \nto make that first troll thread), I can't help but think that those \nsame people would now move and continue their discussions/\narguments upon other sections as ramifications for Omni's \ndescision to lockdown SRPP to Upgraded members. This should \nwork out as anyone who wishes to post or make an opinion on \nSRPP must place their cash into HF as a risk and investment of \ndedication and careful behavior because who wants to pay ~20$ \njust to annoy someone on a forum? This should significantly \nimprove the quality, though I am unsure of the ramifications \nthat may occur due to this.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1221375][i]-Ryuusei Cartwright[/i][/url][/align]\n\nThe topic for next week is \"What do you think of Respawn's Respawn?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.imgur.com/N7zf1is.png[/IMG]\n\n[url=http://hackforums.net/private.php?action=send&uid=1775114&subject=gallerysubmission][img]http://puu.sh/7pOcI.png[/img][/url]\n[/align]\n\n[hr]\n\n[align=center][img]http://i.imgur.com/vfJtB5T.png[/img][/align]\n\n[align=center][spoiler=][img]http://i.imgur.com/uRXZDvs.gif[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/jtK6GCH.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/nqnKqQv.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://25.media.tumblr.com/bbf5a47fab4bd81e8da59a20bde64289/tumblr_n27ndtKZtX1qhnegdo1_500.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://24.media.tumblr.com/9f8c9c2f8e2ab45c242d096de8d860de/tumblr_n1ys90WIvj1rwkrdbo1_1280.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/mV4eUGh.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.imgur.com/mvU7vPJ.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=891000]RDCA[/url]\n[list][*]Security News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1088934]Crypto™[/url]\n[list][*]Currency News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1093501] Roger Waters[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1685553]glockbuster[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1171567]Chieftain[/url]\n[list][*]Scientific News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url]\n[list][*]Film News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=752389]eiqhtworks[/url]\n[list][*]Music News[/list][/list]\n[/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1653635]Clark[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=797403]630[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1775114]Rinium[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=139340]Poseidon[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1172544]awhty[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=891000]Xerucide[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}