{
  "posts": [
    {
      "pid": "33800129",
      "uid": "515249",
      "dateline": "1373257057",
      "message": "[align=center][IMG]http://i.minus.com/jKNmbtspH7Pil.png[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#E42217][b]150th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jbd50RvJc3HTdt.png[/img][/align]\r\n[color=white][b]Staff Changes to Hack Forums[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b]Genuine[/b][/url] has resigned from Staff for an unknown reason. Soon after his resignation, he was also granted the Diamond award for \"Your efforts on staff were excellent and you're a valued member of this community. Thank you.\" [url=http://hackforums.net/member.php?action=profile&uid=656453][color=#00FF00][b]Chris[/b][/color][/url] was also promoted to staff once again. This will be his second time on the Hack Forums staff team; welcome back, Chris!\r\n\n[color=white][b]Omniscient Says \"Thank You\"[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] says thank you to all Hack Forums members for being such great users lately. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] said, \"Gotta say thanks to the members for being so great these past few weeks. I appreciate many things about HF but members most of all. Thanks.\"\r\n\n[color=white][b]Happy Fourth of July to Hack Forums from the HF News Team[/b][/color]\r\nThe news team would like to wish you a late happy Fourth of July. In light of this day, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] had updated the Hack Forums logo on this date; the logo was surrounded by fireworks and traditional Fourth of July images. We hope all American members had a very safe and great Fourth of July!\r\n\n[color=white][b]New Hack Forums Defense System[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] announced on Twitter that he has been working all day and night on a new system which will optimize our DDoS protection. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] claims that DDoS attacks will not even be a factor once completed and operational, and up time will be maximized.\r\n\n[color=white][b]Hack Forums Enhancement Suite[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=956054][b]Emylbus[/b][/url] has developed and designed an enhancement suite for those that want to enjoy Hack Forums to the fullest. Read what Emylbus has to say about it:\r\n[i]\"[url=http://hackforums.net/showthread.php?tid=3603256]HF Enhancement Suite[/url] is designed to solve the frustrations many members have with Hack Forums. The site is great and Omni has done an amazing job, however there are many features and usability issues that deserve to have a solution. HFES attempts to solve this problem by providing users with numerous convenience tweaks (such as linking to a thread's last post in the Your Posts and Your Threads pages) and useful UI overhauls (for example the unique threaded PM system and Quick PMs) all while remaining customize-able so you can use what you want when you want.\r\n\nHFES was originally commissioned as a small series of userscripts by [url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white]xadamxk[/color][/url]. However, as more people found it helpful, more ideas and suggestions were turned into useful features. With the help of both the Empire and the Brotherhood, especially [url=http://hackforums.net/member.php?action=profile&uid=716331][color=white]Cryptic™[/color][/url], HFES has grown into the most advanced and exceptional free programs written exclusively for Hack Forums users.\"[/i]\r\n\n[align=center][img]http://i.minus.com/jbrPyz6ReCubi3.png[/img][/align]\r\n[color=white][b]User News[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=209490][b]Codevade[/b][/url] has hit 2,000 reputation points.\r\n[url=http://hackforums.net/member.php?action=profile&uid=787112][b]Saturday[/b][/url] has hit 1,000 reputation points.\r\n[url=http://hackforums.net/member.php?action=profile&uid=656453uid=209490][color=#00FF00][b]Chris[/b][/color][/url] has been promoted to Staff once again.\r\n\n[color=white][b]Repfucks[/b][/color]\r\n[list]\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=877949][color=black][b]Dunya[/b][/color][/url] was repfucked for Trolling.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=458300][color=black][b]Panda.[/b][/color][/url] was repfucked.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=316698][b]Anakin™[/b][/url] was repfucked.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1330504][color=#0066FF][b]S. Koda[/b][/color][/url] was repfucked.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=483854][color=black][b]мεяcү[/b][/color][/url] was repfucked.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1142191][color=black][b]JΑVΑ[/b][/color][/url] was repfucked.\r\n[/list]\r\n\n[color=white][b]Bans[/b][/color]\r\n[list]\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1539015][color=black][b]-๖ۣۜDivine-[/b][/color][/url] has taken a vacation ban.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=877949][color=black][b]Dunya[/b][/color][/url] was banned for Trolling.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=458300][color=black][b]Panda.[/b][/color][/url] was banned with the reason: \"Accounts Not Transferable\".\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1232842][color=#383838][b]#Skyline[/b][/color][/url] had their account closed.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1237824,][color=black][b]Perfect Cell[/b][/color][/url] was banned for posting a marketplace-style thread outside of the Marketplace.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=299885][color=black][b]Rantz[/b][/color][/url] was banned with the reason: \"Reviewing Account.\"\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=483854][color=black][b]мεяcү[/b][/color][/url] was banned with the reason: \"Accounts Not Transferable\".\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1142191][color=black][b]JΑVΑ[/b][/color][/url] was banned with the reason: \"Unacceptable\".\r\n[/list]\r\n\n[color=white][b]Awards[/b][/color]\r\n[list]\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1535763][color=#0066FF][b]The Don Killuminati[/b][/color][/url] donated for Master Donator, and was awarded Militant along with it.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1527033][b]Skypе[/b][/url] received the Sticky Man award for [url=http://hackforums.net/showthread.php?tid=3573133]this[/url] thread.\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=827711][b]D3xus[/b][/url] won the MOTM award.\r\n[/list]\r\n\n[color=white][b]Group Leadership Changes[/b][/color]\r\n[list]\r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1189774][b]Bandors[/b][/url] is now a leader of Void.\r\n[/list]\r\n\n[align=center][img]http://i.minus.com/jMSrdyQChTalc.png[/img][/align]\r\n\n[i][b]Giveaway Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3562711]FREE 3000+ Twitter followers for everybody [5k-10k followers coming soon][BACK!][/url] - [url=http://hackforums.net/member.php?action=profile&uid=138871][color=#0066FF][b]Layfon[/b][/color][/url] - This thread allows you to obtain a method to get mass amounts of free Twitter followers.\r\n\n[i][b]Hacking Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3595372]The Basics of Remote Administration Tools[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1472362][color=#0066FF][b]Prefix[/b][/color][/url] - A fantastic informational thread based around Remote Administration Tools.\r\n\n[i][b]Lounge Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3599477]Lol so a pretty famous CoD \"commentator\" Whiteboy7thst got hacked[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1848154][b]Dr. Penguin[/b][/url] - A thread discussing the hacking of Whiteboy7thst.\r\n \r\n\n[align=center][img]http://i.minus.com/jun9oZkuCHRrn.png[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=878647]Kosmos[/url][/font][/size]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] Hello there Kosmos, welcome to your interview for the 150th edition of the HF News. Anything you want to say before we start?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: Hmm, there's not much to say before the interview, but I'd like to give a few shoutouts. I see a lot of people doing this, so I may as well. Gotta love my brothers Pali, Hexicidal, 8B1T, Alea Iacta Est, Ethereal, AlbinoShadow, Soulmate, Phenomenal, Penar, Saged, Apathy, and Mahdy. I have left a few people out in order to keep this response short, but those of you who I left out, don't feel unloved.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] How did you find this forum? What were you looking for just before you joined?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: I used to play RuneScape and I did a terrible job on my own, so I wanted to figure out how to steal somebody elses account. Someone told me about the forum and I joined in hopes of finding ways to steal RuneScape accounts. Unfortunately, RuneScape discussion at the time was against the rules. I was bummed out, so I decided to stick around and troll, flame, and harass other members every so often. I had a few breaks when I was apart of HF for my first year. I'd come on and do the same thing for a month, then I'd leave and repeat the process. Only until recently have I started to take the forum seriously (October).\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] What do you enjoy doing on HF?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: I tend to stick to my group sub-forums. I love both of my families here on HF to death, and I'd do everything I possibly could for each of the brothers and sisters. When I'm not posting in the group sub-forums, I'm posting in the Science, Religion, Philosophy, and Politics section. A lot of the activity and posts on HF are dropping in quality, so I try my hardest to put up with it. The only things keeping me here are my groups.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] Which group is your favorite? What do you guys do in it? Answer without having to be kicked for sub-forum leaking 🙂.\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: I'd have to say Void. I have been here since Logic, the sale of Logic, and the rebirth of Logic in the name of Void. When almost nobody would notice my 'change' back in October, one person did. This person was Hexicidal. He is one of my closest friends and I don't know where I would be on HF today if it weren't for him. There's really not much to leak, as this has been said before, but our sub-forum is much like SRPP. There are no trolls and each debate is handled properly. I often feel like I'm dumb compared to most of these guys, but we're all just a big group of friends and family. Void, I love you to death.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] Do you have any goals to join any other groups in the future? Do you have any forum goals? Now is the place to share them since you can't do it in your profile 🤭.\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: I do not have that many goals on HF involving the forum. I do not care for post count, and I do not care for reputation. As far as groups go, there are not many that catch my eye. There are currently only two groups that I would be interested in joining and those are The Alliance and Infamous. I am not looking for a group to join just to be in a group. I find that these two groups have members who have a bond between eachother that is unsurprisingly beautiful.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] What do you dislike about Hack Forums?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: Honestly, nothing. Hack Forums would not be the way it is if it weren't for the current flaws and mayhem among each sub-forum and section. It may be hectic and annoying as fuck at times, but it's Hack Forums. What do you expect? A nice big family who loves eachother?\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] True. I'm loving your answers. Do you have any hobbies in real life?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: Hmm, that's a good question. I hardly ask myself that. I love bike riding, boating, and fishing the most. I'm not really into other sports. Too much work. I game quite often with friends and I go to my local community center to workout and swim.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] I swim too, do you go to competitions? As for gaming, what games do you play?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: No, I do not. I swim to relax and lounge around with friends. I don't play many games anymore since my old computer broke, but I play Xbox more than often. Some examples are Dead Space 3, Silent Hill: Downpour, Silent Hill: HD Collection, Metal Gear Solid: HD Collection, Battlefield 3, Call of Duty: Black Ops 2, Fallout 3, Fallout: New Vegas, and I'm a little bit into the Fable series.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][b][color=#9EE01B]Connected[/color][/b][/url] Thanks for participating Kosmos! Any final words?\r\n[url=http://hackforums.net/member.php?action=profile&uid=878647][b]Kosmos[/b][/url]: It's already over? Well, that was fun. I'd like to thank you for this interview. It has surprisingly been beneficial. I hardly ask myself these questions, so I also got to know myself a bit more. Critical thinking at work!\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url][/font][/size]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Hello HF new readers! For today's edition we will be interviewing the member [url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]. Before we begin, do you have any shoutouts you would like to make?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] Yeah, just a few to Cade, BagHead, and Dan.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] I'm sure they'll be extremely happy to hear the shoutouts from you! Now, to begin, how did you join Hack Forums in the first place?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] I used to be pretty active around gaming forums until a friend recommended that I checked out HF– so I did.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] And you've stayed here ever since! I for one am glad you've remained around the forums; it allowed me to have the opportunity to interview you! Anyway, what's your favourite section in Hack Forums, and why is it your favourite?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] My favorite section is none other than the SRPP section. There are interesting topics, debates, responses, and people. I try to stick around there as much as I can.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] The SRPP section is indeed a wonderful section! There sure are a lot of interesting debates going on all of the time, though you do sadly have to ignore all of the trolling that goes on there. Are there any improvements you would like to see implemented to make the section a better place for members such as yourself?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] Honestly, like you said, it all comes down to the trolls that ruin it. You can't go more than a thread anymore without seeing at least one person who thinks they're funny. The only way it can improve is the departure of said people, but we can do nothing more than just report their posts and move on.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Yeah, it's a shame that they do ruin it for a lot of poeple but I guess all we can do is report their posts and as previously mentioned, ignore them completely. Moving on, I hear you just joined the HF News team in order to replace our old journalist, BagHead. How did you go about joining the team?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] In all honesty, I was just interested in the position so I did no more than ask how I would go about getting it. BagHead is a good friend of mine and encouraged me to PM Sir regarding the position which only lead to Sir giving me a shot. I wrote him a piece, he liked it, and when I woke up I was a Writ3r.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] That must have been a nice surprise to wake up to, haha! Well, I'd like to take this moment to congratulate on joining the team and I can't wait to start reading your articles! Out of all the group's your a member of, which have you been a part of for the longest period of time? Which are you the most active in?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] In the groups that I'm in at the moment, Complexity is the one I first joined. Bugga is an insanely nice person and thought my application was good so recruited me to the group. Though I'm fairly active in all my groups, I'd have to say I post the much in The Empire. Just viewing my post activity, it seems like I do so a lot.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] The Empire is a really nice group, I myself was part of the group until today when I decided to leave due to my inactivity. Do you have any goals you would like to achieve on HF in the near future?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] Essentially, I had always wanted to be a Writ3r. I enjoy writing and I suppose that makes it a goal I had on HF. Of course, however, I'd definitely like to higher my posting activity and continue to make friends around the community.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Well, good luck with increasing your post activity! How about your real life; do you have any hobbies that you enjoy doing outside of HF which you would like to share with us today?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] I do enjoy working out. I like the way I look and only want to increase that feeling. Working out provides a \"me zone\", if you will, and really gets me in a good mood. Hanging out with friends is another thing I like to do, but only when I have money or a ride.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] Sounds like fun, haha! I too enjoy hanging out with friends... although I must admit working out is definitely not something for me, not because of my shape or anything but just because I don't enjoy it. I do run though so I guess that's something. Since you're a Minecraft player, what do you think of the new 1.6 update? Anythnig you particularly like/dislike?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] I definitely enjoy everything they've added in the update, however there are of course some faults. The new update is notoriously looked down-upon due to not only its FPS issues, but the fact that no one can use their previous mods or clients until updated for the new client. Though, all is made up for due to the horses– they're always fun.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#00BFFF][b]SkyGuy:[/b][/color][/url] The horses really are pretty awesome! I haven't updated yet.. but then again I don't really play Minecraft anymore. Anyway, before we wrap things up, do you have anything else you'd like to say?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1645227][color=white][b]Lovol:[/b][/color][/url] I'd just like to get across the point that I'm truly grateful to be a part of the Writ3rs and just as equally grateful of having the chance to be interviewed today.\r\n[/spoiler]",
      "subject": "[7/7/13] - HF News"
    },
    {
      "pid": "33800137",
      "uid": "515249",
      "dateline": "1373257088",
      "message": "[align=center][img]http://i.minus.com/j3DPVBZWZdb4x.png[/img][/align]\r\n[color=white][b]Halo 4 Champions Bundle Announced[/b][/color]\r\nThe annual Rooster Teeth expo is back! Halo has always been featured at the expo and this year, 343 Industries announced a new bundle for Halo 4. 343i said that they are not done supporting the Halo multiplayer experience and will be releasing a new bundle, called the Champions Bundle. You can either buy the bundle as a whole for 800 MSP or you can buy each item separately. \r\n\n[b]The Bullseye Pack includes[/b]\r\n[list]\r\n[*] Two new multiplayer maps - Pitfall and Vertigo. Yes, pitfall is a remake of The Pit from Halo 3.\r\n[*] Sports-themed Spartan armour.\r\n[*] New competitive gravball game type called Ricochet.\r\n[/list]\r\n[b]Infinity Armour Pack[/b]\r\n[list]\r\n[*] New armour.\r\n[/list]\r\n[b]Steel Skin Pack[/b]\r\n[list]\r\n[*] Steampunk style weapon skins.\r\n[/list]\r\n\nThe Champions Bundle and the separate packs will be available on August 20th via Xbox LIVE. You can view map screenshots on [url=http://www.trueachievements.com/n13888/new-halo-4-dlc-announced.htm]TrueAchievements.[/url] \r\n\n[align=center][video=youtube]http://www.youtube.com/watch?feature=player_embedded&v=uA0BdYA3wk4[/video][/align]\r\n\n[align=center][img]http://i.minus.com/jnu3IMOhyb7dH.png[/img][/align]\r\n[b][color=white]Minecraft News Returns[/color][/b]\r\nWith the departure of our much-beloved friend BagHead, the Minecraft news has drifted away-- but alas-- it returns with me, Lovol, as the new writer of the Minecraft news! With the release of 1.6, you've got plenty to read about this week-- so let's get started. \r\n\n[b][color=white]Minecraft 1.6 arrives![/color][/b]\r\nWith the release of Mojang's much anticipated Minecraft update, a new client also arrives. Despite their big release, Mojang presented Minecraft users with the option of still playing on the previous version of Minecraft-- 1.5.2. After having announced said release months prior to the actual event, many new features and items have also been put on the table for use. In addition to adding new blocks and items such as carpet (being the same colors available for wool), hardened clay, and coal blocks, there has also been an addition of the much-anticipated horses along with items that go along with them. Items prevail to name tags, leads, horse armor, and hay bales.\r\n\nHorses, sadly enough for previous servers, are found only in hills and plain biomes in 1.6-generated chunks. Though on the bright side, horses can also be spawned via eggs only obtainable via creative gametype. Their appearance will vary and you might even get a donkey, but you can definitely count on a four-legged creature that you can ride. Just like wolves and ocelots, horses can be just as well tamed-- just a bit differently. Horses are tamed at ease by a user repetedly getting kicked off of them (after having rid them, of course) until hearts appear. It can take anywhere from 3-5 tries, but surely it's worth it if you equip them with a saddle and are ready to ride. When right clicked holding a lead, horses can be mounted to a normal fence just so they don't wander off. Additionally, if you're tired of having just two horses, feel free to let them mate! That's right-- with at ease of an apple for each horse, they share their pixelated hearts and have a baby. \r\n\n[b][color=#ff3333]Fatal[/color][color=white]Craft and[/color] [color=deepskyblue]Planet[/color][color=white]Beacon merge![/color][/b]\r\nAfter running sister servers, [url=http://hackforums.net/member.php?action=profile&uid=1011113]Dan.[/url] and [url=http://hackforums.net/member.php?action=profile&uid=1239927]Fatal[/url] have finally decided to join forces. Introducing new administrators and helpers including Deid, Vallkiriml, Pepsiisgreat, Carter475, Hunter142, Ghasts, Cowboys2317, Diamond42HD, and EmuRider, the two servers' staff members merge forces and continue to keep the server (now as a whole) in-line. Donators of PlanetBeacon are encouraged to head over to FatalCraft and get their equally-valued rank just as FatalCraft members are encouraged to do the same on PlanetBeacon. With Fatal's now-obtained co-ownership, promises have been made regarding new features, mini-games, perks, and more! If you wish to continue to visit FatalCraft, a portal is now present in PlanetBeacon's hub titled \"OP Factions\" leading directly there. \r\n\n[b][color=deepskyblue]Planet[/color][color=white]Beacon News[/color][/b]\r\n[list]\r\n[*] The Matrix rank has been made available for pre-order for $180 anticipating its release and normal price of $200. In-game perks have not all been announced. \r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url] and [url=http://hackforums.net/member.php?action=profile&uid=1295820]Cade[/url] made an economy-dominating melon farm putting them at #1 on /baltop with over $130,000 IGM. \r\n[*] Name tags and hardened clay have been added to the shop. \r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1183390]Rage[/url] was made helper. \r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1262623]Sacred[/url] resigned from his helper position. \r\n[*] [url=http://hackforums.net/member.php?action=profile&uid=661940]Bugga[/url] was promoted from a helper to a moderator. \r\n[*] Donator kits have been re-introduced. \r\n[*] Administrator [url=http://hackforums.net/member.php?action=profile&uid=588904]Digitalconcept[/url] has hosted various PVP tournaments (both team and solo) rewarding winners with creeper heads. \r\n[/list]\r\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]Hypixel[/color][/b]\r\nHypixel is a very notoriously-known, 6,000-player slot mini game server that you can always count on having a ton (literally) of people on. Featuring mini games such as Paintball Warfare, Blitz Survival Games, Bow Spleef, The Walls, and Quakecraft, Hypixel still has plenty of room for adventure games if you want to build a house with your\r\nfriends. Lobbies fill up quickly, so if you want to be a part of the fun, head over to mc.hypixel.net today![/spoiler]\r\n\n[align=center][img]http://i.minus.com/jQ5EQ2ltjeK36.png[/img][/align]\r\n[color=white][b]Egypt’s President Morsi Ousted in Military Coup\r\n[/b][/color]Egyptian armed forces ousted Egypt’s first democratically elected president on Wednesday after being in power for only one year. The military put a temporary civilian government in place, while suspending the constitution and calling for new elections. Islamist President Mohammed Morsi denounced it as being a “full coup” by the military. After a televised announcement by the army chief, millions of anti-Morsi protesters in cities around the country erupted in joy and happiness, shouting “God is great” and “Long live Egypt”. Roughly 50 people have been killed in clashes since mass protests began against Morsi on Sunday. Street battles continue in the Nile Delta city of el-Sheikh and left at least 200 people injured. The military has deployed troops in Cairo and many other locations, many people have been killed and injured in protests on Friday, which continue to go on.\r\n\n[color=white][b]Paula Deen Cut from Food Network After Racial Slur Many Years Ago\r\n[/b][/color]Paula Deen, iconic Food Network star, has had her career taken from her after admission to using a racial slur some many years ago. Mrs. Deen was put on trial in May as part of a civil lawsuit filed last year by Lisa Jackson, a former manager of Uncle Bubba’s Seafood and Oyster House, which is co-owned by Deen and her brother, Bubba Hiers. Jackson claims to have heard Deen using a racial slur. When asked if she used a racial slur Deen replied with “Yes, of course.” However Deen also insisted that “it’s been a very long time”. This however did not matter to the companies that pay to use her name and image on their products and the Food Network. They were neither swayed by the apology video made by Paula.\r\n\n[color=white][b]Plane Crashed After Trying to Abort Landing\r\n[/b][/color]A Boeing 777 that crash-landed at San Francisco airport was “significantly below” its needed speed near the runway and the pilot attempted to abort the landing, US investigators say. The pilot of the Asiana Airlines flight from Seoul requested a “go around” 1.5 seconds before the crash. The plane, with 307 passengers, came down short of the runway on Saturday; the crash resulted in the death of two people and injured many people. The plane hit a sea wall which tore off the tail of the aircraft. Passengers fled the plane via emergency exits as the plane erupted in flames. At the news conference on Sunday the National Transport Safety Board chief Deborah Hersman said the aircraft speed was below the planned 137 knots as it approached the runway. Mr.Hersman also added that “everything is on the table” and “it is too early to rule anything out”.\r\n\n[align=center][img]http://i.minus.com/jbirdFfeOijxAv.png[/img][/align]\r\n[color=white][b]Apple ‘iWatch’[/b][/color]\r\nOn the 3rd of June, the technology giant Apple filed a trademark for the name iWatch in Japan.\r\nIt comes after a year of speculation that Apple will find a way to counter the soon-to-be released android product,  Google Glass. The Apple products (which have dropped slightly in sales over the last few months) are expected to be re-energized after Apple’s spokesperson and CEO Tim Cook stated, “Our teams are hard at work at some amazing new hardware, software, and services that we can't wait to introduce this fall and throughout 2014,” which may be a reference to this new product.\r\n[color=white][b]\r\nSolar Powered Plane[/b][/color]\r\nThe solar powered plane, dubbed the ‘Solar Impulse’, has completed its marathon flight across the United States of America, after more than half a day of continuous flying.\r\nThe plane has 12,000 solar cells directly built into the 63.4-meter (208 feet) long wingspan, which constantly charges a cell of Lithium batteries, removing the need to stop for fuel.\r\nThe Solar Impulse team is planning a flight to cross the globe in late 2015.\r\n\n[color=white][b]Bitcoin Prices Fall Below the $70 Mark[/b][/color]\r\nThe P2P crypto-currency known as Bitcoins have taken quite a hit over the past month, and even in the past seven days. One month ago, the price of Bitcoins were $113 for a single coin; now the price has dropped to just under $68. This has been very clear in the past week as well, with the price of Bitcoins falling from a high of $95 to its current price. This may be caused by the declining profit from mining Bitcoins, which may even tip the price below $50 in the near future.\r\n\n[align=center][img]http://i.minus.com/jsSqf056c30Ww.png[/img][/align]\r\n[color=white][b]Macklemore & Ryan Lewis Help MTV Celebrate Music Independence Day[/b][/color]\r\nThe duo Macklemore & Ryan Lewis have been selected to help out MTV with a huge project on July 4th, which is Independence Day for the United States of America. Considering Macklemore & Lewis are independent in their music (they're not signed to a label yet), this makes them the perfect choice as a role model for children watching the MTV's \"Music Independence Day Blow Out.\" It's a 12-hour celebration which includes music from various different well known artists, as well as superstars trying to make it big. It goes on from 6 a.m. to 6 p.m. At the end of the day, the host of the party, MTV, will celebrate with a block party which will include many different artists that fans love. This is including Macklemore and Ryan Lewis. Emerging from the spotlight, Macklemore stated, \"It comes down to building a fanbase yourself, and that takes time. People connected with us before MTV knew who we were, before XXL knew who we were. If the people mess with you, then over time the media has to come to you ... and then all of a sudden the floodgates open. But the work has already been done, it was something that happened organically, it was us building a fanbase that connected on a personal level with our music.\"\r\n\n[color=white][b]Jay-Z and Nas Bury Their Beef on MTV[/b][/color]\r\nJay-Z and Nas are considered \"gods\" in their art, which is rapping. The two have been going at it for at least four years. Also, these two guys simply don't like each other. Surprisingly enough, in 2005 both artists put their feud aside and Nas joined Jay onstage. As of now, Jay and Nas have finally put an end to their fighting and they've settled to an agreement of respect and peace. If the two can keep it up, they can put the past away to the side. Even back in 2005, it was a very big controversy. They were once joined together by a news reporter for the first time in almost a decade. They each had something to say to each other, \"This isn't, like, high school,\" Jay said. \"You don't sit down with people and be like 'So, we friends now?' That's just not a reality; but anything that's shrouded in respect can grow. ... It's one of those things, at the time you would never think would happen in life, and it's happening, so it was funny.\" \"First thing that happened is, we gave a pound and bust out laughing,\" Nas stated. \"[It was] like, look where we at right now.\"\r\n\n[color=white][b]Mac Miller Toasts his Indie Cred on Independence Day[/b][/color]\r\n\"Most Dope,\" rapper Mac Miller, can finally show of his \"cool\". He loves showing off his independence throughout his music. He's gotten lucky, being signed at a young age, working with the beautiful Ariana Grande, and even starring on his own TV show! He's recorded so many albums, and is the star of \"Mac Miller and the Most Dope Family\" on MTV2. He's dropped so many albums that so many fans appreciate, and he's growing each day. He just loves showing off his appreciation, and he adores his fans. Mac has even been selected to have his music appear on the July 4 Music Independence Day Blow Out, which is  a 12-hour celebration of music as stated above in the Macklemore article.\r\n\n[color=white][b]Music Video of the Week[/b][/color]\r\n[spoiler=]\r\n[video=youtube]http://www.youtube.com/watch?v=JO38UqURoEI[/video]\r\n[/spoiler]\r\n\n[align=center][img]http://i.minus.com/jj0OFp0aBuwTS.png[/img][/align]\r\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\r\n---\r\nI am in a bit of a hurry at the moment, for as soon as I post this edition, I will be off to bed--in starting my week-long canoe trip. I will be canoeing down portions of the Missouri River and will be gone from Monday morning until Saturday night. I hope you all enjoy this edition and give my Writers an easy time in my absence ;P",
      "subject": "*"
    },
    {
      "pid": "33800145",
      "uid": "515249",
      "dateline": "1373257123",
      "message": "[align=center][img]http://i.minus.com/jbyZ42NjdFe8OT.png[/img][/align]\n\n\"What do you think of the two most recent groups?\"\n\n[i]\"In just the past 2 weeks, 2 new groups have formed. I \npersonally think the 'Lannisters' will remain small for a few \nweeks, but then turn into something a little smaller then \nthe old group \"The Marketers\". It looks like a very High \nQuality group, although people would complain that its \nanother one of 'those groups', one that's now based on \nany topics, or 1 topic, and is just here to help. There is \nnothing wrong with that, but some people think all groups \nshould have multiple central ideas, (i.e White Hat Help, \nComputing, Beginner Hacking). Now on to 'The Brotherhood, \nthis group appeals to me personally more then the 'The \nLannisters'. These too groups are VERY similar, both \ncentered around 1 or no topics, so I wont do in depth \nexplaining it. One thing I want to point out is the colorful \nuser bars! Finally, no more all black and grey! Good luck \nto both groups!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1759389][i]-Tᴇɴᴀxɪᴜᴍ[/i][/url]\n\n[align=right][i]\"I think having groups on a forum is always \na good idea but I can't honestly say I agree with how \nmuch groups are changing on the forum every week there \nare at least 1 or two name changes or ownership changes, \nHopefully the two latest groups are here to stay.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=692131][i]-Winner[/i][/url][/align]\n\n[i]\"So far, I have no opinion towards them. Recently, groups \nhave been changing so frequently that investing in a new \ngroup is simply not worth it. I'm going to wait it out and see \nwhat each group has to offer, and only then will I judge. I'm \nsure recruitment for both will begin soon, hoping to see HQ \nmembers, and only HQ members get in. If the groups become \npay2win, I will be fairly disappointed.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1356625][i]-Nero[/i][/url]\n\nThe topic for next week is \"How was your Fourth of July? What did you do?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jt8zvcWASdwiA.png[/IMG][/align]\n[align=center][img]http://i.minus.com/i5habK29ZBOwM.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbgT0f4nbbOTe0.png[/img][/align]\n[align=center][spoiler=][img]http://www.explosm.net/db/files/thiscomicalwaysgoesdownsmooth.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://tinierthings.files.wordpress.com/2013/07/pea-problems-copy.jpg?w=584&h=829[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/KtfBBHz.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/hi3fcIB.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jlltcZhXLjBbZ.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=121196]Natha[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Music News[/list][/list][list][*][url=http://hackforums.net/member.php?action=profile&uid=469528]Odin the Wanderer[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=529870]+Pirate[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692131]Anima Libera[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1050193]Connected[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1121679]SkyGuy[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=763021]Retribute[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}