{
  "posts": [
    {
      "pid": "62871440",
      "uid": "2331053",
      "dateline": "1762789689",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/vyres-gray.png[/img]\r\n\r\n[b][size=xx-large][color=#ffffff][u]Hack Forum News - Edition 22[/u][/color][/size][/b]\r\n\r\n[b]Welcome back to the Hack Forum News. Where we keep you up to date on the weekly events and news happening on site and around the world. If you have never heard of the Hack Forum News, don't worry, we have you covered. We are a team of members from the Hack Forums community who are journalists and writers, and we are here to keep you in the loop of the changes around the site and the events happening around the world.[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/headlines-red.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6313364][color=#ffffff]Vacation[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\n[mention=1] has recently just come back from their vacation in Santa Barbara, California. They have shared with us their experience going there and have said that it wasn't too far from home and they would go again. He has also mentioned that this is his first vacation they have had in a little while and shared some lovely pictures of the place while he was away.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6312808][color=#ffffff]Octoberfest Winners[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nWe somehow missed this thread last week sadly, but it's still worth a mention this week as there have been a few massive winners announced on this thread since Octoberfest, and it appears that the $500 reward could still be up for grabs as it's not been claimed by the winner. If you haven't seen the winners, it's for sure worth checking out.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6299866][color=#ffffff]Hack Forums News Team - Become a Writer[/color][/url][/size][/b][/u] By [mention=2331053]\r\n\r\nAre you looking to join the HF news team? Do you enjoy making threads or even want to become a better writer? Well, we are looking for members of the site to help write each week and are looking for anyone who has any interest. We have a few new sections opening up right now, and we would love for you to see if they would be anything of interest to you. If you are interested, please check out the thread or contact Mix to discuss joining the team behind the HF News.\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/statistics-magenta.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[img=800x400]https://i.gyazo.com/f2845361d9a10e92c6bbf84da2f582ca.png[/img]\r\n\r\n[b]Last Week:[/b]\r\n[spoiler][img=800x400]https://i.gyazo.com/74affadcc69e708053e67cf55c2ee961.png[/img][/spoiler]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/awards-yellow.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n[color=#ffffff]\r\n[b]\r\n[mention=2112829] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=1349010] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=1250012] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=2302499] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=2838777] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=4225267] Has obtained the \"Lounge Head\" award - [award=105]\r\n[mention=3018464] Has obtained the \"Lounge Head\" award - [award=105]\r\n[/color][/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/notable.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6281322]What was the most outrageous lie you believed as a child?[/url][/color][/size][/b][/u] - [b]by [mention=1411092] [/b]\r\n\r\n[mention=1411092] has bought us another great thread talking about outrageous lies we all believed when we were young, and we have been reading through some of the replies and seen some pretty great responses. We all believed in silly things when we were much younger but some of the responses are crazy, and we had to add that to this week's edition.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6312591]Are you still using Windows 10 ?[/url][/color][/size][/b][/u] - [b]by [mention=5594002] [/b]\r\n\r\nAs Windows 10 support is coming to an end, the user known as [mention=5594002] has raised the question for those who still haven't updated to Windows 11 and to find out the reason why they haven't moved over just yet, even when support is pretty much ended.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6309389]How Has 2025 Been For You So Far?[/url][/color][/size][/b][/u] - [b]by [mention=666] [/b]\r\n\r\nAs the year is slowly coming to an end, each day goes by and feels shorter and shorter. [mention=666] has raised a good thread talking about how the year has treated everyone and shared how the year has treated them so far, with a few rough times but also a few good times as well.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310455]Do you use fidget toys[/url][/color][/size][/b][/u] - [b]by [mention=2017813] [/b]\r\n\r\nFidget toys. We all remember the peak of them with the fidget spinners a few years back. [mention=2017813] has created a thread talking about fidget toys as they were playing with their pen and thought they should buy one and ended up getting a fidget toy from Aliexpress. In the end, they have found they are being more productive now that they have bought a toy.\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/groups-yellow.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\r\n\r\n[b][u]GROUPS FOR SALE AND SOLD[/u][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6241882]Succubus group[/url] is still listed for sale by [mention=3604010]\r\n[url=https://hackforums.net/showthread.php?tid=6302394]Olympians group & Benevolence [/url] are still listed for sale by [mention=1342286]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6304410]Mystery Inc[/url] listed for sale by [mention=3909991]\r\n\r\n\r\n[B][u]RECENT GROUP CHANGES & EVENTS[/u][/B]\r\n\r\n[mention=2028907] has been removed as leader from Pink\r\n\r\n\r\n[b][size=large][u]RECRUITMENTS:[/u][/size][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6298855]Casino Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6226725]Pink LSZ Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6304113]Warriors Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6275486]Gamblers Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6294522]Legends Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6046141]Allegiance Buy-in[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6295130]Olympians leader recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6300585]The Academy Recruitment [/url]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/music-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\nRecently we introduced a brand-new section to the HF News. This section will grow over time to more things, but for now we are just going to be doing Song of the week. We are open to what more we could bring to the section from your suggestions, but as a start, we feel adding the song of the week will be a great start for the section and lead the way forward for more things in the future.\r\n\r\nNow we know some of you may question what the song of the week is all about, and we have thought of what a great answer. We feel like the song of the week should be a meaningful song that goes deeper than just general music and has meaning to it all. Granted, we may have a little fun with it sometimes. (Yes, we will have a Halloween version and Christmas version too.) But we want to keep it at a level where we have found the song has a true message behind it all and not just something that everyone will just see as another song that is just a bit catchy or got a good few beats to it. We hope this helps those with that question and if anyone has anything that they wish to ask, please feel free to add them below. We are more than happy to give the reason behind it.\r\n\r\nThis weeks Song Of The Week:\r\n[video=youtube]https://youtu.be/TW9RirTCbcM[/video]\r\n\r\n[b]Big thank you to [mention=481087] for this weeks submittion.[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/spec-ops.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=5550319]\r\n\r\n[size=large][b][u]Russian spies pack custom malware into hidden VMs on Windows machines[/u][/b][/size]\r\n\r\n[color=#39FF14]Bitdefender researchers attribute a campaign to the threat actor \"Curly COMrades\" that abuses Hyper-V on compromised Windows hosts to spin up a tiny, stealth Alpine Linux VM (≈120 MB disk, 256 MB RAM) hosting custom C++ implants (CurlyShell and CurlCat) built on libcurl. By disabling Hyper-V management and using the Default Switch network adapter, the attackers route VM traffic through the host stack so malicious C2 and proxy traffic appears to originate from legitimate host IPs, effectively evading host-based EDR. CurlyShell provides a cron-backed root-level reverse shell over HTTPS for persistence and remote command execution, while CurlCat implements an SSH reverse-proxy that tunnels SSH over HTTP payloads; supporting tooling includes PowerShell scripts for LSASS Kerberos ticket injection and GPO-deployed account creation for lateral movement. The technique highlights a growing trend of VM isolation as an EDR evasion vector and reinforces the need for defense-in-depth (hypervisor auditing, network telemetry, least-privilege, and cross-layer detection) to detect and disrupt such hidden-VM implants.[/color] [color=#00FFFF]Read More - https://www.theregister.com/2025/11/04/russian_spies_pack_custom_malware/ [/color]\r\n\r\n[size=large][b][u]Claude Desktop Extensions Vulnerable to Web-Based Prompt Injection[/u][/b][/size]\r\n\r\n[color=#39FF14]Security researchers at Koi Security uncovered critical vulnerabilities in three official Claude Desktop extensions that allowed prompt injection attacks via malicious web content. The flaws enabled arbitrary command execution on local systems due to the extensions’ elevated OS-level permissions and inadequate input sanitization. Although Anthropic has since patched the issues, the incident underscores a broader systemic risk in AI desktop agents—where integrations with full system access can be weaponized through crafted prompts or browser-based payloads, effectively bridging web-origin threats into local execution environments.[/color] [color=#00FFFF]Read More - https://www.infosecurity-magazine.com/news/claude-desktop-extensions-prompt/ [/color]\r\n\r\n[size=large][b][u]US gives local police a face-scanning app similar to one used by ICE agents[/u][/b][/size]\r\n\r\n[color=#39FF14]The Department of Homeland Security has quietly rolled out a mobile biometric app—reported as “Mobile Identify” and likened to ICE’s Mobile Fortify—that gives local law enforcement a field-capable facial-comparison and fingerprint-matching capability against federal immigration and biometric holdings; the app appeared on the Google Play store and is being distributed to agencies working under authorities such as Section 287(g). Technical concerns raised by reporters and civil-liberties researchers include lack of meaningful oversight or audit trails, the ability to capture and query biometric images in-the-field (with no practical opt-out), potential data-sharing with commercial or federal databases, and algorithmic bias/false-positive risks that can disproportionately affect marginalized groups — all of which materially increase the risk that routine encounters will be turned into remote biometric identification events without warrants or local policy safeguards.[/color] [color=#00FFFF]Read More - https://arstechnica.com/tech-policy/2025/11/us-gives-local-police-a-face-scanning-app-similar-to-one-used-by-ice-agents/ [/color]\r\n\r\n[size=large][b][u]Google warns of new AI-powered malware families deployed in the wild[/u][/b][/size]\r\n\r\n[color=#39FF14]Google’s Threat Intelligence Group (GTIG) has identified multiple new malware families that integrate large language models (LLMs) directly into their execution chains to enable adaptive, self-modifying behavior. One strain, PromptFlux, is a VBScript dropper that queries an embedded LLM API to continuously regenerate and obfuscate its payload code in real time, allowing polymorphic evolution and evasion of static detection. Another, QuietVault, is a JavaScript credential stealer that leverages AI-driven code synthesis to locate and exfiltrate developer tokens and secrets from local environments to dynamically created remote repositories. A third variant, PromptLock, is a Lua-based ransomware framework capable of cross-platform execution on Windows, macOS, and Linux, generating encryption logic on-demand from contextual AI prompts. GTIG also observed state-aligned threat actors weaponizing LLMs for reconnaissance, phishing lure automation, vulnerability scanning, and code obfuscation. Collectively, these findings signal a shift toward AI-assisted, modular malware ecosystems where real-time prompt generation replaces hardcoded logic, posing major challenges to traditional signature- and heuristic-based defenses.[/color] [color=#00FFFF]Read More - https://www.bleepingcomputer.com/news/security/google-warns-of-new-ai-powered-malware-families-deployed-in-the-wild/ [/color]\r\n\r\n[size=large][b][u]Hundreds of Malware-Laden Apps Downloaded 42 Million Times From Google Play[/u][/b][/size]\r\n\r\n[color=#39FF14]A recent report by Zscaler reveals that approximately 239 malicious Android apps on the Google Play Store were collectively downloaded over 41 million times in the one-year span between June 2024 and May 2025. These apps primarily delivered spyware and banking-trojan payloads and represent a 67% year-on-year increase in mobile-malware volume. Many of the threats bypassed normal protections and shifted tactics from card-fraud towards mobile-payment vectors, abusing social engineering (smishing, fake apps, SIM-swaps) combined with privilege escalations via accessibility APIs. The study underscores that malware authors are targeting the Android ecosystem with applications from legitimate stores, leveraging permission creep, sandbox-escape techniques and bank-app overlays — meaning defenders must monitor behavioral anomalies (unexplained data exfiltration, background active services, unusual permission usage) rather than rely solely on signature-based detection.[/color] [color=#00FFFF]Read More - https://www.infosecurity-magazine.com/news/apps-download-41-million-times/ [/color]\r\n\r\n[size=large][b][u]Attackers exploit critical bypass flaw in WordPress JobMonster theme[/u][/b][/size]\r\n\r\n[color=#39FF14]A critical authentication-bypass flaw in the JobMonster WordPress theme ([color=#FF4136]CVE‑2025‑5397[/color]) allowed attackers to bypass normal login mechanisms and gain administrative privileges. Exploitation provides full site control, enabling data exfiltration of sensitive user information such as resumes and recruiter details, content manipulation, and deployment of malicious job listings for phishing campaigns. The vulnerability resides in the theme’s authentication and social-login workflow, which fails to properly validate user sessions. Immediate mitigation includes updating to the patched version, disabling the social-login feature if updates are not possible, enforcing MFA on admin accounts, auditing access logs for unauthorized activity, rotating exposed credentials, and checking for injected content or rogue administrator accounts. Given JobMonster’s widespread use, compromised instances should be treated as high-risk breach candidates.[/color] [color=#00FFFF]Read More - https://www.scworld.com/news/attackers-exploit-critical-bypass-flaw-in-wordpress-jobmonster-theme/ [/color]\r\n\r\n[size=large][b][u]Apple Patches 19 Critical WebKit Vulnerabilities[/u][/b][/size]\r\n\r\n[color=#39FF14]Apple has released iOS 26.1 and macOS Tahoe 26.1 which address over 100 security issues across the platforms—most notably 19 critical vulnerabilities in the WebKit browser engine. Many of these WebKit flaws could allow a website to bypass same‑origin protections and exfiltrate data, crash or corrupt memory in processes, or monitor keystrokes. Beyond WebKit, the updates also patch kernel‑level memory corruptions, sandbox escapes, elevation of privilege and file tampering bugs in macOS, and a broad range of component flaws in iOS/iPadOS. None of the disclosed issues are publicly known to have been exploited in the wild, but due to their severity, administrators and users are strongly advised to apply the updates without delay.[/color] [color=#00FFFF]Read More - https://www.securityweek.com/apple-patches-19-webkit-vulnerabilities/ [/color]\r\n\r\n[size=large][b][u]DeFi Protocol Balancer Loses Over $120m in Cyber Heist[/u][/b][/size]\r\n\r\n[color=#39FF14]The Balancer protocol suffered a major exploit in its V2 composable stable‑pool architecture resulting in a loss of over US $120 million in crypto assets. Initial chain forensics indicate the attack targeted a rounding error or imbalance within the pool swap calculation logic, enabling the attacker to drain funds across multiple pools and chains including Ethereum and Polygon. The protocol’s internal authorization controls for the vault and batchSwap operations also appear to have been bypassed, enabling unauthorised fund transfers. On-chain data shows large volumes of tokens (e.g., wstETH, WETH, osETH) shifted to controlled exploiter addresses. The incident exposed that even heavily audited DeFi systems remain vulnerable to economic-logic and complex multi-transaction exploits, underscoring the need for continuous simulation, anomaly detection, and fast response mechanisms across smart-contract stacks.[/color] [color=#00FFFF]Read More - https://www.infosecurity-magazine.com/news/defi-protocol-balancer-loses-120m/ [/color]\r\n\r\n[size=large][b][u]Latest High Severity CVEs[/u][/b][/size]\r\n\r\n[color=#FF4136]CVE‑2025‑63601[/color] - [color=#39FF14]In Snipe‑IT versions prior to 8.3.3, an authenticated attacker can upload a malicious backup archive containing arbitrary files, which can then be used to execute system commands. This effectively enables remote code execution via the backup‑upload functionality.\r\n[/color]\r\n[color=#FF4136]CVE‑2025‑64164[/color] - [color=#39FF14]In DataEase versions ≤ 2.10.14, the JDBC connection logic fails to properly sanitize user‑provided input, resulting in a JNDI injection vulnerability that can be abused to trigger remote lookups, execute code, or steal credentials.[/color]\r\n\r\n[color=#FF4136]CVE‑2025‑64163[/color] - [color=#39FF14]In DataEase versions ≤ 2.10.14, insufficient protocol filtering allows dns:// URIs to bypass blacklists intended for ldap:// and ldaps://, producing a server‑side request forgery (SSRF) that can force access to internal network resources or metadata endpoints.[/color]\r\n\r\n[color=#FF4136]CVE‑2025‑64110[/color] - [color=#39FF14]In Cursor (code editor) versions ≤ 1.7.23, a logic flaw in the “.cursorignore” handling can be manipulated—via crafted project files or prompt injection—to read sensitive files that should be excluded, leading to potential data exposure and local code‑execution chains.[/color]\r\n\r\n[color=#FF4136]CVE‑2025‑64109[/color] - [color=#39FF14]In Cursor CLI Beta, a malicious MCP (Model Context Protocol) configuration hosted in a cloned repository can be executed when the project is opened, allowing arbitrary command execution on the developer’s machine due to unsafe loading of remote MCP servers.[/color]  \r\n\r\n[color=#FF4136]CVE‑2025‑64108[/color] - [color=#39FF14]In Cursor versions ≤ 1.7.44 on Windows, NTFS path-handling quirks (notably backslash handling) allow prompt-injection attackers to bypass protections and overwrite sensitive editor files, enabling remote code execution and integrity compromise.[/color]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/tech-brown.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=5465469]\r\n\r\n\r\n[u][b][size=large][color=#ffffff]Nagpur Municipal Corporation servers hit by over 2,000 hacking attempts in a single day[/color][/size][/b][/u]  \r\nNagpur’s civic IT systems faced more than 2,000 hacking attempts targeting its property tax and water billing portals. Officials say attempts originated from foreign IP addresses, but no data loss was reported.  \r\n[b][url=https://timesofindia.indiatimes.com/city/nagpur/cyberattack-storm-hits-nmc-over-2000-hacking-bids-on-servers-in-day/articleshow/125201764.cms]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Hackers team up with organized crime rings to hijack physical cargo shipments[/color][/size][/b][/u]  \r\nProofpoint researchers warn that cybercriminals are partnering with traditional crime rings to hijack shipments through phishing, social engineering, and manipulation of freight systems.  \r\n[b][url=https://www.tomshardware.com/tech-industry/cyber-security/cyber-firm-warns-hackers-are-teaming-up-with-crime-rings-to-hijack-cargo]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Iran-linked group Cyber Toufan leaks Australian defense vehicle schematics[/color][/size][/b][/u]  \r\nA pro-Hamas hacking group tied to Iran claims responsibility for breaching Elbit Systems, leaking designs for Australia’s $7 billion Redback infantry fighting vehicle project. Authorities are investigating possible espionage motives.  \r\n[b][url=https://www.theaustralian.com.au/nation/defence/plans-for-armys-7bn-infantry-fighting-vehicles-exposed-in-iranlinked-cyber-attack/news-story/84db7c24d42601234fb97fce623318b2]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]ESET report highlights surge in APT activity by Russia, China, Iran, and North Korea[/color][/size][/b][/u]  \r\nESET’s new Global APT Activity Report shows nation-state groups escalating espionage and disruption operations worldwide, particularly in energy, defense, and telecom sectors.  \r\n[b][url=https://www.helpnetsecurity.com/2025/11/06/global-apt-activity-report-2025/]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Cybercriminals exploit remote monitoring tools to steal digital cargo[/color][/size][/b][/u]  \r\nHackers are increasingly abusing remote access tools and supply-chain software in the logistics industry to reroute or steal valuable cargo, creating a new cyber-physical threat landscape.  \r\n[b][url=https://thehackernews.com/2025/11/cybercriminals-exploit-remote.html]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Industrial cybersecurity sector faces reckoning as ransomware surges 25%[/color][/size][/b][/u]  \r\nA new report finds ransomware incidents in the industrial sector surged 25% in October, with attacks targeting grain, energy, and manufacturing systems. Analysts say compliance must shift to real resilience.  \r\n[b][url=https://industrialcyber.co/features/industrial-cybersecurity-faces-its-reckoning-as-compliance-gives-way-to-accountability-and-resilience/]Source[/url][/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/contests.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6312860]$25 CRYPTO GIVEAWAY — YOUR CHOICE[/url] By [mention=5680404] [/color][/size][/b][/u]\r\n\r\n[mention=5680404] has started a giveaway that will end on the 25th of November this year and is giving away $25 of crypto of your liking to the winner. Go and see if you can get lucky and win some free crypto.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6312473]Win 5,000 Bytes! Easy Entry[/Url] by [mention=5699201] [/color][/size][/b][/u]\r\n\r\nAre you after some free bytes? Well [mention=5699201] has got you covered with their 5,000 bytes giveaway. As the title says, to enter is a very easy process and only takes a few seconds to get your chance to win.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6312859]100,000 Bytes Contest : $250 Value[/Url] by [mention=5418830] [/color][/size][/b][/u]\r\n\r\n100,000 bytes are up for grabs with [mention=5418830] giveaway. The giveaway ends on November 16, 2025, so not too far away and this could be a life changing amount of bytes to someone who may be in need. We hope you all the best of luck to whoever wins.\r\n\r\n[/align]",
      "subject": "Hack Forum News - Edition 22"
    },
    {
      "pid": "62871444",
      "uid": "2331053",
      "dateline": "1762789843",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/wor-magenta.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[u][b][size=large][color=#ffffff]Natural disaster in the Philippines[/color][/size][/b][/u]\n\nA powerful typhoon named Typhoon Fung‑wong struck the Philippines, prompting large-scale evacuations and significant damage. It’s a reminder of how vulnerable coastal communities remain to extreme weather events.\n\n[b][url=https://apnews.com/article/super-typhoon-fung-wong-storm-climate-photo-89347244edef215b27f6263e5204a734]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Saudi Arabia and Israel[/color][/size][/b][/u]\n\nDonald Trump has been promoting the idea that Saudi Arabia might normalise relations with Israel, but Riyadh says such a step depends on a roadmap to a Palestinian state. This illustrates the complexity of Middle-East diplomacy: major moves depend on broader political conditions.\n\n[b][url=https://www.reuters.com/world/middle-east/before-talks-with-trump-saudi-arabia-doubles-down-terms-israel-ties-2025-11-09]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]New leadership in Bolivia amid economic crisis[/color][/size][/b][/u]\n\nRodrigo Paz has been sworn in as the president of Bolivia, promising “capitalism for all” as the country faces its worst economic crisis in decades (inflation, fuel & dollars shortage).\n\n[b][url=https://www.aljazeera.com/news/2025/11/8/paz-sworn-in-as-bolivias-president-promises-capitalism-for-all]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Global climate summit in Brazil[/color][/size][/b][/u]\n\nThe COP30 climate talks are underway in Belem, Brazil — located near the Amazon rainforest. Leaders, activists and scientists are meeting amid growing recognition that the 1.5 °C global warming target may now be out of reach.\n\n[b][url=https://apnews.com/article/united-nations-climate-talks-cop30-belem-brazil-db51b818a4579f49da1c1161927f06c2]Source[/url][/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/comics-magenta.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=1871421]\n\n[b][size=x-large][color=#ffffff]-1-[/color][/size][/b]\n[spoiler][img=600x600]https://i.imgur.com/RYS7qy6.png[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-2-[/color][/size][/b]\n[spoiler][img=600x600]https://i.imgur.com/5y8zcXu.png[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-3-[/color][/size][/b]\n[spoiler][img=600x600]https://i.imgur.com/yofpuGD.jpeg[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-4-[/color][/size][/b]\n[spoiler][img=600x600]https://i.imgur.com/45Bz512.png[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-5-[/color][/size][/b]\n[spoiler][img=600x600]https://i.imgur.com/NDAE66Q.png[/img][/spoiler]\n\n[hr]\n\n[b][size=x-large]A big thank you to all the members who put in the hard workto bring us another edition of HF News this week[/size][/b]\n\n[size=x-large] [mention=2331053] [mention=57618] [mention=3929084] [mention=5550319] [mention=5655318] [mention=5465469] [mention=1871421] [/size]\n\n[hr]\n\n[b][size=xx-large][u]Support The Team by wearing our signatures[/u][/size][/b]\n\nIf you have enjoyed the read please consider using one of our signatures in any way to support us!\n\n[img]https://hackforums.net/images/hfnews/support-red.png[/img] [img]https://hackforums.net/images/hfnews/support-gray.png[/img]\n[img]https://hackforums.net/images/hfnews/support-magenta.png[/img] [img]https://hackforums.net/images/hfnews/support-brown.png[/img]\n[img]https://hackforums.net/images/hfnews/support-magenta-2.png[/img]\n\n[b][size=xx-large][color=#E82A1F]Red[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-red.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#0074D9]Blue[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-gray.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#2ECC40]Green[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-magenta.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#E86E04]Orange[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-brown.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#B10DC9]Purple[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-magenta-2.png[/img][/url][/align][/code]\n\n\n\n\n\n\n\n\n\n[/align]",
      "subject": "RE: Hack Forum News - Edition 22"
    }
  ]
}