{
  "posts": [
    {
      "pid": "16406045",
      "uid": "515249",
      "dateline": "1318217842",
      "message": "[align=center][img]http://goo.gl/CXkuT[/img][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]62nd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. Cobalt+ will be returning by the next edition.\n\n[align=center][url=http://hackforumsnews.com][size=large][b]Hack Forums News Website[/b][/size][/url]\n^Click the link to be redirected to www.HackForumsNews.com^\nJust in case you didn't see the User News, I would like to introduce you to our new website!\nThis is a joint venture between Cobalt+, .edit, and I. \nWe hope you enjoy!\n[/align]\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\nWe have quite a bit to start out with today, so lets get started. The Crew General Discussions forum has now been merged with the regular group recruitment forum. This section is now called, \"Group and Crew General Discussions.\" It's loacted under the [url=http://goo.gl/9sVOy] Crews and Clans Private Forums[/url] tab, then click on [url=http://goo.gl/spmhC]Group and Crew General Discussions[/url]. You can now ask and participate in group discussions within the forum.\n\nOne major change for the new [url=http://goo.gl/spmhC]Group and Crew General Discussions[/url] is that you are now forbidden from donation begging. This essentially means that if you are planning on creating a new user group, you can no longer advertise for donations. This was thought up because a user supposedly took a bunch of money and ran with it. So, given the potential for scammers to gather money quick and go, donation begging is no longer allowed in the [url=http://goo.gl/spmhC]Group and Crew General Discussions[/url]. This includes the posting of [$1000/$2000].\n\nWhile we realize this was a while ago, it was not in the last edition. Thus, we felt it would be good to add in this edition. The newest group, 'Haunter Gang' has been suspended. All of the leaders and members have been removed from the group due to the fact that it is suspended. We have found the main cause as to why the group 'Haunter Gang' was suspended along with the leader, [url=http://goo.gl/veb4E][color=#696969][b]Time Asshole[/b][/color][/url] whose account was closed. [url=http://goo.gl/veb4E][color=#696969][b]Time Asshole[/b][/color][/url] had supposedly disputed the money he sent [url=http://goo.gl/q9Qcg][color=#00BFFF][b]Omniscient[/b][/color][/url]. Therefore the group is now suspended until the payment is returned.\n\nA new [url=http://goo.gl/q9Xlg]Which Group To Remove Next[/url] thread was published. The end results came out to be,\n\n[b][color=white]The Alliance:[/color][/b] 45 [i]|[/i] 7.59%\n[b][color=#9370DB]Black Knights:[/color][/b] 76 [i]|[/i] 12.82%\n[b][color=#87CEFA]Graphics Masters:[/color][/b] 46 [i]|[/i] 7.76%\n[b][color=#32CD32]The RATs Crew:[/color][/b] 306 [i]|[/i] 51.60%\n[b]None:[/b] 120 [i]|[/i] 20.24%\n\nSo far nothing has happened to the RATs Crew, the group still stands as is. Then WiFi. made a thread concerned about the choices people made against the Rats Crew, for anyone interested, read it [url=http://hackforums.net/showthread.php?tid=1794844]here[/url].\n\n[align=center][img]http://goo.gl/ZveLN[/img][/align]\n\n\"What do you think of the Reputation Reset?\"\n\n[i]\"My personal opinion is, that its not necessary, since users can't simply benefit from it. Its \nlike giving a free pass to everyone with bad rep, not only that, but also giving scammers \na \"free pass\"... I would of understood Omniscient's decision if we - the users benefit \nfrom it, but no - they don't. Pretty sure at least 60% of HF's users will start crying about \nreps. There will be a sh*t load of \"Free XXXX [Ub3r]\" threads & etc, since we all know, \nthat HF has a large base of reputation whores.\"[/i]\n[url=http://goo.gl/MO96h][i]-Mario1[/i][/url]\n[align=right]\n[i]\"I think it's good and bad, like the good thing is it gives everyone a fresh start, like \neveryone is like the same no one is better than anyone else because they have more \nrep, but I also think it's fucking retarded due to the fact that, a lot of the members \nof hackforums, have indeed worked their asses off to get the rep they have, like \nthey do everything possible to earn it like, think about the people that have like 500+ \nrep, they have worked so hard to achieve that, and there just going to lose it like \ninstantly, its rather bullshit, i think that he just get rid of all the negatives but not \npositives(that makes no sense but i cannot explain it the way i want to,) but like \nthe people that have earned their rep should be able to keep their reputation, \nbut the people that ask for reputation or scam, or people that should just dont \ndeserve their reputation should lose it, not everyone, and i hope everyone can \nread my opinion, even omni, i have no hate Against omni's choice, but i agree with it, \nand disagree with it.\"[/i]\n[url=http://goo.gl/VJfQm][i]-illuminatiâ–²[/i][/url][/align]\n\n[i]\"I think the reputation reset will have both a positive and a negative impact on this \ncommunity. Positive due to everyone \"having a clean slate\", and negative due to \nthe scammers, low quality posters, flames, etc. being able to act like they have not \ndone anything wrong in their past.\nAlthough there are negative aspects of the reset, overall, I think it is a bad idea. \nNot because of people loosing their high reputation, but because of the ability people \nhave to start over again... Meaning old scammers will return, old flamers will return, \nall negative will return.\nOverall, I think it's not to great of an idea.\"[/i]\n[url=http://goo.gl/UfiWP][i]Spafic[/i][/url]\n[align=right][i]\n\"My honest opinions for the reputation resetting is acceptable. It will give the new \nusers that joined here a second chance and to help them gain more respect. The \nupgraded member that \"Rep4Rep\" obviously need to stop because this is a great \nexample of what will be a waste in the future. Even though my saying will not make \nthem stop, it's worth a shot. Omniscient is aloud to do whatever he feels like doing. \nAnyone who comes in his way will be dealt with. Yes, there will be threads made by \nusers asking \"Where there rep went?\" & \"I'm was rep fucked?\". Omniscient will need \nto deal with a lot of problems when that day comes.Without being said, the whole \nreputation resetting is also a great idea because than our wonderful Vouch system \nwill be done. I will understand if there is a lot of confusion towards it and I know \nOmniscient will explain everything in the future.\"[/i][/align]\n[align=right][url=http://goo.gl/3fcaX][i]Genuine[/i][/url][/align]\n\nThe topic for next week is \"Do you think the vouch system will improve the quality of the Marketplace??\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url]. \n\n[align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nSteve Jobs, the mastermind behind a number of Apple products (such as the iPhone, iPad, iPod, etc)., has died, on October 5th, 2011. Steve Jobs passed at the age of 56, surrounded by family members who have stated that he died peacefully. The rare form of Pancreatic cancer that Steve suffered from is believed to be the cause of his death. His death was announced by Apple in a statement which read: \n\n\"We are deeply saddened to announce that Steve Jobs passed away today. Steve's brilliance, passion and energy were the source of countless innovations that enrich and improve all of our lives. The world is immeasurably better because of Steve. His greatest love was for his wife, Laurene, and his family. Our hearts go out to them and to all who were touched by his extraordinary gifts.\"\n\nThis quote is verbatim. More details about his death can be read [url=http://abcnews.go.com/Technology/steve-jobs-apple-ceo-dies/story?id=14383813][color=#F5DEB3]here[/url][/color]. This article will start by recognizing the success of Steve Jobs and the many contributions that he has made. Under Steve Jobs, Apple participated in the [i]Product Red[/i] program, which produced red versions of devices and gave profits from these sales to charity. Since then, Apple became the largest contributor to this program. You can read more about Product Red [url=http://en.wikipedia.org/wiki/Product_Red][color=#F5DEB3]here[/color][/url]. Many of his contributions were made privately, although we mustn't forget that he's made more contributions to Technology than in charity itself. One cannot say where Apple would be without Steve Jobs. Steve Jobs has been successful throughout his life, with a net worth of 7 billion dollars (net worth varies). More information on Steve Jobs can be found [url=http://en.wikipedia.org/wiki/Steve_Jobs][color=#F5DEB3]here[/color][/url]. \n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n\n[align=center][img]http://m-103.minus.com/ib0gIlykpX0Zfn.jpg?q=0.822622681466[/img][/align]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[align=center][i]A special thanks to Reported as he sent in two interviews for the main edition even though he is a User News interviewer. \nKyle was unable to finish his interview due to family issues, and Valik is suspended from the team until further notice.[/i][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - bugga[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Thank you bugga for letting me interview you for the 5th edition of the User News. Is there anything you'd like to say before we get started?\n[b][color=#0066FF]bugga[/color]:[/b] Aw I thought I'd get to speak lol. I would just like to say thank you to all the members that make HF what it is today.\n\n[b][color=#0066FF]Reported[/color]:[/b] Alright, now to start off the interview, why did you join hackforums?\n[b][color=#0066FF]bugga[/color]:[/b] Sadly revenge, I was looking for answers to question's I just didn't have. I am glad to say I never achieved what I set out to do, in the end I met some wicked people and discovered you can actually make friends online.\n[spoiler]Go figure lol.[/spoiler]\n\n[b][color=#0066FF]Reported[/color]:[/b] So you've be on hackforums for a little under a year now, are there any differences that you like and dislike from when you joined?\n[b][color=#0066FF]bugga[/color]:[/b] Not really, I think all the changes since I have been here are for the best, in the long run. I mean Omniscient has built HF into a strong small business, it would be naive to question why he makes the changes he does, when we can see how successful HF has become for him. Although mainly just the dick heads, like who PM's randoms with \"Do you root beetroot?\" anyways lol. I guess the horrid trolls annoy me a little, I love some of the funny one's, a good laugh is a good laugh after all. Truth Hurts, we just get on like a house on fire. So many more, I would crash the site with that many details I'm afraid ðŸ™‚.\n\n[b][color=#0066FF]Reported[/color]:[/b] Will you be hoping to run for member of the month next month?\n[b][color=#0066FF]bugga[/color]:[/b] Honestly, I see myself as a nice enough person but there are many members that are deserving of this and so much more than me. Of course I would be excited and flattered if I was to win, but I would rather it go to a really deserving member.\n\n[b][color=#0066FF]Reported[/color]:[/b] Now tons of people have seen your best UB3R thread, now what gave you the idea of this thread?\n[b][color=#0066FF]bugga[/color]:[/b] I don't know, I was a little bored and I have had some issues getting threads up, it was easy to post on my phone and thought it would be nice to see the wide array of ub3rs we have. I spend a lot more time chatting to members wanting upgrades and thought it might be a nice way to get the BLUE team together.\n\n[b][color=#0066FF]Reported[/color]:[/b] Now tons of people know you're a girl, so I'm curious how many guys have asked you to E-Date them or Date them in general?\n[b][color=#0066FF]bugga[/color]:[/b] Um a few lol, most members are very polite and the guys that really tend to annoy me are the ones that send me filthy messages. It's not as bad these days though.\n\n[b][color=#0066FF]Reported[/color]:[/b] Wow, looks like some people on hackforums need girlfriends. Now on to the next question... What forums do you think you're most popular in and why?\n[b][color=#0066FF]bugga[/color]:[/b] I go all over HF, but I tend to post mainly in the lounge and contest section. I just rather PM people it helps as it avoids the sexism I have encountered throughout the forums.\n\n[b][color=#0066FF]Reported[/color]:[/b] Wow, I'm ashamed of those users, they should keep their keyboard to themselves ðŸ™‚. Alright, now time to wrap this interview up. Is there anyone you'd like to give a shout out to and is there anything you'd like to say to everyone on hackforums?\n[b][color=#0066FF]bugga[/color]:[/b] Yes, I would like to thank the people who entertained me this year while I was sick. I love you all for the time you spent keeping my mind occupied. I will not go into names, I would hate to miss someone. Oh actually, I would like to say one special hello to Qua, my little mate <3.\n\n[b][color=#0066FF]Reported[/color]:[/b] Well thank you bugga for letting me interview you for this weeks weekly user news.\n[b][color=#0066FF]bugga[/color]:[/b] You are very welcome.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - iMario[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hello iMario, thank you for this interview. Now I'd like to start off by saying congratulations on earning moderator and you deserved it, now to the questions. Now my first question is, How did you find hackforums?\n[b][color=#AAAAFF]iMario[/color]:[/b] Hello Reported and your welcome and thank you. I met someone at school that was into hacking and I liked the hacking he did, so he showed me this forum and I joined.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you come up with your username?\n[b][color=#AAAAFF]iMario[/color]:[/b] I used Mario999 for a long time as a username for anything, because Mario is my real name and Mario is always taken so I used 999 at the end. After being a big fan of the iPhone, I decided to add an \"i\" in front of my username. So my Youtube account, etc is iMario999. Then I decided to remove the 999 in my HF account because it looked better.\n\n[b][color=#0066FF]Reported[/color]:[/b] I just noticed your extremely popular monetizing thread and I'm curious, how did you come up with the idea to create that thread?\n[b][color=#AAAAFF]iMario[/color]:[/b] I made a lot of money from this. I understand how people feel when you try to make money online but you always fail. So I did this tutorial hoping people will learn to do real money ðŸ™‚.\n\n[b][color=#0066FF]Reported[/color]:[/b] Exactly how did you receive moderator and what was your expression when you got mdoerator?\n[b][color=#AAAAFF]iMario[/color]:[/b] Well, I received a PM from Omniscient, I replied and I received moderator. When I saw the PM first, I felt my heart beating. It wasn't unexpected, just unusual to receive a PM from Omniscient, lol.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you see yourself as an HQ Member?\n[b][color=#AAAAFF]iMario[/color]:[/b] If I was LQ I wouldn't get an interview :3. Well, being high quality depends on several cases. I consider being HQ when you use good punctuation, good grammar, being on topic, etc. Even though my grammar is not perfect, yes I consider myself an HQ member.\n\n[b][color=#0066FF]Reported[/color]:[/b] So you've been on hackforums for a little under a year now, has it changed from when you first joined and if so how?\n[b][color=#AAAAFF]iMario[/color]:[/b] Yes, Hackforums has changed a lot. First, a lot of new rules have been added and modified. Also, the groups. It all started when nokia2mon2 got gifted the Red Lions group. After a while, some members started to buy other groups. Some of the old free groups got deleted. All of them will eventually get deleted like Omniscient said. Anyways, there's also a lot of new sections that have been added.\n\n[b][color=#0066FF]Reported[/color]:[/b] What's your opinion on the reputation reset and what it's done to members on hackforums?\n[b][color=#AAAAFF]iMario[/color]:[/b] I like the reputation reset. I don't really have a reason. It will just be fun to see everyone with low reputation. The main reason of the reputation reset is for the new marketplace vouch system. Hopefully the vouch system will reduce the amount of scammer's on this forum. That's the best part about it.\n\n[b][color=#0066FF]Reported[/color]:[/b] How does it feel being a moderator now, sense you joined not that long ago?\n[b][color=#AAAAFF]iMario[/color]:[/b] I feel like I have a duty to accomplish and I better do my task properly if I don't want to lose this position. That's how I feel ðŸ˜.\n\n[b][color=#0066FF]Reported[/color]:[/b] Well thank you so much iMario for accepting to be interviewed and is there anyone you'd like to give a shout out to?\n[b][color=#AAAAFF]iMario[/color]:[/b] Your welcome and yes. Shout out to Dordelicious, Wolves, BlackChaos, InfectedCoding, Deities, ScripT., BoodyE-, my MSN buddies, The Alliance, Marketers. Sorry if I forgot someone <3.\n[/spoiler]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n[url=http://goo.gl/7M6h9][img]http://goo.gl/bT3g8[/img][/url]\n[align=right]\n[url=http://goo.gl/XNOmD][img]http://goo.gl/2frWD[/img][/url][/align]\n\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]",
      "subject": "[10/9/11] - HF News"
    }
  ]
}