{
    "posts": [
        {
            "pid": "10415596",
            "uid": "0",
            "dateline": "1300498590",
            "message": "[align=center][img]http://i.imgur.com/2xoYW.png[/img][/align]\r\nWelcome to the 36th edition of HF News. To view any past editions please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url]. First off, I'd like to thank [url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url] for giving me the honor of writing this week's edition of HF News.\r\n[align=center][img]http://i.imgur.com/SI3BT.png[/img][/align]\r\nOn Monday, the 14th, Omniscient announced a new over flow tag. This will make signatures that are taller than 200px be in a scroll box. There are many mixed feelings on this. He then changed it where the signature is clipped off if it is bigger than 200px. You can read more [url=http://hackforums.net/showthread.php?tid=1129095]here[/url]. \r\n[hr]\r\nUser UNIV3RSE was banned for reporting a staff's post as LQ. He then posted a thread in the Rules, Announcements, New and Feedback section. Factor 8 and TRRS both said that since staff have no minimum character limit, they don't have to abide to the rule. You can read more [url=http://hackforums.net/showthread.php?tid=1136466]here.[/url]\r\n[hr]\r\n\r\n[align=center][img]http://i.imgur.com/ll8Ut.png[/img][/align]\r\nThe last edition of HF News failed to mention this, so I'll say it. The member On Vacation, also known as Mystic Guru, was banned by Omniscient for the reason \"Figuring this out\". \r\n[hr]\r\nUser [url=http://hackforums.net/member.php?action=profile&uid=8484]Đενɨаηсε™[/url] has reached a momumental goal of 1,000 reputation points this week. As of now, only 8 people have 1,000 or more reputation points. \r\n[align=center][img]http://i.imgur.com/BbFgs.png[/img][/align]\r\nIn other news, User [url=http://hackforums.net/member.php?action=profile&uid=237516]Glamour[/url] has announced to the lounge that he is returning. You can read more [url=http://hackforums.net/showthread.php?tid=1139414]here[/url].\r\n[hr]\r\nStaff and Admins are cracking down on LQP. More and more users are being banned and limited for LQP. Remember to keep your posts HQ as much as possible and more.\r\n[hr]\r\nAfter the recent DB troubles, we are slowly climbing back up to 9 million posts on HF. We are also nearing 200,000 members. HF is becoming a very popular community.\r\n[align=center][img]http://i.imgur.com/NY4aV.png[/img][/align]\r\n[align=center]The video of the week is \"The Flower\"\r\n[youtube]http://www.youtube.com/watch?v=hMM_T_PJ0Rs[/youtube][/align]\r\n[align=center][img]http://i.imgur.com/pShSH.png[/img][/align]\r\nThreads of the week is a section that I'm introducing this week that shows some of the best and most popular threads on HF in the past week.\r\n[hr]\r\nOmniscient posted a beatiful picture of a nuclear power plant [url=http://hackforums.net/showthread.php?tid=1131598]here[/url].\r\n[hr]\r\nTate posted a thread reasoning how the US might actually win a war with China if the circumstances were right. You can read this thread [url=http://hackforums.net/showthread.php?tid=1121918]here[/url].\r\n[hr]\r\nRhythm posted a thread asking how to create your own country. Some interesting responses were made. You can read more [url=http://hackforums.net/showthread.php?tid=1135041]here.[/url] \r\n[hr][hr]\n[align=center][img]http://i.imgur.com/s7tTs.png[/img][/align]\r\nThis week, I have interviewed 5 people. Here are all of the interviews.\r\n\nThe first interview is with [url=http://hackforums.net/member.php?action=profile&uid=93419][b]Minnesota Nice[/b][/url].\r\n[b][color=#FF1493]Interview with Minnesota Nice[/color][/b]\r\n[spoiler= ]\r\n[b][color=white]Cobalt:[/color][/b] Why did you join HF?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] Well, I don't remember exactly why but I was looking for help getting some phone spy stuff and I was pretty interested in keylogging and general computer security at the time. But essentially because the site look enticing.\r\n\n[b][color=white]Cobalt:[/color][/b] Who were your first friends on HF?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] Hard to say, I wouldn't say I really had friends right away but Sparky, Robbieava, Thoth, Glamour, xerotic, and Hysteria X are pretty chill people. Basically if you have my Skype I would say you are my friend. For firsts I would probably say... Hm, Static, or Verdande.\r\n\n[b][color=white]Cobalt:[/color][/b] What is different about HF now from when you joined?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] There's been quite a few rule changes, sections have been added and removed, and ub3r is now something you can get haha. Ub3r wasn't around when I joined. I also just remembered that the international section is gone. That's good because it's hard to moderate people when they are speaking in other languages. As for the \"quality\" of members, people need to chill out because it's all the same. People weren't higher quality back when I joined, there's always trolls and LQM's. \r\n\n[b][color=white]Cobalt:[/color][/b] Do you have any current goals on HF?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] Nothing special, maybe an award or two, but that's all. I don't really have post or rep goals. I would like to improve the Graphics tab in general but it seems to be doing a lot better than before!\r\n\n[b][color=white]Cobalt:[/color][/b] What is your favorite section on HF? Least favorite?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] My favorite sections are the lounge, beginner hacking, anything in the graphics, and the VIP forums. Sections I visit the least, or my least favorite, are probably webmaster and the marketplace. I just avoid the marketplace in general since I've been scammed or charged back on 100% of the transactions I've made through there.\r\n\n[b][color=white]Cobalt:[/color][/b] Are there any members you look up to here on HF?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] Well, I like everyone unless you are a douche, but personally I like Qwazz, he's got his act together.\r\n\n[b][color=white]Cobalt:[/color][/b] If you could change one thing on HF what would it be?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] If I could change something I would probably make a moderator for every tab and possibly one fore sub sections depending on the activity. And then I would have 5 or 6 staff members instead of then 10 I think we have now. It would ease the work load of everyone and it would help get things resolved faster. But since you can't assign a mod group in 1.6 that could be tricky :P.\r\n\n[b][color=white]Cobalt:[/color][/b] Any advice or comments for the HF community?\r\n[b][color=#FF1493]Minnesota Nice:[/color][/b] For the black hats, if you're gonna special op with the bad boys,\r\ngoin' in unprotected is a bad choice.\r\nFor the GFX guys, nothing is ever a 10/10\r\nFor the my boys in the lounge, xerotic likes to ban for \"lounge crackdowns\".\r\nEveryone else, take care.[/spoiler]\r\n\nThe next interview is with [url=http://hackforums.net/member.php?action=profile&uid=132486][color=white][b]420[/b][/color][/url]\r\n[b][color=blue]Interview with 420[/color][/b]\r\n[spoiler= ]\r\n[b][color=white]Cobalt:[/color][/b] Why did you join HF?\r\n[b][color=blue]420:[/color][/b] I guess it was around the time Call of Duty prestige modding became really popular. I joined out of curiosity, and ended up staying.\r\n\n[b][color=white]Cobalt:[/color][/b] Who was your first friend on HF?\r\n[b][color=blue]420:[/color][/b] Probably Dr. Longcat. I knew him way before I joined up here.\r\n\n[b][color=white]Cobalt:[/color][/b] What is different about HF now from when you joined?\r\n[b][color=blue]420:[/color][/b] Nowadays, more and more people rely on what others can do for them, rather than doing it themselves. I wouldn't say people have just become lazy, instead, I would say that unfortunately the majority of HF's users simply lack the initiative to quit relying on others for everything. It's bad parenting, man. Bad parenting is the source of all this. If only their parents would teach them that they have to do shit themselves, rather than [b]expect it[/b] to [b]be[/b] handed to them on a silver platter. Don't have kids, that's the moral of the story.\r\n\n[b][color=white]Cobalt:[/color][/b] Do you have any goals on HF?\r\n[b][color=blue]420:[/color][/b] No, I don't bother setting goals for a discussion forum.\r\n\n[b][color=white]Cobalt:[/color][/b] Are there any members you look up to here on HF?\r\n[b][color=blue]420:[/color][/b] Not really to be honest. There was someone who helped me out with some issues I was having with my linux box quite a while back, but he only had around 5 posts and I don't think he ever came back here again. Can't remember his username, but I guess I look up to that guy.\r\n\n[b][color=white]Cobalt:[/color][/b] If you could change one thing on HF what would it be?\r\n[b][color=blue]420:[/color][/b] If I could change one thing, i'd probably add a narcotics discussion board to the site. Maybe a Lounge sub-board or something. I suggested it a few months ago and it got some great feedback, but Omniscient ended up turning it down in the end.\r\n\n[b][color=white]Cobalt:[/color][/b] Any advice or comments for the HF community?\r\n[b][color=blue]420:[/color][/b] Don't deceive yourself into believing you are the shit, because in reality you are an unimportant, insignificant, spec of dust on this planet we call earth. Be nice and respect everyone, it'll take you far. Also, try something new every day. (I read that on the back of a cereal box, it's good advice.)\r\n\nOh, and RIP cancer boy. (KaNe)\r\n[/spoiler]\r\n\nThe third interview is with [b][color=white][url=http://hackforums.net/member.php?action=profile&uid=25053]Hawkins[/url][/color][/b]\r\n[b][color=yellow]Interview with Hawkins[/color][/b]\r\n[spoiler= ]\r\n[color=white][b]Cobalt:[/b][/color] What brought you here to HF?\r\n[color=yellow][b]Hawkins:[/b][/color] I guess as pretty much everyone else, I came here to learn how to hack. I wanted to learn how to steal passwords, I wanted to learn how to phish.\r\n\n[color=white][b]Cobalt:[/b][/color] Who were your first friends on HF?\r\n[color=yellow][b]Hawkins:[/b][/color] I can't really remember that clearly, I know I felt pretty lonely at first but then I met Trilobyte, and I joined the Wraith where I met Zammy and the others and everything changed.\r\n\n[color=white][b]Cobalt:[/b][/color] What has changed since you joined HF?\r\n[color=yellow][b]Hawkins:[/b][/color] Many things changed since I joined. I remember, back then there were so many new members and there was this eagerness to learn new things. I don't see a lot of those kind of people nowadays.\r\n\n[color=white][b]Cobalt:[/b][/color] What is your favorite section? Least Favorite?\r\n[color=yellow][b]Hawkins:[/b][/color] My favorite section is of course, Wraith's section where I spend pretty much my whole time while on HackForums. I also like the SRPP section too. I never really liked the Beginner Hacking section or however it is called. It was always full of annoying kids asking stupid questions.\r\n\n[color=white][b]Cobalt:[/b][/color] Who do you look up to on HF?\r\n[color=yellow][b]Hawkins:[/b][/color] I've always looked up to my mentor, ZammySlave really. I've also always had great respect for Furyan, the founder of the Wraith who has taught me a lot about standing up for what I believe and for being myself. There are more but these two are the ones that have had pretty much the biggest impact on me.\r\n\n[color=white][b]Cobalt:[/b][/color] Do you have any goals on HF?\r\n[color=yellow][b]Hawkins:[/b][/color] Yes. My goal on HF is to make the Wraith great once again, and to continue leading it the best way possible and by doing that, I hope to reach my ultimate goal, which is making a difference, a difference towards making the world a better place.\r\n\n[color=white][b]Cobalt:[/b][/color] How did you get involved in the Wraith?\r\n[color=yellow][b]Hawkins:[/b][/color] I was trying to see where I belonged in HF, and when I read Wraith's recruitment thread I just knew that it is the place I was looking for. Back then, it wasn't allowed for members to be in other groups, and I was in three. I left all three groups and since then, I have never joined another group on HF.\r\n\n[color=white][b]Cobalt:[/b][/color] Do you have any advice or comments for the HF community?\r\n[color=yellow][b]Hawkins:[/b][/color] I hardly check threads outside the Wraith's section, but whenever I do, I see people arguing over differences and that is why I want to say to all that differences are what make our lives better, what make our world a more interesting place to live in. Just imagine how ugly the world itself would be if there was only one type of flowers, one color, one weather. Just embrace diversity and enjoy life, guys.\r\n[/spoiler]\r\n\nOur fourth interview is with [color=white][url=http://hackforums.net/member.php?action=profile&uid=101228]Tate[/url][/color]\r\n[color=purple][b]Interview with Tate[/b][/color]\r\n[spoiler= ]\r\n[color=white][b]Cobalt:[/b][/color] How did you come about HF?\r\n[color=purple][b]Tate:[/b][/color] A once active member referred me.\r\n\n[color=white][b]Cobalt:[/b][/color] What was the first section you started posting in?\r\n[color=purple][b]Tate:[/b][/color] Coding sections.\r\n\n[color=white][b]Cobalt:[/b][/color] What are you favorite sections on HF?\r\n[color=purple][b]Tate:[/b][/color] The the sections under the hacking tab for the most part.\r\n\n[color=white][b]Cobalt:[/b][/color] Who were you first friends on HF?\r\n[color=purple][b]Tate:[/b][/color] My only \"friends\" were the people I invited. I didn't use referral links since they didn't exist.\r\n\n[color=white][b]Cobalt:[/b][/color] You are a controversial member. Some people love you, some hate you. Why do you think you receive such mixed feelings?\r\n[color=purple][b]Tate:[/b][/color] I believe a large portion of the issue is in how my posts are being read. Most people here live in different areas with different common voice patterns and accents, so a statement I make might come across with a different attitude to someone with a different voice pattern or accent than my own. That's definitely not the entire issue, though. If I went into detail, your 10,000 word limit would be more than met, so I'll stop this explanation here.\r\n\n[color=white][b]Cobalt:[/b][/color] If you could change one thing about HF what would it be and why?\r\n[color=purple][b]Tate:[/b][/color] I would change its date of creation. If HackForums were around in the 80s and 90s when hacking was in such a rapid state of growth and technologies and networks usually had huge errors/holes in security, HackForums would have gone down in history.\r\n\n[color=white][b]Cobalt:[/b][/color] Any advice or comments for the community of HF?\r\n[color=purple][b]Tate:[/b][/color] No.\r\n[/spoiler]\r\n\nThe final interview is with [color=white][b][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url][/b][/color]\r\n[color=#32CD32][b]Interview with xerotic[/b][/color]\r\n[spoiler= ]\r\n[color=white][b]Cobalt:[/b][/color] Why did you join HF?\r\n[color=#32CD32][b]xerotic:[/b][/color] I joined HF to learn more about Batch and VBS with Notepad because I thought those were the big things. I also wanted a hack for a game. ^_^\r\n\n[color=white][b]Cobalt:[/b][/color] Who were some of the first people you befriended? \r\n[color=#32CD32][b]xerotic:[/b][/color] I didn't really befriend anyone. I didn't really talk to any HF member until perhaps later 2010. That is when I first considered people \"buddies\".\r\n\n[color=white][b]Cobalt:[/b][/color] What did you do before that then?\r\n[color=#32CD32][b]xerotic:[/b][/color] Before I became friends with people I mainly took in info, and helped out where I could. I learned Python programming language and took it up from there. I tried my hand at RAT'ing and graphics.\r\n\n[color=white][b]Cobalt:[/b][/color] Before you got staff, were you aiming for a staff position?\r\n[color=#32CD32][b]xerotic:[/b][/color] Not at all, I expected other people to perhaps get staff. I actually started learning a new programming language around the time I was promoted. Very unexpected.\r\n\n[color=white][b]Cobalt:[/b][/color] How did you feel when Omniscient asked you to join staff?\r\n[color=#32CD32][b]xerotic:[/b][/color] I felt somewhat elated. I was surprised and honestly I tried to supress my enthusiasm when responding to his PM. Then I just browsed until he responded back.\r\n\n[color=white][b]Cobalt:[/b][/color] What did you first when you gained Staff access?\r\n[color=#32CD32][b]xerotic:[/b][/color] Learn. Can't really say any more than that. =P\r\n\n[color=white][b]Cobalt:[/b][/color] Do you look up to any members on HF?\r\n[color=#32CD32][b]xerotic:[/b][/color] For staff, phire nuk3r and Factor8. I like how they operate and handle members. For members, not too much. I have buddies, but I don't really look up to anyone, I just do as I do.\r\n\n[color=white][b]Cobalt:[/b][/color] Do you have any advice or comment for the HF community?\r\n[color=#32CD32][b]xerotic:[/b][/color] Yea, re-read or read the Help Docs and check out all subforums of HF. There is more there than you think. Stay HQ and and learn learn learn.\r\n[/spoiler]",
            "subject": "[3/18/11] - HF News"
        }
    ]
}