{
  "posts": [
    {
      "pid": "26493968",
      "uid": "515249",
      "dateline": "1347859456",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#9f2dc5][b]109th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Groups No Longer Being Sold[/b][/color]\nDue to an overload of groups, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided that the sales of new groups would be obliterated from HF. There will be no more new groups sold, although the owners of the current paid groups are still welcome to sell their group. It was stated that, much like awards, he felt groups were losing their rarity on the site. To see [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread, click the following link: http://goo.gl/Qaf5a\n\n[color=white][b]New Ub3r Feature[/b][/color]\nAfter, and I quote, \"feeling productive\", [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to implement a new feature, which allows Ub3rs to search the past username database, which would then show a list of members who fit the provided criterea. This is useful for looking for old friends that have changed their username, or perhaps finding a user's profile link from exported PMs. In the past, there was no way to locate users, so this feature should prove to be quite helpful. To view the new search function, click the following link: http://goo.gl/9tMMy\n\n[color=white][b]AOL Ban Lifted[/b][/color]\nAfter constant persuasion attempts, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally managed to actuate AOL to lift the IP address ban on emails, allowing members to register and recover passwords via AOL once again. It will likely take 1-2 day(s) before the ban is fully lifted, although confirmation that AOL users will once again be able to receive HF emails once again is comforting. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about this happening, click the following link: http://goo.gl/sYvkw\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=688075][b]monkeytherat[/b][/url] won the Hackforums chess tournament. Read about it [url=http://hackforums.net/showthread.php?tid=2825792]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=129812][b]Moralitas[/b][/url] stepped down as Staff.\n[url=http://hackforums.net/member.php?action=profile&uid=458073][b]Chief.[/b][/url]'s account was re-opened.\n[url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] had his post count drastically lowered.\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=#00FF00][b]Paradoxum[/b][/color][/url] is now Staff! Congratulations!\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=65167][color=black][b]Diogenes of Sinope[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=black][b]mybboss[/b][/color][/url] was banned for low quality posting.\n[*][url=http://hackforums.net/member.php?action=profile&uid=516470][color=black][b]SoulZeh[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=576437][color=#0066FF][b]Stevo[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=875895][color=black][b]Haste.[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=65167][color=black][b]Diogenes of Sinope[/b][/color][/url]'s account was closed.\n[*][url=http://hackforums.net/member.php?action=profile&uid=869826][color=black][b]Suhinder[/b][/color][/url] was banned for multi-accounting.\n[*][url=http://hackforums.net/member.php?action=profile&uid=65141][color=#0066FF][b]The Goat[/b][/color][/url] was banned for trolling.\n[*][url=http://hackforums.net/member.php?action=profile&uid=899243][color=black][b]Harry Dresden[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=687297][color=black][b]Barneyyz™[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=132817][color=black][b]S70N3R[/b][/color][/url] was banned for a year... again.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544][color=black][b]Cody[/b][/color][/url] was banned due to an infection.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=74674][color=#0066FF][b]Blazin[/b][/color][/url] received the Brony award for smoking weed and watching MLP.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1033713][color=#0066FF][b]Formula1[/b][/color][/url] is no longer a leader of Eminence.\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][b]Chief.[/b][/url] is now a leader of Logic.\n[*][url=http://hackforums.net/member.php?action=profile&uid=879655][b]iElement[/b][/url] is now a leader of Logic.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Phegget[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2863314][b]HF OMGPOP Pool Tournament 4 - REGISTER NOW - $105 worth of prizes[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][b]malichi[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2862049][b]Romney the Liar![/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=767248][color=#0066FF][b]Sherlock Holmes[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2858776][b]Do you think real Time Travel will ever be possible?[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=136025][color=#0066FF][b]The Elite[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2857157][b]You are born gay - Only logical arguments[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/showthread.php?tid=2851558]Logic[/url][/font][/size][/color] (group)\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Hello Hexicidal, and thanks for allowing me to interview your group for the 109th edition of the HF News. Why don't you tell the readers what the group focuses on primarily?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][color=white][b]Hexicidal[/b][/color][/url]: Thank you for interviewing us. Logic focuses on itself. We are a dedicated group here for the people. Without the amazing members that are in Logic, we would be nothing. My purpose here is to give an experience unlike any other on HackForums. Each group is an individual family, and I love our little dysfunctional family.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Haha, you're not the only one. Before I start interviewing the members, I'll ask you a quick question. What are your views on multiple dimensions?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][color=white][b]Hexicidal[/b][/color][/url]: Multiple dimensions is a brilliant area of thought. I hold the views that each dimension influences our own in inconspicuous ways. Each dimension could possibly be linked by black holes that allow white holes to form in multiple dimensions and interlink each dimension to each other. While information is absorbed and crush, it is not destroyed. It is simply transformed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Will we, the human race, end up as a fossil collection for more advanced species?\n[url=http://hackforums.net/member.php?action=profile&uid=1091100][color=white][b]Racutt[/b][/color][/url]: Civilization seems to be heading multiple ways right now. I believe that part of our species will be left on earth to die off and be discovered as a fossil collection, while another part will end up exploring the stars. Maybe even being the advanced species that discovers its original ancestors one day.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Do you think there should be further limits, rather than just prompts, on online adult content?\n[url=http://hackforums.net/member.php?action=profile&uid=73089][color=white][b]sylvertech[/b][/color][/url]: No. If a person wants porn, let him have it. Those who do not want it, leave. I could care less about shielding offspring from the horrors they will eventually have to face. Trauma leads to awareness.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What is your ideal political movement?\n[url=http://hackforums.net/member.php?action=profile&uid=1204034][color=white][b]DeadLine[/b][/color][/url]: Let me start off by saying that I'm not a big fan of modern politics. The reason is very simple: most political figures are smart people who use their knowledge to maintain the corrupt system that we live in today. You might not know it, or see it every day but something is very wrong with this world. Take Julian Assange for instance, the man is being hunted by several governments for crimes that he did not commit. He is a modern day hero for what he did, leaking those files and exposing the truth about so many things, just like Bradley Manning. The things that they did for this world, are amazing to say the least. They have opened a lot of eyes. They have given their lives to support humanity, and that is what brings a little bit of light to the darkness that we live in. That being said, my ideal political movement as of today does not exist and I doubt it ever will.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Is there such a way to 'cheat' death, or do you just get lucky sometimes?\n[url=http://hackforums.net/member.php?action=profile&uid=849324][color=white][b]Text[/b][/color][/url]: You cannot cheat death. No one can know when death strikes. \"Cheating Death\" is implying that death is a living thing, which it is not.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Would the world be better under a one world order? Why/why not?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: That would have to depend on the type of system that we would have in order. In my opinion, yes, because we would have all the resources in the world capable of being used by every person in the world. This would relinquish a lot of the current issues we have now, such as the high prices we have on crude oil. At the same time, though, I believe if a one world order were to be enacted, we would have to be EXTREMELY careful of who we put in power.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Is suicide selfish?\n[url=http://hackforums.net/member.php?action=profile&uid=397679][color=white][b]Anarchy[/b][/color][/url]: Yes, although not always. If someone lets say has no chance of recovering from an injury that gives them no chance to ever move a muscle again, that's not exactly selfish. If some 14 year old girl commits suicide because someone called her ugly it's not selfish either since she's furthering evolution of humans.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Should survival be the main focus of society today? Why/why not?\n[url=http://hackforums.net/member.php?action=profile&uid=567334][color=white][b]Cyph3rStorm[/b][/color][/url]: Well I would have to say no to that, mainly because we all already know how to survive. As humans, our biggest focus should be bettering our technology to be able to help each other. Take starving children for example, we have the capacity and resources to do it, but the main problem is we have no cheap and easy way to get resources to them. If we could make our lives more efficient, and better for EVERYONE, things would go really well.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Should we limit the amount of children someone should be able to have for population control?\n[url=http://hackforums.net/member.php?action=profile&uid=397679][color=white][b]Anarchy[/b][/color][/url]: No. A person shouldn't be bound by the government in anyway involving breeding. What's next? Do we kill old people for population control?\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Is immortality a possibility in the future?\n[url=http://hackforums.net/member.php?action=profile&uid=839420][color=white][b]Isaac Asimov[/b][/color][/url]: Well immortality is theoretically possible, but in my opinion no. Being immortal or if everyone is immortal, then the demand for food will skyrocket or plummet, as well as our population(Always will increase). Also, just imagine the evolutionary aspects of things and if you are walking around like the average human being in the year 2012, you will look totally out of place compared to the others. Imagine being a Homosapien Erectus while everyone else is Homosapien Sapien? Then just imagine the mental impact. If your mind is aging, but your body is not, you will develop such a strong disorder, so remembering what your name is would be a daily accomplishment. I think my greatest fear of immortality would be getting trapped somewhere out in this world. If you can't die then you can't escape, therefore driving you mentally insane for all of eternity.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Do you think technology is advancing too fast for the world? Will technology take our jobs?\n[url=http://hackforums.net/member.php?action=profile&uid=1160000][color=white][b]tamilan[/b][/color][/url]: No, I don't think that technology is advancing too fast for the world. Yes, people will lose jobs, but technology will also help people live a much more affordable life due to reduced costs at the producer's end. People will have to adjust to machines doing their jobs sooner or later, and I personally would prefer sooner.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Do ghosts exist or is it possible?\n[url=http://hackforums.net/member.php?action=profile&uid=1160000][color=white][b]tamilan[/b][/color][/url]: Of course there is a possibility that ghosts exist, however I would go as far as to make the claim that they don't. Just because people tell more stories about ghosts does not mean that ghosts are more likely to exist than other fantasy creatures such as fairies and pixies. Yes, there are sometime phenomena that sometimes occur, but I don't think it is fair to attribute that to ghosts. 'I don't know, therefore Ghosts!', is not a valid explanation for the existence of ghosts. But it would be pretty cool if ghosts like the ones from Harry Potter existed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What is your opinion on standardized testing in schools and its impact on society?\n[url=http://hackforums.net/member.php?action=profile&uid=567334][color=white][b]Cyph3rStorm[/b][/color][/url] (against): From my Personal experience is has set standard education back. From the time I took my first State Standard when I first went to public school in the 6th grade and found that we were not learning anything, everything I had learned from the 4th-5th grade was being taught in the Advanced classes in Public school. The main objective was to get kids prepared for these standardized tests since they were what determined if you passed or failed; also teachers based their whole curriculum around the standardized test to help children pass since they gain a Pay Bonus for every child who passes the test. Now I am all for seeing where people stand but because of this education does not start 'till after Junior year of High School. I pretty much had to teach myself all the advanced Math because my math teachers were busy teaching tricks to these standard tests and cheating Arithmetic equations so we can move at full speed. But since teachers have become so focused on these standardized tests they leave out the fun part of education; learning new things by experience; so my feelings is these bonuses have forced teachers to put greed before education made them lazy, rude, and actually very ineffective. Now there are teachers out there that actually love what they do, but from my experience and people I know they go for the money, state bonus, and summers. So the overall impact is children are learning the same thing year after year; they get bored. Teachers start to call them failures since they're bored of learning the same thing. Teachers tell them they're going to fail the state standard, although you pass with flying colors since it's really the same thing over and over. Teachers make bonus and never thanks anyone, and you're left to do the same thing and start to hate it even more, leading to either dropping out, doing drugs, getting into trouble, or finding other ways to entertain and learn. Standard testing is leading to an uneducated world. I believe they should have a standard test but make it once every four years, so new things can be implemented. People can actually be taught important things; new things, and testing wouldn't be the primary focus of teachers.\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url] (for): Standardized testing brings a much more positive impact on society as a whole. For example, it makes sure that the students are learning all the necessary knowledge for their age. Additionally, it creates a sort of \"test\" for teachers because if they were to slack off and not care about the education of the students, it would show because the students would be complaining that they never learned the necessary techniques to solve a problem. Its impact on government is great as well. The government can see which students have the highest intelligence levels out of the entire country or area. This enables them to look even closer at the students’ schools and find out which schools house the most intelligent humans. They can then direct their funds to more appropriate areas where the intelligence levels aren't as high. If the teachers don't teach right, it will show as well. In conclusion, every level of society is affected positively from standardized testing in schools.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Who are you (yes, this is a serious question. I mean as in... as a person, not \"Hi, I'm ___\")\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: This question’s depth is often taken for granted by many individuals. If I directed this question to you, what would you say? Most likely “My name is ____ and I like ____, ____, and __.” What would you classify yourself as? The point is that we were given a name and when were given the name, we become that. We have been labeled. Other than that, we are all the same when we are born. This isn’t my point though; a massive realization will come in the end. Everything physical in this world is made up of these four conditions:\n•    Solidity\n•    Liquidity\n•    Heat\n•    Airiness\nThese elements are taken directly out of Buddhism; the faith behind this is very low. If you look at everything in this world that you can see, look for these inside of them. Now what makes us different from those? Well, some would argue we have consciousness (or a soul). If you have taken a course in neurology you will have realized how much brutal raw power our brain has. It can take in millions of data points and organize them in a fraction of a second. Unfortunately, we don’t have a soul. Put aside your faith for a bit and look at the facts. Our brains and bodies are so complex (years of evolution) that not even the machinery we have today can match it. Feelings are simply just biochemistry that is active in our body. Consciousness is the process of receiving all this information from the outside and recreating it. Our brains can trick us at any point, it controls everything. Is reality an illusion? We may never know until we create or find intelligence higher than us.\nMy point is that we have no soul. If we have feelings and consciousness, there is no need for a soul. Personality, what about that? All the interactions you have in your life is printed into your brain. You can craft somebody’s personality by controlling the external variables that affect them. I know it’s hard to accept, but it is the truth. Thanks for reading, I hope this has made you more critically minded about what you are.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=981500]zZParadoxZz[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, zZParadoxZz, to the 109th edition of the HF News. Usually, interviews are focused at well-known members, or old-fags. This week, I've decided to take a less well-known member, and look at his views of the site, and following the interview with Logic, receive his opinions on some SRPP related questions. Shoutouts?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: Moon Shiner, of course. My Xbox Live buddy!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Good to hear. Now, what brought you to the forum originally?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I had a deep urge to find a way to connect with other people online. So after I found Facebook, I found HackForums and discovered that I was very interested in computers.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Facebook and Hackforums as your first social-networking sites, strange match. Anyhow, what exactly interests you in HF? Which sections do you frequent, and what have you learnt?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: When I first started, I used to frequent both the RAT and Coding sections of HF. I never really became truly amazing with either, but found out that I liked the site, and the people on it (for the most part). Since then, I just wander aimlessly around the site, giving my personal input and advice towards a variety of people and things, although I do spend a good deal of time in both the SRPP and AA sections.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I see. Diversity of topics is one of the things which makes HF so popular. While we are on the topic of the site, what are some things that you would change/implement/improve if you had the opportunity?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I would like to see a better cultivation of newer members. Quite often, I'll see newer members, who don't necessarily know what they are doing wrong, get flamed to the breaking point by more senior members. If older members could maybe give more of a helping hand towards newer members, I'm sure everyone would be much happier.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I most definitely agree, although it's hard to tell which new members are serious, or just trolling/there to cause havoc. If you don't mind sharing, what is your religious stance(s), and why?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I was raised a member of the LDS religion, but have never truly believed a good percentage of what they teach, although I've seen that it sometimes makes more sense than other religions. Currently, I am not too concerned with my \"eternal\" welfare. If there is a God, so be it, but if there isn't, I'm perfectly fine with that as well. One thing I am sure of, it's that neither me nor anyone else will know for sure until death.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's definitely a decent take on such a controversial topic. Another topic which has been of interest recently is suicide. What are your views on suicide, and do you see the act as selfish? Why/why not?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: Although there are many cases where it probably should be considered selfish, I generally don't think it is; rather, I believe it to be a personal decision based on what a person had been through, and what he believes he will be going through. If a person has lived a life of misery and sadness, and truly believes that their existence is just a burden, I believe that they have the right to make a decision regarding suicide.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: While we are on the topic of death, what about the death penalty? Do you think it should be used more, less, or in a different way? Do you think it's effective?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I believe that everyone deserves a second chance, but there comes a point where a person does not care about his or anyone elses welfare anymore. Also, if a person has been in and out of prison so much that his existence is that much of a burden on the government, then I believe that the death penalty should be a consideration.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Morality definitely plays a role in that topic, as everyone has a different level and/or understanding of it. What morals define you as a person, and what major morals difference you from the generalised society?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I believe that if someone does something to me, than I have the right to do something of equal weight towards them. Although I believe I have that right, I rarely act upon it. I usually just try to avoid a situation that will end badly for both me and whoever else may be involved. Frankly, I believe that compassion is better than justice, just because nobody is perfect.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Most definitely. What kind of music do you listen to, in what situations, and why?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I listen to all sorts, but I tend to lean towards Rap, which does not fit my personality in the slightest. Certain groups/artists I like are Wu-Tang Clan, AZ, and Nas. I basically enjoy any type of music that has a gritty realism to it, without trying to mask anything from anyone. Although content has a lot to do with it, I like a strong lyrical presence in a song as well. I listen to music in all situations, because it gives my mind something else to focus on besides whatever my current situation may be.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I agree with your situation-relation, as I do the same. Earlier today, Omniscient stated that no more paid usergroups will be introduced. What are your views on this, and on usergroups in general?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I believe that his decision was a good one, since the usergroups, at least to me, were losing their appeal. On usergroups in general, I believe that some of them should have a larger focus on a specific topic. I do not believe that having a usergroup just for the sake of having a usergroup, is very smart or original.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for allowing me to interview you today zZParadoxZz. Any final thoughts/comments before I let you go?\n[url=http://hackforums.net/member.php?action=profile&uid=981500][color=white][b]zZParadoxZz[/b][/color][/url]: I appreciate your willingness to interview me, and I'm glad I got the chance to share a little bit about myself with the community.\n\n[/spoiler]",
      "subject": "[9/16/12] - HF News"
    },
    {
      "pid": "26493972",
      "uid": "515249",
      "dateline": "1347859467",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=white][b][color=#00BFFF]Wii U Launch Date[/color][/b]\nEarlier this week, Nintendo announced the official release date for the Wii U console. It's planned for release November 18 in North America and November 30 in Australia. The console will set you back a hefty $299, while a deluxe version will hit hard at $350. \"The basic Wii U model will come with one Wii U GamePad, an AC adapter, HDMI cable, and a sensor bar. The deluxe set will include everything from the basic set, as well as additional memory, a cradle for the console, stands for the GamePad, and a copy of NintendoLand.\" It was also announced that Wii U games will be around $60.\n\n[b][color=#00BFFF]Black Ops 2 Confirmed for Wii U[/color][/b]\nActivision confirmed that the next title in the Call of Duty series will be Wii U compatible. The news was announced by Nintendo while they held an event for the new product. The event screened a live demo with two developers playing a multiplayer map. Black Ops II launches on November 13, except for Wii U, which doesn't have a set release date as of yet. \n\n[b][color=#00BFFF]ARMA Devs Arrested[/color][/b]\nTwo ARMA developers were arrested for \"spying\" in Greece this week. Greek reports say that they were in possession of images and videos of military bases. The Greek island of which they were filming is the main island in the next ARMA game. \"Since its establishment in 1999, Bohemia Interactive has created games based only upon publicly available information,\" Spanel said. \"We always respect the law and we've never instructed anybody to violate the laws of any country. The same is true for Arma III.\"\n\n[b][color=#00BFFF]Text version... say what?[/color][/b]\nYes, this week is a text version. However, the graphical version of the Gaming News will be back next week! Sorry for any inconvenience and fuck the haters. \n\n[align=center][b][color=#FF1493]Top Upcoming Games[/color][/b]\n- Borderlands 2\n- MoH Warfighter\n- AC3\n- Halo 4\n- Call of Duty: Black Ops II\n\n[b][color=#FF1493]Latest Achievements List Revealed[/color][/b]\nAssassins Creed 3\n- 50 Achievements worth 1000 Gamerscore\n[url=http://www.xbox360achievements.org/game/assassins-creed-3/achievements/]List Here[/url][/align]\n\n[align=center][b][color=#FF1493]Gaming Video of the Week[/color][/b]\n[video=youtube]http://www.youtube.com/watch?v=ZzmWedLiHMg[/video]\n[/align]\n[/color]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]\"Innocence of Muslims\" is not so Innocent[/b][/color]\nAnti-West protesting is only part of the reactions from Anti-Islamic film trailer releases. \"Innocence of Muslims\" is a low budget film that criticizes everything about the Islamic religion and its prophet, Mohammed. After being dubbed into Arabic, the videos were spread all over the Middle East by Morris Sadek. On September 8th, the video was shown on Al-Nas TV, which is an Islamic station. Protests against the video started on September 11th, and continued on throughout the week. Protesting across the world has cause several deaths and injuries, including the United States Ambassador, Christopher Stevens. To this day Embassy's in Middle Eastern cities are being burned to the ground by Islamic protesters. \n\n[color=white][b]11th Anniversary of Attacks on America[/b][/color]\nIt's been eleven years since the heart-wrenching day of September 11th, 2001, where thousands died from attacks on American soil. The World Trade Center, The Pentagon, and Somerset County are all sites where Americans have come together to mourn the deaths of those lost in the attacks. Millions sat in silence, including the President and first Lady. According to several sources, almost 3,000 people were killed in the attacks. Whether or not you're an American, this was one of the worst things to happen in American history.\n\n[color=white][b]New Species of Monkey Found[/b][/color]\nTwenty-eight years have passed since a new species of monkey has been discovered, until now. Deep inside the forest of the Democratic Republic of the Congo, is where the new species was found. This animal has always been known by the native people, but not by anyone outside. The discovery of this animal was by complete accident, when a field team of scientist were on a routine stop to a village called Opala. Upon entering the village, the team saw this animal sitting on a post. Later, to find out that it is a pet of the local school director. They took this animal, and came to a conclusion that is a brand new species of monkey never seen before to outsiders. It took the team three years to finally get confirmation that this animal is indeed a new species.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Google[/b][/color]\nTwo weeks earlier, Google announced that they had purchased Virustotal for an undisclosed amount. Virustotal is a free online security service, which focuses on scanning suspicious files and URLs. The analysis report is then sent to both the user, and owner (now Google). The reports help prevent a wad of infections, and helps anti-virus software keep up with the latest malware technology. Virustotal is currently partnered with a variety of anti-virus companies (around 42). Users can use the program simply by visiting the website, selecting the file/URL and uploading it (for files, not URLs). The user is then left with a detailed report from each of the anti-virus programs. There is also browser extensions and desktop applications provided by Virustotal. Files that exceed 32MBs of space cannot be scanned. \"The quality and power of our malware research tools will keep improving, most likely faster\" Virustotal boasted, with the resources of Google now in play.\n\n[b][color=white]Apple[/color][/b]\nAfter months of hype and anticipation, Apple's iPhone 5 officially released last week, on September 10. Apple has revised and improved various things in the new iPhone including, but not limited to: a smaller dock connector, smaller SIM card slot, extended battery life, 4G LTE, A6 processor, a larger 4-inch Retina display, along with a [b]much[/b] thinner design. The new iPhone also has an additional mic, located at the bottom. This new iPhone 5 has iOS6 installed. A highlight feature in relation to iOS6 is its 3D maps app, which is extremely accurate and efficient. Despite the huge array of new features offered with this new Smartphone, critics, as well as myself, believe that the iPhone 5 still lacks the expected 'wow' factor. When you hold an iPhone 4S in one hand, accompanied with an iPhone 5 in the other, the only noticeable aspect is its weight and slimness.\n\n[b][color=white]Adobe[/color][/b]\nAfter the partnership between Windows XP and Adobe, which has been upheld for 11 years (which was the release of Windows XP), Adobe says that the current version of PhotoShop (Adobe Photoshop CS6) will be the last version that is Windows XP compatible.  Adobe justifies their reasoning behind this somewhat controversial decision with advancing technology. Modernized software requires a modern hardware graphics interface, which Windows XP simply lacks. \"The Photoshop team would like to provide advanced notice that Photoshop CS6 (13.0) will be the last major version of Photoshop to support Windows XP,\" stated Tom Hogarty, Adobe Product Manager, on Adobe's official blog.\n\n[color=white][b]Alibaba[/b][/color]\nAlibaba, which is widely regarded as \"China's Google\", is most obviously renowned in China for its brilliant services, nationwide. Following this gained respect, Alibaba decided to walk in Google's footsteps, and attempted to build their own OS. This OS was given the name 'Aliyun'. Acer was planning to release some of their products with Aliyun, although Google claimed that Aliyun is forked and an incompatible version of Android, respectively trashing Acer's plans. Regarding this issue, Alibaba said,  \"Aliyun is not a fork. Ours is built on open-source Linux. Aliyun has its own applications. It's designed to run cloud apps designed in our own ecosystem. It can run some, but not all, Android apps.\"\n\n[color=white][b]Samsung[/b][/color]\nAfter the release of the iPhone 5, accompanied with various reviews, critics stick to the conclusion that the Samsung Galaxy S3 is still the best Smartphone on the market. Samsung has created an ad mocking Apple, in which they state \"It doesn't take a genius [to realize that the S3 is better than the iPhone]\", which is backed up by various statistics (the ad can be seen [url=http://goo.gl/Mb0Jn]here[/url]). After losing the lawsuit against Apple, Samsung has taken a more aggressive approach towards Apple, which is backed up by this confronting ad. Things are really starting to heat up between these two Smartphone developers (among other things). Your move, Apple.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Lupe Fiasco Extends Olive Branch to Chief Keef[/b][/color]\n\"Lupe Fiasco a hoe ass n---a and when I see him I'ma smack him like da lil b--ch he is,\" Chief Keef wrote on Twitter.\nLupe Fiasco and Chief Keef have had their differences over the past few weeks, but Lupe showed his commitment to ending the rivalry by shouting out Chief Keef at a concert in Toronto.\n\"I'm far from being the man I want to be... I ain't no saint, either,\" Lupe Fiasco told the crowd. \"With that being said, I love my brother and I want to see him succeed and do his thing... shout out to the big homie Chief Keef.\"\nSince then, both of them have attempted to calm things down. We hope Lupe's shout out leads to further peace.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=9bZkp7q19f0[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=LbimBz1ZwIk[/video]\n[video=youtube]http://www.youtube.com/watch?v=LPgvNlrBfb0[/video]\n[video=youtube]http://www.youtube.com/watch?v=zNMSSdPC_Mw[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI'd like to welcome the newest addition to the HF News team, [url=http://hackforums.net/member.php?action=profile&uid=879655][b]iElement[/b][/url]!\nNow that the World News position has been filled, I will be going through the last edition and sending out messages shortly.\nConsider all applications to be closed, sorry if I didn't respond to a private message asking about applying, I figure I had made it clear, and did it is such a way so that I wouldn't have to deal with private messages.\n\nThank you all for reading!",
      "subject": "*"
    },
    {
      "pid": "26493976",
      "uid": "515249",
      "dateline": "1347859477",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What's your favorite/least favorite thing about Hack Forums?\"\n\n[i]\"Really, the most favorite thing for me on Hackforums are the members. There \nare tons of nice people who help out a bunch of people everyday. For example, I \nwas reading the griefing section today and saw a newer member need help coding \na specific thing for his client. Instead of raging at him and calling him a skid or w/e, \nhe actually helped him out and explained how to code it. The least favourite thing for \nme, basically the opposite is the rude members. Sure, there are a ton of rude people \nin real life and all over the internet, but I consider the Hack Forum community as a \ngroup of friends. Yes, we aren't all friends but I do consider it as that. I don't really \nlike the people who just instantly rage at a person for accidently mistyping a part of \na code and negative rep them or whatever.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1347898][i]-Uehm[/i][/url]\n\n[align=right][i]\"My favourite thing about HackForums would definitely have to be the \npeople. If you look in the right places there are people who are always willing to help, \ncan give you advice on topics, let you learn a new skill or even provide you with some \namusement if you are bored. With so many different sections on HF, people have a huge \nvariations on the different skills which different people have. You could take to an expert \nSEO money maker one minute and a game developer the next.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url][/align]\n\n[i]\"My least favourite thing is elitism. Before I go overboard, on both my thoughts & feelings \non this matter, the whole concept of elitism is starting to over-rule this forum. The divide \nbetween the 3 different member types is looked upon as a hierachy, and I for one, hate that. \nMy favourite thing has to be the people. The people here on hackforums are incredible and \nno matter what my level of anger, and or mood, they'll never cease to entertain me.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=992333][i]-Accident[/i][/url]\n\nThe topic for next week is \"How do you feel about the ability to purchase a custom usergroup coming to a close?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center]Barneyyz has taken a Vacation Ban, we will sort things out over Skype. Thanks.[/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://art.penny-arcade.com/photos/i-L7SrsM7/0/L/i-L7SrsM7-X3.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://imgs.xkcd.com/comics/success.png[/img][/spoiler][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=879655]iElement[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net]Coming Soon[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}