{
  "posts": [
    {
      "pid": "6425423",
      "uid": "30595",
      "dateline": "1284375010",
      "message": "[align=center][img]http://img23.imageshack.us/img23/4201/hfnews.jpg[/img]\n\n[color=white][b]Edition #13[/b][/color][/align]\n\nHey everyone! This is [url=http://hackforums.net/member.php?action=profile&uid=311070]Virtual Reality[/url], filling in for Yin this week. He has been a little busy lately, and he apologizes for his truancy! He should get back to regular schedule soon enough! Until then, I am extremely excited to bring you Edition #13 of HF News! This week was \"one of those weeks\" where there was not too much real news. I apologize in advance for the filler-stories, if you see any.\n\n[hr]\n\n[color=#00BFFF][font=COMIC SANS MS][size=xx-large][align=center][b]HEADLINES[/b][/align][/size][/font][/color]\n\n[font=COMIC SANS MS][url=http://hackforums.net/showthread.php?tid=671146]Political and Religious Expression BANNED[/url]: Yesterday, Omniscient created a new rule. This rule prevents members from utilizing their user titles, signatures, and avatars, to express any religious or political stance. Omniscient still encourages discussion on these hard-hitting topics in the [url=http://hackforums.net/forumdisplay.php?fid=128]Science, Religion, Philosophy, & Politics[/url] forum. With this rule in place, Omni has also updated the Help Documents, with a new page devoted Profile Violations! If you would like to view it, you may do so by clicking [url=http://hackforums.net/misc.php?action=help&hid=22]here.[/url]\n\n[url=http://hackforums.net/showthread.php?tid=653939]HF Officially #1 MyBB Forum[/url]: This was posted on the 4th, but I thought that it should still be reported on. Congratulations HackForums, we are now the #1 MyBB forum in every category! With over 20,000 posts per day, HF is by far the most popular forum within MyBB! Next Step: Take over the world!\n\n[hr]\n\n[align=center][color=#00BFFF][size=xx-large][b]USER NEWS[/b][/size][/color][/align]\n\n[url=http://hackforums.net/member.php?action=profile&uid=81075]Robbieava[/url] has been hard at work this week, with the creation of a new unofficial HF group. The name of the group is PHQE, and it stands for [i]Project HQ Era[/i]. This new group is sponsored by The Alliance, and is devoted to encouraging users to create HQ content within this forum. Project HQ Era sponsors and engages in several forum activities, including but not limited to: Games, Tutorials, Program Coding, Graphic Design, Debates, and Fund-Raising. Robbieava has stated that 100% of the proceeds raised by PHQE will go directly back into HF, via upgrade, sticky purchase, or direct donation. Keep your eyes and ears open, as I am sure you will be hearing more about PHQE in the forthcoming weeks.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1]Omniscient[/url] recently wrote about his summer, and his recent trip to Zeon National Park with his family. If you would like to read about his trip, you can view the thread [url=http://hackforums.net/showthread.php?tid=662659]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=311070]Virtual Reality[/url] recently received UB3R, thanks to [url=http://hackforums.net/member.php?action=profile&uid=295518]Dykerosoft[/url]! He also received his 1000th post around the same time! To show his appreciation to the HF community, he created a thread devoted to thanking some of his favorite members! You can view this thread by clicking [url=http://hackforums.net/showthread.php?tid=673642]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=63387]Black Shadow™[/url] received the red donator award! This means that he has donated over $500 to HF in total! This news is a little bit outdated, but it is so noteworthy that I couldn't help but fit it in! Congratulations, Black Shadow™!\n\n[url=http://hackforums.net/member.php?action=profile&uid=267098]Nahomish[/url] has made it public knowledge that he is looking to assemble a group of Call Of Duty gamers. He wishes to create a montage and enter an official HF video into a contest for [url=http://www.youtube.com/machinima]Machinima[/url]! He posted about it [url=http://hackforums.net/showthread.php?tid=674743]here[/url]. If you are interested, PM him.  Good Luck Nahomish!\n\n[hr]\n\n[color=#00BFFF][size=xx-large][align=center][b]BAN OF THE WEEK[/b][/align][/size][/color]\n\nThis week, iBruteForce banned [url=http://hackforums.net/member.php?action=profile&uid=110746]Mute[/url] for Low Quality Posting. He received 6 warnings in a row, and his account is currently suspended for a 1 week period. We'll see you next week, Mute! We can only hope he has learned his lesson, and will come back as a better member than before the ban!\n\n[hr]\n\n[color=#00BFFF][size=xx-large][b][align=center]Other News[/align][/b][/size][/color]\n\nHi Guys! It was really a pleasure to be given the opportunity to write this weeks edition of HF news! I really worked hard on it, yet enjoyed doing so at the same time! It is a really strenuous thing to have to compete with past editions written by members as awesome as Yin & Robbieava are, so I hope I did alright! Let me know what you think. I hope to get the opportunity to write another one in the future!\n\nOnce again, I apologize for some of the filler. Not much happened this week. Thanks for reading! :)\n\n[color=#FFD700][b][size=large]- Virtual Reality[/size][/b][/color]\n[/font]",
      "subject": "[13/09/2010] HF News"
    }
  ]
}