{
  "posts": [
    {
      "pid": "13591845",
      "uid": "295848",
      "dateline": "1310663107",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNMain.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=deepskyblue][b]50th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNHeadlines.png[/IMG][/align]\n\n[align=justify]Lately [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has been thinking about on making Liberty Reserve as Hack Forums' primary currency. This would entail all buyers and sellers must have that as one of their payment options. If you'd like to read the full statement, it can be found [url=http://hackforums.net/showthread.php?tid=1465358]here[/url]. \n\nIn addition to the Liberty Reserve idea, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] created a poll asking members to give their opinions on the service as a whole. Almost 40% of voters stated that they've used Liberty Reserve at some point in time, and were satisfied with what they offer. The thread itself has turned into a very informative debate between those for and against what Liberty Reserve offers. If you would like to read the full story click [url=http://hackforums.net/showthread.php?tid=1465665]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] has posted a link containing a message for you. If you would like to read what it has to say please click [url=http://hackforums.net/showthread.php?tid=1475299]here[/url]. You won't be disappointed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=175033][color=lime][b]xerotic[/b][/color][/url] has posted a thread laying out what he does on a daily basis, as well as a few real life problems he's facing. If you have any advice for him what so ever please post it [url=http://hackforums.net/showthread.php?tid=1466490]here[/url]. \n\nNo need to worry [url=http://hackforums.net/member.php?action=profile&uid=100071][color=lime][b]cobija[/b][/color][/url] is only on vacation, he should be returning in two weeks' time.\n\n[url=http://hackforums.net/member.php?action=profile&uid=115612][color=#0066FF][b]-BoodyE-[/b][/color][/url] has been promoted to co-leader of the Reviewers. Now the group has three leaders and should be able to turn out reviews much faster than in the past.\n\n[url=http://hackforums.net/member.php?action=profile&uid=616850][color=black][b]Atthackers[/b][/color][/url], the leader of [b]The Informers[/b], has been banned for seven days. This is quite a shock after all he's given back to the community. \n\nAt this point in time five official groups are recruiting. They are: [url=http://hackforums.net/showthread.php?tid=1421354]The Alliance[/url], [url=http://hackforums.net/showthread.php?tid=1431069]Graphics Masters[/url], [url=http://hackforums.net/showthread.php?tid=1406024]The RAT's crew[/url], [url=http://hackforums.net/showthread.php?tid=1446805]Reverence[/url], and [url=http://hackforums.net/showthread.php?tid=1338354]The Wraith[/url]. If you would would like to apply for any of these 5 groups head over to the [url=http://hackforums.net/forumdisplay.php?fid=52]Recruitment[/url] section now![/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNUsernews.png[/IMG][/align]\n\n[align=justify][url=http://hackforums.net/member.php?action=profile&uid=70881][b]Paradoxum[/b][/url] has received the esteemed Qwazz Star. To see the full list of who has received this award, click [url=http://hackforums.net/myawards.php?awid=62]here[/url]. He has also filled the second row of awards this week after receiving the Genius award for his efforts here on Hack Forums.\n\n[url=http://hackforums.net/member.php?action=profile&uid=151894][color=#0066FF][b]Vanadium[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=619030][b]iNviZ[/b][/url] have achieved the rank of Master Donator this week. Such donations are what keep Hack Forums alive; we thank both of them for their generosity. To see a full list of the Master Donators, click [url=http://hackforums.net/myawards.php?awid=50]here[/url].\n\nThis week [url=http://hackforums.net/member.php?action=profile&uid=370510][b]!!* Alone Vampire *!![/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=317364][color=#0066FF][b]Nightmarе[/b][/color][/url] reached 1,000 reputation points. Last week [url=http://hackforums.net/member.php?action=profile&uid=101228][color=#0066FF][b]Tate[/b][/color][/url] surpassed this same milestone. Only seventeen members in total have achieved this, that being said it's quite an accomplishment.\n\n[url=http://hackforums.net/member.php?action=profile&uid=79121][color=white][b]Richie[/b][/color][/url]'s graphics service is now the most posted GFX service in the history of Hack Forums, and it's free! If you need some graphics for a sales thread, or your profile needs some revamping check out his thread [url=http://hackforums.net/showthread.php?tid=692081]here[/url].\n\nWith all this talk about Liberty Reserve many members are looking towards the currency exchange section with weary eyes. [url=http://hackforums.net/member.php?action=profile&uid=382745][color=#FFCC00][b]Confidence[/b][/color][/url] has put together a comprehensive guide to currency exchanging online for those who are new to the concept. His guide can be found [url=http://hackforums.net/showthread.php?tid=1453067]here[/url].\n\nThis week [url=http://hackforums.net/member.php?action=profile&uid=661940][color=#0066FF][b]bugga[/b][/color][/url] is holding a very unique upgrade contest in The Lounge, instead of the Member Contests section. This is due to the fact that she is wanting to upgrade a member that spends quite a bit of time on Hack Forums browsing The Lounge. This round's contestants have been chosen -- click [url=http://hackforums.net/showthread.php?tid=1462608]here[/url] to place your vote.\n\n[url=http://hackforums.net/member.php?action=profile&uid=675453][b]Cyber-Security[/b][/url] has created a very thorough guide to computer safety. It covers just about every type of way one can use to protect themselves online. If you'd like to read it, click [url=http://hackforums.net/showthread.php?tid=1458606]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=93419][color=#0066FF][b]Minnesota Nice[/b][/color][/url] has returned after taking a month long break from Hack Forums. He spent this time seeing the sites in Europe and finishing up his school work. If you'd like to welcome him back it should be done so [url=http://hackforums.net/showthread.php?tid=1470175]here[/url].\n\nFeeling a bit hungry? Have a spare 5 minutes on your hands? Well, [url=http://hackforums.net/member.php?action=profile&uid=277712][b]Cobalt+[/b][/url] has put together a quick tutorial that will solve this problem -- and fast! Find out how to make the perfect grilled cheese sandwich [url=http://hackforums.net/showthread.php?tid=1473754]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=274613][color=#0066FF][b]Яǝʌǝɹsǝ[/b][/color][/url] has returned to the Ub3r group after spending two months as a dead account. Just a few days later his account was closed yet again for low quality posting, but now he's back once again.[/align] \n\n[align=center][b]This Week's Bans & Repfucks[/b] [/align]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=11953][b]Nyx-[/b][/url] has been repfucked yet again.\n[*][url=http://hackforums.net/member.php?action=profile&uid=74052][color=red][b]Gold[/b][/color][/url] is back to sporting a red username due to his warning level.\n[*][url=http://hackforums.net/member.php?action=profile&uid=279955][color=red][b]Happeh[/b][/color][/url] has been repfucked and limited. Reason: Stupidity. \n[*][url=http://hackforums.net/member.php?action=profile&uid=132817][color=red][b]S70N3R[/b][/color][/url] has been repfucked and limited. Reason: Stupidity. \n[*][url=http://hackforums.net/member.php?action=profile&uid=119690][color=red][b]SpK[/b][/color][/url] has been repfucked and limited. Reason: Stupidity. \n[*][url=http://hackforums.net/member.php?action=profile&uid=197180][color=red][b]Syed[/b][/color][/url] has been repfucked and limited. Reason: Stupidity. \n[*][url=http://hackforums.net/member.php?action=profile&uid=200751][color=red][b]Zach[/b][/color][/url] has been repfucked again and limited. Reason: Stupidity. \n[*][url=http://hackforums.net/member.php?action=profile&uid=813596][color=black][b]Quincy[/b][/color][/url] has been repfucked and banned after donating $500, and having it reversed 15 minutes later.\n[*][url=http://hackforums.net/member.php?action=profile&uid=272042][color=black][b]Shades[/b][/color][/url] has been banned and repfucked after admitting to scamming other Hack Forums members.\n[*][url=http://hackforums.net/member.php?action=profile&uid=68704][color=black][b]sky-[/b][/color][/url] has been repfucked and banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=88465][color=black][b]Taiga[/b][/color][/url] has been banned for sales trashing.\n[*][url=http://hackforums.net/member.php?action=profile&uid=551465][color=black][b]Torrent.[/b][/color][/url] has been banned.[/list] \n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNOther.png[/IMG][/align]\n\n[align=justify]Unfortunately, another drastic earthquake has struck Japan. This earthquake was a shocking 7.3. The last one Japan had was a 9.0 and was very dangerous. Fortunately, no deaths or injuries have been reported. The nuclear power plant that caused a lot of concern the last time was not damaged at all. While an earthquake is definitely nothing to be happy about, an earthquake of this magnitude and no injuries is miraculous. \n\nAnother natural danger this summer is heat. Fifteen states are under heat advisories. My state, Tennessee, is under one, and let me tell you, this heat is no joke. It has been pushing 100°F, 38°C, almost every day for the past 10 days. Most of the states that are experiencing this dreadful heat advisory experience humid heat, which is generally worse than dry heat. The heat index, how hot it feels compared to how hot it is, is expected to hit 115°F, 46°C.\n\nThis year, the world is happy to welcome a new country — South Sudan. South Sudan has been announced a new country state for a while, but it has not been recognized until July 9, 2011. It has redrawn the borders between South Sudan and Somaliland. The African Union has not approved of this, but South Sudan is succeeding with or without the AU’s blessing.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNInterviews.png[/IMG][/align]\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - The Rated R Superstar[/color][/font][/size]\n[spoiler][yt]http://www.youtube.com/watch?v=GtGhtKJW0kc[/yt][/spoiler]\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - Wolves[/color][/font][/size]\n[spoiler][align=justify][color=white][b]Astonish is NJ:[/b][/color] Hello Wolves, and thank you for participating in the 50th edition of the HF News. Would you like to make any opening statements?\n[color=white][b]Wolves:[/b][/color] I'd just like to say it's an honor to be interviewed and was quite surprised to get offered.\n\n[color=white][b]Astonish is NJ:[/b][/color] Let's jump right into it, why did you join HF?\n[color=white][b]Wolves:[/b][/color] I saw a link once upon a time and it looked like a place like I'd enjoy. After joining and looking around for a good hour or two, I finally made one of my first posts in the Call of Duty section.\n\n[color=white][b]Astonish is NJ:[/b][/color] Who was your first friend on Hack Forums and how did you get to become friends with him?\n[color=white][b]Wolves:[/b][/color] It'd have to be Frvwfr3 for the Prestige Lobby in CoD as well as my first rep. For a long time, I remained distant from most members to a personal level. All of that changed once being accepted into The Alliance and having the open arms of an HF family I've yet to see in another group.\n\n[color=white][b]Astonish is NJ:[/b][/color] Well now you have been here about the same time as me. Have you seen a change in the forum, if so how? \n[color=white][b]Wolves:[/b][/color] Honestly, I've seen the quality of certain sections decrease and activity die down. For the most part things have stayed consistent. I haven't seen much change as a whole, just tiny things across the entire board.\n\n[color=white][b]Astonish is NJ:[/b][/color] If you had to pick one person to give the Member of the Month award to, who would it be?\n[color=white][b]Wolves:[/b][/color] This is a hard decision, of course I would always love to have such an award, I mean, who wouldn't? But I'd probably want to give it to either Xypher or Deities. Both of them are phenomenal members greatly deserving of it. I'd have to say Deities is one of the smartest people I've encountered in my life and amazes me on a daily basis.\n\n[color=white][b]Astonish is NJ:[/b][/color] How did you become leaders of Black Knights and Red Lions?\n[color=white][b]Wolves:[/b][/color] This is rather difficult to answer. Black Knight leadership was Xypher's doing. We had shared similar thoughts and had moments were he was unsure whether he was going to focus down on The Alliance or attempt to lead both. In the end, he's chosen to lead both, but keep me as a leader as Qwazz has recently stepped down. Red Lions is due to my hard work and efforts to make the sub forum more active. I made the upgrade thread for nokia2mon2 as well as other fairly big threads in the sub forum most members can't see. He surprised both myself and Hуѕтєяιa X™ with leadership positions not too long ago, something desired by a lot of members within our group.\n\n[color=white][b]Astonish is NJ:[/b][/color] You have had about two weeks of experience in a leadership role of the Black Knights and Red lions, Would you say that being a leader was more challenging then you expected?\n[color=white][b]Wolves:[/b][/color] It is to an extent, I still haven't got the big tasks as a leader yet. Black Knights is being reformed and should start recruitment soon, which will be one of my first big tasks. As for Red Lions, Hуѕтєяιa X™ has taken amazing charge as leader and I find myself mostly playing a support leader for the time being. Hopefully that will change sometime soon and I'll take more charge soon, but he is doing an astounding job that I could only compare to Paradoxum's leadership within his groups.\n\n[color=white][b]Astonish is NJ:[/b][/color] Would you consider yourself a strict or a laid back leader, and why?\n[color=white][b]Wolves:[/b][/color] I'm a little of both. I've only kicked a few people and I'm not as strict as Hуѕтєяιa X™ is in leading the Red Lions. I'm strict when it comes to accepting members outside of recruitment time and activity, but otherwise I'm a fairly relaxed and kind leader. Who knows, that may change here in the near future. ;)\n\n[color=white][b]Astonish is NJ:[/b][/color] If you were given the opportunity to be a leader Reverence, would you take the role on, why or why not?\n[color=white][b]Wolves:[/b][/color] That is a very interesting question. I feel that three leadership spots would be quite a hard thing to handle, especially when I start school again trying to balance 19 hours in college. I'd also like to keep other options open, I was interested in HJT, but feel I now wouldn't have the time to dedicate to it. There is also that hope that many others have of one day being offered a Staff position that I'd always like to be open to. ;)\n\n[color=white][b]Astonish is NJ:[/b][/color] How does it feel a few months ago winning an upgrade contest, to now being leader of two groups and holding contests?\n[color=white][b]Wolves:[/b][/color] All I have to say is that it's rather astounding. I've been a member of several forums since I was about 13 and 6 years later it seems I've finally found a suitable place for myself. I hope to push myself even further here as one of the greatest things I desire in my life is to help people in any way I can. It feels nice being a leader coming from being a shy kid lacking confidence all my life. The forum has provided me with confidence both online and in my real life, shaping me into a better person.\n\n[color=white][b]Astonish is NJ:[/b][/color] What one piece of advice would you give to a new user joining HF?\n[color=white][b]Wolves:[/b][/color] I'd probably say, \"Be kind, respectful, and genuine both here and in life. You will encounter people who dissuade you from this and the best thing to do is turn the other cheek and stay true to yourself. Leave the cynical thoughts that you may have gained through your life and try and start things with a fresh perspective. One of my greatest realizations in life is that being cynical makes you into a depressing and negative person and being positive is a much better \"outlook\" as corny as that may sound.\n\n[color=white][b]Astonish is NJ:[/b][/color] This went fast, but time to wrap it up, do you have any shout outs?\n[color=white][b]Wolves:[/b][/color] Ah, I really have way too many people to thank. I have to say hey to Xypher, Paradoxum, Deities, Tha Sneak, Qwazz, Astonish is NJ, H0p.e, Pluto, Decoy, iMario, TheHackersLove and really all the fantastic members in my groups. Sorry if I left anyone really important out. <3\n\n[color=white][b]Astonish is NJ:[/b][/color] Alright, thanks for this interview!\n[color=white][b]Wolves:[/b][/color] Thank you, Astonish.[/align][/spoiler]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNClassifieds.png[/IMG][/align]\n\n[align=left][url=http://hackforums.net/showthread.php?tid=1458970][img]http://i.min.us/ibZ1lE.png[/img][/url][/align]\n\n[align=right][url=http://hackforums.net/showthread.php?tid=1416451][img]http://i.imgur.com/F3Qub.png[/img][/url][/align]\n\n[align=left][url=http://www.mskeys.in][IMG]http://i.imgur.com/X3GG1.jpg[/IMG][/url][/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNTeam.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\n[/list][color=white][b]Publisher's Assistant[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url][/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url][list]\n[*]Other News[/list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=153686]Fireren[/url][list]\n[*]Headlines[/list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=515249]Sir[/url][list]\n[*]User News[/list][/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url][list]\n[*]Head Reporter[/list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=129444]3x0r_$c0rPi0n[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=355307]chocothunda[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url][/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=657392]Astonish is NJ[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=137080]Boxing[/url][/list]\n[color=white][b]Editors[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=234024]Deities[/url][/list]\n[color=white][b]Graphic Designer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]",
      "subject": "[7/14/2011] - HF News"
    }
  ]
}