{
  "posts": [
    {
      "pid": "4065473",
      "uid": "74244",
      "dateline": "1273993936",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\n[align=center]Edition 1 (first news)[/align]\n\nIt's been a busy week here at HackForums, with many updates.\n\n[size=x-large][color=#00BFFF]Headlines[/color][/size]\n\n[b]It seems as if MyBB.com has been purchased! This means that Omniscient will definitely be getting some increased traffic in MyBBCentral for his plugins. We all love MyBB as our main software for forums, and let's hope it goes on![/b]\n\n[color=#32CD32]It seems we cannot find a person to do the Wikipedia page. Ph!sh had attempted this, but Omniscient and him didn't come to an agreement, and now the house is definitely burning. Check out the latest of it [url=http://hackforums.net/showthread.php?tid=423334]here[/url].[/color]\n\n[color=#FF4500]HackForums has 4 servers now! This doesn't seem big compared to games like Runescape, but for a forum, it's very good. This should hopefully keep the site running smooth. Here's the direct quote from Omni himself :\n\n\"Anyways I had planned on adding this fourth server as it was donated by a member a couple months ago. I've just now gotten it setup for use. It's a great server especially given it's a donated one. Since it's not in the same datacenter there are limitations for it's use. However it's perfect for backup and redundancy. I've also decided to serve all the javascript files from it. This alleviates apache some work on the HF main server and also I/O of the hard drive. So far so good after about 18 hours. No complaints and smooth as can be.\n\nIt's at Vuwin.com/jscripts so if you see that domain it's not a XSS or hack. It's regular usage of HF. Please notify me if any of your AVs or Malware detectors go off for HF or Vuwin.\n\nI will probably also move the css to that server but that's slightly more complicated so I'll wait till next week.\n\nAll this to help keep HF up and running as fast and smooth as possible.\n\nAnd for those considering attacking it. It has the same security as all my servers. And I can disable it's usage here with one click. That's not an invite either but a notice that attacking it is going to be a waste of your time not mine.\n\nOne great thing about this is that users are now even less likely to trigger the firewall and be blocked. It's just that many less connects you make to HF.\n\nI have some plans this summer that once implemented will severely limit DDOS attacks. Eventually we will out hardware 99% of attacks. At this point most attacks are stopped quickly and our downtime is minimal. As usual I'll continue to harden HF as I learn and we grow.\n\nThanks everyone. \"[/color]\n\nSeems like he's as excited for the future as we are.\n\n[color=#FF1493]Omniscient cleared the 500,000+ posts in the Junk forum. This caused many members to lose posts. Staff were hit the hardest, as they get +1 when they junk a thread. The highest losing victims were Yin, iBruteforce, and Kutmustakurt. [/color]\n\n[b]There has been a PHP forum added by Omniscient. This was a request which can be found [url=http://hackforums.net/showthread.php?tid=409832]here[/url]. The section was added on May 11th, and is already becoming a success.[/b]\n\n[color=#FFD700]Omniscient added a filter to the minimum characters in posts. It changed from 20 to 25, which means you now need 25 characters in a post or you may not post.[/color]\n\n[color=#C71585]Another update this week was a non HF L33T/UB3R change. This means registered members (non l33t/ub3r) may only post 10 times in the Lounge per day. This is in hopes to stop spam, and low quality posts.[/color]\n\n[color=#FF4500]This week we have also hit 95,000 reported posts. The totals are as follows -\n\n20,160 low quality\n15,856 wrong forum\n1755 dumps\n7711 lock request\n6873 flaming\n5335 other\n5671 spamming\n3556 infected downloads\n2782 double posting\n2552 CC or PP fraud\n1541 phishing\n1162 Cross Posting\n\nThanks to the swift staff of HF for dealing with all of those, as well as the reporters who are keeping HF safe![/color]\n\n--\n[size=x-large][color=#32CD32]\nUser news[/color][/size]\n\n[b]It seems as if The Elite was hacked again this week. You can find the thread [url=http://hackforums.net/showthread.php?tid=422749]here[/url]. This is the third time it's happened, seems like someone needs to secure their computer![/b]\n\n[color=#9370DB]GOS Anthony has been a big headline in the past week. He scammed over 10 HF users, and with no remorse. Anthony posted [url=http://hackforums.net/showthread.php?tid=398937]this[/url] thread to prove his innocence, but was instead fucked. Teaches you a lesson about scamming.[/color]\n\n--\n[size=x-large][color=#FF4500]\nJust Plain Weird[/color][/size]\n\n[color=#FF6347]PewPewPew posted a thread about him shaving his pubes [url=http://hackforums.net/showthread.php?tid=420212]here[/url]. What a crazy dude to share his experience of shaving his pubes with HackForums. His story earned him a spot on this week's Just Plain Weird![/color]\n\n[b]The-Black Raven posted a thread about describing sex in a funny way. The thread can be found [url=http://hackforums.net/showthread.php?tid=418807]here[/url].[/b]\n\n[color=#32CD32]Russiky posted a thread of him wearing a skirt [url=http://hackforums.net/showthread.php?tid=423522]here[/url]. Something tells me after this guy got a Justin Bieber haircut, and is wearing a skirt, Houston has a problem. What's Russiky's next move? Only time will tell.[/color]\n\n--\n[size=x-large][color=#FF6347]Repfucks/Bans of the Week[/color][/size]\n\n[url=http://hackforums.net/member.php?action=profile&uid=83269]Wazakindjes[/url] was banned this week, with a reason of \"Bye\" from the mysterious staff |||. Is this the end of Lounge trolling as we know it? \n\n--\n\n[size=x-large][color=#FF6347]More information about this news -[/color][/size]\n\nI'm making a daily news of HackForums. This will include a bunch of segments, I just need to think of them. I want suggestions. I don't want anyone helping me with this, as I don't want this to become some fiasco. If you'd like to help me with the news portion (meaning you give me news, via HF links) then that'll work. I need some segment suggestions for the most part.\n\nI'm going to have a graphic for this soon too, and post them every week for people to tune in and see what's cracking with HackForums. Post on the thread, it'll keep it up in the pages and let more people view the news.\n\n--\n\n[size=x-large][color=#98FB98]Suggestion Format[/color][/size]\n\nSegment it goes under (Just Plain Weird, Headlines, etc) -\nLink to the thread -\nA bit more describing the news -\n\nThanks guys, this should hopefully be a success.\n\n--\n\nFollowing thread - http://hackforums.net/showthread.php?tid=434536",
      "subject": "HF News Week - 5/09-5/16 [FIRST] [COMMENT]"
    }
  ]
}