{
  "posts": [
    {
      "pid": "20383935",
      "uid": "515249",
      "dateline": "1330571606",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]81st full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]New group[/b][/color]\nEarlier this week there was a thread posted by BELLAGIO in the graphic requests section asking members to make a userbar for a new group. In the thread title it stated that the group was paid for, however the thread did not contain any information on the group and the thread is now junked. Whether or not any of this is true is unknown, for now all we can do is wait.\n\n[color=white][b]Datacenter issues[/b][/color]\nOn Saturday the 25th, Omniscient tweeted that he was facing a few datacenter problems. However he said that they seemed to have been resolved and everything should be back to full functionality. To view Omniscient's tweet click the following link: [url=http://goo.gl/UC8Lc]http://goo.gl/UC8Lc[/url]\n\n[color=white][b]5 year anniversary[/b][/color]\nHackForums is nearly a month away from the huge 5 year anniversary, so Omniscient has recently posted a thread asking members to post their suggestions as to what they'd like to see on the anniversary. To read Omniscient's thread about the anniversary click the following link: [url=http://goo.gl/y7Eki]http://goo.gl/y7Eki[/url]\n\n[color=white][b]New almost-official group[/b][/color]\nThe HF News team has unconfirmed notice that there will soon be a new payed group called \"Illuminati.\" It will be an invite only group, and has been purchased by [url=http://hackforums.net/member.php?action=profile&uid=1007343]BELLAGIO[/url]. \"The illuminati is based on marketing, monetizing, selling, buying, trading, currency exchanging, free services & giveaways. In addition to the supposed shadowy and secret organization we are just overall into helping those who desire the passion of making money online & offline.\" See the thread here: [url=http://goo.gl/01NdH]http://goo.gl/01NdH[/url]\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=734805][b][color=white]Glassy[/color][/b][/url] has reached 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=#FFD700]Slayher[/color][/b][/url] was rep fucked because he asked Omniscient if he was approved for UB3R without waiting 60 days.\n[url=http://hackforums.net/member.php?action=profile&uid=542514][color=black][b]Akash[/b][/color][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=415606][color=black][b]Emporer[/b][/color][/url] was banned for excessive scam reports.\n[url=http://hackforums.net/member.php?action=profile&uid=114470][color=black][b]F4T4L 3RR0R[/b][/color][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=200751][color=black][b]Zach[/b][/color][/url] has requested to have his account closed.\n[url=http://hackforums.net/member.php?action=profile&uid=454666][color=black][b]adampelletgun[/b][/color][/url] was banned for cross posting.\n[url=http://hackforums.net/member.php?action=profile&uid=394403][color=black][b]Old.[/b][/color][/url] was banned for multiple accounts.\n[url=http://hackforums.net/member.php?action=profile&uid=496906][color=black][b]Amp™[/b][/color][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=526277][color=black][b]Mr. Potato Head[/b][/color][/url] was banned and rep fucked for abusing the reputation system.\n[url=http://hackforums.net/member.php?action=profile&uid=738154][color=black][b]MLD[/b][/color][/url] was banned for rep fuck complaining.\n[url=http://hackforums.net/member.php?action=profile&uid=931148][color=black][b]Gυap[/b][/color][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=762186][color=black][b]Naxian[/b][/color][/url] was banned for UB3R junk abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=898134][color=black][b]Uzi‍[/b][/color][/url] was banned and rep fucked for assisting a ban evader.\n[url=http://hackforums.net/member.php?action=profile&uid=330676][color=black][b]Diabolic[/b][/color][/url] has requested to be banned while on vacation.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]AIM Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2233957]Just so you know...[/url] - [url=http://hackforums.net/member.php?action=profile&uid=323740][color=white][b]Positive[/b][/color][/url] - As Positive is well known around the forum and is a co-leader of Techsperts, it is important that many know his AIM has been stolen.\n\n[i][b]Marriage Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2252685]Crow got married. :)[/url] - [url=http://hackforums.net/member.php?action=profile&uid=91531][color=#0066FF][b]ven0m[/b][/color][/url] - As Crow is one of the most known members on the forum, for being one of the oldest and an ex-admin. He has recently gotten married!\n\n[i][b]Vulcan Thread[/b][/i] - [url=http://vulcantools.net/]Vulcan Tools[/url] - [url=http://hackforums.net/member.php?action=profile&uid=422270][color=white][b]Kill4joy KJ-Vulcan Tools[/b][/color][/url] - While this isn't a thread, Vulcan Tools has many threads on Hack Forums. These guys are providing free high quality software for the consumer. Check it out!\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Groove1337[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Groove! Thanks for taking the time out for this interview! Before we begin, would you like to give a shoutout to any special members?\n[b][color=#1466ff]Groove1337[/color][/b]: I'd like to give a shout out to -Elision- who just bought http://www.NetFlirts.com with me, hopefully this is the start of something great.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Can’t wait to check it out! I assume it will be a dating site of some sort. To start us off, what lead you to Hack Forums and why did you like it enough to stay?\n[b][color=#1466ff]Groove1337[/color][/b]: I remember finding hackforums once via google when searching for something back in 2008, I shamefully found it, leeched it and never looked back until I came upon it again in 2009, this time I made an account and had a read, I didn’t get active until last year really where I bought leet and started trying to contribute – moved up to Ub3r soon after. The reason I stay is because behind all of the junk there is some very good info here as well as some great people.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  I see! It’s interesting how many people join, become inactive, and then come back! I’m surprised your account wasn’t closed! What has changed the most in your 3 years on Hack Forums? I would like to congratulate you on your 3 year anniversary 16 days ago!\n[b][color=#1466ff]Groove1337[/color][/b]: Thanks, I didn’t even notice that :P Well the Ub3r count has gone through the roof, like seriously – I had something like 31 rep and 200 posts when I went for UB3R, not much at all - standards definitely dropped for acceptance but what a profile tells you at face value is sometimes very different to the mind behind it so it's not a bad thing in a lot of cases. The SE section is gone, I find this a great shame and wish Omni had just assigned some moderators to it – I’d have happily sat there moderating it.  \n\n[b][color=#1466ff]Michael Westen[/color][/b]: I agree, though they did blow both their first and second chances. Speaking of which, I see you're very active in the e-whoring section, would you consider it a hobby or a passion? Both?\n[b][color=#1466ff]Groove1337[/color][/b]: Yeah, it was the only section I could really contribute to until I got into SE, I started with Facebook packs and then moved onto E-Whore collections – definitely a Hobby, I don’t actually do it very much – was useful at Christmas to buy those damn rip off Uggs for the girlfriend though.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: From what I hear, the people who usually purchase pictures have become much smart which is ashame. What's your favorite activity outside of HF?\n[b][color=#1466ff]Groove1337[/color][/b]: I’m a very keen rugby player, in the 1st team for my University.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That’s awesome! I’ve only played a few times and left pretty banged up. What about your favorite food?\n[b][color=#1466ff]Groove1337[/color][/b]: Chinese food, hands down.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I’m beginning to like you more and more. Kung pao chicken! If you could change one thing on HF, what would it be?\n[b][color=#1466ff]Groove1337[/color][/b]: Bringing the SE section back for a 1 week trial and letting a team moderate it with an evaluation at the end of the week. \n\n[b][color=#1466ff]Michael Westen[/color][/b]: If only Omni was open to this, it was a valuable section but unfortunately people can’t follow the rules! Rules are important, especially on HF! Where do you see yourself in 5 years?\n[b][color=#1466ff]Groove1337[/color][/b]: I’ll have finished my degree and will be working for a very big technology company hopefully, (won't name for obvious reasons) I have a year long work placement with them next year.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  That sounds great, I’ll be attending college next year and I plan on majoring in networking! Before we wrap this up, do you have any closing words for the readers?\n[b][color=#1466ff]Groove1337[/color][/b]: Not really, thanks for reading and if you ever need any help or advice with anything then I’m only a PM away.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Vizixify[/font][/size][/color][spoiler=]\n[b][color=white]Paradise.[/color][/b]: Hey, Vizixify! Glad you could take the time to have this interview with me!\n[b][color=#1466FF]Vizixify[/color][/b]: Hello! I'm happy to be interviewed!\n\n[b][color=white]Paradise.[/color][/b]: Great! Now before we start; is there anyone you'd like to get a shoutout to?\n[b][color=#1466FF]Vizixify[/color][/b]: That shoutout probably got to go to Click Me, an awesome internet friend!\n\n[b][color=white]Paradise.[/color][/b]: I've seen him around the Minecraft section, I hear he's a great coder! How did you get your alias, \"Vizixify\"? I remember when I first talked to you, I didn't even know how to pronounce it!\n[b][color=#1466FF]Vizixify[/color][/b]: Hehe, thanks! My name originates from my Youtube channel which I had to make sooner or later. To be honest though, I just bashed random characters until I got a decent one!\n\n[b][color=white]Paradise.[/color][/b]: Cool! So what do you think about the recent staff changes? Such as ReactionZ going from Mentor to Staff in such a small amount of time, and Factior8 being promoted to Administrator?\n[b][color=#1466FF]Vizixify[/color][/b]: In my opinion, it's honestly not that big of a deal. As long as they're doing what they're supposed to do, it's OK.\n\n[b][color=white]Paradise.[/color][/b]: Mhmm. So, what's your favorite section within Hack Forums, and why?\n[b][color=#1466FF]Vizixify[/color][/b]: That has to be the griefing section. I've stated my opinion on it before, and I'll do it again. For me, the griefing section is a completely different community than most other sections. Since the griefing section is where I started, I really got to know the people there. 90% of my posts are from the griefing section, just because I know everybody there, and I think it's rough trying to get used to a new community, and that's why rarely post outside of the section.\n\n[b][color=white]Paradise.[/color][/b]: Hmm. I sometimes hang out there, but I have heard a lot of contraversity within the Griefing section. People thinking it's going to get removed, people saying how low quality it is, etc... What are your thoughts on those rumours and statements?\n[b][color=#1466FF]Vizixify[/color][/b]: To begin with, the Minecraft section got flooded with griefing threads. In fact, there was rarely any threads unrelated to griefing there. That's why Omni made the griefing section; to give legit Minecraft players a chance in the Hackforums community as well.\nI seriously doubt that it's going to get removed, just because it will start the same disaster that nobody wanted. That's my thoughts though, albeit it's not likely to happen.\n\n[b][color=white]Paradise.[/color][/b]: I never knew that. I thought it was added just because it's a whole new \"dimension\" of Minecraft. Griefing. Now, outside of Hack Forums and Minecraft what are some hobbies of yours?\n[b][color=#1466FF]Vizixify[/color][/b]: I'm in to computer programming, or, coding. I started learning Java 5-6 months ago, and I think it's gone pretty good. Out of all the programming languages, I'd prefere Java. If you're new, however, some might say it's easier to start off with either C++ or C#, that's down to your personal preferences.\n\n[b][color=white]Paradise.[/color][/b]: Oh cool, I've seen you code. You're an amazing coder! Anything you do such as sports, be a player, etc?\n[b][color=#1466FF]Vizixify[/color][/b]: Not really, I've never been a sports player. However, I did some fighting sports some years ago. It was fun, I suppose. I quit about 1 year after I started, just because it took too much time as I had to drive for several hours back and forth, each day. That's the only reason I quit. I guess I would've quit anyway, but not that early.\n\n[b][color=white]Paradise.[/color][/b]: Oh, I see. Well, I think that I've talked about everything I've wanted to talk about. Anything you want to discuss? If not, feel free to wrap up the interview with anything!\n[b][color=#1466FF]Vizixify[/color][/b]: Yes there is! I'd like to thank every moderator/administrator for keeping this forum as clean and simple as it is today. This is by far the best forum I've ever participated in!\nThat pretty much sums it up.\n[/spoiler]\n",
      "subject": "[2/29/12] - HF News"
    },
    {
      "pid": "20384044",
      "uid": "515249",
      "dateline": "1330571837",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Davy Jones Died[/b][/color]\nFormer Monkees lead singer past away this week.  Davy join the Monkees in 1965 and had a wide variety of popular songs such as \"I'm a Believer' and 'Daydream Believer'.  He passed away at the age of 66 due to a heart attack near his horses, which were his life passion.\n\n[color=white][b]Egypt Opens Doors[/b][/color]\nEgypt has recently decided to lift the travel bin in US allowing Americans to enter and leave, most likely to reconcile with USA back from the crisis.  Currently 7 Americans are trapped in Egypt but have been moved to the US embassy.  News was released that a military plane landed in Egypt earlier in effort to bring the Americans back home.\n\n[color=white][b]North Korea and US agree on Nuclear Halt[/b][/color]\nEarlier Wednesday, North Korea agreed on stopping their nuclear weapon testing to allow UN inspectors to return.  This will also aid in the reconciliation between US and N. Korea after all these years of tension.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[color=white][b]iPad 3:[/b][/color]\nThe iPad 3 finally has a planned event. After months and months of rumors and speculations, the iPad 3 which is set to be introduced on March 7th. The iPad 3 according to [MacRumors] is to be thicker than the iPad 2. Also it seems with the photos from Apple’s invite that the iPad 3 has no home button. This could mean new gestures that for the iPad button and maybe we can see more innovation from Apple.\n\n[color=white][b]iTV:[/b][/color]\nNow that the iPad 3 has been announced, there is another thing that is pointing to a showcase of a new Apple TV. It could be a update to the old little box of the original Apple TV or maybe a revolutionary new TV that will change what we know of the TV today. The event on March 7th could be the release of 2 new products from Apple.\n\n[color=white][b]Stocks:[/b][/color]\nApple’s stock skyrocketed today. Apple is now worth half a TRILLION dollars. Yes, half a trillion! 1 stock for Apple now is about 525 dollars. Apple surpassed EXXON as being the biggest company on the market. With this rapid growth maybe Apple one day will reach a trillion dollars. Its already growing a lot daily, maybe with all this money; Apple will bring in things that no one has ever seen or dreamed of.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]Record Broken[/b][/color]\nAdele's album \"21\" celebrated its 21st week at No. 1 on the billboards. This is the longest command for an album by a woman in the chart's 56-year history.\n\n[color=white][b]Good Girls[/b][/color]\nCarrie Underwood released another song warning against unseemly male figures in \"Good Girl\", her newest single released Thursday February 23rd, 2012.\n\n[color=white][b]Whitney Houston and Youtube[/b][/color]\nWhitney Houston's Youtube and Vevo videos are in high demand. Her view count increased by 4,523% last week. She went from 868,000 views to 40.2 million views in the week ending February, 20th.\n\n[color=white][b]Return Of A King[/b][/color]\nBruce Springsteen will be on \"Late Night With Jimmy Fallon\" for a week-long tribute as part of the release of his new album, \"Wrecking Ball\".\n\n[color=white][b]Music Videos of the Week[/b][/color][spoiler=]\n[yt]http://www.youtube.com/watch?v=OZLUa8JUR18&ob=av3e[/yt]\n[yt]http://www.youtube.com/watch?v=fN-xq7t6pKw[/yt]\n[yt]http://www.youtube.com/watch?v=At-YPyVW9R8&ob=av2e[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nWell, this week a rather expensive object that I had purchased was stolen right off my front step. I got to thinking, and wondered why anyone would do that, take something that was unknown from an unknown. This led to me thinking about piracy, and how often it is done. Now, I'm not saying that you should feel shamed for piracy, I'm just going to say that I think you should think about what you pirate. If you really enjoy it, you should try to actually purchase it from the owner, or in some way, make a contribution to the company. Just a thought.",
      "subject": "*"
    },
    {
      "pid": "20384057",
      "uid": "515249",
      "dateline": "1330571877",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"What do you think of Hack Forums' theme?\"\n\n[i]\"I think HackForums theme is great. I can be reading many thread\nduring the day without getting irritated in my eyes of the colors. When \nOmniscient add something new he always adds something very smexy. \nThe theme is very unique too. You won't find a theme a round that looks \nlike Hacksfourms without it's inspired by our theme. Omniscient did a good \njob as always!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=130447][i]-Tobe[/i][/url]\n\n[align=right][i]\"I think the HackForums theme needs a little upgrading. It's \nfine for a low traffic site, but it's blown up now. I'm sure Omni could get an \nHF member to really make some amazing graphics for him. I really think the \nlogo and colors should be changed a little.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=822426][i]-iHaX™[/i][/url][/align]\n\n[i]\"Personally, I believe that the theme is great at the state it is right now. \nHowever, I feel many \"veterans\" of Hack Forums want something fresh and \nnew, and the newer members are more impartial because they have not been \nin the site for as long. A new theme wouldn't be a bad thing in my opinion, \nespecially with the 5 year anniversary coming up. As I said before, the theme \nis great right now, but a fresh look wouldn't be bad either.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=933453][i]-Elite_Sniper[/i][/url]\n\n[align=right][i]\"I like the current theme that Hackforums employs. It makes the \nwebsite look clean, slick and best of all; professional. Everything is in it's place \nand it looks very neat and tidy. The grey color makes the site have a neutral \nlook which is good since it does not look too hard on the eyes if you are viewing \nin the night, and the absence of bright colors and colourful ads makes the site look \nlike it is run by someone who wants to maintain a high standard, which Omni certainly \ndoes.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url][/align]\n\nThe topic for next week is \"Which do you prefer? Moderation or Staff, why?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/BwLGG.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3035666_460s.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3019872_460s.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=aFEec51mJY0[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=657392][color=white][b]Astonish is NJ[/b][/color][/url] received The Protector award.\n[url=http://hackforums.net/member.php?action=profile&uid=964299][color=white][b]Purple Haze[/b][/color][/url] recieved the Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=964299][color=white][b]Purple Haze[/b][/color][/url] received the RAT Expert award.\n[url=http://hackforums.net/member.php?action=profile&uid=815887][color=white][b]-=Conqueror=-[/b][/color][/url] received The Protector award.\n[url=http://hackforums.net/member.php?action=profile&uid=1007343[color=white][b]BELLAGIO[/b][/color][/url] received The Hustler award.\n[url=http://hackforums.net/member.php?action=profile&uid=1007343[color=white][b]BELLAGIO[/b][/color][/url] recieved the Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=934193[color=white][b]Minnesota Nice[/b][/color][/url] received The Alien award.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Innocence.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}