{
  "posts": [
    {
      "pid": "14622978",
      "uid": "79121",
      "dateline": "1313252558",
      "message": "[align=center][img]http://goo.gl/PE0VI[/img][/align]\r\nThe edition you are currently reading is the [b][color=#ff00d2]54th full edition[/color][/b]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\r\n\n[align=center][img]http://goo.gl/ioi0J[/img][/align]\r\n\n[url=http://goo.gl/kmeck][color=lime][b]Richie[/b][/color][/url] and [url=http://goo.gl/ll1vu][color=lime][b]T3h Hack3r[/b][/color][/url] have been recently promoted to Probational Staff. We wish them a hearty congratulations and best of luck with their newly added responsibilities.\r\n\n[url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] has recently updated the forum to MyBB 1.6.4. He has stated that you do not report any bugs and problems until he is completely finished with the update. Read his thread [url=http://goo.gl/wzkY8]here[/url].\r\n\n[url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] has now enabled post in all sections of HackForums. This is the result of the feedback given by [url=http://goo.gl/5FhRS]Hуѕтєяιa X™[/url] which can be read [url=http://goo.gl/BnHoK]here[/url].\r\n\nAs the result of the post count being enabled in all sections, the minimum post length has been increased from 25 to 50 characters and the LQP warning has been increased from 10 points per month to 25 points per month. You can read more about it [url=http://goo.gl/4oWmB]here[/url] and [url=http://goo.gl/BSzuO]here[/url] respectively.\r\n\nThis week, there have also been some changes pertaining to the warning levels. You can read more about it [url=http://goo.gl/3GtIw]here[/url].\r\n\n[url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] has introduced new usertitles and post ranks. You can read more about it [url=http://goo.gl/3jjFW]here[/url].\r\n\n[url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] has made a new rule regarding signature goals. It states that no user is allowed to have site goals or achievements in the signature this includes but not limited to posts, reps, upgrades, and groups memberships. You can read more about it [url=http://goo.gl/09xW8]here[/url].\r\n\n[url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] has now removed the Testing sub-section which was located under the Introductions section.\r\n\n[url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] is working towards upgrading HackForums to the latest MyBB (1.6.4). He also plans to upgrade HackForums' MySQL version to 5.6. This news can be read [url=http://goo.gl/5SJ6T]here[/url].\r\n\nThe many mistakes members have found in the help documents have been fixed by [url=http://goo.gl/NJBuF][b][color=#4DD0FC]Crow[/color][/b][/url]. For a much needed read for some members, the help documents are located [url=http://hackforums.net/misc.php?action=help]here.[/url]\r\n\nA new section has been added to the Marketplace - [url=http://goo.gl/Zhv3M]Member Auctions[/url] and a new sub-forum has been added under the Marketplace Discussions - [url=http://goo.gl/XLhFl]Appraisals and Pricing[/url]. Guidelines on how to use these two sections have been created in their respective places.\r\n\nAfter [url=http://goo.gl/LgKfu][b]Hуѕтєяιa X™[/b][/url] gave his opinion about the post count removal in some sections; [url=http://goo.gl/XSV0p][b][color=#4DD0FC]Omniscient[/color][/b][/url] gave him a post count of 355,323,000. While he no longer has a post count of this extremity after Omniscient removed it, many members gave him reputation for it. There is also picture proof [url=http://goo.gl/3YoPj]here[/url] and [url=http://goo.gl/jJ5Tq]here[/url].\r\n\n[url=http://goo.gl/oB1hp][color=lime][b]cobija[/b][/color][/url] and [url=http://goo.gl/m7JDw][color=lime][b]Factor8™[/b][/color][/url] have repfucked each other. This was a result of a troll. They thought that it would not actually work since they were under the impression that staff can not repfuck each other. So, [color=lime][b]Factor8™[/b][/color]went first and repfucked [color=lime][b]cobija[/b][/color] and as we can see, it did work!\r\n\nWhat has happened before has happened again, but now to [url=http://goo.gl/oDopi][b]Ethereal[/b][/url]. He was wrongly repfucked by our head administer, [url=http://goo.gl/q9Qcg][color=#00BFFF][b]Omniscient[/b][/color][/url]. Omniscient mistakenly repfucked Ethereal, whereas he was meaning to repfuck [url=http://goo.gl/rzfO4][color=black][b]Mike.[/b][/color][/url] Omniscient has made a public announcement apologizing to Ethereal; You may read it [url=http://goo.gl/C9pmY]here[/url].\r\n\nDue to what happened above, [url=http://goo.gl/q9Qcg][color=#00BFFF][b]Omniscient[/b][/color][/url] recently gave himself the asswipe award for his mistake.  Everyone makes mistakes and we can all imagine the great deal of stress he must go through to keep the forums running.  I'm sure Ethereal has forgiven him for the mistake.\r\n\n[align=center][img]http://goo.gl/yNv17[/img][/align]\r\n\nOn 8/06/2011, our beloved user [url=http://goo.gl/phwSu][b]Qwazz[/b][/url] was given the Diamond award.  This is truly an accomplishment and he is 1 out of the 13 members who have received this award.  View a complete list of all have have gotten this honorable award [url=http://goo.gl/h6Gll]here[/url].  \r\n\n[url=http://goo.gl/XeeeM][color=#0066FF][b]χтяємє™[/b][/color][/url] celebrated his 18th birthday on 8/08/2011.  We wish him a happy birthday and the best of luck throughout the rest of his life as an adult!\r\n\nAfter [url=http://goo.gl/93zqU][color=black][b]xvisceral[/b][/color][/url]'s resignation from BlackShades, he decided to permanently close his account.  His effort in the marketplace will not be forgotten and he was truly a great business man.  \r\n\n[url=http://goo.gl/w16uB][b]C4Vendetta[/b][/url] has been promoted as leader of Graphic Masters, after recovering his account from the dead group.\r\n\n[url=http://goo.gl/XQm7E][b]A N D R E W[/b][/url] recently got the Militant award.  This is definitely a great achievement for him due to the fact that only 9 users have ever received this award!  Find the full list of users who have received the Militant reward [url=http://goo.gl/a6G1O]here[/url].  \r\n\n[url=http://goo.gl/hDhXH][b][color=#0066FF]Atthackers[/color][/b][/url] has received the gamer award because he gave [url=http://goo.gl/q9Qcg][color=#00BFFF][b]Omniscient[/b][/color][/url] a game for his birthday according to his award description. If you would like ot view to full list of this award’s recipients of this award, please go [url=http://goo.gl/LrV51]here[/url].\r\n\n[url=http://goo.gl/Onpol][b]iNviZ[/b][/url] has received the Da Bomb award for administer reason, “Nothing better than meth heads dancing to 80's tunes.” To see the complete list of recipients, please go [url=http://goo.gl/DfBVC]here[/url]. \r\n\n[url=http://goo.gl/o0rdF][b]Brawl[/b][/url] has received the Master Donator for his generous donations. Such members and donations are what keep HackForums standing. We thank him and others for these donations. To see all grateful members with this award, please go [url=http://goo.gl/tnflI]here[/url].\r\n\n[url=http://goo.gl/CMKEi][b]Oxid[/b][/url] has received the Drunk award from Omniscient shortly after the MyBB 1.6.4 update. To see all recipients of this award, please go [url=http://goo.gl/jPZU0]here[/url]. \r\n\n[b]This weeks Bans, Limitations, & Repfucks.[/b]\r\n\n[b]Repfucks[/b]\r\n[list]\r\n[*][url=http://goo.gl/erfFu][color=lime][b]Cobija[/b][/color][/url] got repfucked twice by Factor8™.  \r\n[url=http://goo.gl/bg65m][color=lime][b]Factor8™[/b][/color][/url] got repfucked by Cobija.  \r\n[*][url=http://goo.gl/rzfO4][color=black][b]Mike.[/b][/color][/url] was also repfucked for insulting [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url].\r\n[*][url=http://goo.gl/wXuw][color=#0066ff][b]Mike.[/b][/color][/url] has also been repfucked due to possible confusion between staff. He may have been confused with this [url=http://goo.gl/rzfO4][color=black][b]Mike.[/b][/color][/url]\r\n[/list]\r\n\n[b]Limitations[/b]\r\n[list]\r\n[*][url=http://goo.gl/L5CL5][color=red][b]Tate[/b][/color][/url] has gotten limited for re-posting previously removed threads by staff.  \r\n[*][url=http://goo.gl/TsXMo][color=black][b]S70N3R[/b][/color][/url] was limited for Flaming, Threatening, or Harassing. He was later banned for a 100% Warning level\r\n[*][url=http://goo.gl/VWHhc][color=red][b]Orgasmic[/b][/color][/url] was limited for Flaming, Threatening, or Harassing as well as Low Quality Posting.\r\n[*][url=http://goo.gl/jJ8lR][color=red][b]DeMeR[/b][/color][/url] was limited for unknown reasons.\r\n[/list]\r\n\n[b]Bans[/b]\r\n[list]\r\n[*][url=http://goo.gl/q6ybO][color=black][b]Taiga[/b][/color][/url] got banned for low quality posting.  \r\n[*][url=http://goo.gl/rzfO4][color=black][b]Mike.[/b][/color][/url] was banned for insulting Omniscient.\r\n[*][url=http://goo.gl/dqgri][color=black][b]Justin Bieber[/b][/color][/url] was permabanned for posting adult content publicly.\r\n[*][url=http://goo.gl/vrVD6][b]HakkuR[/b][/url] was permabanned by Omniscient, but then was unbanned shortly afterwards.\r\n[*][url=http://goo.gl/QNC2F][color=black][b]Skrillex[/b][/color][/url] was banned for Low Quailty Posting.\r\n[*][url=http://goo.gl/CAkBR][color=black][b]Tsgh Mike[/b][/color][/url] requested a Vaction Ban.\r\n[*][url=http://goo.gl/OjpIU][color=black][b]Reverse[/b][/color][/url] was banned for Reputation Abuse.\r\n[/list]\r\n\n[align=center][img]http://goo.gl/dhA6A[/img][/align]\r\n\n[align=center][size=medium][color=#00BFFF]Anonymous and Facebook[/color][/size][/align]\r\nRecently, the media has been abuzz with news that [b]Anonymous[/b] plans to target [b]Facebook[/b] because it has been \"selling information to government agencies and giving clandestine access to information security firms so that they can spy on people from all around the world\". The supposed [url=http://goo.gl/4jn7i][color=#FFDAB9]message from Anonymous[/color][/url] states that they will be launching their attack on [b]November 5[/b] because it is [b]Guy Fawkes Day[/b], which commemorates a failed plot to blow up England's House of Lords in 1605. But the owners of [b]@anonops[/b], [url=http://goo.gl/fVfqz][color=#FFDAB9]have stated[/color][/url] that the attack is not organized by Anon, but by a few of its members who stand for the cause. Whether this is true or not is yet to be confirmed. For more information, you can browse through [url=http://goo.gl/qt1rG][color=#FFDAB9]this article[/color][/url] on PCMag.\r\n\n[align=center][size=medium][color=#00BFFF]The Stolen iPhone 4: 1 Year Later[/color][/size][/align]\r\nAfter more than a year of hassles and uncertainty, the case of the stolen iPhone 4 has been brought to some sort of conclusion. San Mateo County Assistant District Attorney [b]Morley Pitt[/b] announced that charges would not be filed against Gizmodo’s [b]Jason Chen[/b], who has been under the heat since the police raided his house in April 2010.\r\nOn the other hand, Brian Hogan and Sage Wallower, who found Apple's little gadget at a bar will be fined and may face up to a year in jail. There's justice for you. For more to read on this, you can check out the article [url=http://goo.gl/shnep][color=#FFDAB9]the article[/color][/url] posted on USAToday.\r\n\n[color=#00BFFF][size=medium][align=center]London's Burning: The English Riots[/align][/size][/color]\r\nRiots have spread across England after police lost control over what was a peaceful protest demanding further investigation involving the fatal shooting of a young male. 29 year old Mark Duggan was shot dead by police in Tottenham on the 4th of August, however the warrant for his arrest isn't fully understood though Police state the arrest was issued under “Operation Trident” an investigation unit situated in London that specialises in gun and drug crime. Friends and relatives of the alleged gang dealer claim that Duggan was unarmed at the time of the shooting though Police revealed information that Duggan was armed with a loaded handgun. Media has widely reported that a distinct police issue bullet has been found embedded within a police radio despite the fact there has been no hard evidence that any shots were fired from the gun Mark Duggan was carrying.\r\n\nA protest was held by friends and relatives of Mark Duggan in a request for justice for the recently deceased friend and family member of which has not yet be proven of any crime. The March lead over 200 protesters to Tottenham, this continued with a 3 hour wait for response from Police. After no significant statements were given in regards to the death of Mark Duggan the crowd soon turned violent and rioting broke out across Tottenham.\r\n\nOver the following days the riots had spread across England. Numerous accounts of vandalism, arson, theft, and violent disorder were reported as Police desperately tried to keep the situation under control. Undeterred by 111 cases of injured officers in the “protests”, Police sectors across the country persisted with their duty, already making over 1000 arrests. As the riots worsened and although already holding this power, police have now been “authorised” to use rubber bullets and water canons against anyone who continues to commit further criminal acts, this authorisation was given by a furious Prime Minister, David Cameron who was forced to cut (yet another) holiday short to settle the issue. \r\n\nOpinions have been shared as to how things lead up to the current events, including rumoured contributory factors such as high unemployment, economic crisis and gang culture. Although these may not be true some authority and order seems to have been regained. The streets seem quieter for the time being and people can begin to rebuild their homes, businesses and lives.\r\n\nThe riots caused four people to loose their lives as well as hundreds of people injured. \r\nArrests continue to be made.\r\n[spoiler=Brief Summary of Events]\r\nRiots have spread across England after police lost control over what was a peaceful protest demanding further investigation involving the fatal shooting of a young male. 29 year old Mark Duggan was shot dead by police in Tottenham on the 4th of August, however the warrant for his arrest isn't fully understood though Police state the arrest was issued under “Operation Trident” an investigation unit situated in London that specialises in gun and drug crime. Friends and relatives of the alleged gang dealer claim that Duggan was unarmed at the time of the shooting though Police revealed information that Duggan was armed with a loaded handgun. Media has widely reported that a distinct police issue bullet has been found embedded within a police radio despite the fact there has been no hard evidence that any shots were fired from the gun Mark Duggan was carrying.\r\n\nA protest was held by friends and relatives of Mark Duggan in a request for justice for the recently deceased friend and family member of which has not yet be proven of any crime. The March lead over 200 protesters to Tottenham, this continued with a 3 hour wait for response from Police. After no significant statements were given in regards to the death of Mark Duggan the crowd soon turned violent and rioting broke out across Tottenham.\r\n\nOver the following days the riots had spread across England. Numerous accounts of vandalism, arson, theft, and violent disorder were reported as Police desperately tried to keep the situation under control. Undeterred by 111 cases of injured officers in the “protests”, Police sectors across the country persisted with their duty, already making over 1000 arrests. As the riots worsened and although already holding this power, police have now been “authorised” to use rubber bullets and water canons against anyone who continues to commit further criminal acts, this authorisation was given by a furious Prime Minister, David Cameron who was forced to cut (yet another) holiday short to settle the issue. \r\n\nOpinions have been shared as to how things lead up to the current events, including rumoured contributory factors such as high unemployment, economic crisis and gang culture. Although these may not be true some authority and order seems to have been regained. The streets seem quieter for the time being and people can begin to rebuild their homes, businesses and lives.\r\n\nThe riots caused four people to loose their lives as well as hundreds of people injured. \r\nArrests continue to be made.\r\n[/spoiler]\r\n\n[align=center][img]http://goo.gl/6IYJU[/img][/align]\r\n[spoiler=][img]http://goo.gl/mp4fH[/img][/spoiler]\r\n[i][size=x-small][url=http://goo.gl/qJLjp]Vanquish`[/url][/size][/i]\r\n\n[align=right][spoiler=][img]http://goo.gl/y6DOA[/img][/spoiler]\r\n[i][size=x-small][url=http://goo.gl/JpkHr]hansen[/url][/size][/i][/align]\r\n\n[spoiler=][img]http://goo.gl/nnRqn[/img][/spoiler]\r\n[i][size=x-small][url=http://goo.gl/BOCG4]Element[/url][/size][/i]\r\n\n[align=right][spoiler=][img]http://goo.gl/FlFPD[/img][/spoiler]\r\n[i][size=x-small][url=http://goo.gl/w16uB]C4Vendetta[/url][/size][/i][/align]\r\n\n[align=center][img]http://goo.gl/ZwReH [/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - Richie[/font][/size][/color][spoiler=]\r\n[b][color=white]Positive:[/color][/b] Thanks Richie for letting me interview you for the 54rd edition of HF News. Anything you have to say before we get started?\r\n[b][color=lime]Richie:[/color][/b] Thank you for the opportunity.\r\n\n[b][color=white]Positive:[/color][/b] To get things going a bit, why did you join HF?\r\n[b][color=lime]Richie:[/color][/b] Well.. In around June 2009, a rival clan was DDoS'ing my clans ventrilo, meaning we couldn't do clan fights.\r\nI decided to join HF and get a botnet up and running, it never really worked out.\r\nEventually I found the GFX section which kept me here, if I'm honest. I only tried looking for a botnet for about 2 hours then I fell in love with the Graphics area, haha.\r\n\n[b][color=white]Positive:[/color][/b] Dang, you have been here for a long time man. So being here for a long time, anything new happen? Things that you like? Not like?\r\n[b][color=lime]Richie:[/color][/b] Well, the recent rule additions are fantastic, especially the +25 points for Low Quality Posting. I've never really been affected by anything that's been removed.\r\n\n[b][color=white]Positive:[/color][/b] When you got invited via PM by Omni, what was your first reaction?\r\n[b][color=lime]Richie:[/color][/b] It's a bit of a shock, really. I got on at 3AM to talk to some girl on facebook.\r\nI was just chilling and I recieved an e-mail from HF, checked PM's and here I am!\r\nI've never been so nervous, especially over the internet.\r\nMy first reaction was pulling my hands off the mouse! I think I pulled them a bit too high, though.. I've got a lat injury, and it really started hurting haha. I called xerotic on Skype and was talking jibberish. I gladly accepted, of course.\r\n\n[b][color=white]Positive:[/color][/b] You now being staff, what's it like? (I know you can't say much) Being not only able to report, but to warn?\r\n[b][color=lime]Richie:[/color][/b] It's a bit of a shock. I never expected to be put on staff, especially not at 3 in the morning. People have been really friendly, which is nice.\r\n\n[b][color=white]Positive:[/color][/b] Dang. Being here on hackforums, have you made any friends? Any best friends? Enemies?\r\n[b][color=lime]Richie:[/color][/b] I've made many friends over the years, but only a few have stuck. I met Xch4ng3 the day I joined, we used to talk frequently but not as much the last year or so. I've been going on Skype and transformice recently, it's good fun. My best friend on HF would probably be xerotic, he's helped me with loads recently, on-site and off.\r\n\n[b][color=white]Positive:[/color][/b] Well, that's always nice isn't it? He is one of the friendlier staff on HF. Next question. When not on HF, in your spare time, what do you like doing?\r\n[b][color=lime]Richie:[/color][/b] I like hanging out with friends and playing sports. The main thing I've been doing outside of HF is gym/fitness, it's really improved me as a whole. I like doing nerdy things from time to time, like getting my friends to bring their xbox's over or something stupid.\r\nOh, parties are also fun, long story about the last one...\r\n\n[b][color=white]Positive:[/color][/b] Amazing. I have tried doing that stuff many times, I can do it, just not well.\r\nAnyway, have you set any goals besides 'staff' on hackforums? Any set standards?\r\n[b][color=lime]Richie:[/color][/b] I don't really have any statistic/award goals..\r\nI want to be the best staff I can be, though. I guess winning a few Graphics Battles, would be awesome.. when I have some spare time.\r\n\n[b][color=white]Positive:[/color][/b] Cool cool, as I see you are really good at graphics. Do you have any advice for members trying to achieve what you have gotten?\r\n[b][color=lime]Richie:[/color][/b] Don't be something you're not. If you don't enjoy doing something then don't do it. For example, I really enjoy making free GFX for people, but that doesn't mean you should. Do something for the community that you love to do. Most importantly, try stay out of the way of drama/conflict, it's never good.\r\n\n[b][color=white]Positive:[/color][/b] Alright, thanks for that. I try and stay away from the stuff I don't like. I see that you have a HUGE graphics thread. That's a nice contribution to HF. What other contributions have you brought forward to Hackforums?\r\n[b][color=lime]Richie:[/color][/b] I used to do quite alot of free giveaways. If I was ever given money for a piece of GFX I'd give it to an Ub3r. I try and help members whenever they need it, too.\r\nOne of my ad banners was picked by Omni for the new Help Doc, which made me proud.\r\n\n[b][color=white]Positive:[/color][/b] Any shoutouts or comments before we wrap this up?\r\n[b][color=lime]Richie:[/color][/b] Shoutout to all of my Skype friends.. All of the staff members.. and all the Red Lions. \r\nI'd like to say thanks for all the supportive PM's in the last 24 hours. It really does mean alot! And of course all you Red Lions.\r\n\n[b][color=white]Positive:[/color][/b] Well, thank you Richie for letting me interview you for this weeks \"Hackforums weekly news\" (August 7 - 13 2011).\r\n[b][color=lime]Richie:[/color][/b] It's been a pleasure\r\n[/spoiler]\r\n\n[align=center][img]http://goo.gl/AebzK[/img][/align]\r\n[url=http://hackforums.net/showthread.php?tid=1461526][img]http://goo.gl/8r0pM[/img][/url]\r\n[align=right][url=http://hackforums.net/showthread.php?tid=935578][img]http://goo.gl/tQrgg[/img][/url][/align]\r\n[url=http://hackforums.net/showthread.php?tid=1501187][img]http://goo.gl/TPmhj[/img][/url]\r\n[align=center]If you would like to advertise in HF News, please [url=http://goo.gl/TuaBu]PM Cobalt+[/url] for pricing and details.\r\n[img]http://goo.gl/R8LxX[/img][/align]\r\n\n[color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list][*][url=http://goo.gl/kQNfV]Cobalt+[/url]\r\n[/list]\r\n[color=white][b]Publisher's Assistant[/b][/color]\r\n[list][*][url=http://goo.gl/VIJ7W]xerotic[/url]\r\n[/list]\r\n[color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/2TOSE]Joey Tribbiani[/url]\r\n[list][*]Headlines[/list]\r\n[*][url=http://goo.gl/8KlIG]DΣxus[/url]\r\n[list][*]Headlines[/list]\r\n[*][url=http://goo.gl/O8NJY]BlackChaos[/url]\r\n[list][*]World News[/list]\r\n[*][url=http://goo.gl/Ms2su]kyoutu[/url][list]\r\n[*]World News[/list]\r\n[*][url=http://goo.gl/9o5L7]chocothunda[/url][list]\r\n[*]User News[/list][/list]\r\n[color=white][b]Reporters[/b][/color]\r\n[list][*][url=http://goo.gl/FrpHu]Zeon[/url]\r\n[list][*]Head Reporter[/list]\r\n[*][url=http://goo.gl/HseZT]Figaro[/url]\r\n[list][*]Headlines[/list]\r\n[*][url=http://goo.gl/oUEoV]Mr.Kewl[/url]\r\n[list][*]Headlines[/list]\r\n[*][url=http://goo.gl/bm9lH]-BoodyE-[/url]\r\n[list][*]User News[/list]\r\n[*][url=http://goo.gl/vbEM4]Puppy™[/url]\r\n[list][*]User News[/list]\r\n[*][url=http://goo.gl/2vNh9]Decoy[/url]\r\n[list][*]World News[/list]\r\n[*][url=http://goo.gl/mqwu2]Cyber-Security[/url]\r\n[list][*]World News[/list]\r\n[/list]\r\n[color=white][b]Interviewers[/b][/color]\r\n[list][*][url=http://goo.gl/gGUxd]Astonish is NJ[/url][list]\r\n[*]Head Interviewer[/list]\r\n[/list]\r\n[color=white][b]Editors-in-Chief[/b] [/color]\r\n[list][*][url=http://goo.gl/bm9lH]-BoodyE-[/url]\r\n[*][url=http://goo.gl/8tTvB]Deities[/url]\r\n[/list]\r\n[color=white][b]Graphical Editor[/b][/color]\r\n[list][*][url=http://goo.gl/K8gav]panDa.[/url][/list]",
      "subject": "[8/13/11] - HF News"
    }
  ]
}