{
  "posts": [
    {
      "pid": "28390319",
      "uid": "515249",
      "dateline": "1353914723",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#00BFFF][b]119th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[b][color=white]Mobile App Update[/color][/b]\nA couple months ago, there was much talk and discussion on the possibility of the creation of a mobile application for the HackForums community. Following all the discussion, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] ended up creating a thread on the matter, saying that he will be hiring Forum Runner to create an application for the community. The application is to be for both the App Store, and Google Play. Other than a thread created asking for graphics for the app, not much talk happened on the matter, until now. A thread was created on the subject to which [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] replied stating \"I've already paid for it. It's in production.\" The reply can be found [url=http://hackforums.net/showthread.php?tid=3038584&pid=28271897#pid28271897]here[/url].\n\n[b][color=white]Ub3r Emails Disabled[/color][/b]\nIt appears that after a certain amount of abuse from forum members, the Ub3r email feature has been disable by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]! This has come to a shock to many who surely use the email feature on a daily basis. The feature was an Ub3r member only feature and was a great one at that. A statement on the matter from [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] can be found [url=http://hackforums.net/showthread.php?tid=3036801&pid=28308377#pid28308377]here[/url]. Although Ub3r emails can no longer be created for new Ub3r members, those of us who already have an email will still be able to use the feature.\n\n[b][color=white]Microsoft Lifts Restrictions on HF[/color][/b]\nFor those of you who were around at the time, you may remember that Google temporarily flagged HackForums as a possible malicious site or a site with malicious intent. This led to a warning message that popped up for most users as well as Microsoft blocking many aspects for HackForums users, one of which is email use on the site. Furthermore, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] announced a couple days ago that Microsoft has lifted any restrictions on the site which is surely a good thing for those who use Microsoft emails!\n\n[b][color=white]Thread Subscriptions[/color][/b]\nFor those of you that often use the Thread Subscription feature on HackForums, a bit of change has recently developed in it. The primary change to the feature is that the notifications for threads one is subscribed to will be sent via Private Message rather than E-mail as it was prior to the change. Alongside this change to the Thread Subscription feature, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] ended up clearing all current subscriptions to threads as to start from a clean slate. He also stated that he will be implementing stricter guidelines on thread subscription. To read the official statements on the matter, check the official Twitter of HF @HackForumsNet.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=127950][color=#0066FF][b]Rhynorater.[/b][/color][/url] is now a moderator of the Python forum.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=121075][color=black][b].Infinity.[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=946358][color=black][b]New York[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=698572][color=#0066FF][b]Gummybear[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453][color=black][b]Chris[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1206954][b]Nickelodeon[/b][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=946358][color=black][b]New York[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][color=black][b]Chiеf[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=920387][b]Ηades[/b][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=298746][color=black][b]Grammar Rays[/b][/color][/url] was banned.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] received the Gavel of Dredd award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1233686][b]Sandshrew[/b][/url] received the Master Donator and Businessman awards.\n[*][url=http://hackforums.net/member.php?action=profile&uid=746038][b]Christy[/b][/url] received the Master Donator and Star awards.\n[*][url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url] received the Cat award!\n[*][url=http://hackforums.net/member.php?action=profile&uid=121196][b]Natha[/b][/url] received the Brony award, revealing his true sexuality once and for all.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1448109][b]RyanC[/b][/url] is now a leader of Root.\n[*][url=http://hackforums.net/member.php?action=profile&uid=431105][b]Tɦɛ Gʀiɱ[/b][/url] is now a leader of the Marketers.\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] is no longer a leader of The Empire.\n[*][url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url] is no longer a leader of The Empire.\n[*][url=http://hackforums.net/member.php?action=profile&uid=121196][b]Natha[/b][/url] is now a leader of The Empire.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1251587][b]Hazy[/b][/url] is now a leader of The Empire.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=1092339][b]Lemur[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3039479][b]Official Rap Battle Challenge #2[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=398194][color=#0066FF][b]Tyler‌[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=1934990][b]Warning: Don't deal with the member Gant! (Legitti the scammer)[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1554363][color=#FFD700][b]RubyStar™[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=3046176][b]When did you get your l33t?[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1028401]Zanelot[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 119th edition of the HF News, Zanelot! As always, any shoutouts?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: I'd like to give a shoutout to Orgy, BV1, Infection, and Phytrix for having me here.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, thanks for the shoutout, and I'm sure those other members will appreciate it too. You've been a member for well over a year now. What prompted you to begin your HF journey?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: Like most other members, wanting to learn how to hack. My friend stole a runescape account and I was really interested in how he did so, so he directed me towards here. I heard about the site years before when 'php' was talking about it, he owned a runescape private server. Everyone looked up to him, and I did the same. I thrived to be better than him and everyone who has ever hacked. Then I came to my realization, and found an amazing community.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Following on from that, did you ever learn to hack? If so, how and what did you hack? I know there's a thriving market for RSGP, then and now. Have you hacked any RS accounts since, and if so, how much money have you made from it?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: I learned how to use a RAT, (blackshades), but that was about it. I want to learn more, and that I shall do. Yes, I have hacked numerous runescape accounts. All in all I've probably made $2,000-3,000 dollars from it. It was quite an experience for me.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Wow, that's a great turnover. Looking at your post activity, with almost 800 posts in Respawn, it'd be right to assume you are an avid gamer. What games do you play mainly, why, and on which platform?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: The games have varied. When I joined Respawn, I was a mild gamer, but before Respawn, I spent all my summer nights, and school nights, playing Playstation 3, modern warfare 2, or world at war. Now, I'm playing Minecraft, World of Warcraft, very rarely Runescape, Team Fortess 2, Left 4 dead 2, etc, all via PC. Why you ask? Mainly to pass the time. I love making money, but I've been slacking lately. I haven't put forth in effort into making money, so I've been blowing it all on games and what not. I regret it, but I don't at the same time. I've made some amazing friends and I've been tought some amazing things as well.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Yeah, many people don't understand the fun and lessons you can learn from playing games. The stereotype of it being a bad habit is slowly dying, I think. The meaning of human life... it's tossed around a lot, the topic, although there are varying opinions. What do you feel the meaning of life is?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: Life can either be simple or be very complicated, it's whatever you make it, and your preference. Some people want to live a fun and exciting life, and some simply don't. I'm more of a simple man myself. Although my life has gotten extremely complex within the past 3 months, to answer your question, the meaning of life is to come, to see, and to conquer. Veni, vidi, vici. ( It can go numerous ways, although that's how I'd sum it up.)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's definitely a good outlook on it. NASA and the Curiosity Rover have found something groundbreaking, although at the current moment, we are unsure of what it is. What do you think this \"...one for the history books\" is? Read more [url=http://scholarsandrogues.com/2012/11/21/has-nasa-discovered-life-on-mars-if-so-what-are-the-implications/]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: \"This data is going to be one for the history books, it’s looking really good,” Grotzinger said. Honestly, if they found something they wouldn't have a hard time at all keeping it from us. The government can tell us one thing and we'll believe it, so for all we know, if you've saw the movie transformers, those transformers could be real. That movie could be based on something real, but we don't know. Personally I don't think they have found extraterrestrial life, but I'm sure we'll find out eventually.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: You're right about the first part. I'm confident, based of speculation, that there are some strange things NASA has found that we don't yet know about. How long do you think it'll take us to find intelligent life, and what form/intelligence do you think it'll possess?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: There's no telling to be completely honest. They could either be as everyone speculates, and be completely alien like, with a green skin color and saying things such as \"Beep boop beep, beep\" or they could be like us, but evolved, like seeing ourselves in the future. I think our government has found/has evidence of extraterrestrial life, but for the publics safety, they're keeping that information confidential. Personally, I think they'll be extremely similar to us, such as character traits and what not. That's a tough question.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What do you find to be the strong points of HF in particular? What do you think makes it such a thriving community?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: The strong points recently, the marketplace. Reason being is because that's the main sub forum I hear about, or is active 24/7, other than the lounge. Honestly, it's hard telling what makes the people thrive. Some people are purely in it for money, and some are in it for the passion of learning. It varies from person to person. Me personally, I'm around to forum everywhere, whether it'll be currency exchange one day, to a hacking tutorial the next, I try to be everywhere.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I suppose it has something to appeal to everyone, too. Anyhow, what are some weak points that you see in the site and why?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: Some call them veterans, some calling them elders, some call them oldfags. They're slowly quitting, getting repfucked and banned, or turning into scammers. They were the soul of HF and how it got started, and now they're slowing decaying. I feel as if the community is slowly fading away, along with its members. The lounge has always been an issue, and I'm sure it'll stay that one, but it's impossible to fix that without banning hundreds of people a day.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, as the true oldfags depart, a new round of them are born, I suppose. Thanks for your time today Zanelot. Any final thoughts or comments?\n[url=http://hackforums.net/member.php?action=profile&uid=1028401][color=white][b]Zanelot[/b][/color][/url]: Mayonnaise.\nThanks for having me.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1306528]xadamxk[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 119th edition of the HF News, xadamxk has been subject to a close encounter of the 4th kind! Any shoutouts or comments you'd like to make before we continue?\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: Shout out to Grin and Phobix! My iDevice guys. \nTo Tibby (Tibit). And to Natha, because he secretly loves me <3\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: :c Oh well. I've been MIA with other things. How did you get into iDevices and iEverything else?\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: In 2008, I got the iPod Touch 2nd gen (which was WAY too expensive) and a few months later I found out that there was a way to get games that weren't in the app store on them by a method known as \"Jailbreaking\". I started Jailbreaking around the time Blackra1n by Geohot was released. Since then, I've been interested in the 'freeness' of the 3rd party installer that the jailbreak gives you.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: That's about when I joined the jailbreaking game too. I learned that I did NOT want to update my iPod whenever a new software update was released... how did you come to learn more about the iDevice and teach others?\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: I came into learning about iDevices mainly through experience. \nOver the years I've made friends on Jailbreak help pages, twitter, tumblr, even HF. I've read books, and just googled little by little. But over all, experience and learning from mistakes is how i learned most of it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Why do you think the iDevice and Android section needs change? Your thread is one of the largest unacknowledged suggestion threads ever.\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: It's been over a month, and Omni hadn't acknowledged it....\nIt's making me crazy :0\nBut anyhow, if anyone has ever browsed the tablet section (home of androids) they will see that it is full of iPhone and iPad touch threads. Just making the section unorganized and slopy. When iDevice users ask for help, it most likely won't be sen for a while. Where as, if it was posts where it should be, it would have been fixed in minutes. Since the iPads are similar to iPhones, this would clear things up. That covers the iDevice section idea of mine. As for Android, the tablet section seems to be the only place for Android users to converse able android phones and tablets. Making threads about actual tablets unseen. Making \"Android\" have their own section would clear up any confusion as to where to post for them. And my idea regarding both, would be to move the \"iDevice\" and \"Android\" section to the computing section, because where both of the current sections are makes it hard for users seeking help to find. Hoping that Omni will approve the ideas, if not.... I'll just have to try harder the next time around.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: He might just be busy. He has a million projects on his mind (official app, Pow3r, Vouch system) and who knows what else. ._. What do you have to say about the current status of jailbreaks, or rather, the lack of progress thereof?\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: Well the current version of the iPhone software is iOS 6. To jailbreak iOS 5, it took weeks of fuzzing and user debugging in order to find a base exploit. After that, it took the worlds best mobile hacks to work together in order to exploit it. Which took months. iOS patches all of those exploits, and added a new security feature to the kernel, KASLR. This makes it even harder for developer's. iOS 6 is said not to be touched by exploiters, but I know of several developers are working on it. Exploiters/ hackers do have personal life to attend to, and I know an iOS 6 jailbreak will be coming in a few months. Just have to be patient.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: The problem is that CrApple might decide to release iOS 7 by then. But since they can't come out with any new devices until they get a new battery manufacturer, it might not happen for a long time. \nHow did you get involved in Empire and 143? What has it been like there?\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: If Apple does release iOS 7 by the time the hackers have exploits needed, then odds are that the exploits used will still work. \nRegarding the group known as the Empire. I saw when the Empire and Creed groups were added months ago. So I look into it. When the Empire started recruiting a month or two later, I applied. Spent a good 2-3 hours on my application. Did my best to make it show I spent time on it and be unique. I used a few other methods to get it shown to Tibit, but I'm not going to talk about those. And I've been in ever since. Regarding the group of 143, I honestly don't know why I was added. I got a PM from Daisy one day and I accepted the invite. 143 is full of friends and seems like family. I've enjoyed both groups, each have had their fair share of drama. But all in all, I'm glad I'm in both groups.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Your friends are leaders of the groups... did you get to know them through the group or outside of group forums?\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: I am only on 3 forums. Hack Forums, Surf Mac, and Myrepospace. \nI never knew anyone before hackforums. \nI just act as respectful and nice to members, as long as they are to me. \nAnd I suppose it's just been time and many iMessages that I have the friends I do. \nI must say, I've made MANY friends here on Hack Forums.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Friends keep you sane... or their insanity coupled with your own will do the same. Any closing comments or things you'd like to say to wrap things up?\nI know Omni is busy, and this could be a few hour change, but I will wait and continue to voice my opinion. \n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=white][b]xadamxk[/b][/color][/url]: http://goo.gl/K2Ewo\n[/spoiler]",
      "subject": "[11/25/12] - HF News"
    },
    {
      "pid": "28390320",
      "uid": "515249",
      "dateline": "1353914736",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=white][b]Xbox TV[/b][/color]\nWhats next for Microsoft? Xbox TV may be it. Microsoft are building a set-top Xbox according to sources in Redmond. It's a low cost next generation alternative that will compete with Apple TV. The box is said to always stay ON, allowing quick access to entertainment. Sources say it's lined up to be revealed in 2013 with a scheduled launch in the pre-holiday season. Microsoft loves to keep consumers guessing. \"Xbox 360 has found new ways to extend the console lifecycle by introducing controller-free experiences with Kinect and re-inventing the console with a new dashboard and new entertainment content partnerships,\" Microsoft told The Verge in an official statement. \"We are always thinking about what is next for our platform and how to continue to defy the lifecycle convention.\"\n\n[color=white][b]Black Ops II Patch[/b][/color]\nThe hottest game to hit consoles this year received it's first patch. You can view the patch notes below - many glitches were fixed.\n\n[size=small]- Made infrastructure and performance improvements to Live Streaming.\n- Made streaming performance improvements to video playback in CODTV.\n- Addressed an issue where flight range parameters for airborne vehicles could be deleted in the middle of a match due to a network interruption.\n- Escort drone flying under the map\n- Inability to call in the Dragonfire\n- FHJ-18 weapon level is now increased by destroying Scorestreak vehicles and aircraft.\n- Care Package/AGR canister exploit has been addressed.\n- Patched a small map exploit in Aftermath.\n- Addressed a rare situation that would cause the Emblem Editor menu to overlap other menus.\n- Balance pass on spawn influencers to improve cases causing non-optimal spawning under certain conditions.\n- Improved performance for emblem uploads to prevent an occasional hang. If there is an error connecting to servers during an upload, you will now be able to re-try your save.\n- Emblems and Clan tags will now appear correctly on the Assault Shield when stowed on the back.\n- Addressed all reported UI error code messages.\n- Elite Clan Friends list no longer actively sorts players when their status is updated. The player list will refresh after closing and re-opening the tab.\n- Improved a number of emblem icons in the Emblem Editor.\n- Junkyard IV reward added to Calling Cards.[/size]\n\n[color=white][b]Video of the Week[/b][/color]\nSo hows the Halo 4 connection for you? Great I hear? Well, I've never heard that here in Australia. This weeks video shows some classic lag us Aussie's are getting while playing Halo 4 multiplayer... the DMR only has 14 shots, but this player shoots 19 before getting killed. The enemy also doesn't take any damage from multiple hits. You can view this ridiculous video [url=http://www.youtube.com/watch?v=YXAWb9WjzGc]here[/url].\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]China's Fighter Jet Lands on Carrier[/b][/color]\nOn Sunday, China announced it demonstrated landing a fighter jet on its new aircraft carrier. China seems to be planning to build up a strong navy and even military all around. It has had increasing tensions with Japan, and China has warned the US to stay out of Asia, in reference to Obama's latest trip to Burma. President Hu Jintao said, \"We should make active planning for the use of military forces in peacetime, expand and intensify military preparedness, and enhance the capability to accomplish a wide range of military tasks, the most important of which is to win local war in an information age.\" China has also been increasing its military spending, and showing off other new hardware.  \n\n[b][color=white]Black Friday's Record Online Sales[/color][/b]\nThis Black Friday has seen record sales online, which topped 1 billion dollars. It was stated that the sales jumped 26% from last year. Last year sales were at $816 million, while this year shows sales of $1.04 billion. Amazon came in first as the most visited retail sales, while Walmart, not being slowed down by the protests, came in second. E-commerce continues to grow relative to the physical retail stores in the United States. ComScore announced that they anticipate an increase by 17% in this year's holiday spending all around. \n\n[color=white][b]Over 117 People Die in Burning Factory[/b][/color]\nAround the Bangladesh capital of Dhaka, a fire in a clothing factory has said to have caused the death of roughly 117 people. Adding onto that, there was also said to be over 200 people injured. As firefighters battled to contain the raging fire, many people laid trapped in the burning building which comprised mostly of women. Many family members waited outside for their loved ones to come out alive. \n\n[color=white][b]Israel Satellites Spot Weapons Headed for Gaza[/b][/color]\nIsrael satellites have reported spotting an Iranian ship with weapons cargo headed for Gaza. According to Haaretz, the ship was said to have been sent off on the day the ceasefire agreement was reached between Hamas and Israel. The cargo was suspected to contain the same kind of rockets that Hamas fired at Israel (Fajr-5 rockets). It is uncertain if the weapons are truly headed for Gaza, but it is very likely. An Israeli source told the Sunday Times of London, \"We believe that Iranian warships anchored in Eritrea will accompany the weapons ship as soon as it enters the Red Sea.”\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Samsung[/b][/color]\nIn addition to various patent battles between Samsung and Apple, we now have a new patent case being filed by Samsung on Wednesday. Samsung filed the case claiming that Apple's fourth generation iPad & latest iPad infringe patents of its own devices. Samsung has officially claimed that, \"All Apple products including a built-in speaker and an external audio output port infringe this particular patent.\" and hence the patent case has been filed against them. The court has ordered both the companies due on December 6.\n\n[color=white][b]Mozilla[/b][/color]\nBenjamin Smedberg, Mozilla Engineering Manager has asked his developers to stop working on building the 64-bit Mozilla Firefox for 64-bit version of Windows nightly. He created a thread named \"Turning off win64 builds\" under the developers board in which he stated that the 64 bit Mozilla was unstable, crashes frequently & overall inconvenient for use. He has also added the lack of plugins and lack of proper coding that leads to crashing of the plugins often. Finally, Benjamin posted, \"Thank you to everyone who participated in this thread. Given the existing information, I have decided to proceed with disabling windows 64-bit nightly and hourly builds. Please let us consider this discussion closed unless there is critical new information which needs to be presented.\"\n\n[color=white][b]Apple[/b][/color]\nWe know Samsung has filed a patent complaint over Apple this Wednesday that includes Apple's fourth generation iPad, iPod & iPhone 5. In response to that, Apple has filed another patent case against Samsung claiming them to infringe their patents that includes Samsung's Galaxy Note 2, S3 with Android 4.1 & S3 mini. Earlier in August, Apple won a case over Samsung that dealt with exterior design issues and the court finalized the case by ordering Samsung to pay one billion to Apple. But, unlikely, this case deals only with interior issues such as patent software, their way of working and such. This case is being overtaken by U.S. Magistrate Judge Paul Grewal in a federal court in San Jose, California.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b][color=white]Beck Working On New LP[/color][/b]\nIn an interview with Triple J Radio, Beck has revealed that he is currently working on a new album. The album has yet to be named and does not have a release date, but the musician has been working on the record for nearly half a decade, since 2008. Beck has an excuse however, as he has also been working on a sheet music album, Beck Hansen's Song Reader. The LP will be released via Consequence of Sound.  \n\n[b][color=white]Fiona Apple Cancels Tour For Dying Dog [/color][/b]\nIndie legend Fiona Apple has announced the cancellation of the last leg of her tour, according to her website. Unlike most tour cancellations in the music industry, the cause was not drugs and alcohol, nor STDs; it was a dying dog. The musician divulged into her personal life in a hand written note. The note narrated the story of how she adopted the dog as a puppy, up to the diagnosis of tumours, amongst other health problems for the 14 year old dog. The tour's affected gigs are mostly in South America. \n\n[b][color=white]Music Video Of The Week[/color][/b]\n[spoiler=][video=youtube]http://youtu.be/FWlIEBPKl7M[/video]\n[video=youtube]http://youtu.be/tCHFiJ9MIB0[/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI don't get to say this enough, but I want to thank the HF News team for all of their work in this endeavor. All of them, past and present, have spent a lot of time and effort on creating what you see today.\nWith that said, I'd like to thank Retribute to the team. While it may only be temporary, he is playing an important role in the creation of this project.\nThank you.",
      "subject": "*"
    },
    {
      "pid": "28390329",
      "uid": "515249",
      "dateline": "1353914764",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What are you looking forward to in the 'future'?\"\n\n[i]\"By now, I thought the future would've had hi-tech machinery \nlike floating cars and holograms from calls. At the moment, I expect \nto see holograms when we call, sort of like Facetime but the caller \nis actually there. Another thing I hope, but not expect to see are \nlasers strong enough to rip through or cut through like lightsabers. xD\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1090190][i]-Pink Leaf Skyline[/i][/url]\n\n[align=right][i]\"Time is on the wall, and we must be specific about what we want.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=863752][i]-Hexicidal[/i][/url][/align]\n\nThe topic for next week is \"What is your favorite movie? What do you like about it?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ibxOHusIBzkrYJ.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/iyaKQ9b4ldsxY.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/iS3n3yzw8VTul.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=660659]-Anal OG-[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=903914]Prince™[/url]\n[list][*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=138559]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Vox[/url]\n[list][*]Music News[/list][/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=763021l]Retribute[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}