{
  "posts": [
    {
      "pid": "59064705",
      "uid": "900087",
      "dateline": "1571419997",
      "message": "[align=center][img]https://i.imgur.com/bnbMM5P.png[/img][/align]\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/T48nHIL.png[/img][/align]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6007040][b]Live Convo Chat Room for HF[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nUsers can now interact in a public chat room accessible by all members.  Come join in on the conversation [url=https://hackforums.net/convo.php]here[/url].\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6012753][b]Official HF SportsBook Now Open[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nThe HF SportsBook is now open. It is a new feature that allows you to bet on sports teams using your HF βytes.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6011110][b]Paid Bytes Bump (PBB)[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nThis new feature helps combat low-quality posting by allowing users to bump their threads at the cost of βytes.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6010874][b]Official Mobile Navigation Changes[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=175033][color=#9999ff][b]Xerotic[/b][/color][/url]\r\nThere have been some changes for mobile users, view the thread to learn more about the updated navigation system.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6013287][b]New Award Goals [24k and SportsBook][/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nThe 24k and SportsBook awards have been added to the [url=https://hackforums.net/awardgoals.php]Award Goals[/url].\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/QK9ku0t.png[/img][/align]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6003823][b]Daily Bytes Donation Bonus[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=175033][color=#9999ff][b]Xerotic[/b][/color][/url]\r\nUsers now have a chance of being awarded βytes by donating to other members of the forum.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6013795][b]Hack Forums Bytes Gambling[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nA compiled list containing all of the casual and gambling related games Hack Forums has to offer.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6015596][b]Stopping Scammers and Smart Marketplace Choices[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nOur Admin posted a thread explaining HF's history of trying to provide extra security in the Marketplace.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6015418][b]Profile Analytics[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nUsers can now check their profile statistics over a 28-day period.  This includes; profile visitors, posts, threads, popularity, blogs, contracts and best responses.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6017128][b]Stanley PBB Update[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1][color=#9999ff][b]Omniscient[/b][/color][/url]\r\nFrom now on if an existing \"PBB\" is in a thread, it gets updated on the timestamp. This will limit a thread to just one Paid βytes Bump.\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/sObdSyq.png[/img][/align]\r\n\r\n[url=https://hackforums.net/member.php?action=profile&uid=2295175][b][color=#ff99ff]luke[/color][/b][/url] has won [url=https://hackforums.net/myawards.php?awid=4]Member of the Month[/url] for September 2019.\r\n[url=https://hackforums.net/member.php?action=profile&uid=1552290][color=#ffcc99][b]FBI[/b][/color][/url] received [url=https://hackforums.net/myawards.php?awid=7]The Protector[/url] award for reporting XSS.\r\n[url=https://hackforums.net/member.php?action=profile&uid=3739930][b]BTC[/b][/url] received the [url=https://hackforums.net/myawards.php?awid=8]Dunce[/url] award for his inability to understand basic math.\r\n[url=https://hackforums.net/member.php?action=profile&uid=2439716][b][color=#ffcc99]Vyrez.[/color][/b][/url] was granted the [url=https://hackforums.net/myawards.php?awid=11]Hustler[/url] and [url=https://hackforums.net/myawards.php?awid=55]Alien[/url] awards.\r\n[url=https://hackforums.net/member.php?action=profile&uid=3921080][b][color=#ff99ff]Vanilla[/color][/b][/url] was given the [url=https://hackforums.net/myawards.php?awid=19]Star[/url] award for his $1,000 contest.\r\n[url=https://hackforums.net/member.php?action=profile&uid=947940][b][color=#33ffff]webdev77[/color][/b][/url] has reached [url=https://hackforums.net/myawards.php?awid=67]24k[/url] posts.\r\n[url=https://hackforums.net/member.php?action=profile&uid=1441945][b][color=#000000]M0HX[/color][/b][/url] took a vacation ban for 3 days.\r\n[url=https://hackforums.net/member.php?action=profile&uid=4414169][b][color=#000000]*Subutex*[/color][/b][/url] was permanently banned for hosting a fake contest.\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/gxOiVUZ.png[/img][/align]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6014479][b]Selling Official Group[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1452196][b]Nas[/b][/url]\r\nThe Official usergroup 'Prevail' is currently available for purchase.  Click the thread above to learn more.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6016475][b]Sui Generis Regeneratione - Recruitment[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=1314004][b]scam[/b][/url]\r\nThe Official usergroup 'Sui Generis' is currently open for recruitment.  Click the thread above to apply.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6005390][b]Gamblers - Open Recruitment[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=2028907][b][color=#ff99ff]Lavish Living[/color][/b][/url]\r\nThe Official usergroup 'Gamblers' is currently open for recruitment.  Click the thread above to apply.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6005042][b]Wolfpack - General Recruitment[/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=2331053][b][color=#ffcc99]Mix[/color][/b][/url]\r\nThe Official usergroup 'Wolfpack' is currently open for recruitment.  Click the thread above to apply.\r\n\r\n[url=https://hackforums.net/showthread.php?tid=5925557][b]BrickSquad - Recruitment [BUY-IN][/b][/url] by [url=https://hackforums.net/member.php?action=profile&uid=3323508][b][color=#339999]MMLF[/color][/b][/url]\r\nThe Official usergroup 'BrickSquad' is currently open for recruitment and accepting buy-ins.  Check the thread above for more information.\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/hLChXwH.png[/img][/align]\r\n\r\n[color=#ffffff][b][size=small]Riot's 7 New Games are a Declaration of War Against Blizzard[/size][/b][/color]\r\n\r\nLeague of Legends creators, 'Riot Games' have officially announced 7 new games in correlation to their 10 year anniversary.  For the first time in the company's history, we will see them venture into new territories with a fast-paced FPS game, a card based strategy game and also a mobile version of League of Legends. They are also developing a fighting game similar to 'Mortal Kombat' which is a bold move by the gaming behemoths. On top of that, we are also treated to a new League of Legends animated series called Arcane.  This currently has no approximate release date but is planned to release in 2020.\r\n\r\nWhat is of most interest currently though is the new card strategy game called 'Legends of Runeterra.'  This will tackle 'Hearthstone' and will certainly challenge its place at the top of the card strategy genre. It is set to battle the micro transactions that has angered and frustrated Hearthstone players for years. 'League of Runeterra' will have a completely new system in which the players can buy cards directly using in-game currency.\r\n\r\n[size=small][url=https://www.pcgamer.com/riots-7-new-games-are-a-declaration-of-war-against-blizzard/]Source[/url][/size]\r\n\r\n[url=https://www.youtube.com/watch?v=h4FGqymg4k4&t=2165s][size=small]10-Year Anniversary[/size] [/url]\r\n\r\n[color=#ffffff][b][size=small]New PlayStation controllers connect using Cloud Based technology & Cross Platform support[/size][/b][/color]\r\n\r\nNew patents for the new PS5 controller have led to some interesting finds. For the first time, the PS5 controller is shown to be connected through an online server rather than your PlayStation 5 console, it seems the shift to cloud gaming is soon upon us. However, this is only speculation and it might not be for the PS5 controller at all, but rather a separate controller for the new generation console believed to be used in PlayStation's 'PS Now' streaming service. Microsoft has also confirmed that Project Scarlett (Xbox new generation) will use some kind of cloud based technology, so we should definitely be excited for this new era of advancement. Sony has also confirmed the new controller will feature cutting edge \"haptic technology,\" rumored to be called 'Dual-shock 5.'\r\n\r\nSomething very exciting for console gamers is that the PS4 has finally allowed cross-play, which is a big move for Sony considering they ruled out cross-play for a long period of time.  But, with increased pressure they have now confirmed that the PS4 will join the cross-play club.  Below is a list of all games that are now cross-play compatible:\r\n\r\n[list]\r\n[*]Fortnite: PS4, Xbox One, Switch, PC, mobile\r\n[*]Dauntless: PS4, Xbox One, PC\r\n[*]Rocket League: Xbox One, Switch, PC, PS4\r\n[*]SMITE: Xbox One, Switch, PC, PS4\r\n[*]Paladins: Champions of the Realm: Xbox One, Switch, PC, PS4\r\n[*]Call of Duty: Modern Warfare: Xbox One, PS4, PC (October 25th)\r\n[/list]\r\n\r\n[size=small][url=https://www.youtube.com/watch?v=MrrX2leLVsA]Source[/url][/size]\r\n\r\n[color=#ffffff][b][size=small]Spectacular Nintendo Switch sales & Witcher 3/Overwatch[/size][/b][/color]\r\n\r\nThe 'Nintendo Switch' is breaking records, it has now surpassed 15 million sales in North America.  The 'Nintendo Switch' is now the best selling US video game console for 10 months in a row.  You have the choice between two models, the standard Switch which comes in at $299, or you can opt for the cheaper option and buy the Lite for $199. \r\nBoth models feature most of the same core specs, (i.e same cpu/gpu) which means that they are both equally powerful and offer great in-game performance. The Switch Lite is also only intended as a handheld device, meaning that you cant play it the same way as the standard model. \r\n\r\n[size=small][url=https://www.youtube.com/watch?v=MrrX2leLVsA]Source[/url][/size]\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/wA0wwfj.png[/img][/align]\r\n\r\n[color=#ffffff][b][size=small]Beats Solo Pro[/size][/b][/color]\r\n\r\nApple has just announced the Beats Solo Pro, these are the company's first on-ear noise-cancelling headphones. They feature up to 22 hours of wireless power (40 hours off), on top of that, they come in several eye popping colors, and three of the designs are created by singer Pharrell Williams. They have a transparency function which activates the external microphone so you can hear the outside world, this is particularly useful when travelling. They have now refined the drivers and lower harmonic distortion, which means clearler quality. The price of these are around $350 so they are definitely not cheap, but maybe for music lovers who enjoy a better battery life, it could be worth the purchase.\r\n\r\n[size=x-small][color=#ffffff][url=https://www.wired.co.uk/article/beats-solo-pro]Source[/url][/color][/size]\r\n\r\n[color=#ffffff][b][size=small]The Failure of RED's Hydrogen One[/size][/b][/color]\r\n\r\nThe phone created by popular camera/video company 'RED' was originally $1,295 at launch.  The phone was robust and built well to protect it from the environment, but the design was clunky and the camera was oversized. Now, the Hydrogen One has been dropped down to $645 which is slightly under 50% of the original price, reviewers and testers are still wondering if the price is worth it. The reason why it was considered a failed product is the fact the camera, despite being made by RED, was extremely lackluster and failed to deliver on any of its promises.\r\n\r\n[color=#ffffff][size=x-small][url=https://www.theverge.com/2019/10/18/20920624/red-hydrogen-one-phone-price-drop]Source[/url][/size][/color]\r\n\r\n[color=#ffffff][b][size=small]U.S. Launches Cyber Attack Against Iran[/size][/b][/color]\r\n\r\nTwo officials have notified the Reuters news agency that a secret cyber attack operation took place in late September. The motive of this operation was to stop Tehran from spreading fake news. Tehran is the capital of Iran and is currently in suspicion of carrying out an attack on oil tankers in the Gulf during May. Tehran has denied involvement, but it is claimed that an Iran-aligned militant group carried out the attack and claimed responsibility.\r\n\r\n[color=#ffffff][size=x-small][url=https://news.sky.com/story/us-launched-secret-cyber-strike-against-iran-after-attacks-on-saudi-oil-facilities-11836715]Source[/url][/size][/color]\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/8xEZJhn.png[/img][/align]\r\n\r\n[size=small][color=#ffffff][b]Lady Gaga falls hard off the stage after being dropped by a fan mid-performance[/b][/color][/size]\r\n\r\nLady Gaga endured a really hard fall off the stage after being dropped by a fan during her show Thursday night.  The singer was performing her regular 'Enigma' show, as part of her resident Las Vegas performance, when a fan, picked her up while dancing before losing their balance, sending both him and Lady Gaga to the ground below.  The artist recovered and returned to the stage to finish her performance, but the condition of the fan is unknown at this time.\r\n[url=https://ew.com/celebrity/2019/10/18/lady-gaga-falls-hard-off-stage-dropped-fan-mid-performance/][size=x-small]Source[/size][/url]\r\n\r\n[size=small][color=#ffffff][b]Alec Baldwin Doesn't Think Anyone Involved in College Admissions Scandal Should Go to Jail[/b][/color][/size]\r\n\r\nThe beloved actor wrote on Twitter late Thursday to share his thoughts on the college admissions scandal, after Felicity Huffman turned herself in to a federal prison to begin a 14-day sentence.  Huffman had plead guilty to charges of mail fraud and honest services mail fraud back in April. Baldwin wrote;\r\n[size=x-small][i]\"I don’t think anyone involved in the college fraud cases should go to prison, that includes past cases as well. Community service, fines, yes. But prison time, no. My heart goes out to Felicity, Bill Macy and their family.\"[/i][/size]\r\nJust a month ago, the actress was given her sentence to serve 14 days in prison, one year of supervised release, $30,000 in fines and 250 hours of community service working directly with children.\r\n[url=https://www.etonline.com/alec-baldwin-doesnt-think-anyone-involved-in-college-admissions-scandal-should-go-to-jail-134620][size=x-small]Source[/size][/url]\r\n\r\n[color=#ffffff][size=small][b]Jennifer Aniston Broke Instagram with her Debut[/b][/size][/color]\r\n\r\nJennifer Aniston's debut on Instagram caused problems for users, it was reported to have literally crashed the app.  Aniston joined the platform on Tuesday afternoon, posting a group photo with the former cast of 'Friends,' Courteney Cox, Lisa Kudrow, David Schwimmer, Matthew Perry and Matt LeBlanc.  That one photo temporarily caused her profile to crash and a lot of fans were briefly unable to follow the actress for quite some time. However, it didn't stop her from obtaining waves of followers. As of Wednesday, Aniston had 9.9 million followers.  Fortunately, the problem was resolved and everyone is now be able to follow the actress without any issues.\r\n[url=https://www.cnn.com/2019/10/16/entertainment/jennifer-aniston-broke-instagram-trnd/index.html][size=x-small]Source[/size][/url]\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/7jeJc8S.png[/img][/align]\r\n[align=center][i]Oct 14, 2019 - Oct 20, 2019[/i]\r\n \r\n[b][color=#cc3333]Aries ♈[/color][/b]\r\n[i]\"If you’re going to get the best out of a relationship, aspects of it might need to change. There could be an imbalance of power in its current format. Open the way for discussion on this topic and a much better connection can be yours.\r\n \r\nRelationships continue to be important, but so are the feelings concerning them that often lie just under the surface. With Mercury and Venus in an intense zone, you may become more aware of how you really feel about someone, and this could inspire you to do something if necessary.\r\n \r\nWith lively Mercury linking to dreamy Neptune on Tuesday and potent Pluto over the weekend, someone could seem almost ideal at first encounter. As the week progresses, you could begin to see more of their flaws (which everyone has), and this could bring you back to reality. The bond can now proceed on a more equal footing.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=1]>>Source[/url][/size][/i]\r\n \r\n[b][color=#ff99ff]Taurus ♉[/color][/b]\r\n[i]\"Are your routines helping or hindering you? If it’s the latter, this is very much the time to get things sorted out. If your day-to-day tasks are preventing you from reaching for new and bigger opportunities and challenges, an edgy sun-Pluto tie on Monday could be a call to action. Give yourself room to maneuver and you’ll feel much better.\r\n \r\nWith a focus on your sector of relating, you now have opportunities to improve a current bond, enjoy a sparkling social life, and make empowering business connections, too.\r\n \r\nBe realistic on Tuesday, though, as upbeat Mercury’s link to aquatic Neptune could see you being rather too trusting of someone. This person may be fine, but get to know them better before you commit to anything.\r\n \r\nThe weekend could see you immersed in deep conversation about the future and what you need to do to welcome positive change. You might need to let go of something to gain something.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=2]>>Source[/url][/size][/i]\r\n \r\n[b][color=#66cc33]Gemini ♊[/color][/b]\r\n[i]\"Oct 14, 2019&nbsp;-&nbsp;Oct 20, 2019</s - Should you take a budding romance further or be patient? With the sun angling toward Pluto at the start of the week, this question may be on your mind. This aspect could see you pushing to move things along, but this might not be wise. You’ll have a much better chance of success if you can be patient and allow things to develop organically. <br><br>Lively Mercury, your guide planet, continues its journey through Scorpio and your lifestyle zone along with sweet Venus. Be sure that any deals or schemes you’re considering are aboveboard, because a dreamy Mercury-Neptune tie suggests that you could unwittingly sign up for something that ends up losing money. Do your research and by the weekend you may find something that is much more lucrative. <br><br>An intense Mercury-Pluto link on Saturday could encourage you to pool your resources with someone to good effect. It’s also possible that the conversation could turn into a collaboration.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=3]>>Source[/url][/size][/i]\r\n \r\n[b][color=#3399ff]Cancer ♋[/color][/b]\r\n[i]\"With the radiant sun illuminating an awkward angle with potent Pluto on Monday, there could be a battle of wills. Issues on the home front might need careful handling, particularly if someone seems eager to override your thoughts or decisions. Be open to discussion and negotiation, but if it gets you nowhere, stand your ground.\r\n \r\nWith a focus on your sector of recreation this week, you might enjoy some leisure activities. This can also be a very exciting time for romance, including possibilities for finding that special person. With both sweet Venus and chatty Mercury in passionate Scorpio, flirtations can be understated but powerfully intense. If there is someone you’ve admired from afar, you may no longer be able to hide it.\r\n \r\nA potent Mercury-Pluto tie on Saturday indicates that one conversation could encourage positive change. Talking things over with someone could be a healing experience.\r\n \r\nOn Sunday, a formal event could turn out to be much better than you expected.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=4]>>Source[/url][/size][/i]\r\n \r\n[b][color=#ff9933]Leo ♌[/color][/b]\r\n[i]\"As warrior Mars continues its journey through your sector of talk and thought, you’ll have the energy and dynamism to make a success of your plans. This is a great time to get organized, attend to administrative tasks, and network with others on your wavelength.\r\n \r\nStill, it helps to tread with care on Monday because someone could challenge your ideas. If you deal with them diplomatically, it will likely blow over in a few days. If you tackle them head-on, there could be a spat, which is best avoided.\r\n \r\nAs dealmaker Mercury aligns with hazy Neptune on Tuesday, you could find it hard to focus on details, preferring to drift and dream. Are you working on a creative project? Your imagination may be strong, and this aspect can be very helpful for completing the work.\r\n \r\nThe weekend could be more intense, with key aspects encouraging you to transform your lifestyle. Going along with this could leave you feeling much better.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=5]>>Source[/url][/size][/i]\r\n \r\n[b][color=#339933]Virgo ♍[/color][/b]\r\n[i]\"You now have an opportunity to consider your resources and how you might use them more fruitfully. With fighter Mars now powering through your personal financial zone, you may be ready to resolve issues that have been going on for some time.\r\n \r\nAside from this, it might be wise to look at your skills and abilities and how you can make the most of them. Are there any that are underused? And how much are they worth on the market? The sun angles toward potent Pluto on Monday, so it’s also possible that you’ve underestimated certain talents and that now is the time to realise their true worth.\r\n \r\nWith Mercury and sweet Venus in your sector of communication, your social life could pick up and sizzle with promise. Tuesday can be excellent for a romantic date, but don’t believe everything someone tells you.\r\n \r\nThe weekend has more intense qualities, with an in-depth conversation encouraging some positive decisions and inspiring you to take up new opportunities.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=6]>>Source[/url][/size][/i]\r\n \r\n[b][color=#3366ff]Libra ♎[/color][/b]\r\n[i]\"You could make a decision early in the week that impacts the family or your home. Have you had enough of someone’s attitude? Now is the time to stand your ground and say what you really think. They might be surprised, but perhaps they had it coming.\r\n \r\nAs the sun and dynamic Mars continue to move through your sign, you find the courage to focus on those plans that are personal to you. It’s time to do what you want regardless of what others might think.\r\n \r\nYou could be feeling very generous on Tuesday and inclined to give away your time and money for free. But are you doing the right thing? It might be that without your input a certain person would be more inclined to manage on their own.\r\n \r\nYou could be looking for the perfect item for your home over the weekend, no matter how much it costs. A resourceful Mercury-Pluto tie hints that with some research you could find a bargain.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=7]>>Source[/url][/size][/i]\r\n \r\n[b][color=#8B0000]Scorpio ♏[/color][/b]\r\n[i]\"You continue to be in a quieter phase, with the sun and warrior Mars currently journeying through your spiritual zone. On Monday, though, you might realize how a past experience is continuing to affect you now. This can be an opportunity to talk things over with a trusted confidant and find a way to heal and resolve the issue.\r\n \r\nWith articulate Mercury and luscious Venus in your sign, this is very much a time to reach out to others, expand your social circle, and share your ideas and opinions.\r\n \r\nTuesday could be very creative day when your imagination peaks. If you have the urge to produce something beautiful, go with it. You could feel positively recharged as a result.\r\n \r\nThe weekend could find you in detective mode and eager to resolve issues that have bugged you for some time. You may also enjoy thrillers and suspense novels and movies as a way to wind down.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=8]>>Source[/url][/size][/i]\r\n \r\n[b][color=#FFFF00]Sagittarius ♐[/color][/b]\r\n[i]\"Your social life seems to be on a roll, and you could be very proactive about mixing with people on your wavelength. But you might also need to make decisions about how much time you spend with friends and how much time you spend on important plans and goals. Getting the balance right can be difficult, but because this is a time of opportunity for you, you won’t want to miss out.\r\n \r\nTuesday could bring creative and imaginative ideas into the mix, and you may find that channeling them into artwork or beautifying your home can be positive. The ideas might be linked to your spiritual ideals, and bringing them into your domestic setting could create a very positive atmosphere.\r\n \r\nWith both lively Mercury and lovely Venus in your spiritual sector, you may enjoy mixing with people who are on your same spiritual path. Any events you attend could have a positive impact on you.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=9]>>Source[/url][/size][/i]\r\n \r\n[b][color=#663333]Capricorn ♑[/color][/b]\r\n[i]\"You may feel someone in authority needs to change, but perhaps you are the one who needs to be more flexible. If you can’t agree on a key issue, trying to force things to go your way could make matters worse. As the aspect on Monday is temporary, it might be wise not to rock the boat. See how you feel about things in a few days. You may find your perspective changes quite dramatically.\r\n \r\nHowever, Tuesday could see you in a dreamier mood and very sensitive to the subtleties of life as logical Mercury aligns with ethereal Neptune. Practical matters may not hold much appeal, but anything creative or romantic will. You might also be drawn to art exhibitions, which could be very enjoyable.\r\n \r\nSaturday could see you trying hard to figure out a key issue, and with a very intense transit in the cards, it seems likely you will succeed.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=10]>>Source[/url][/size][/i]\r\n \r\n[b][color=#9966ff]Aquarius ♒[/color][/b]\r\n[i]\"What is stopping you from embracing a new opportunity? Could it be past experiences? The sun’s edgy angle with volcanic Pluto on Monday could draw your attention to this matter. This can be a chance to discuss things with a life coach who can help you move beyond your limits and fulfill your potential.\r\n \r\nGo easy with your money on Tuesday because you could have a tendency to splurge regardless of whether you can afford it or not. And rather than spend it on yourself, your generosity may be directed to others. You might have a very noble desire to make them happy, but it helps to be practical as well.\r\n \r\nTrust your instincts over the weekend when chatty Mercury aligns with potent Pluto. If you get an urge to call someone or visit a place, do so. It could be important to you.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=11]>>Source[/url][/size][/i]\r\n \r\n[b][color=#cccc66]Pisces ♓[/color][/b]\r\n[i]\"With dynamic Mars and the sun moving through your sector of shared assets and business, the coming week could see you making some key decisions. You can go far this time if you avoid overthinking certain matters and just sort things out. A friend may have a very different opinion on what you should do, but only listen to them if you feel they have a valid point.\r\n \r\nYou may yearn to visit a place that holds special memories for you, particularly on Tuesday. If it’s a beautiful place, going there might act as a restorative and help you relax. It could be a very healing experience.\r\n \r\nThe weekend could be quite intense in a positive way. Conversations could lead to you make plans for a trip that ends up being life changing in some way. And a business connection could show signs of developing into a supportive friendship.\"[/i][i][size=xx-small][url=https://www.horoscope.com/us/horoscopes/general/horoscope-general-weekly.aspx?sign=12]>>Source[/url][/size][/i]\r\n[/align]\r\n\r\n[hr]\r\n\r\n[align=center][img]https://i.imgur.com/OS0BBVp.png[/img][/align]\r\n\r\n[align=center][img]https://i.gyazo.com/2bee876332952a0b39939a8c799713c2.png[/img]\r\n[img]https://i.gyazo.com/a647b96d473dd09e869b45c92bfa0047.png[/img][/align]\r\n\r\n[hr]\r\n\r\n\r\n[align=center][img]https://i.imgur.com/3QVosbu.png[/img][color=#000000]-[/color]\r\n[url=https://hackforums.net/member.php?action=profile&uid=900087][b]Sir[/b][/url]\r\n[url=https://hackforums.net/member.php?action=profile&uid=2890436][color=#ff3333][b]Pikachu[/b][/color][/url]\r\n[url=https://hackforums.net/member.php?action=profile&uid=4219906][b]duplex[/b][/url][/align]",
      "subject": "Hack Forums News  // Edition 445"
    }
  ]
}