{
  "posts": [
    {
      "pid": "20989677",
      "uid": "515249",
      "dateline": "1332377194",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]84th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[b]I understand that this was a fairly short edition. There wasn't a large amount of news this week, and we just had to make do with what we had.[/b]\n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]SoundCloud Embed[/b][/color]\nFor all the music fanatics on HackForums Omniscient has just embed SoundCloud for a much easier experience while listening to music on HackForums. Adding a SoundCloud track into your post or thread is extremely easy, just add the [sοundcloud] and [/sοundcloud] bb tags before and after your track url. To view Omniscient's announcement thread click the following link: http://goo.gl/INZJP\n\n[color=white][b]HackForums pays taxes[/b][/color]\nDespite common belief, HackForums is actually a business. Since it is considered a business Omniscient recently had to pay the taxes for HF. To read Omniscient's tweet about this matter click the following link: http://goo.gl/X4FFD\n\n[color=white][b]Old tool comes back to life[/b][/color]\nAfter being left in the dust for quite some time, the moderator tool used to show that a user was warned for a specific post has recently come back from the dead. The unnamed tool displays a black and red text box text box at the bottom of a post when a user is warned for the said post. This is very useful and effective for setting an example of what not to do on HF. To see the tool in action click the following link: http://goo.gl/itzXz\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=977824][b][color=#0066FF]Nifty[/color][/b][/url] was rep fucked.\n[url=http://hackforums.net/member.php?action=profile&uid=588781][b][color=#0066FF]Hуѕтєяιa X™[/color][/b][/url] was rep fucked a second time since he asked for it. Literally.\n[url=http://hackforums.net/member.php?action=profile&uid=535046][b][color=#0066FF]Emily[/color][/b][/url] was rep fucked for attempting to buy an HF account.\n[url=http://hackforums.net/member.php?action=profile&uid=1103896][b][color=black]BigDomePiece[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=729921][b][color=black]тнє Jσкєя[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=898069][b][color=black]Click Me[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=560013][b][color=black]Peroxide[/color][/b][/url] was banned and rep fucked for account sharing.\n[url=http://hackforums.net/member.php?action=profile&uid=8349899][b][color=black]๖ۣۜBlowmy16inch[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=888979][b][color=black]Zombot[/color][/b][/url] had his account stolen.\n[url=http://hackforums.net/member.php?action=profile&uid=700833][b][color=black]๖ۣۜSuckmy16inch[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=334193][b][color=black]Microwave[/color][/b][/url] was banned for rep fuck complaining.\n[url=http://hackforums.net/member.php?action=profile&uid=789792][b][color=black]Kornk[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=361543][b][color=black]Scooter[/color][/b][/url] was banned for cross posting.\n[url=http://hackforums.net/member.php?action=profile&uid=793351][b][color=black]Enterprise[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=80552][b][color=black]Sold[/color][/b][/url] was banned.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Soundcloud Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2314883]Soundcloud Embed[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] - This thread announces the new soundcloud embedding ability.\n\n[i][b]Lucid Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2188675][Tutorial] Lucid Dreaming (WILDs)[/url] - [url=http://hackforums.net/member.php?action=profile&uid=871571][color=#FFCC00][b]codst3r[/b][/color][/url] - If you've ever wondered how to lucid dream on your own, this tutorial will tell you how.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\nWe are currently going through the applicants. Three have been chosen to give a test interview, however, there is no guarantee that no one else will be chosen as well.\n",
      "subject": "[3/21/12] - HF News"
    },
    {
      "pid": "20990015",
      "uid": "515249",
      "dateline": "1332377976",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Kutcher Buys Ticket to Space[/b][/color]\nBillionaire, Richard Branson, recently announced that he has gotten his 500th customer for a trip that takes wealthy tourists into space. That spot was filled by Ashton Kutcher.  Reporters from Yahoo News have stated that, \"Virgin Galactic is in the final stages of its test flight program. The company will launch its spacecraft from Spaceport America, a specially designed terminal and runway built in a remote stretch of desert in southern New Mexico.\"\n\n[i]\"Virgin Galactic customers will ride in a six-seat spacecraft that looks like a small plane, with wings near the rear that sweep upward. Once the craft and its mother ship reach a certain altitude, the smaller craft is released and its rockets are fired, pushing passengers back into their seats for the trip to suborbital space.\"[/i]\n\nThe minds behind this incredible new technology currently aim to make it more affordable for the everyday person rather than the current $200,000 ticket.\n\n[color=white][b]Israeli Underweight Model Laws[/b][/color]\nIn attempt to attack many vicious eating disorders, Israeli law recently banned overly thin models being advertised in companies' ads.  This new law requires publications to announce when modifications of women have been made to make them appear thinner than in reality. Statistics say that 2% of all girls between the ages of 14-18 have eating disorders which provoked the government to start to changes in the fashion industry.\n\n[color=white][b]1952 Mr. Universe turns 100[/b][/color]\nIn 1952, Aich, won Mr. Universe international bodybuilding championship.  On Sunday, he celebrated his 100th birthday with his family in a city in India.  Aich started body building when imprisoned in the 40's for rebelling against Britain colonial rule over India.  After released, he continued to join competitions and traveled around the world.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[b][color=white]iPad 3[/color][/b]\nApple had an amazing sale selling about 12 million iPads on the first week. \nThe first iPad and 2nd iPad first weeks where not even as big as this. People \nHave been going crazy over the new iPad. The upgraded iPad was just hardware changes like the iPhone 4S. It's a little thicker but still an amazing product. \n\n[b][color=white]Sprint[/color][/b]\nRumors of Sprint going bankrupt have surfaced. This a huge ordeal because Sprint is a large cellphone carrier. It hurts Apple also because they are trying to get on the LTE bandwagon and now one of there most reliable carriers might go bankrupt. Sprint stocks have also went down by 4% and now they might not even face another year. \n\n[b][color=white]Jailbreaking[/color][/b]\nOnce the iPad 3 was released to the public, within a few hours it was jailbroken by 3 of the top jailbreakers. Muscle Nered, i0n1c and Chpwn+PhoniexDev have all jailbroken the recent iPad. i0n1c has said that he will not release the jailbreak. No idea why but he can do whatever he wants. We know his is currently the only 1 un-tethered. Maybe the others will release it. No word if it works for the 4S or not.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]OFWGKTA[/b][/color]\nOdd Future's tape Volume 2 was released March 20th, 2012.\n\n[color=white][b]Hall of Fame[/b][/color]\nRock and Roll Hall of Fame members John Mellencamp, Smokey Robinson, Carole King, Robbie Robertson and ZZ Top's Billy F. Gibbons and Dusty Hill will be among the presenters for this year's 27th annual induction ceremony, which takes place on April 14 in Cleveland.\n\n[color=white][b]Beatles[/b][/color]\n\"Yellow Submarine\", the Beatles' 1968 animated feature film, will hit shelves again on May 28, digitally restored for DVD and Blu-ray release.\n\n[color=white][b]Depp and Manson[/b][/color]\nIndustrial rocker Marilyn Manson and Hollywood icon Johnny Depp have teamed up to collaborate on a cover of Carly Simon's iconic kiss-off song, \"You're So Vain.\"\n\n[color=white][b]Music Videos of the Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=vk_O3yhLbMA[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nIn the movie [i]Wall Street: Money Never Sleeps[/i], the main antagonist, Gordon Gekko, said \"Greed is Good.\" Now, I'm using this as an example due to the topic being on greed. An interesting way to see that quote, is to see it from a different perspective. Instead of using \"good\" as a term for something righteous or morally correct, but as a means to a goal. Greed is good for a goal, if that goal is not for an honorable purpose. In my opinion, greed will be the death of humanity and the world itself. We actively oppress change for greed, if there is something that can ruin or damage profits, it is taken care of. Quickly. Our own greed is stopping the evolution of the human race. This all came to mind while I was watching the movie [i]Thive[/i], where they talk about the costs to humanity of money and general greed. It's just something to think about.",
      "subject": "*"
    },
    {
      "pid": "20990049",
      "uid": "515249",
      "dateline": "1332378065",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about the new Prestige system?\"\n\n[i]\"The prestige system seems like a really cool idea. The keyword being it seems like one, as at this current stage of the game. The reason being is that as it stands right now there is zero purpose to it (from my point of view any ways.) It seems like it's currently just a glorified Epeen meter. Sure it gives you a way of distinguishing yourself from other members, as achieving a higher prestige rating means you'll have to be a notable member among the community, help out, and be a kind person. Or so it seems as the 100% method of gaining prestige hasn't been released, I feel like we only have 70-80% of the picture on how you gain your prestige. So in short, I feel at this stage the prestige meter holds nothing more then to enlarge your Epeen. If Omniscient implements something like a certain area of the forum where only people with 50+ prestige can enter. Or maybe even give aways or contests that only people of a certain prestige can enter, would actually make it have some purpose. If those features would be implemented, then I would be all for that rating. However this is just an opinion, and I semi feel like it's too early to make a proper judgement, as omniscient hasn't released the full scope of what it can do, and it is still in it's baby steps.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1187133][i]-dawnofwar[/i][/url]\n\n[align=right][i]\"The new prestige system is a great idea implemented by Omniscient. Anticipating what this will be used for, I look to see how the whole HF community responds. Some people hate change. I for one believe change is a great thing, as long as it benefits the HF community itself. Whether the prestige system stops the scamming or it stops the spamming, it will be a highly honored system in my eyes, among many others in the community.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=839420][i]-Angel Of Ɖeath[/i][/url][/align]\n\n[i]\"I feel that if this feature is incorporated into a useful feature such as reputation is for the Marketplace, then I will welcome Prestige with open arms. Sadly, until that day comes along, I find it rather useless and would rather have the option to remove it from view as it is quite annoying sometimes when you're trying to see a certain stat of a user but can get easily confused. Omniscient, please try to make a good, unique way for Prestige to be useful in these forums and everyone won't get confused as easily and maybe will stop users making threads asking about what Prestige is.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=297518][i]-Stuck In Your Radio[/i][/url]\n\nThe topic for next week is \"What is your favorite section of the forum? Explain it please.\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/PTJTG.jpg[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3476714_460s.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3473541_460s.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=M1Dcy6HvP78[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b][color=white]xerotic[/color][/b][/url] has recently been promoted to leader of the Techsperts.\n[url=http://hackforums.net/member.php?action=profile&uid=725160][b][color=white]Mcflurry[/color][/b][/url] has recently been demoted from leader of Respawn.\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=572367][b][color=white]The MammoTh[/color][/b][/url] received the Youtube award.\nhttp://www.youtube.com/watch?v=7QJaPy_mGPs\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}