{
  "posts": [
    {
      "pid": "19999773",
      "uid": "515249",
      "dateline": "1329372359",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\r\n\r\nThe edition you are currently reading is the [color=#FF69B4][b]79th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\r\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\r\n[color=white][b]Group changes[/b][/color]\r\nThe group Reverence has now been officially renamed ‘Respawn’.  Although Omniscient wasn’t very pleased with the changed he did allow them to do so. In other group news there has been talk of several new groups coming to HF, however there haven’t been any official announcements so it doesn’t look very promising. To view Omniscient’s tweet about Reverence’s name change click the following link:  [url=http://goo.gl/lyKJv] http://goo.gl/lyKJv[/url]\r\n\r\n[color=white][b]Post recount[/b][/color]\r\nEarlier this week Omniscient deleted both junked posts and ub3r junks which in total ended up being 1.2 million posts. Many members lost a vast amount of posts from the recount; however this doesn’t even come close in comparison to the last recount. There was also a bit of downtime here and there while the posts were being deleted, but it didn’t seem to last more than 20 minutes at a time.\r\n\r\n[color=white][b]Advertisements[/b][/color]\r\nAfter a bit of a wait, Omniscient decided to allow anyone to purchase an ad space on HF directly. This may have been related to the fact that members were complaining of the ads infecting their computer although this was never confirmed.  To view Omniscient’s tweet containing the link to buy an ad space click the following link:  [url=http://goo.gl/GmPCq] http://goo.gl/GmPCq[/url]\r\n\r\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=529870][b][color=#0066FF]+Pirate[/color][/url][/b] - celebrated his birthday earlier this week!\r\n[url=http://hackforums.net/member.php?action=profile&uid=663370][b][color=#0066FF]Impulsee[/color][/url][/b] - recently became a member for a year!\r\n[url=http://hackforums.net/member.php?action=profile&uid=613009][b][color=white]Morchid[/color][/url][/b] - was repfucked then banned for complaining about his repfuck, he was unabanned early.\r\n[url=http://hackforums.net/member.php?action=profile&uid=182754][b][color=white]Orgy[/color][/url][/b] - was repfucked once again and received a negative from Omniscient with the reason \"Helping Orgy will only lead to problems for you. Seriously. He gets people rep fucked and banned with his nonsense. You should steer clear of him and his antics.\"\r\n[url=http://hackforums.net/member.php?action=profile&uid=442838][b][color=#0066FF]#cn[/color][/url][/b] - was repfucked for unknown reasons.\r\n[url=http://hackforums.net/member.php?action=profile&uid=68704][b][color=black]Sky-[/color][/url][/b] - was banned for Account Sharing.\r\n[url=http://hackforums.net/member.php?action=profile&uid=545127][b][color=black]Joey Tribbiani[/color][/url][/b] - mentor of HF went on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=275104][b][color=black]Delicious[/color][/url][/b] - was banned for a requested vacation ban.\r\n[url=http://hackforums.net/member.php?action=profile&uid=344143][b][color=black]Crayo[/color][/url][/b] - was also banned for Account Sharing.\r\n[url=http://hackforums.net/member.php?action=profile&uid=923753][b][color=black]Juicy Booty[/color][/url][/b] - was banned and repfucked for a payment reversal.\r\n[url=http://hackforums.net/member.php?action=profile&uid=868052][b][color=black]Burner™[/color][/url][/b] - was banned and repfucked for multi accounting and band evading.\r\n[url=http://hackforums.net/member.php?action=profile&uid=701593][b][color=black]Saga[/color][/url][/b] - has been banned for vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=793351][b][color=black]MasterMind[/color][/url][/b] - received a vacation ban and most likely will never come back to HF.\r\n[url=http://hackforums.net/member.php?action=profile&uid=405595][b][color=black]rattlesnake™[/color][/url][/b] - was banned for vacation.\r\n\r\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\r\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\r\n[i][b]Group Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2209690][Marketers]Get a new Userbar and access to exclusive forums and content[Buy Now!][/url] - [url=http://hackforums.net/member.php?action=profile&uid=209490][color=white][b]Codevade[/b][/color][/url] - It seems that the quality of the Marketers has run its course, Codevade has opened it up to practically anyone for only $50. \r\n\r\n[i][b]Recruitment Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2168164]{Official Gaming group} Respawn - Now Recruiting[/url] - [url=http://hackforums.net/member.php?action=profile&uid=657392][color=white][b]Astonish is NJ[/b][/color][/url] - The completely changed group has finally opened up for recruitment. If you were a previous member of Astonish's group Reverence, be sure to apply to the replacement, Respawn.\r\n\r\n[i][b] Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2194347]Emotional Support - I am here to talk and help[/url] - [url=http://hackforums.net/member.php?action=profile&uid=323740][color=white][b]Positive[/b][/color][/url] - If you've been having a hard time lately and don't want to take the long journey to Support Forums, Positive is open for business. Just speak to him like a best friend, share your problems, your secrets, and have help through the clouds. \r\n \r\n\r\n[align=center][img]http://goo.gl/C6j11[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Christy™[/font][/size][/color][spoiler=]\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Christy! Thanks for taking the time out for this interview!\r\n[b][color=#1466ff]Christy™[/color][/b]: You are welcome\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Before we begin, would you like to give a shoutout to any special members?\r\n[b][color=#1466ff]Christy™[/color][/b]: I would like to make a shoutout to Chief. and Positive\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Great! To start us off, how exactly did you find Hack Forums and what were your intentions upon joining?\r\n[b][color=#1466ff]Christy™[/color][/b]: My friend introuduced me to Hackforums. I had a lot of Gamertags for Xbox and he told me I could sell them on Hackforums. My intentions were to sell my Gamertags and meet people. I loved the people on it after I joined.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: You are certainly well known in the gamertag section for your quality original gamertags. Do you have any favorite gamertags in your possession?\r\n[b][color=#1466ff]Christy™[/color][/b]: I have a favorite Gamertag but it is my main so I can not disclose it. I can just tell you its very original. My favorite Gamertag I did own was Cupcake.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Just one of the examples of your great gamertag collection - Check out Christy if you're looking for an OG! Outside of Hack Forums, what are your favorite activities?\r\n[b][color=#1466ff]Christy™[/color][/b]: I love to game, so Xbox is one of my favorite activities. Then I would have to say helping out in the community. I do a lot of community work. For example every Christmas I devote weekends to stand outside in the cold to ring the bell for the Salvation Army. My dad coordinates it every year along with other events for the Kiwanis Club. Lastly I love hanging out with my friends and family.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: That's great - Volunteering is certainly a great way to spend free time, especially around the holidays. I see you're in Propitious - A new group I'm not very familiar with. Would you care to explain it a little bit, and you're duties in it?\r\n[b][color=#1466ff]Christy™[/color][/b]: Propitious is a group of higher quality members that serve the community. The group as of now is still working on getting started up. TheHackersLove and iNiviZ are doing a great job about managing it. Currently, we are working on ways to contribute to Hackforums as a group. Every member in Propitious has already contributed to Hackforums in many ways already but everyone knows as a team you can accomplish more. Thats all I can say about that group as of now.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: That sounds great -  I can't wait to see more from them. If you could change one thing on Hack Forums, what would it be, and why?\r\n[b][color=#1466ff]Christy™[/color][/b]: The only thing I would change is the penalty for flaming. I see so many members getting harassed along with me. Girls have it the hardest on Hackforums. Flaming is never acceptable and is very low quality. I do not flame even if someone else is already doing it towards me. When you flame someone it is a form of bullying;  I always private message members and ask if they are okay after an attack like this.  On my own I plan on changing the Gaming  Section by making tutorials to make it higher quality and useful. As of now that section lacks a sense of community and purpose.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: I totally agree - I think Staff is very leniant with those who verbally abuse their peers. I really appreciate the interview - Before we wrap it up, do you have any words for the readers?\r\n[b][color=#1466ff]Christy™[/color][/b]: Remember readers, members on Hackforums should never flame remember to stay higher quality by not flaming. Make sure to check out the group Techsperts on Hackforums I am currently Co-Leading it. The leaders of it are Positive and The Rated R Superstar and the Co-Leaders are Delicious, Qwazz and myself.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Thanks Christy!\r\n[/spoiler]\r\n\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Scooter[/font][/size][/color][spoiler=]\r\n[b][color=white]Paradise.[/color][/b]: Hey, Scooter! I'm glad you could take the time to have this interview with me! It's quite an honor for me.\r\n[b][color=#1466FF]Scooter[/color][/b]: Glad to be interviewed Paradise., this is my first interview, so it's an honor for me as well.\r\n\r\n[b][color=white]Paradise.[/color][/b]: That's great! Before we start... Would you like to give some shout outs?\r\n[b][color=#1466FF]Scooter[/color][/b]: I'd like to give a shout out to the Red Lions (except Wolves and Guess Who is Back), the Marketers, and all the people who have helped me throughout my HF career.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Haha, alright! You've come very far through your HF career? How did it all start though? How'd you find Hack Forums?\r\n[b][color=#1466FF]Scooter[/color][/b]: WHAT ARE YOU DOING? THERE SHOULDN'T BE A QUESTION MARK AFTER CAREER! Just kidding. I found HF when looking for ways to hack my brother's GaiaOnline account a few years ago. I probably would have had an earlier join date, but I just lurked around.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Oh, I see. When you joined, how did you get your alias, \"Scooter\"?\r\n[b][color=#1466FF]Scooter[/color][/b]: For as long as I remember, my nickname on the streets has been \"Scooter\", since I used to ride my scooter around the park. When I first joined, the username Scooter was taken. However, luckily for me, it soon became available when Omniscient pruned the inactive accounts.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Very cool. I remember when I used to always ride my scooter up and down the block. So, how do you think Hack Forums is doing in general? As the community, and staff all together.\r\n[b][color=#1466FF]Scooter[/color][/b]: Hack Forums is doing quite well, I suppose. However, I can't say that I like Omniscient's work ethic. I realize that he's extremely busy, but when Omni says that something will come \"soon\", it usually takes months. As for the staff, they do a great job keeping the forum clean and safe.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Hmm, I agree completely. Vouch System is a great example. Which brings up another question; If you could add, remove, or change one thing about Hack Forums.. What would it be?\r\n[b][color=#1466FF]Scooter[/color][/b]: To be honest, the one thing that HackForums needs above all is scammer protection. Scamming runs rampant in the Marketplace, and it seems to me like nothing is done about it. Scamming, in my opinion, tarnishes HF's reputation as an otherwise good place for members.\r\n\r\n[b][color=white]Paradise.[/color][/b]: I do believe if Omniscient COULD physically remove scamming, he would. It is getting outrageous. Just like that recent \"The Holy\" scamming, and more. Do you see yourself as a possible staff member or mentor for Hack Forums in the future? If so, why?\r\n[b][color=#1466FF]Scooter[/color][/b]: Possible staff member - definitely not. Possible mentor - I hope so, though not likely. Being staff takes too much dedication, hard-work, and commitment to HF which I could never do. Also, I've had more than a few warnings which probably lessens my chance as a staff member.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Ah, I see. Talking about groups and being in them; what do you think about the new group, \"Propitious\"?\r\n[b][color=#1466FF]Scooter[/color][/b]: I'm not familiar with what they do, yet I see many people in the group already. I hope that they will do their part to contribute to the community, and I hope that they don't let EVERYBODY in. I'd love to see Propitious become an elite group.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Yes. Lots of people just wanting it for the userbar though. What do you think about the group forum? In the past WEEK, I've seen 10+ threads saying groups are \"coming soon\".\r\n[b][color=#1466FF]Scooter[/color][/b]: Lots of scams can happen in regards to Groups and Group Membership Payments. Infact, if I recall correctly, the HF News's very own music writer, OVO, was engaged in a group membership scam.\r\n\r\n[b][color=white]Paradise.[/color][/b]: I've heard bits and pieces on that. Like we talked about earlier, scamming is everywhere and we only wish for it to be gone. Let's loosen it up.. What about that Super Bowl?\r\n[b][color=#1466FF]Scooter[/color][/b]: Since I'm from New Jersey, I couldn't be any happier that the Giants won the Superbowl. It feels great, also I'm going to call out Omniscient - He thought that the Patriots would win lol.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Haha. Another big thing that's pretty big in my eyes. I was surprised to hear about it; the closing of [removed].com.. What do you think about that?\r\n[b][color=#1466FF]Scooter[/color][/b]: I guess it was deserved; it was legally inevitable. However, what interested me more than that whole closure was the attack of Anonymous on the FBI after the incident.\r\n\r\n[b][color=white]Paradise.[/color][/b]: Oh, I haven't heard about that sadly. Sounds interesting though, and I'll be sure to look that up. Anyways, I think I talked about everything I wanted to talk about this evening. Do you have anything you want to talk about?\r\n[b][color=#1466FF]Scooter[/color][/b]: --\r\n[/spoiler]\r\n",
      "subject": "[2/15/12] - HF News"
    },
    {
      "pid": "19999782",
      "uid": "515249",
      "dateline": "1329372391",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Whitney Houston Passes Away[/b][/color]\nOn February 11, 2012, Whitney Houston was found dead on her hotel floor at the age of 48 the night before the Grammys.  During the few days after her sudden death, sales for her decade old songs hit the top charts on iTunes and Amazon.  A source from Yahoo news stated that \"'I Will Always Love You,' jumped to 195,000 downloads in the week through Sunday, up from just 3,000 the week prior\".  Similar to Michael Jackson's This Is It movie, Houston will be featured in a movie set to be released next year portraying the a concerned mother of three daughters whom have had drugs affect their lives while forming a singing group.\n\n[color=white][b]Syrian Forces Attack Hama[/b][/color]\nEarly Wednesday, Syrian forces started an offensive attack on the city of Hama where military fired at civilians from armored vehicles and anti-aircraft weapons, whilst ignoring international pressure.  As of now, there have been no casualty reports, but an opposing activist who spoke briefly via satellite phone stated that the \"landlines and mobile networks had been cut in the whole of Hama.\"\n\n[color=white][b]American Airline Workers Protest[/b][/color]\nAmerican Airline employees gathered together and marched to protest the companies plans of outsourcing jobs, cutting pay, and reducing benefits.  The company filed for bankruptcy on November 29th after losing billions of dollars in losses over then past 10 years.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[size=large][b][color=white]Apple:[/color][/b][/size]\n[b][color=white]Siri:[/color][/b]\nSiri the personal assistant the revolutionized the iPhone 4S has been updated. This recent update broke Spire and any server running a proxy to stop working. It seems like Apple is either combating non-4S devices from having Siri or since Siri is still in beta they are updating it. Siri is really the main reason everyone wanted a 4S. Maybe in the coming days Apple will come out with another update.\n\n[b][color=white]iPad 3:[/color][/b]\nYes, yes. Another iPad 3 story.. Well the iPad 3 has been getting a lot of talking about. WSJ is stating that Apple is testing a 8” iPad. Also LTE compatible and maybe sporting a A6 processor that’s quad-core! Release date should be imminent and maybe early March. For sure if its sporting a retina display I will be getting one.\n\n[size=large][b][color=white]Other:[/color][/b][/size]\n[b][color=white]Motorola Droid 4[/color][/b]\nThe new Motorola Droid 4 came out. Its sports a more sleek finish and nice looking keyboard.  This phone is a original Droid, “Not a Droid Charge or Droid Razr, but just a straight up Droid. The original Droid basically single-handedly pulled Motorola Mobility out of its tailspin.” (Gizmodo.com) . This phone could be the next best thing to come out?  The battery life is great according to users. Will you get it?\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][i]The HF News Team is looking for a replacement Music News writer. Sir doesn't have the time to write this section every single week, so the position will be available to all that meet the specific requirements.[/i][/color]\n\n[spoiler=Requirements]\n[list]\n[*]Member of Hack Forums for at least four months\n[*]1,000 posts\n[*]Good grammar (you know who you are)\n[*]Willing to turn in your article by Tuesday night\n[*]Some type of knowledge or background in music\n[/list][/spoiler]\n\n[spoiler=Apply]\n[url=http://hackforums.net/private.php?action=send&uid=515249&subject=Music%20News%20-%20Application&message=Hello,%20here%20is%20my%20application:]Message me with the following:[/url]\n[code]\n[b]Username:[/b]\n[b]Musical involvement:[/b]\n[b]Any past experience:[/b]\n[/code]\n\nKeep them short and sweet, I will deny you instantly if it's too long, don't try to show off in the application.\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThis is more aimed at the population of Hack Forums that is still in schooling, but can be applied generally anywhere. We always want to give up at some point, and we always hear the \"Go for it!\" or \"You can do it!\" Never are people supposed to just give up, throw in the towel, no, they are always picked back up and brushed off. You always hear that you need to get back up, but never hear why. Sometimes you just need to relax, go with the flow, give up for a while. I know I'm not making much sense, but sometimes thing just have a way of working themselves out. Contrary to most people's beliefs, the 'universe' has a mind of its own. Try something different for a while, show that you can live on, but don't be afraid to fight for what you want when called out on it, for there may be a time when you will be.",
      "subject": "*"
    },
    {
      "pid": "19999789",
      "uid": "515249",
      "dateline": "1329372418",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about the current state of Hack Forums? Compared to your join date.\"\n\n[i]\"I joined HF about 6 months ago. To be honest HF has changed quite a bit.\nMany official groups have been shut down and new ones have been come up \nin their place.The overall atmosphere of HF is bustling right now due to constant \nchanges,than it was months ago. HF is evolving into an ultimate community not \nonly for \"hackers\" but for everyone else. It has been a pleasure to grow alongside \nHF.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=964814][i]-Vulcan™[/i][/url]\n\n[align=right][i]\"I thought it was cool when HF had Password dumps, and you were able \nto post links to things with pirated content, i thought that was cool, but Omni probably \nwould have faced legal issues with that so probably why it stopped, but i think it used \nto be a lot more layed back than it is now... mind you it is a lot more HQ than it used to \nbe\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=150496][i]-Derwin[/i][/url][/align]\n\nThe topic for next week is \"What's your opinion of Factor8?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/QhwQW.jpg[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/MkZoV.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/2673572_460s.jpg[/img][/spoiler]\n[color=white][i](^Large^)[/i][/color][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=L4HSZjZ_9P4[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=103669][b][color=white]Factor8™[/color][/url][/b] - was promoted to admin.\n[url=http://hackforums.net/member.php?action=profile&uid=613009][b][color=white]Morchid[/color][/url][/b] - was demoted from Red Lions leader.\n[url=http://hackforums.net/member.php?action=profile&uid=656453][b][color=#32CD32]ReactioNz[/color][/url][/b] - was promoted to Staff.\n[url=http://hackforums.net/member.php?action=profile&uid=2103][b][color=white]Crow[/color][/url][/b] - stepped down from Admin he is now a Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=81119][b][color=#0066FF]Tsgh Mike[/color][/url][/b] - stepped down from Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=40895][b][color=white]BV1 ツ[/color][/url][/b] - is no longer leader of the Marketers.\n[url=http://hackforums.net/member.php?action=profile&uid=182754][b][color=white]Orgy[/color][/url][/b] - is no longer leader of the Marketers.\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=2103][b][color=white]Crow[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?uid=2103]DaBomb[/url] award.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net]Open[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Paradise.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}