{
  "posts": [
    {
      "pid": "62825687",
      "uid": "2331053",
      "dateline": "1758557624",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/w-red.png[/img]\r\n\r\n[b][size=xx-large][color=#ffffff][u]Hack Forum News - Edition 15[/u][/color][/size][/b]\r\n\r\n[b]Welcome back to the Hack Forum News. Where we keep you up to date on the weekly events and news happening on site and around the world. If you have never heard of the Hack Forum News, don't worry, we have you covered. We are a team of members from the Hack Forums community who are journalists and writers, and we are here to keep you in the loop of the changes around the site and the events happening around the world.[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/headlines.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6308262][color=#ffffff]OSINT Forum[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\n[mention=1] has renamed the \"Private Investigation Methods  to \"OpSec and OSINT\". This change will make it easier to understand what that forum is for. Also allows some new topics to be discussed and hopefully will bring some activity to that forum.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6308021][color=#ffffff]SRPP Deleted[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nRecently [mention=1] made the decision to delete the entire SRPP category from HF. This decision was made to try push the Forum to focus primarily on hacking and tech rather than being more social. The removal of these forums will delete almost 1 million posts. [mention=1] quotes \"We will no longer encourage discussion based on politics or religion. I want us to be a technology forum. In the early days of HF we had a policy against any political or nationality context in profiles. That mean no flags, no political statements, and we got along much better.\"\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6307040][color=#ffffff]Stanley Fan Award Goal[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nRecently [mention=1] released a brand new award for everyone to earn. With this new award you will need to make 250 posts that are replies to Stanley 's threads. Stanley has been making threads for a while now and with this we can see a massive increase in replies to the threads the Stanley bot is making. Good luck everyone award hunting.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6307025][color=#ffffff]New Sales Tags[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nWith the recent changes to the design of the site, [mention=1] has now started to look into changing the look of the current sales tags used on the site. The thread is looking for feedback from site members to see what they think of the new design made by [mention=776749]\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6299866][color=#ffffff]Hack Forums News Team - Become a Writer[/color][/url][/size][/b][/u] By [mention=2331053]\r\n\r\nAre you looking to join the HF news team? Do you enjoy making threads or even want to become a better writer? Well, we are looking for members of the site to help write each week and are looking for anyone who has any interest. We have a few new sections opening up right now, and we would love for you to see if they would be anything of interest to you. If you are interested, please check out the thread or contact [mention=2331053] to discuss joining the team behind the HF News.\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/statistics-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[img=800x400]https://i.gyazo.com/26b71c93a146b2b4f5c46ee785e8e607.png[/img]\r\n\r\nLast Week:\r\n[spoiler][img=800x400]https://i.gyazo.com/9e6e5899c6db14827c8df0862af2178d.png[/img][/spoiler]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/awards-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n[color=#ffffff]\r\n\r\n[b]Quick reminder, the donation awards page has had a bit of a change. Some of the classic awards are back up for purchase. If you would like to check out what is new, head over to the donation award page to snipe up some of the awards today.  Or [url=https://hackforums.net/buyawards.php][u]Click Here![/u][/url][/b]\r\n[b]\r\n\r\n[mention=843423] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=5697524] Has obtained the \"Dicey\" award - [award=97]\r\n[/color][/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/groups-header.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\r\n\r\n[b][u]GROUPS FOR SALE AND SOLD[/u][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6241882]Succubus group[/url] is still listed for sale by [mention=3604010]\r\n[url=https://hackforums.net/showthread.php?tid=6302394]Olympians group & Benevolence [/url] are listed for sale by [mention=1342286]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6304410]Mystery Inc[/url] listed for sale by [mention=3909991]\r\n\r\nNo recent group sales.\r\n\r\n\r\n[B][u]RECENT GROUP CHANGES & EVENTS[/u][/B]\r\n\r\nFidelity has been rebranded to Quantum\r\n\r\n[b][size=large][u]RECRUITMENTS:[/u][/size][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6298855]Casino Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6226725]Pink LSZ Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6304113]Warriors Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6275486]Gamblers Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6294522]Legends Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6046141]Allegiance Buy-in[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6295130]Olympians leader recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6300585]The Academy Recruitment [/url]\r\n\r\n[hr]\r\n\r\n\r\n[img]https://hackforums.net/images/hfnews/music-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\nRecently we introduced a brand-new section to the HF News. This section will grow over time to more things, but for now we are just going to be doing Song of the week. We are open to what more we could bring to the section from your suggestions, but as a start, we feel adding the song of the week will be a great start for the section and lead the way forward for more things in the future.\r\n\r\nNow we know some of you may question what the song of the week is all about, and we have thought of what a great answer. We feel like the song of the week should be a meaningful song that goes deeper than just general music and has meaning to it all. Granted, we may have a little fun with it sometimes. (Yes, we will have a Halloween version and Christmas version too.) But we want to keep it at a level where we have found the song has a true message behind it all and not just something that everyone will just see as another song that is just a bit catchy or got a good few beats to it. We hope this helps those with that question and if anyone has anything that they wish to ask, please feel free to add them below. We are more than happy to give the reason behind it.\r\n\r\nThis weeks Song Of The Week:\r\n[video=youtube]https://youtu.be/u2ah9tWTkmk?si=1oUoUJOC8o2WLdTB[/video]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/contests.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6305248]\r\n$100 USD (BTC) Contest || Celebrating My Acceptance in The Academy[/url] By [mention=4189082] [/color][/size][/b][/u]\r\n\r\nA new contest has been created this week by [mention=4189082] They have recently been accepted into The Academy, and they feel like it's time for them to share the love by making a massive $100 BTC giveaway to one lucky winner. Let's make sure to spread the love, and thank them for the contest. The contest ends September 30th, 2025. Make sure you get yourself entered before it's too late.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6308726]⭐️ FREE 5,000 TikTok Views Giveaway – 1 Lucky Winner! ⭐️[/Url] by [mention=5457424] [/color][/size][/b][/u]\r\nA bit of a different type of giveaway than just cash or bytes. Those people that do Tiktok for any reason should be very interested in this. Great opportunity to get a boost on your profile! Get in quick!\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6307929]\r\n100,000 Bytes Contest || $250 Value || Post-To-Enter[/url] By [mention=5418830] [/color][/size][/b][/u]\r\n\r\nA new contest has been created this week by [mention=5418830] . Rules are simple. Upgraded Members Only, Post/Reply to enter, Max Popularity & Quick Love the OP. You have until 25th September to get in!\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/user.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\n[mention=533443] has gone on vacation until Feb 29, 2026\r\n[mention=18] has reached 4000 Popularity.\r\n\r\n[b]\r\n[size=large]Remember if you have reached an achievement on your account feel free to post about it on our weekly reports thread. That way we can add you to the news for the next edition. [u][url=https://hackforums.net/showthread.php?tid=6299864]Click Here To See The Weekly Reports Thread[/url][/u][/size]\r\n[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/gaming-header.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\r\n\r\n[size=large][color=#72FF84][b]Notable console & hardware releases:[/b][/color][/size]\r\n\r\n[size=medium][color=#FFFF44][u][b][size=large]Nintendo Making Apparent Changes to Switch Game Cases[/size][/b][/u][/color][/size]\r\n\r\n\r\nAccording to keen-eyed fans, some game cases for Nintendo Switch titles have been swapped from clear and transparent to red ones similar to those used for Nintendo Switch 2 games. The change to the original Nintendo Switch game cases was posted on social media, though it is unclear if the new red cases will be what Nintendo goes with for future releases.\r\n\r\nThrough the original Nintendo Switch's life cycle, the majority of physical games released for the system came in clear, transparent game cases. This allowed developers and publishers to print reversible covers that fans can utilize for display purposes. By comparison, the Nintendo Switch 2's game cases are colored red and are not transparent. While this makes them stand out from other game cases on the market, the Nintendo Switch 2's red cases received a mixed response from fans, namely from the inability to show off reversible art on both the inside and outside the case.\r\n\r\n[size=medium][color=#FFFF44][u][b][size=large]Xbox Is Raising Console Prices Again[/size][/b][/u][/color][/size]\r\n\r\nCustomers in the US will soon be paying more for a new Xbox console, as the ongoing tariff situation between the US and China is to blame for an imminent price increase. Microsoft stated that the price of all Xbox Series X and Series S consoles sold in the US will go into effect on October 3, with the Xbox Series S 512GB starting at $399 rather than the current $379.\r\n\r\nThe imminent price change is largely due to the ongoing tariff situation between the US and China. A controversial part of the Trump administration's economic policy, the tariffs imposed by the US government have affected the gaming industry across the globe.\r\n\r\n[size=medium][color=#FFFF44][u][b][size=large]New PS5 Console Update is Live Now[/size][/b][/u][/color][/size]\r\n\r\nAfter revealing more details yesterday, Sony has rolled out a new PlayStation 5 system update, introducing a new Power Saver mode and the ability to pair DualSense controllers across multiple devices simultaneously. The latter has been on many PlayStation 5 fans' wishlists for a while now, and with this new patch, it will be easier than ever to seamlessly switch between PC, console, and mobile devices.\r\n\r\n[size=large][color=#72FF84][b]Notable News (September 2025)[/b][/color][/size]\r\n\r\n[color=#FFFF44]Fortnite Leak Hints at New Star Wars Event[/color]\r\n\r\nRecent leaks from Fortnite are hinting at a brand-new Star Wars event set to run before the end of Chapter 6 Season 4, teasing a special live event. Fortnite's litany of crossovers throughout the game's history have often made sweeping changes to everything from the game's weapons to the in-game map of the battle royale. Previous seasons have featured the addition of weapons based on series like Dragon Ball Z, Futurama, and Deadpool, alongside map changes like an in-game tribute to JUICE WRLD. Now, a brand-new event based on a beloved sci-fi franchise may be in the works.\r\n\r\n[color=#FFFF44]September 25 is Going to Be a Big Day for Xbox Gamers[/color]\r\n\r\nThe Tokyo Game Show 2025 is gearing up to be quite an exciting event for gamers. When Xbox's showcase was first announced earlier this month, it was described by a senior company official as something fans \"don't want to miss.\" Sony will be there too, as well as numerous third-party publishers to show off their upcoming titles. The event will run from September 25 to 28, and Xbox gamers have an extra reason to be excited.\r\n\r\n[color=#FFFF44]Battlefield 6 Takes Inspiration From Call of Duty With Popular Quality-Of-Life Feature[/color]\r\n\r\nBattlefield 6 will officially allow players to choose which content they want to install on their console or PC, giving users more control over how much storage space the upcoming shooter will occupy. According to the Battlefield 6 Steam page, it is recommended that players have at least 80 GB of storage space free for the game's installation, but its handy quality-of-life feature means players can install the modes they want to play, which will take up much less storage space.\r\n\r\n[color=#72FF84][b]Game Releases - (September 2025)[/b][/color]\r\n\r\n[spoiler][list]\r\n[*]Above Snakes  — September 4\r\n[*]Adventures of Samsara  — September 4\r\n[*]Alien: Rogue Incursion Evolved (PC, PS5) — September 30\r\n[*]Arctic Awakening  — September 18\r\n[*]Atelier Resleriana: The Red Alchemist & the White Guardian — September 26\r\n[*]Baby Steps  — September 8\r\n[*]Baki Hanma: Blood Arena  — September 11\r\n[*]Borderlands 4  — September 12\r\n[*]Bubsy: Purrfect Collection  — September 8\r\n[*]Class of Heroes 3 Remaster  — September 18\r\n[*]Cronos: The New Dawn — September 5\r\n[*]Daemon X Machina: Titanic Scion  — September 5\r\n[*]Dark Deity 2 (Switch) — September 4\r\n[*]Demonschool  — September 3\r\n[*]Duckside  — September 3\r\n[*]Dying Light: The Beast  — September 18\r\n[*]EA Sports FC 26  — September 19 – 26\r\n[*]Everybody’s Golf: Hot Shots (PC, PS5, Switch) — September 5\r\n[*]Final Fantasy Tactics: The Ivalice Chronicles  — September 30\r\n[*]Formula Legends  — September 18\r\n[*]Frostpunk 2 (PS5, Xbox Series X and S) — September 18\r\n[*]Garfield Kart 2: All You Can Drift  — September 9\r\n[*]Gloomy Eyes — September 12\r\n[*]Hell is Us  — September 4\r\n[*]Henry Halfhead (PC, PS5, Switch) — September 16\r\n[*]Hirogami (PC, PS5) — September 3\r\n[*]Hollow Knight: Silksong  — September 4\r\n[*]Indiana Jones and the Great Circle: The Order of Giants DLC — September 4\r\n[*]Jotunnslayer: Hordes of Hel  — September 3\r\n[*]Karma: The Dark World  — September 10\r\n[*]Katanaut (PC) — September 10\r\n[*]Lapin (PS5, PS4) — September 2\r\n[*]LEGO Party  — September 30\r\n[*]LEGO Voyagers  — September 15\r\n[*]Little Witch in the Woods (PC) — September 4\r\n[*]Mandragora: Whispers of the Witch Tree (Switch) — September 4\r\n[*]Metal Eden (PC, PS5, Xbox Series X and S) — September 2\r\n[*]Moros Protocol (PC) — September 4\r\n[*]NBA 2K26  — September 5\r\n[*]NBA Bounce  — September 26\r\n[*]Nicktoons & the Dice of Destiny  — September 30\r\n[*]Otherskin (PC) — September 2\r\n[*]Pac-Man 2 Re-Pac  — September 26\r\n[*]Parasol Superstars  — September 16\r\n[*]Platypus Reclayed  — September 18\r\n[*]Scar-Lead Salvation  — September 2\r\n[*]Shuten Order (PC, Switch) — September 5\r\n[*]Silent Hill f (PC, PS5, Xbox Series X and S) — September 25\r\n[*]Slime Rancher 2  — September 23\r\n[*]Sonic Racing: CrossWorlds  — September 25\r\n[*]Star Wars Outlaws (Switch 2) — September 4\r\n[*]Strange Antiquities (PC, Switch) — September 17\r\n[*]Tiny Witch (Switch) — September 10\r\n[*]Trails in the Sky 1st Chapter  — September 18\r\n[*]Void Crew  — September 4\r\n[*]Wander Stars  — September 19\r\n[/list][/spoiler]\r\n\r\n\r\n\r\n\r\n\r\n\r\n[/align]",
      "subject": "Hack Forum News - Edition 15"
    },
    {
      "pid": "62825710",
      "uid": "2331053",
      "dateline": "1758560235",
      "message": "[align=center]\n[img]https://hackforums.net/images/hfnews/tech-header.png[/img]\n[size=medium][b]Writer –[/b][/size]  [mention=5465469]\n\n[u][b][size=large][color=#ffffff]European airports hit by cyberattack on airline software[/color][/size][/b][/u]  \nA cyberattack on Collins Aerospace’s MUSE check-in and boarding system disrupted operations at major European airports which included Heathrow, Brussels, Berlin, and Dublin. Flight check-in and baggage systems were down, causing cancellations and lot of delays.  \n[b][url=https://www.reuters.com/en/cyberattack-causes-flight-delays-cancellations-brussels-airport-2025-09-20/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Inside the Jaguar Land Rover hack: supply chain & smart factory failures exposed[/color][/size][/b][/u]  \nA cyberattack has left Jaguar Land Rover’s global smart factories stalled (except China operations), revealing dependency on outsourced cybersecurity and weak supply-chain resilience. The attack could cost hundreds of millions of money.  \n[b][url=https://www.theguardian.com/business/2025/sep/20/jaguar-land-rover-hack-factories-cybersecurity-jlr]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]AI misuse rising: generative systems fueling new cyber threats[/color][/size][/b][/u]  \nExperts warn generative AI is being misused by hackers to bypass traditional security which included automated phishing, crafting targeted attacks via manipulated AI assistants, and collaborating with existing malware tools.  \n[b][url=https://www.washingtonpost.com/technology/2025/09/20/ai-hacking-cybersecurity-cyberthreats/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Netskope IPO valuated at ~$7.3B amid cybersecurity market boom[/color][/size][/b][/u]  \nCloud security firm Netskope raised its IPO price range, targeting a valuation of $7.26-7.30 billion. Strong demand highlights investor confidence in cloud and SASE security amid rising threats.  \n[b][url=https://www.reuters.com/business/cybersecurity-firm-netskope-lifts-ipo-price-range-eyes-73-billion-valuation-2025-09-16/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]CrowdStrike to acquire AI security specialist Pangea Cyber[/color][/size][/b][/u]  \nCrowdStrike is buying Pangea Cyber (~US$260M) to bolster its ability to defend against AI-based attacks, such as prompt injection and misuse of large language models in enterprise environments.  \n[b][url=https://www.wsj.com/articles/crowdstrike-to-buy-ai-security-company-pangea-a82946e9]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]API-based cyberattacks spike: 40,000+ incidents reported H1 2025[/color][/size][/b][/u]  \nA Thales report reveals over 40,000 API-based attacks across 4,000 environments in the first half of 2025. Attackers increasingly favor APIs as a vector for automation, data exfiltration, and stealthy access.  \n[b][url=https://www.tech.co/news/massive-api-cyber-attack-spike-observed]Source[/url][/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/comics-header.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[b][size=x-large][color=#ffffff]-1-[/color][/size][/b]\n[spoiler][img]https://img-s-msn-com.akamaized.net/tenant/amp/entityid/BB1oNhUU.img?w=700&h=642&m=6[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-2-[/color][/size][/b]\n[spoiler][img]https://i0.wp.com/warandpeas.com/wp-content/uploads/2025/07/war-and-peas-fad-diets.jpg?resize=768%2C891&ssl=1[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-3-[/color][/size][/b]\n[spoiler][img]https://i.pinimg.com/736x/42/b6/05/42b605888d9a0d233d57b9ca5ef5afc9.jpg[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-4-[/color][/size][/b]\n[spoiler][img]https://preview.redd.it/asking-gpt-to-make-a-funny-original-comic-v0-g4h53pmh1yhe1.jpeg?width=1080&crop=smart&auto=webp&s=6f09a174eda3e4f2288b1e9778106c7d63786b88[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-5-[/color][/size][/b]\n[spoiler][img]https://thunderdungeon.com/wp-content/uploads/2025/02/dark-humor-comics-27-20250205.jpg[/img][/spoiler]\n\n[hr]\n\n[b][size=x-large]A big thank you to all the members who put in the hard workto bring us another edition of HF News this week[/size][/b]\n\n[size=x-large] [mention=2331053] [mention=57618] [mention=3929084] [mention=3725052] [mention=5465469] [/size]\n\n[hr]\n\n[hr]\n\n[b][size=xx-large][u]Support The Team by wearing our signatures[/u][/size][/b]\n\nIf you have enjoyed the read please consider using one of our signatures in any way to support us!\n\n[img]https://hackforums.net/images/hfnews/support-red.png[/img] [img]https://hackforums.net/images/hfnews/support-gray.png[/img]\n[img]https://hackforums.net/images/hfnews/support-magenta.png[/img] [img]https://hackforums.net/images/hfnews/support-brown.png[/img]\n[img]https://hackforums.net/images/hfnews/support-magenta-2.png[/img]\n\n[b][size=xx-large][color=#E82A1F]Red[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-red.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#0074D9]Blue[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-gray.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#2ECC40]Green[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-magenta.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#E86E04]Orange[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-brown.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#B10DC9]Purple[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-magenta-2.png[/img][/url][/align][/code]\n\n[/align]",
      "subject": "RE: Hack Forum News - Edition 15"
    }
  ]
}