{
  "posts": [
    {
      "pid": "11517093",
      "uid": "295848",
      "dateline": "1303944833",
      "message": "\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFmainbanner.png[/IMG][/align]\n\n[color=#98FB98][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\n\nThe edition you are currently reading is the [b]39th full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFheadlines.png[/IMG][/align]\n\n[align=justify][url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has created a thread further discussing his VPN service. This service would be provided by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] in partnership with OpenVPN. If you would like to read more on this topic click [url=http://hackforums.net/showthread.php?tid=1229973]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Hanzo[/b][/color][/url] our reputation abuse enforcement administrator has finally decided to start giving out reputation points, to a few members. To see who those member lucky members are, Ub3rs can check his log [url=http://hackforums.net/repsgiven.php?uid=4066]here[/url]. \n\nHave you been wondering about all the downtime lately due to DoS and DDoS attacks? [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has posted a thread about the new server, and how it will handle these attacks [url=http://hackforums.net/showthread.php?tid=1243533]here[/url]. More spoilers can be found [url=http://hackforums.net/showthread.php?tid=1246598]here[/url]. \n\n[url=http://hackforums.net/member.php?action=profile&uid=46373][color=black][b]phire nuk3r[/b][/color][/url] a former site staff, has been repfucked and given a negative 10 from [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] stating, \"Maybe now you're rep fucked you will stop giving a shit.\" He has also resigned from his staffing position and requested a two-week vacation ban for himself. This leaves the Reviewers, a group he led, in a tough spot. We hope everything will be sorted out soon.\n\n[url=http://hackforums.net/member.php?action=profile&uid=47360][color=#0066FF][b]Saged[/b][/color][/url] has announced his resignation as Staff. He has suggested a successor and many people are wondering who it is. See his thread [url=http://hackforums.net/showthread.php?tid=1230174]here[/url].\n\nCongratulations to [url=http://hackforums.net/member.php?action=profile&uid=100071][color=lime][b]cobija[/b][/color][/url] for being promoted to the position of Staff. If you would like to personally congratulate him it should be done so in [url=http://hackforums.net/showthread.php?tid=1231852]this[/url] thread.\n\nThis week, a new group has emerged called [color=#A9A9A9][b]Techsperts[/b][/color]. Leadership of this group is solely [url=http://hackforums.net/member.php?action=profile&uid=30595][b][color=lime]The Rated R Superstar[/color][/b][/url]'s. Here's what he had to say about it. \"We're a new group, we're going to be VERY exclusive. Only the best of the best will get in.\" He went on to comment, \"Expect us soon.\"\n\n[color=white][b]The Alliance[/b][/color] has finished all applications in their last recruiting thread and added some new members. Congratulations to all of the members for getting in. [url=http://hackforums.net/member.php?action=profile&uid=234024][color=white][b]Deities[/b][/color][/url] was recently promoted as a new leader.\n\n[url=http://hackforums.net/member.php?action=profile&uid=85928][color=#0066FF][b]Swag[/b][/color][/url] has been removed from leadership in [color=#87CEFA][b]The RAT's Crew[/b][/color]. This means next in command [url=http://hackforums.net/member.php?action=profile&uid=200751][color=white][b]Zach[/b][/url][/color] has become the official owner of the group. His first act as leader was to promote a new leader to fill Swag's absence -- this new position has been filled by [url=http://hackforums.net/member.php?action=profile&uid=132817][color=white][b]S70N3R[/b][/color][/url].\n\nBoth [color=#87CEFA][b]The RAT's Crew[/b][/color] and the [color=#9370DB][b]Black Knights[/b][/color] have opened their doors to new members this week. If you feel that you have what it takes to be a member of either group, please check out the Recruitment section [url=http://hackforums.net/forumdisplay.php?fid=52]here[/url] and look for their threads.[/align] \n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFusernews.png[/IMG][/align]\n\n[align=justify]Over the Easter weekend [url=http://hackforums.net/member.php?action=profile&uid=63387][color=white][b]Black Shadow™[/b][/color][/url] showed his dedication to the site, by spending 30 straight hours online on Hack Forums. More on his experience can be read [url=http://hackforums.net/showthread.php?tid=1241117]here[/url].\n\nRecently the old-timer, [url=http://hackforums.net/member.php?action=profile&uid=61391][color=#0066FF][b]Tank[/b][/color][/url] was unbanned after being banned for scamming the member [url=http://hackforums.net/member.php?action=profile&uid=150196][color=#0066FF][b]Cubby[/b][/color][/url]. This was a large controversy at the time due to him having been a moderator of the Scam Reports section. He has often been considered as one of the greatest members of The Lounge, if not Hack Forums itself, and it is good to see him back. Tank says that he and Cubby are making amends. The scam report can be read [url=http://hackforums.net/showthread.php?tid=829583]here[/url] for further information.\n\n[url=http://hackforums.net/member.php?action=profile&uid=295848][color=#AAAAFF][b]Qwazz[/b][/color][/url] has been promoted to  moderator -- he now moderates the [url=http://hackforums.net/forumdisplay.php?fid=162]HF News[/url] section. If you would like to see who all of the forum moderators are click [url=http://hackforums.net/showteam.php]here[/url].\n\nThis week [url=http://hackforums.net/member.php?action=profile&uid=63387][color=white][b]Black Shadow™[/b][/color][/url], [color=white][b]N3w_2_H@Ck1n™[/b][/color] and [url=http://hackforums.net/member.php?action=profile&uid=81075][color=white][b]Robbieava[/b][/color][/url], have achieved 1,000 reputation points. Only a total of 11 members have surpassed this milestone, so it's quite an achievement.\n\nAnother member joins the ranks of the Master Donators this week, congratulations to [url=http://hackforums.net/member.php?action=profile&uid=326128][color=#0066FF][b]Time[/b][/color][/url] for surpassing $500 donated to Hack Forums. This site wouldn't be where it is today if it weren't for the generosity of members like him. If you're interested in finding out who is on the Master Donators list click [url=http://hackforums.net/myawards.php?awid=50]here[/url].\n\nThe Great Ninja known as [url=http://hackforums.net/member.php?action=profile&uid=234024][color=white][b]Deities[/b][/color][/url] has created a new group called the Peace Keepers. The group was created to help prevent public information from being sold on Hack Forums' marketplace. Public information can legally be sold, and is within Hack Forums rules, however, is it morally correct? Deities and his followers don't think so. Their mission; to prevent members from being swindled by those selling public, widely-known methods. To prevent the sale of such methods the Peace Keepers will be giving out these methods for free, in hope of preventing them from being sold in the Marketplace. Check out both their [url=http://hackforums.net/showthread.php?tid=1235371]Recruitment[/url] and [url=http://hackforums.net/showthread.php?tid=1235357]Contributions[/url] thread to help the cause!\n\n[url=http://hackforums.net/member.php?action=profile&uid=74052][color=#0066FF][b]Gold[/b][/color][/url] has finally had his Ub3r back after having to endure almost eight months of being limited. He was then repfucked a couple days later for an unknown reason. \n\n[url=http://hackforums.net/member.php?action=profile&uid=385801][color=white][b]Indirect[/b][/color][/url] has been repfucked by choice, to prove he truly doesn't care about rep and never has.\n\nHave you ever wondered who Hack Forums' longest standing members are? [url=http://hackforums.net/member.php?action=profile&uid=661940][color=#0066FF][b]bugga[/b][/color][/url] has created a thread asking just that, with over 32 pages of replies in just 3 days, it's safe to say the thread was quite a hit. If you would like to check it out click [url=http://hackforums.net/showthread.php?tid=1239283]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=#0066FF][b]Vitani's Mate[/b][/color][/url] has created a thread titled [b]The Poopie List[/b] explaining just about every possible way a person can go number 2. If you're interested in learning some alternative names for defecating [url=http://hackforums.net/showthread.php?tid=1117962]this[/url] thread is for you.\n\n[url=http://hackforums.net/member.php?action=profile&uid=112139][color=black][b]Carbon[/b][/color][/url] has been banned for multiple accounts, he can return on the 3rd of May if he chooses to.\n\n[url=http://hackforums.net/member.php?action=profile&uid=277712][color=black][b]Cobalt[/b][/color][/url] has been banned for two weeks under the suspicions of \"profile botting\" or in other words boosting online time.\n\n[url=http://hackforums.net/member.php?action=profile&uid=479120][color=black][b]Zev eH[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=70346][color=black][b]Crust[/b][/color][/url] have both been banned and moved to the \"Dead Accounts\" group. [/align]\n\n[url=http://hackforums.net/member.php?action=profile&uid=300616][color=#0066FF][b]Thoth[/b][/color][/url] has recently made some changes with his Minecraft server, [url=http://valiantcraft.net]ValiantCraft[/url]. He has upgraded his servers to bring forth a commonly called 'lag-free' server. Also, his 'pixel art' contest is drawing to a close. The winner will receive their own private group and a Minecraft beta code. The owner has also released that he promoted new Staff on his server, including Hack Forums' own [url=http://hackforums.net/member.php?action=profile&uid=17503][color=lime][b]xerotic[/b][/color][/url] to admin. If you wish to play on his server, simply type in [i]play.valiantcraft.net[/i] for the server IP.\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFothernews.png[/IMG][/align]\n\n[align=justify]Since Easter was has passed this week, here are a few little known facts about both the holiday itself and the animal that represents it.\n\nEaster is one day of the year where Christians celebrate Jesus Christ's resurrection. According to the Canonical gospels, Jesus rose from the dead on the third day after his crucifixion. Easter marks the end of Lent, a forty-day period of fasting, prayer, and penance. The last week of the Lent is called Holy Week, and it contains Good Friday, commemorating the crucifixion and death of Jesus. Easter is followed by fifty-day period called Eastertide or the Easter Season, ending with Pentecost Sunday. The modern English term Easter developed from the Old English word [b]Ēastre or Ēostre (IPA: [ˈæːɑstre, ˈeːostre])[/b], which itself developed prior to 899 AD.\n\nAccording to University of Florida's Center for Children's Literature and Culture, the origin of the celebration — and the Easter bunny — can be traced back to 13th century, pre-Christian Germany, when people worshiped several gods and goddesses. The Teutonic deity Eostra was the goddess of spring and fertility, and feasts were held in her honor on the Vernal Equinox. Her symbol was the rabbit because of the animal’s high reproduction rate.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFinterviews.png[/IMG][/align]\n\n [size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - cobija[/color][/font][/size]\n[spoiler]\n[align=justify][color=white][b]ROCKST★R:[/b][/color] Hello cobija, thank you for taking the time to answer a few questions.\n[color=lime][b]cobija:[/b][/color] You're very welcome.\n\n[color=white][b]ROCKST★R:[/b][/color] How does it feel to be added to Staff?\n[color=lime][b]cobija:[/b][/color] It feels alright. I thought it would be fairly easy going. Then I realized how much responsibilities were placed on my shoulders.\n\n[color=white][b]ROCKST★R:[/b][/color] How do you feel about the current state of Hack Forums, quality-wise?\n[color=lime][b]cobija:[/b][/color] It has seen better days. There are still the occasional trolls and such, but it has improved IMO with active Staff and just overall people reporting quickly.\n\n[color=white][b]ROCKST★R:[/b][/color] You are a very respectable member and many might even say a mentor to the HJT Team and The Alliance. How do you explain your success so to speak?\n[color=lime][b]cobija:[/b][/color] Well, I love helping people, so that is a big part of my success. My tip would be to find something on HF that you like, such as coding and stick with it. You will meet people with similar interests and enjoy HF more.\n\n[color=white][b]ROCKST★R:[/b][/color] I see you have a few awards and I was wondering what other goals do you have?\n[color=lime][b]cobija:[/b][/color] Nothing right now. 100 posts from 10k posts. The main fuel for making me get it is to see the user title and the extra star under my name. But yeah, besides that nothing really.\n\n[color=white][b]ROCKST★R:[/b][/color] How do you feel about the current groups you are in. (HJT Team, Gamers, The Alliance)\n[color=lime][b]cobija:[/b][/color] I feel that they are great. We have great active leaders that make everything possible.\n\n[color=white][b]ROCKST★R:[/b][/color] When you first joined Hack Forums did you have any friends?\n[color=lime][b]cobija:[/b][/color] Actually, one of my first friends on HF was Factor8. Besides that, no one really THAT close to me. I eventually just got friendly with anyone that I could, more specifically white-hatters.\n\n[color=white][b]ROCKST★R:[/b][/color] Many members say once you become Staff you change. What do you think of this theory?\n[color=lime][b]cobija:[/b][/color] I think it is true, but from what I have seen so far, I am not too strict of a staff member. I don't ignore people's PMs and such like other Staff. My role model would probably be how N2H was on Staff.\n\n[color=white][b]ROCKST★R:[/b][/color] Is there anyone you look up to?\n[color=lime][b]cobija:[/b][/color] No one really on HF. But being a Christian, I look up to God. He has made my life much better even with everything that has gone on.\n\n[color=white][b]ROCKST★R:[/b][/color] Do you have any advice for the new members of Hack Forums?\n[color=lime][b]cobija:[/b][/color] Yes, start HQ and read the Help Docs. You would be surprised how quickly respected you get if you correct a L33T or avoid breaking rules. Also as stated above, find your niche and you will be liked. Also, don't try hard for anything. Even though you are being a monitor, it becomes apparent when someone really wants to be in a certain user group or Staff.\n\n[color=white][b]ROCKST★R:[/b][/color] Alright this concludes our interview thanks for your time. 🙂\n[color=lime][b]cobija:[/b][/color] You're welcome, better get back to reports before TRSS yells at me. 😟[/align][/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - Robbieava[/color][/font][/size]\n[spoiler]\n[align=justify][color=white][b]Chick-Fil-A:[/b][/color] What motivates you to want to be a 'high quality' member?\n[color=white][b]Robbieava:[/b][/color] Well you say high quality member, but just like anything being a high quality member also means you're a solid person. Not to be rude or single anyone out, because I do have friends that are low quality, and all it means is they don't want to be detailed and that's fine within the rules. Low quality and high quality have so many definitions I couldn't say what motivates me to be a high quality member because it's just me. Nothing motivates me to post other then I want to. \n\nAlmost like a fingerprint we all have different and unique minds. We choose our habits and how we post, it's just what we do. Regardless of if that means Hack Forums, or how much time you put into your work at your job or your homework for school, it's just what you do.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What does being a 'Mentor' mean to you?\n[color=white][b]Robbieava:[/b][/color] It doesn't make me feel any sort of superiority over anyone other then I might have more access to items contrast to others. It's an accomplishment that I made it in there only because I love helping the site. It means to me that I have reached a milestone in my \"HF journey\" and that I just need to keep making new goals and strive to improve, and enjoy the site at the same time.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you feel as though you deserve all of the respect you have?\n[color=white][b]Robbieava:[/b][/color] I wouldn't say that I have this huge amount of respect around the forum. Yeah I have rep, but that's a whole different ball park. I mean I'm not as active as I used to be, but I still come on and make friends and talk to members as any other would. I don't think I deserve more respect then another average member would get. Maybe more trust, but not respectability.\n\n[color=white][b]Chick-Fil-A:[/b][/color] How long do you plan on staying a member on Hack Forums?\n[color=white][b]Robbieava:[/b][/color] Not sure, I take it day by day here. It really depends on what's going on in my life, but I'd love to stay as long as I can. 🙂\n\n[color=white][b]Chick-Fil-A:[/b][/color] Would you consider yourself a hard worker? Why or why not?\n[color=white][b]Robbieava:[/b][/color] I consider myself someone that can be both of those. It really depends on if I'm interested in the topic, the goal, and the reward. Not saying that I need some sort of special incentive, maybe just the self-satisfaction that I helped. If I'm not captivated, I won't work hard. \n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you think Omniscient is doing a great job as Administrator? What things do you think need to be added or removed?\n[color=white][b]Robbieava:[/b][/color] Great admin. Many people say that he's bad or that he's unfair, but if you really think about it, he does more than run a site. He has created some sort of unique atmosphere as a community here. That being, he's very smart in my opinion. I really am not here enough to say what he should change or improve on. He is doing fair at what he's doing to my knowledge.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What was your favorite update since joining the Hack Forums community?\n[color=white][b]Robbieava:[/b][/color]The Mentor group. Although it hasn't really kicked in yet, it's still going to be a great group, as long as all goes well.\n\n[color=white][b]Chick-Fil-A:[/b][/color] How do you feel after getting your 1000th reputation?\n[color=white][b]Robbieava:[/b][/color] I feel like the same person. It's cool seeing 4 digits there, but it's not like I feel like I won the Stanley Cup or something.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Rank these members by their sexyness: Xypher, xerotic, Qwazz, HakkuR.\n[color=white][b]Robbieava:[/b][/color]You already rated them now for me, hah. Except, xerotic and Qwazz are like equal. \n\n[color=white][b]Chick-Fil-A:[/b][/color] If you were stranded on a deserted island, and could bring three members from HF, who would you bring?\nAside from Staff, and the members listed above.\n[color=white][b]Robbieava:[/b][/color] Fuck you for taking my friends out of this!\n[list][*]Paradoxum \n[*]Minnesota Nice \n[*]NaDe[/list][/align][/spoiler]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFWebshow-1.png[/IMG][/align]\n\n[align=center][yt]http://www.youtube.com/watch?v=0mHHrP7UgfY[/yt][/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFcredits.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\n[/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=133256]Xypher[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url]\n[/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url]\n[/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=92059]Chick-Fil-A[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=246042]ROCKST★R[/url]\n[/list]\n[color=white][b]Editors[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\n[/list]\n[color=white][b]Graphic Designer[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url]\n[/list]\n[color=white][b]Webshow Host[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=242000]Sharks[/url]\n[/list]\n[color=white][b]YouTube Channel Owner[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=639914]VanCliffe[/url][/list]\n",
      "subject": "[4/27/2011] - HF News"
    }
  ]
}