{
  "posts": [
    {
      "pid": "22927861",
      "uid": "515249",
      "dateline": "1338057997",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]93rd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Sections now require l33t[/b][/color]\nIn an effort to stop spammers and ban evaders from using certain sections to monetize, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to limit the ability to post threads in several sections to l33t or above. Regular members will still have the ability to post in/view threads in these sections, however, they will not be able to post threads. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has also announced that the \"no post to pm\" and \"no post to download\" rules will be coming into effect soon. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread, click the following link: http://goo.gl/4f7uY\n\n[color=white][b]Minor cleanup[/b][/color]\nEarlier this week, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] tweeted that he will be doing some config changes and setups that require a site reboot. So far this doesn't seem to have made any major impact on Hack Forums, however, it is possible that this was in preparation for an upcoming event. PM icons were also removed this week, for unknown reasons. Yet it is speculated that it was because they were not necessarily needed on Hack Forums. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet, click the following link: https://twitter.com/HackForumsNet/status/204382839179968512\n\n[color=white][b]Coders Group and Honor Et Veritas[/b][/color]\nAs many of you know, there was quite a bit of drama over the incident involving Honor Et Veritas and the Coders group. In an attempt to clean up the mess and straighten things out, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has sold the group to Hexicidal--and has also promised every former paid member of the Coders a spot in the newly revived usergroup. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread regarding this event, click the following link: http://goo.gl/2NjgD\n\n[color=white][b]Downtime[/b][/color]\nThere was quite a bit of downtime this week due to undisclosed reasons. According to [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], there is no evidence of an attack; however, it is very likely that it was. He has also mentioned that Hack Forums may be getting a second web server, hopefully to ensure 100% uptime. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread, click the following link: http://goo.gl/ucerC\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=359776][color=black][b]ABlackFedora[/b][/color][/url]  was repfucked and permanently banned for attempting to blackmail [url=http://hackforums.net/member.php?action=profile&uid=1229886][color=#FFD700][b]Sophie986[/b][/color][/url] for erotic pictures. We don't need that type of behavior on here.\n[url=http://hackforums.net/member.php?action=profile&uid=47970][color=#0066FF][b]Rusty_V[/b][/color][/url] is no longer a Mentor. We have yet to receive a reason for his demotion.\n[url=http://hackforums.net/member.php?action=profile&uid=119173][color=#0066FF][b]Xenochrist[/b][/color][/url] reached the milestone of 10,000 posts! Congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=129812][color=#00FF00][b]Peter Chao[/b][/color][/url] changed his name to [color=#00FF00][b]Moralitas[/b][/color], latin for \"morals\" or \"morality.\"\n[url=http://hackforums.net/member.php?action=profile&uid=656453][color=#00FF00][b]ReactioNz[/b][/color][/url] is celebrating his birthday on May 26th! We wish him a very happy birthday!\n\n[b]Repfucks[/b]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=359776][color=black][b]ABlackFedora[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=73276][color=black][b]Joseph K0ny[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1233362][color=#FFD700][b]VaginalDischarge[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=249035][color=black][b]Blizzard'[/b][/color][/url] was repfucked.\n[/list]\n\n[b]Bans[/b]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=791230][color=black][b]★Beastly★[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=359776][color=black][b]ABlackFedora[/b][/color][/url] was banned, then had his account permanently closed.\n[*][url=http://hackforums.net/member.php?action=profile&uid=73276][color=black][b]Joseph K0ny[/b][/color][/url] was banned for complaining about a repfuck.\n[*][url=http://hackforums.net/member.php?action=profile&uid=496906][color=black][b]Amp™[/b][/color][/url] was banned for selling an ebook on how to get free apple products.\n[*][url=http://hackforums.net/member.php?action=profile&uid=905109][color=black][b]Dashy[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=944024][color=black][b]Neal Caffrey[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=249035][color=black][b]Blizzard'[/b][/color][/url] was banned for scamming.\n[*][url=http://hackforums.net/member.php?action=profile&uid=384998][color=black][b]Zεus[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1073327][color=black][b]BlindFire[/b][/color][/url] was banned for making an unauthorized sticky payment.\n[*][url=http://hackforums.net/member.php?action=profile&uid=834989][color=black][b]/Thief[/b][/color][/url] was vacation banned.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=#FFD700][b]Apathy[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2523629]5 Year Old Transgender kid[/url] - A debate on a young child wanting to change genders.\n\n[url=http://hackforums.net/member.php?action=profile&uid=62795][b]Tasemu[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2517681]Experiment: Polyphasic Sleep | My 30 day video diary of hell[/url] - A member here is documenting his experience following the Uberman Sleeping Diet.\n\n[url=http://hackforums.net/member.php?action=profile&uid=729765][b]Libertarian[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2514936]Discrimination is a Right, right?[/url] - An interesting thread on how far our rights extend.\n\n[url=http://hackforums.net/member.php?action=profile&uid=519478][color=#FFD700][b]Yurippe[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2524443]Why should severely retarded people be allowed to live?[/url] - Yurippe created a thread on why people with full body paralysis should be murdered.\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[b][color=#00BFFF]Interview -[/color] [color=white]Enterprise &[/color] [color=#FFD700]Primal Rage[/color][/b]\n[spoiler]\n[color=white][b]Starstruck:[/b][/color] Today, I am interviewing the founder and the leader of the unofficial group, \"Sanctuary.\"  How are you both doing today?\n[color=white][b]Enterprise:[/b][/color] I am doing fine, I am currently studying for finals and about to head out with my friends.\n[color=#FFD700][b]Primal Rage:[/b][/color] I'm okay just excited.  Today is a great day :D\n\n[color=white][b]Starstruck:[/b][/color] That's good to hear, before we get started, would you guys like to give a shout-out to anyone on the forum?\n[b][color=#FFD700]Primal Rage:[/color][/b] Umm sure I would like to give a shout out to Leey, Hax420 and Mr. Rawrgasm.\n[b][color=white]Enterprise:[/color][/b] Yes I would like to shout out to my Best friend Legacy. I would also like to shout out to Tarn and His army. The hackers love, Inviz, Mcflurry Justice, barneyzz, Jae, and Dan. I would also like to shout out to Rawrgasm who will be leading the group with me. Lastly, to all my serenity bros. If i forgot you, I still love you.\n\n[color=white][b]Starstruck:[/b][/color] I noticed you guys have created an unofficial group that is drawing a lot of attention lately; could you explain to our readers the details of the group?\n[b][color=#FFD700]Primal Rage:[/color][/b] I was going to be the leader of that group but due to some things I will not be leading it. I will be joining it though as a leader and donating the money for the group. Enterprise will be running the group since he has been my friend since before hackforums.\n\n[color=white][b]Starstruck:[/b][/color] I see. It's not too often a member creates a group for another member.  What is the reasoning behind the creation of \"Sanctuary?\"\n[b][color=white]Enterprise:[/color][/b] well Primal and I initially had an Idea of making a group named the HF ballers about a year ago and we decided to make it a reality. Then we added Mr. RawrGasm to are team and decided to change the name to Sanctuary.\n\n[color=white][b]Starstruck:[/b][/color] What kind of skills will the group be based around?\n[color=#FFD700][b]Primal Rage:[/b][/color] To be honest since the group will not be called the ballers that much has not been figured out yet.  I think it will be more of a lounge group a place to get away from others and chat with people and chill.\n\n[color=white][b]Starstruck:[/b][/color] That sounds like a pretty good idea. In what ways would the group be able to contribute to the forum?\n[color=#FFD700][b]Primal Rage:[/b][/color] I think the group will contribute to the forum more by ideas and such. Most of the group are people with great ideas. Some are already in working with a few of my coding friends. And when they are seen I am sure hack forums as a whole will love them.\n\n[color=white][b]Starstruck:[/b][/color] Well, I'm sure other members look forward to seeing what you have in store for the community. Aside from the group, in what ways have you both contributed to the site?\n[color=white][b]Enterprise:[/b][/color] I think I have contributed several times. I have helped with many groups and have always made sure that anyone who needs emotional support will be helped.\n[color=#FFD700][b]Primal Rage:[/b][/color] Well that is a very hard question. I have currently been going threw a lot of trouble to make things right on one end. I will be contributing to the site by opening my hosting company back up and giving free hosing to anyone who was victimized from some other incidents. I also have upgraded many members such as cyba and others and I believe when one deserves to be noticed I try hard to make it happen.\n\n[color=white][b]Starstruck:[/b][/color] How do you both feel you will be able to run a successful group, not having any previous official leadership positions?\n[color=#FFD700][b]Primal Rage:[/b][/color] Hmm I am very good at leadership. I have ran many things outside of a group. Such as a hosting company, and many other projects.\n[color=white][b]Enterprise:[/b][/color] I think that since i have lead many unofficial groups before and I am currently a supervisor of propitious I will be able to do this.\n\n[color=white][b]Starstruck:[/b][/color] What brought you guys to the forum originally?  And what kept you coming back?\n[color=white][b]Enterprise: [/b][/color]It was my mom's birthday on May 11th and I was very bored because she was being showered with gifts. I was getting interested in minecraft so i looked a video. It linked me to hackforums and that is why I joined. What kept me coming back was my best friend Lance/Legacy.\n[color=#FFD700][b]Primal Rage:[/b][/color] I came for the marketplace. I owned a hosting company and this was a good place to earn money as I was told on web hosting talk. And since then I have keep coming back. I have learned more and I see hack forums as a place of knowledge and a great place to lean and show others.\n\n[color=white][b]Starstruck:[/b][/color] Money and friends are two good reasons for returning, haha.  That's all the questions I have for you guys at this time. Would you like to say anything to our readers before we're done?\n[color=#FFD700][b]Primal Rage:[/b][/color] Well I just want to say that its good to be back. I look forward to doing more business on hf and when protective host is back up first month will be free using freemonth as code for hosting.\n[color=white][b]Enterprise:[/b][/color] Glad to be interviewed, have a good week everybody.\n[/spoiler]\n\n[color=#00BFFF][b]Interview[/b][/color] - [color=white][b]Dr.QuickModz[/b][/color]\n[spoiler]\n[b][color=white]Starstruck:[/color][/b] Today, I am interviewing Dr.QuickMods. Hello Quicky, how are you doing tonight?\n[b][color=#1E90FF]Dr.Quickmodz:[/color][/b] Pretty swell Starstruck. How about yourself?\n\n[color=white][b]Starstruck:[/b][/color] I'm doing great buddy, thanks for asking. Before we get started, would you like to give anyone a shout-out?\n[color=#1E90FF][b]Dr.Quickmodz:[/b][/color] I would love to thank  few people here. I would like to give a shout out to Juicy Booty, Justice, Try, Mr. Rawrgasm, iNviZ, Qwazz, Chief, Diabolic, and all the other members I didn't mention.\n\n[b][color=white]Starstruck:[/color][/b] Several members have noticed that you created your own booter, one that was free for the members of the community: \"Quick Booter.\"  Could you give us details on why you decided to create the program for the members of Hack Forums?\n[b][color=#1E90FF]Dr.Quickmodz:[/color][/b] Well this is quite a story here. I put \"Quick Booter\" into production few months prior to releasing it, didn't tell anyone, though that I would surprise people with it. It was made not only to help the people to that could not afford booters, but for people to see that, other members are still caring and giving to others. It supplies members with free booting, with great features, of coarse. There are some minor mistakes with the booter, and it still needs some features added to it, but overall I think that people are satisfied with it, and making others happy is what makes me happy.\n\n[color=white][b]Starstruck:[/b][/color] That's quite generous of you, it seems to be a pretty solid booter. Did you code the booter yourself?  If so, how long did it take you?\n[color=#1E90FF][b]Dr.Quickmodz:[/b][/color] I was the main coder, but I can't take all the credit, there are some fabulous members that had stopped what they were doing, and managed to help me push this booter along. The actual booter came along pretty decent, took about a few days or so to code up, they kept on progressing and adding new features to satisfy others.\n\n[b][color=white]Starstruck:[/color][/b] In the near future, do you plan on coding any other programs for the community?\n[b][color=#1E90FF]Dr.Quickmodz:[/color][/b] Of course! I love programming, have a new product in production, but I will keep it a surprise. I can't just stop all the programming, if people seem to enjoy the product put out, I would love to progress it and get more out there.\n\n[color=white][b]Starstruck:[/b][/color] I look forward to seeing another product from you. On Hack Forums, do you have any personal goals you hope to accomplish?\n[b][color=#1E90FF]Dr.Quickmodz:[/color][/b] Who would not have any goals, at the moment, I'm just looking forward to finishing this project and get it released, but as for personal goals on HF, I would like to eventually get into Serentiy.\n\n[color=white][b]Starstruck:[/b][/color] I can't blame you, Serenity is a great group full of great members. Aside from programming, do you provide any other services for Hack Forums?\n[color=#1E90FF][b]Dr.Quickmodz:[/b][/color] I use to release free thread designs every week, and that kind of got abandoned as I quit making graphics, but looking forward to getting back into making thread designs and releasing a new design every week.\n\n[color=white][b]Starstruck:[/b][/color] I've seen your work before, I was a bit jealous of your creativity. How did you discover Hack Forums, and what kept you coming back?\n[color=#1E90FF][b]Dr.Quickmodz:[/b][/color] While thank you for that positive comment. Hack Forums was introduced to me by a friend back in 2011. I kept on coming back because I was interested in learning new things, exploring and learning was the key elements of me returning. But the people were a big inspiration to me as well, I wanted to be like so many others that's what pushed me to come back and learn.\n\n[color=white][b]Starstruck:[/b][/color] Well, I'm glad you continued coming back, members like you are what keeps Hack Forums going. Thank you for taking the time to answer all my questions. Before we finish, is there anything you would like to say to the community?\n[color=#1E90FF][b]Dr.Quickmodz:[/b][/color] I'm sure you guys don't want to hear any more of what I have to say. So to all the readers and members have a good one. I would like to thank you for having me, it has been a blessing.\n[/spoiler]",
      "subject": "[5/26/2012] - HF News"
    },
    {
      "pid": "22927963",
      "uid": "515249",
      "dateline": "1338058195",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][IMG]http://i.imgur.com/DEHlq.png[/IMG]\n[video=youtube]http://www.youtube.com/watch?v=4IkiQ_4hylA[/video]\nThis week's winner is iDuL, and his lightning fast fingers.[/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Egypt in line to be Democracy[/b][/color]\nAfter thousands of years of political competition between religions and other forces, people of Egypt never thought they would ever be able to walk into a poll station and cast their vote for the first free presidential election. Similar to the ending of the recent hit, the Dictator, starring Sacha Baron Cohen, this new democracy is currently in the process of writing a new constitution. Reporters from LA Times stated that, \"About 50 million Egyptians were eligible to vote. Results are expected May 29, and if no candidate wins more than 50%, a runoff will be held in mid-June. The voting was mostly quiet; a large turnout forced officials to keep polls open an extra hour.\"\n\n[color=white][b]Jim Parsons Comes Out[/b][/color]\nMost commonly known as Sheldon Cooper from the hit CBS show Big Bang Theory, Jim Parsons subtly mentioned on his profile in the New York Times that he has been in a relationship with his partner for over ten years. The National Enquirer attempted to release the information on this two-time Emmy winner in 2010 about his engagement with Todd Spiewak, but were ignored by Parsons' publicist.  \n\n[color=white][b]Apple Head Designer Knighted[/b][/color]\nJonathan Ive, born in Chingford, London, was recently knighted by Princess Anne at Buckingham Palace. The 45 year old who has lead the Apple design team since 1996 is responsible for many of the most popular gadgets in the world including the iMac, iPod, iPhone, and iPad. \"It has been wonderful. It was really thrilling and particularly humbling,\" said Ive after being made a Knight Commander of the Order of the British Empire (KBE) for services to design and enterprise, according to [i]The Guardian[/i].\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[b][color=white]Facebook Camera[/color][/b]\nA while back, Facebook acquired Instagram. Instagram is sort of a photo social network that became very popular, so popular that Facebook bought it for a whopping 1 billion dollars. For a little while, Facebook seemed like they did not want to do anything with it. Yet recently, Facebook released a new app called “Facebook Camera (FB Camera).” FB Camera is just like Instagram but basically with a different UI. It seems like Facebook is trying to outshadow its own “child” and compete against it. Many are asking \"Why?\" For buying a product and paying a billion dollars for it, you would want it to succeed not compete against it. Facebook seems like they are having some trouble with the products they have. Could the release of FB Camera mean Instagram is going to get shutdown?\n\n[b][color=white]Jailbreak[/color][/b]\niOS 5 has been one of the toughest firmwares to Jailbreak. Since its release, many have been trying to find exploits and vulnerabilities within the firmware builds. The most recent released 5.1.1 has been successfully jailbroken untethered, yes folks, untethered. It took the [i]Dream Team[/i] a while to get the jailbreak put together because with every firmware that is released, new exploits and vulnerabilities need to be found--for Apple patches the previous ones used. There is said to be a jailbreak being sold for money. My advice is not to buy it for the following reasons: 1) A free version is supposed to be released by Friday (5/25/2012) according to some. 2) The jailbreak works only for A4 devices. Meaning it won't work for 4S and newer devices.\n\n[color=white][b]IBM and Siri[/b][/color]\nThe giant, IBM, has banned Siri's use for all its employees. To function, Siri needs to listen to what you say and send to Apple servers for a response. IBM thinks that this is a huge security risk. Sensitive information could be said though Siri, which could release things that IBM means to keep secret. IBM also has it where if you are working for them and are laid off, fired, or retired, your device you have from them will be remotely wiped off, but personal data saved. Is this too much security? IBM has so many things that need to be kept a secret, that doing this seems right. The wrong information leaked could potentially be a huge security risk for IBM and users of their products.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Michael Jackson's Bad to Get 25th Anniversary Reissue[/b][/color]\nMichael Jackson's \"Bad\" album is nearly coming to its 25th anniversary. LA Times states that Jackson's collaboration with Epic & Legacy Recordings will reissue the album with more music and never before shown video footage in commemoration of the platinum selling recording. The package of the new album with have three CD's, two booklets, and a DVD of the \"Bad\" tour taken from Michael's private collection. This upcoming album will be the fourth release from Michael after the \"Immortal\" and \"This Is It\" soundtracks, as well as a compilation of unreleased material.\n\n[color=white][b]Kanye West Premieres Short Film in Cannes With Kim, Jay-Z at His Side[/b][/color]\nKayne West revealed his latest film project at the star-studded premiere in Cannes. The movie was titled Cruel Summer and was projected on seven placed screens. It's been describe as a short film-art installation. Kayne arrived early with his new girlfriend, Kim Kardashian, on his arm. Jay-Z and Aziz Ansari also attended to make appearances in the film. The story is to follow a car thief (Kid Cudi) who gets tangled in with a beautiful blind women played by Razane Jammal. The seven screens are used to provide multiple angles. THR says & quoted \"the flim clocks in at less than 30 minutes.\" Kayne stated that the movie wasn't finished yet, calling it a \"rough draft.\" He also said it was his dream to create an immersive film that may one day be the norm in theaters.\n\n[color=white][b]Kendrick Lamar Speaks on Gay Marriage[/b][/color]\nWith Barack Obama now on the side of the gay marriage debate, black artists, from Janet Jackson to Jay-Z, have been coming forward publicly to announce they are OK with recent changes. Lamar said he would no longer insult someone for their sexual orientation. He also stated that he wouldn't criticize them either. \"If you didn’t believe in Jesus, I can’t knock you for not believing, you got your own beliefs and your own morals. I can’t help the way you was born if you was gay. And I can’t change that so do what you gotta do to be happy” said Kendrink.\n\n[color=white][b]Eminem Announces Slaughterhouse Performance at Hot 97 Summer Jam[/b][/color]\nFamous artist Eminem was on the phone with New York's [i]Hot 97[/i] host, Peter Rosenberg. They were discussing the upcoming plans for himself and his group Slaughterhouse. Shady revealed that Slaughterhouse will be joining the lineup for this year's Summer Jam concert.\n\n[color=white][b]Adam \"MCA\" Yauch Covers Rolling Stone[/b][/color]\nRolling Stone magazine had dedicated its latest cover to Admin Yauch, the member of the hip hop group called Beastie Boys. This article features the first interviews with Adam Horowitz and Mike Diamond, with tribute from friends such as Billy Corgan, Spike Jonze, and Rick Rubin. Adam Yauch passed away on May 4th, 2012, after losing a harsh battle with cancer. In case you missed it, he was diagnosed with cancer in his parotid gland and lymph nodes in mid 2009. Recently, citizens from Adam's hometown of Brooklyn, New York have gotten together in honor of him. A large group has petitioned to get Brooklyn Heights' Squibb Park renamed after the hip hop legend. The new issue of Rolling Stone hits newsstands May 25th. \n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler= ]\n[yt]http://www.youtube.com/watch?v=8UVNT4wvIGY[/yt]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI feel like money owns too much of the world nowadays. I could literally quote Family Guy's theme song. The old-fashioned values we used to have. The trust that used to be all over. Now, we don't trust anyone. We keep a wary eye on every single person we walk by. Hitchhiking is a thing of the past. Times are changing, and I don't know if it's for the better. Much like Hack Forums has changed so much over the past few years, I feel like the world has changed much in the same way. As things mature, they eventually decline in whatever means.",
      "subject": "*"
    },
    {
      "pid": "22927995",
      "uid": "515249",
      "dateline": "1338058245",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"How do you feel about the new Scammer Database?\"\n\n[i]\"The hack forums scammer database is a great idea. It should help to cut down on scamming \nof the members that don't know how to search the deal disputes section. It will also help a lot \nof members because it will be a lot easier to search in the database then trying to find deal \ndisputes. Probably a lot of people will probably use it to file fake scam reports. So it's good that \nit will require that you have to add a deal dispute thread link to the database file. Hopefully as \nsoon as it opens it will become very popular and I hope a lot of members will file their accurate \nreports in the database. I think this is a great step forward in dealing with scam reports. And \nhopefully the amount of members getting scammed once the database comes out.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][i]-TheVortex[/i][/url]\n\n[align=right][i]\"I think that the scammer databse is a great idea from Omni. I mean sure, still \nmembers will get scammed, but the scam rate will be lowered too much. It's like a program that's \ndoing the scanning work for you. I thank you Omni for all the work you're doing to HF. :)\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=509788][i]-Makaveli The Don[/i][/url][/align]\n\n[i]\"The new database is a great addition to the site. It makes me wonder why this wasn't installed \nbefore. But, I do see some problems with it. One, being that it is new, it will most likely be abused \nby corrupted members that want to ruin others' name. Another problem is who would be moderating \nall the scam reports that will be flooding the database? All the current staff members are busy with \ntheir assigned work. This would mean that a new staff member is required to moderate the system. \nI do not see this as a big issue since Omniscient does a great job picking staff as it is. But, there is \nalways a chance that the new recruit will abuse his powers in some way. Other than that, it is an \naddition to the site that we have all been waiting for for too long.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=707008][i]-OzDok[/i][/url]\n\n[align=right][i]\"I feel that there is great potential in this upcoming feature. Being able to search this \ndatabase will be much easier then trying to find a scam report in the Deal Disputes section. It would \nbe quite convenient if a members profile displayed any open scam reports against them. Thinking \nabout doing a transaction with someone? It would be as easy as taking a look at their profile.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=708415][i]-Kοala[/i][/url][/align]\n\n[i]\"I personally have my positives and negatives to this idea being approached and completed. My \npostives are of course that the amount of those whom are being scammed with just decrease in huge \nnumbers! It'd also making trading a smooth common to do thing; because as we're all already aware, \nyou can't really trust anyone on this site. My negatives are I hope that before members get posted on \nthe Scammer's Database there scam report is fairly assesed. I know this likely is gong to be the case, \nBut in my HF months, I've noticed that many people like myself, just make assumptions on the one side \nof the story. Assuming if they take into account both stories and sides, I believe that this could be a \ngreat success. I'd say give it a week and it'd be flawless.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=992333][i]-Accident[/i][/url]\n\nThe topic for next week is \"What suggestions do you think would really help Hack Forums?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/imuqVxfoD4Esl.png[/img]\n[size=x-small][url=http://hackforums.net/showthread.php?tid=2507467&pid=22728216#pid22728216]Want to be featured? Post here![/url][/size][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ixMzOMIj0752a.jpg[/img][/spoiler]\n[spoiler=][img]http://i.minus.com/izV0x5apE0Igt.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=qjVV095Pr1M[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=799211][color=#0066FF][b]Ŧг๏zєภקlคร๓ค[/b][/color][/url] got the Sticky Man award for creating a very detailed thread on [url=http://hackforums.net/showthread.php?tid=2498971]WaterCooling[/url]\n[url=http://hackforums.net/member.php?action=profile&uid=70909][b]Miah[/b][/url] got the HJT graduate award for graduating from the HJT training program.\n[url=http://hackforums.net/member.php?action=profile&uid=1049662][b]redpois0n[/b][/url] got the Master Donator and the Award Whore award. After realizing he liked being an award whore, he purchased the Brony award.\n[url=http://hackforums.net/member.php?action=profile&uid=871364][b]Andy™[/b][/url] purchased the Brony award after realizing he was gay.\n[url=http://hackforums.net/member.php?action=profile&uid=620668][b]Renowned[/b][/url] got the FPS Gawd award.\n[url=http://hackforums.net/member.php?action=profile&uid=892183][color=#0066FF][b]Geezer[/b][/color][/url] got The Protector award for catching ban evaders.\n[url=http://hackforums.net/member.php?action=profile&uid=751405][b]haz3d[/b][/url] purchased the Brony award after deciding he wanted to be a gay Brony.\n[url=http://hackforums.net/member.php?action=profile&uid=679685][color=#0066FF][b]Rhapsody[/b][/color][/url] decided to purchased the Brony award after realizing his inner gay heritage.\n[b]\n\nGroup Leadership changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=687297][b]Barneyyz™[/b][/url] is now a leader of the Graphic Masters.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Webshow[/list][/list]\n[list][*][url=http://goo.gl/KNR24]Starstruck[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/vwJYz]Eruditus[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News\n[*]Notable Threads[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/3fcaX]Genuine[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewer[/b][/color]\n[list]\n[*][url=http://goo.gl/KNR24]Starstruck[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}