{
  "posts": [
    {
      "pid": "17062995",
      "uid": "515249",
      "dateline": "1320294038",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]65th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[b]A couple of notices:[/b]\n[list][*]We have had a graphical overhaul, as you have probably noticed\n[*]Cobalt+ has stepped down and left the news in my hands\n[*]The editions will be combined from now on, the first post will contain the regular news, the second post will contain the user news[/list]\n\n[align=center][img]http://goo.gl/MLaS1[/img][/align]\n[url=http://hackforums.net/showthread.php?tid=1875183][b]Omniscient's Vacation[/b][/url]\nOmniscient recently took a well needed vacation to Disneyland to spend some quality time with his family. Despite the backup of PM's and Account upgrades, it's nice to see our webmaster get some time off for himself. This was his 4th time to the amusement park and though he stated, \"there wasn't anything too special about the trip\" he enjoyed the time with his family. As of now everything is back to normal and has been caught up. To read more about his trip click on the title.\n\n[url=http://hackforums.net/showthread.php?tid=1852486][b]New E-book Rules[/b][/url]\nOmniscient has recently set in place a new set of rules for the Hacking Tutorials Section regarding the use of e-books, off-site links, videos, and post format. To read the whole list of new rules click [url=http://hackforums.net/showthread.php?tid=1852486]here[/url]. However, consequently Omniscient has also added a new subforum under the Hacking Tutorials Section for Free E-books Hacking Tutorials which can now be found at the title.\n\n[url=http://hackforums.net/showthread.php?tid=1862797][b]Happy Halloween + Banner[/b][/url]\nHappy Halloween Hackforums! This year we got some frigheningly festive banners. Check out Etheryte's thread to look at all the banners that were made for the site. In the end Omniscient chose Emily's banner which is still up to be viewed. So enjoy and we hope you had a wonderful Halloween.\n\n[b]Site Downtime For Several Hours[/b]\nWhile Omniscient was away on his brief hiatus the site suffered several hours of downtime. However, rest-assured Omniscient has stated not to worry for it was not significant and as far as he can see it was nothing too serious.\n\n[b]Minecrafters Final Payment \nBlack Knights are Recruiting[/b]\nIn group news, the HF Official group lead by hackdeveto, Amp™, and  Wolves is now open for recruitment once again! To file an application or check out their thread click [url=http://hackforums.net/showthread.php?tid=1873326]here[/url]! Also the HF Minecrafters Group lead by Dylan was made official this week after Dylan paid the last $1,000 to Omniscient. This marks the first ever paid group to become official from a full payment.\n\n[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"What do you think about the Runescape Nuke-Day?\"\n\n[i]\"The bot-nuking day that occurred last Tuesday was a phenomenal step towards \neliminating botting in Runescape.  Runescape had such a large amount of botters.  If\n Jagex put together a demographic for all to see, I'm sure 60% of the userbase were \nbotters. Some will argue that botting was needed. That bots are important and needed \nfor the economy, and for the game overall. To be honest, no. They don't need to be in \nthe game. Users who play can get and sell the materials, and prices will rise, but they \nwill rise to what they should be. Because of botters we saw drops in Fish, Logs, and \nother materials prices that were gained through skills. In my opinion, botting needed \nto be eliminated. I'm sure bots will be back, and it'll happen all over again. But, I'm finally \nglad Jagex is taking an initiative to finally get rid of them for good. To eliminate them. \nAnd, I hope they succeed. Props to Jagex for finally putting a stop (although probably \ntemporary) to botting. \"[/i]\n[url=http://goo.gl/Oir4J][i]-Leeroy Jenkins[/i][/url]\n\n[align=right][i]\"I have mixed opinions on the \"Nuke\". First, i think that it is a great thing\n for Jagex to do. They have always maintained the fact that they are against botting, \nand taking out over 95% of the bots is a enormous feat of accomplishment. On the other\n hand, i feel that botters were a part of Runescape. They kept the trade prices steady, \nthey provided a constant influx of items which can be used to skilling, and they almost \nmade the economy run by itself. With the nuke, Whip prices have almost doubled in price; \nit is more expensive to train skills like Prayer; as the botters killing dragons for the bones \nare no longer there. I can almost say for certain the botters will come back, and when they\n do; prices will drop, and Jagex will do another Nuke later. \"[/i]\n[url=http://goo.gl/S9Xxg][i]-+Pirate[/i][/url][/align]\n\nThe topic for next week is \"What's your take on the MotM? Do you agree with this contest, or do you disagree?\" \n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[align=center][img]http://goo.gl/Bkvmj[/img][/align]\n\nDevastated friends of the British couple who died in a coach fire while on a pilgrimage to the Muslim holy city of Mecca have spoken of their mourning and complete and utter pain for there loss. One of the victims who died in the horrendous blaze in Jeddah, Saudi Arabia was named by fellow friends at their Birmingham mosque as Dawud Burbank and his wife also died. Sadly the couple wanted to show the respects but they were not prepared for what was to come. Two fellow friends of Dawud's who did not want to be named said \"He was a very respected man, a very well-liked man, a very learned man.\" \"He was well known and one of the best, if not the best, in the West in terms of translating Arabic manuscripts into the English language.\" His other friends and fellow worshipers were just to upset to speak. The tragic accident shook the whole of Mecca and the holy place, many were distraught and many did not know what to say.\n\nPoliticians and Muslim leaders have denounced a firebomb attack that destroyed the offices of a satirical French newspaper after it \"invited\" the Prophet Mohammed as its guest editor, things in the world news just got a lot serious. No one was majorly injured in the fire at Charlie Hebdo weekly in eastern Paris but hours before the current issue hit the news-stands. One witness saw someone throwing two firebombs at the building and the newspaper's director, who goes by the name Charb, said a Molotov cocktail was the cause of the fire. He blamed \"radical stupid people who don't know what Islam is,\" for the apparent attack. \"I think that they are themselves unbelievers ... idiots who betray their own religion,\" he said. \n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://goo.gl/1sAM3[/img][/align]\n\n[align=center][img]http://goo.gl/b4JkO[/img][/align]\n[url=http://www.gamecove.net/][img]http://gamecove.net/images/gamecoveHF.png[/img][/url]\n\n[align=right][url=http://goo.gl/t1WFy][img]http://i1192.photobucket.com/albums/aa330/Mostskillful/reactionn.gif[/img][/url][/align]\n\n[align=center][URL=http://goo.gl/VX8xv][IMG]http://img710.imageshack.us/img710/580/contactforadvert.png[/IMG][/url][/align]",
      "subject": "[11/2/11] - HF News"
    },
    {
      "pid": "17063008",
      "uid": "515249",
      "dateline": "1320294064",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://goo.gl/phwSu][color=white][b]Qwazz[/b][/color][/url] has stepped down as moderator of the HF News section. He will be sorely missed.\n[url=http://goo.gl/1wK6r][color=#0066FF][b]Soldier of Fortune[/b][/color][/url] has returned to hack forums and has even been seen posting in a couple of sections.\n[url=http://goo.gl/UtHlv][color=white][b]Pali[/b][/color][/url] turned sixteen this week, happy birthday!\n[url=http://goo.gl/nJT9F][color=black][b]DiscipLе[/b][/color][/url] was banned until 11-09-2011 for several reasons, we do not know if he will even return after his ban has been lifted.\n[url=http://goo.gl/c5vue][color=black][b]Peter Chao[/b][/color] [/url] has gone on vacation until 11-02-11.\n[url=http://goo.gl/XQ0u9][color=black][b]EarthShaker[/b][/color] [/url] has been forced to leave Hack Forums for a while, he requested a vacation ban until 11-04-11.\n[url=http://goo.gl/8nJ4z][color=black][b]-Revolution-[/b][/color] [/url] has gone on vacation until 11-04-11.\n[url=http://goo.gl/E5rZg][color=black][b]Alberto[/b][/color] [/url] was only banned until 11-05-11 for scamming Black shadow out of $700.\n[url=http://goo.gl/HETYy][color=grey][b]-mothered-[/b][/color] [/url] has finally been moved to the dead group as a hacker logged on to it again. He will be sorely missed.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Helpful Thread[/b][/i] - [url=http://goo.gl/efPYR]✔ Ultimate Xbox 360 Resource Guide ✔[/url] - [url=http://goo.gl/89giM][color=#0066FF][b]Ignite.[/b][/color][/url] - Ignite and Valik have created a helpful resource thread that links to any other thread that could be needed for your xbox 360.\n[i][b]Blackhat Thread[/b][/i] - [url=http://goo.gl/fS4MW]HQ √ Pics √ TuT √ - How to set-up a Cythosia HTTP Botnet - HQ √ Pics √ TuT √[/url] - [url=http://goo.gl/q8FJf][color=white][b]Suhinder™[/b][/color][/url] - Anyone who is interested in setting up their very own botnet should read this tutorial, and if you need any help, Suhinder will gladly give his time to give you a hand.\n[i][b]TinyChat Thread[/b][/i] - [url=http://goo.gl/rCJmV]Drug Cartel - HF Tinychat - Always Busy - Friendly People - Good Time[/url] - [url=http://goo.gl/sRlzZ][color=#0066FF][b]Storm Watch[/b][/color][/url] - This TinyChat has received a sticky in its section as it's the largest TinyChat group to date.\n[i][b]Member Returning Thread[/b][/i] - [url=http://goo.gl/5Vznm]Prokill - [ Read ] -[/url] - [url=http://goo.gl/sRlzZ][color=white][b]Prokill[/b][/color][/url] - This user who is well known for hacking many social networking accounts of celebrities has posted a thread explaining some things to members.\n[i][b]Bragging Thread[/b][/i] - [url=http://goo.gl/nuX4M]]$63,000 - Earnings for October 2011 - At a Loss for Words[/url] - [url=http://goo.gl/Ajwic][color=white][b]mrwhich[/b][/color][/url] - This member provided plenty of proof to show that he has earned over sixty-three thousand dollars through unknown monetizing techniques.\n\n[color=#FFFFE0][size=large][b]Gaming Thread(s)[/b][/size][/color]\n[i][b]Helpful Tutorial[/b][/i] - [url=http://goo.gl/7aLQq]What FPS Are You Getting On MineCraft?[/url] - [url=http://goo.gl/CVFX7][color=#0066FF][b]Mr. Apple[/b][/color][/url] - If you have ever played \"Minecraft,\" you know how computer-demanding it is. Mr. Apple has written a thread explaining a great way to increase your frame-rate in this game.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Mark Webber[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Mark! Thanks for taking the time out for this interview!\n[b][color=#1466ff]Mark Webber[/color][/b]: No problem! Thanks for taking the time to Interview me :D\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Absolutely! Before we begin, are there any people you'd like to give a shout out too?\n[b][color=#1466ff]Mark Webber[/color][/b]: Definitely. A big shoutout to Oldskool., Fetus Flipper, Depression, Mr Kewl, Ignite. and all the Members of Techsperts :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Perfect! Speaking of the TechSperts, what inspired you to become a part of that group?\n[b][color=#1466ff]Mark Webber[/color][/b]: Well, I have been interested in Computer Hardware for a very long time, as long as I can remember actually, and I wanted to join a Group where I could communicate with others who shared my interests. I didn't think I would get such a warm welcome into the Group, but I loved it, and I have loved the Group ever since day one.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Where do you think your love for computer hardware has originated? Have you been tinkering with electronics ever since you were little? I can tell it's a huge passion, judging by your number of posts in the \"Computer Overclocking, Customizing and Hardware,\" section.\n[b][color=#1466ff]Mark Webber[/color][/b]: It started when I was young, yes. I would take PC's apart, and Build them with my dad. I learned how to Build a PC, and what all the Parts were for by the time I was 8 years old. Hardware has been a passion ever since. And yes, I’m really active in the Hardware Section :D\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That's great - You better watch out, I may be contacting you around Christmas time when I go to build my very first desktop. While you were building computers, I was still probably playing with Legos. I also understand you are a musician. What instruments do you play?\n[b][color=#1466ff]Mark Webber[/color][/b]: Contact me if you need any assistance, I will gladly provide you with whatever help you may need. Yes, I am a Musician, and a very dedicated one at that. I know how to play about 8 Instruments in total, but nowadays, I would just play on my Guitar, Bass, Piano, Drums, or perform vocally.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That's incredible; I can barely play the recorder if you count that as an instrument! What type of music do you play/listen too?\n[b][color=#1466ff]Mark Webber[/color][/b]: If you keep your mind to it, you can learn anything, trust me :) Well, I really just give off the 'Emo/Goth' look, if you look at my Sig and Avatar. My main Genres of Music would be Hard Rock, Speed Metal, Death Metal, Thrash Metal, and possibly just a little bit of Classical Music thrown in there as well, for times when I need to sleep :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Are you part of a band that plays one of those genres, or do you play and practice solo?\n[b][color=#1466ff]Mark Webber[/color][/b]: Yes. I play as the Lead Guitarist of a Band called 'Entitled to Die'. We mainly Cover the entire Metal Genre with our own Songs. We were influenced by Avenged Sevenfold, a Hard Rock/Metal American Band. :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Very cool! I just took a look at your new avatar/signature combo, they are really nice and unique! What do you think of the update barring regular members from having signatures? Do you think it has had a significant impact on regular members?\n[b][color=#1466ff]Mark Webber[/color][/b]: Thank you :) Well, I personally support the current Sig Rules. It will show Regular Members that there are a lot on benefit's for having an Upgraded Account. Hopefully this will bring in a lot more income for Hack Forums, and we will see a fantastic bunch of new L33t and Ub3r Members in the near future :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definitely, do you have any other proposals for increasing revenue on Hack Forums?\n[b][color=#1466ff]Mark Webber[/color][/b]: Well, I know many Members have brought it up before, but I am all for a new Group to Upgrade to. Something higher than Ub3r that would cost a little more to get into. Of course, the downsides with that would be that you would have to find some features to add, which would be a daunting task, but manageable. I know a lot of Members who would pay the required amount to get into this Group.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I couldn’t agree more, who knows; maybe we'll see a new \"Om3ga,\" group sometime in the future. You guys can find suggestions just like this in the \"Suggestions and Ideas,\" section. Why did you choose \"Mark Webber,\" as your username?\n[b][color=#1466ff]Mark Webber[/color][/b]: Hopefully we will, and it will generate a great amount of income for HF to benefit from. I get that a lot. You would also be surprised by the amount of people who think I am the real Mark Webber, but anyway... I chose Mark Webber because I am a huge fan of Motorsport. Ever since I started racing Karts when I was 9, I have worshipped Formula 1, and Mark Webber is a driver who has stood out for me, more than all others. I know pretty much everything about him, and when I met him for the first time, I knew that it would be a once in a lifetime experience. Ever since that day, I have been known as 'Mark Webber' on the Internet.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: It's always great to hear stories of people who meet their idols. Where do you see yourself, career and Hack Forums wise, in 5-10 years?\n[b][color=#1466ff]Mark Webber[/color][/b]: Well, Career wise, I expect to have a National Diploma in ICT, as well as accomplishing my dream of making it into the Formula Renault Motorsport series, which I am very close to already. On HackForums, I expect to be at the same point as where I am now. I like where I am, and I don’t want that to change anytime soon. I will definitely be around the Forums for another few years to come :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Well, I wish you the best of luck with your goals and career! I think that about wraps it up for me, do you have anything you'd like to say to the members of Hack Forums?\n[b][color=#1466ff]Mark Webber[/color][/b]: I would like to wish the Members of HackForums a happy upcoming Halloween and best of luck to you all in the future. I would also like to thank you Michael, for interviewing me :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey, thank you Mark, it's been my pleasure!\n[b][color=#1466ff]Mark Webber[/color][/b]: Thank you! :)\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Riggs[/font][/size][/color][spoiler=]\n[color=#1466ff][b]Daniel Faraday: [/b][/color]I just want to say thanks for accepting this interview. Do you have anything you want to open with?\n[color=white][b]Riggs: [/b][/color]Hello Daniel, thanks for the opportunity.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Do you have a favorite forum on Hack Forums?\n[color=white][b]Riggs: [/b][/color]I can’t really answer that. I tend to only ever use the “View New Posts” link. The Science, Religion, Philosophy, and Politics section appeals to me, but I wouldn’t say it’s my favorite.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]You have a decent standing on Hack Forums. Would you define that as being \"HQ\", or is it just part of who you are.\n[color=white][b]Riggs: [/b][/color]I think my reputation is primarily responsible for portraying my “decent standing”, but my character is what I believe a lot of the community tend to give me recognition for. I think High Quality can be defined by our character as opposed to our reputation, because our character is what we really are, while our reputation is merely what others think of us.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]You seem to be very popular with Omniscient and in Tiny Chat, do you take part in them often?\n[color=white][b]Riggs: [/b][/color]I wouldn’t say I’m hugely popular with Omniscient, more so the other TinyChat participants. Omniscient is like me in the sense he doesn’t appear on TinyChat very often, but when he does he makes it enjoyable for everyone. Logically - the less you have of something that makes you happy, the more you appreciate it when it’s there. Like Omniscient, I appreciate TinyChat for being a place to relax and socialise with the option to express myself beyond the boundaries of a keyboard.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of the direction the site is headed in?\n[color=white][b]Riggs: [/b][/color]I think it’s important to remember that many members will never be happy with changes. Given we orientate a hacking community, it seems appropriate to me there will always be a negative bandwagon looking to publicly recognise the defects in changes to an already working system.\n\nI’m hoping progressive development will remain consistent.  However, I respect Omniscient’s commitment and I think a lot of members fail to acknowledge just how demanding his work schedule really is.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Are there any things that you want changed or support change for?\n[color=white][b]Riggs: [/b][/color]Given I avoid the Marketplace at all costs; maturity is by far the biggest issue for me on HackForums. If I could support anything it would be a change in staff discretion regarding the Etiquette of HackForums. Acting like you’re older than 16 even if you’re not has always been a mandatory rule that lacked any staff enforcement and I see immature members deviating from it regularly. It’s great to have a laugh, but some posts are just not funny. A lot of posts don’t even make sense.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]How do you think membership in the Marketers affects your life on Hack Forums?\n[color=white][b]Riggs: [/b][/color]Although the Marketers are still very new, I’ve noticed it’s already an extremely versatile group. Like the other members, I tend to give as much advice as I take and we all sit well with an unofficial “mutual sharing” rule. For me this means a lot less time is wasted in The Lounge and a lot more is invested in gaining knowledge with the potential to help me in the real world.\n\nI personally like to mix the information resources of our private sub-forum up with some of the public black hat tutorials available in the forums. This means HackForums opens new doors for me. Possibly steel barred ones, but with the benefit of always having enough money to make bail.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of the new wave of members?\n[color=white][b]Riggs: [/b][/color]I’ve always expected the community to grow with a rapidly increasing incline. As long as the staff keep post activity manageable, I’m confident the board will only benefit.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of the new usergroups and what they bring to the forum?\n[color=white][b]Riggs: [/b][/color]I think user groups are a great official asset to anyone looking to feel a part of something and socialize with others sharing similar interests. I think they bring a sense of exclusivity to the forums and for a lot of members, another target to reach. Though group owners that think their few extra text-based privileges make them powerful forum Gods do make me laugh.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Are there any specific members that you think are benefiting the site en masse?\n[color=white][b]Riggs: [/b][/color]I won’t name specific people/groups as making exceptions for only some might offend others, and I can’t sit here typing out a list of names to accommodate for everyone. Financially, probably quite a few. Educationally, everyone.\n[/spoiler]\n\n[align=center][img]http://goo.gl/G1F5k[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=bJvlI9nDKWE[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Storm Watch\n--Leadership\n---Rhythm (http://goo.gl/9UPMb) - Graphics Masters - >Leader\n---WiFi. (http://goo.gl/tUYGS) - Rats Crew - <Leader\n--Awards\n---Mostskillful (http://goo.gl/fRrV2) - GFX Guru\n---The Operator (http://goo.gl/GHxhD) - Speaker of the House\n---The MammoTh (http://goo.gl/NYos4) - The Alien\n---Diabolic (http://goo.gl/WE2fJ) - Grammar Nazi\n---Ignite. (http://goo.gl/qjzA5) - Rat Expert\n---bugga (http://goo.gl/dNZoI) - Diamond\n---Judge Dredd (http://goo.gl/SGeaI) - Cuddly and Cute\n---Orgy (http://goo.gl/A1VGY) - Businessman\n---RRain (http://goo.gl/FZ1fm) - Sticky Man\n--Misc.\n---\n[/spoiler]",
      "subject": "*"
    }
  ]
}