{
  "posts": [
    {
      "pid": "18389499",
      "uid": "515249",
      "dateline": "1324539018",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]72nd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://goo.gl/jXMHO[/img][/align]\n[b]New possible usergroup[/b]\nOmniscient has recently posted that he has been considering a new usergroup, POW3R. The reason behind this is because multiple members have been requesting a larger PM box along with the ability to give more reputation points. POW3R will have many perks including an enlarged PM box with a capacity of 10,000 messages, the ability to give 5 reputation points at a time, and 10 reputations a day. It will also reduce flood times to a miniscule amount of 10 seconds. Although this may seem great there is a catch to obtaining the new usergroup, payments are only acceptable through LR so many members will not be able to buy this upgrade.\n\n[b]Section closing and opening[/b]\nThe social engineering section has once again been closed due to multiple members ignoring the past warning and continuing to break the rules. However this did lead to the opening of a new section named Decompiling, Reverse Engineering, Disassembly, and Debugging (DREDD). This was due to many members asking for a specific section for these topics, Omni has stated that he will be very strict when it comes to enforcing the rules in the DREDD section.\n\n[b]30,000 posts[/b]\nVitani’s Mate, a well-known member on HF has recently reached the 30,000 post milestone. Not only is this an amazing achievement for any member on HF, but he has done this in just under a year which is near impossible for the average member. After looking at his profile you can easily tell that he tries to make all of his post of good quality. He really is a role-model for new members, he will inspire them to be active and post often.\n\n[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"Seeing as there is currently limitations for you to be able to post in the marketplace, do you agree with those? Or are they too strenuous?\"\n\n[i]\"I support all of the Marketplace limitations. Without all of these limitations, there would\n be quite a few people selling/advertising every product which would just spam the forums.\n I honestly think they should somehow cut down sales on booters as well. Every other thread\n in Premium Sellers Section is a booter.\"[/i]\n[url=http://goo.gl/xjvd0][i]-Purple Haze[/i][/url]\n\n[align=right][i]\"I believe the current Marketplace restrictions are completely fair, also, due to\n the fact that 3/4 of things sold on the Marketplace are illegal, or \"Black hat\" if you will, these\n restrictions are perfectly fit. Obviously the restriction regarding credit cards & fraud is there for\n a reason. If someone does have a negative REP, I don't believe they should have the ability to\n advertise on our forums, due to the fact that they're obviously not very popular, and a thread\n would be a waste of space as no one would buy from someone with -34 REP.\"[/i]\n[url=http://goo.gl/7rtFt][i]-Graveee[/i][/url][/align]\n\nThe topic for next week is \"How do you feel about the death of Kim Jong Il and what it will mean for the future of North Korea?\" \n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n[b]Noted: Don't send me a blank message from the link, the colon is there for you to put your opinion after. I won't message you back allowing you to send me your opinion.[/b]\n\n[align=center][img]http://goo.gl/Bkvmj[/img][/align]\n[color=white][b]Kim Jong Il Dead[/b][/color]\nOne of the worlds most infamous leaders has died and leaving Korea unattended to. Kim Jong Il’s death on Saturday has sparked a 13-day mourning period in North Korea as thousands converged on Pyongyang to pay their respects to their \"Dear Leader.\" When Mr. Il was found dead, an autopsy was performed. They found that he died from over exhaustion. For South Koreans, Kim Jong Il’s sudden death drove home an unsettling disparity between them and their neighbors, a gap that could spark turmoil, if an unstable North Korea were to collapse. At this point, some in Seoul say, North and South Korea hold nothing in common but a language. \n\n[color=white][b]Megaupload Being Sued[/b][/color]\nAnother month, another copyright lawsuit from adult media outfit Perfect 10. This time the company is chasing file-hosting service Megaupload and its owner Kim Schmitz, associated companies such as megarotic.com, megaporn.com, megavideo.com, and megaclick.com, and other businesses and affiliates. \n\nAs song has been made by multiple artists, you can view this [url=http://www.youtube.com/watch?v=o0Wvn-9BXVc][color=white][b]here[/b][/color][/url].\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.minus.com/i8zxbKscOMvPC.png[/img][/align]",
      "subject": "[12/21/11] - HF News"
    },
    {
      "pid": "18389509",
      "uid": "515249",
      "dateline": "1324539047",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=651773][b][color=#0066FF]Vitani's Mate[/color][/url][/b] - has reached a number of 30,000 posts in just under a year!\n[url=http://hackforums.net/member.php?action=profile&uid=320970][b][color=white]HakkuR[/color][/url][/b] - reached the 1000 reputation mark!\n[url=http://hackforums.net/member.php?action=profile&uid=195796][b][color=#0066FF]phybeя[/color][/url][/b] - has also reached the 1000 reputation mark, this is a huge milestone for anyone!\n[url=http://hackforums.net/member.php?action=profile&uid=723224][b][color=#0066FF]h3x3n[/color][/url][/b] - received a repfuck for abusing the reputation system.\n[url=http://hackforums.net/member.php?action=profile&uid=538574][b][color=black]-Thomas-[/color][/url][/b] - Thomas has requested a vacation ban until 24-12-11.\n[url=http://hackforums.net/member.php?action=profile&uid=366559][b][color=black]Daniel Faraday[/color][/url][/b] - he has taken a vacation ban, he will be returning on the 17-01-12.\n[url=http://hackforums.net/member.php?action=profile&uid=805825][b][color=black]- Sam -[/color][/url][/b] -  this member was banned for Ub3r junk abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=125325][b][color=black]BumperJumper[/color][/url][/b] -  this member was also banned for Ub3r junk abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=119690][b][color=black]SpK[/color][/url][/b] - SpK was banned for the posting of another member's dox.\n[url=http://hackforums.net/member.php?action=profile&uid=920797][b][color=black]Creatxre[/color][/url][/b] - requested a ban for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=260570][b][color=black]Fetus Flipper[/color][/url][/b] - has requested a lengthy vacation ban of 4 months.\n[url=http://hackforums.net/member.php?action=profile&uid=869826][b][color=black]Civilizied[/color][/url][/b] - formerly known as Suhinder has had his account hacked. - He has recently change his name back to Suhinder.\n[url=http://hackforums.net/member.php?action=profile&uid=752389][b][color=black]eightworks[/color][/url][/b] - has taken a vacation ban and will be back on christmas eve.\n[url=http://hackforums.net/member.php?action=profile&uid=200751][b][color=black]Zach[/color][/url][/b] - the leader of Eminence and RATs Crew has received a repfuck and a 3 month ban for the reason \"It's when you crack a program\".\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]POW3R Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2027533]P0W3R Informational Thread[/url] - [url=http://hackforums.net/member.php?action=profile&uid=735315][color=white][b]Michael Westen[/b][/color][/url] - Anyone who is confused about the upcoming upgrade called \"POW3R\" should read this thread.\n[i][b]Funny Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2034683]All balls itch it's a fact[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1093031][color=white][b]Obie Trice[/b][/color][/url] - For those of you who weren't here, Omniscient made HackForums.net redirect to http://allballsitch.ytmnd.com/ for a short time.\n[i][b]Rap Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2034808]Teach Me How To WiFi!?!?!?![/url] - [url=http://goo.gl/Q9qiG][color=white][b]WiFi.[/b][/color][/url] - WiFi made a new rap that he put some real time in to. Anyone looking for a good laugh and some interesting beats should watch this video.\n[i][b]Steam Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2028956]Steam Sales Trading Thread[/url] - [url=http://hackforums.net/member.php?action=profile&uid=366251][color=white][b]Razor339[/b][/color][/url] - Regarding the latest of Steam's innovations in the Great Gift Pile, at this thread you can trade the gifts your have received through fulfilling the objectives set for you.\n[i][b]Coding Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2034312][Video] How to make userscripts - HF Scripts [Tutorial][/url] - [url=http://hackforums.net/member.php?action=profile&uid=175033][color=#0066FF][b]xerotic[/b][/color][/url] - Xerotic is well know for all of his scripts and programs that he has coded, in this thread he shows you how he makes them and how you can make one yourself!\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - .Infinity.[/font][/size][/color][spoiler=]\n[color=white][b]Ignite:[/b][/color] Hi Infinity, Is there anything you would like to say before we start?\n[color=#0066FF][b]Infinity:[/b][/color] Nothing in particular.\n\n[color=white][b]Ignite:[/b][/color] Alright, you're often seen in the Marketplace a lot. Is there any other sections or topics you enjoy?\n[color=#0066FF][b]Infinity:[/b][/color] I enjoy just about everything, it really depends on my mood. Hackforums is a business playground for me, so I try to stick to the sections that are most related to what I enjoy and prosper in. I do also spend time in the Innuendo section and Xbox section on occasion.\n\n[color=white][b]Ignite:[/b][/color] How difficult do you find running a product as successful and as popular as Rebel?\n[color=#0066FF][b]Infinity:[/b][/color] It can be very challenging at times. I thoroughly enjoy working with customers, managing sales, and helping people with whatever they need, so it's a great fit. As long as I've got a developer to cover by ass (back end pun), it works pretty well for me. Challenging, but very rewarding.\n\n[color=white][b]Ignite:[/b][/color] Awesome. What do family and friends think of your online business ventures?\n[color=#0066FF][b].Infinity.:[/b][/color] There are only two people that know me in real life that have the slightest idea of what I do online. So really, they don't think much at all. They know I make money online, and that's it.\n\n[color=white][b]Ignite:[/b][/color] Has the thought of releasing any new products crossed your mind yet?\n[color=#0066FF][b]Infinity[/b][/color] Of course, but it's a slow process. Right now I have a currency exchange service that's barely been born, so it's still in the making. As well, I'd like to start a new type of DDoS service, unique to HF. As far as products go there isn't much on my mind until Rebel Stress has been improved quite a bit. It's a great product but there are still plenty of modifications we can make to add that extra edge that the customers enjoy.\n\n[color=white][b]Ignite:[/b][/color] The term \"Businessman\" gets chucked around HF quite a lot, although the understanding that you need to have a certain amount of experience of it to actually be classed as one is kind of forgotten. Would you call yourself a businessman?\n[color=#0066FF][b]Infinity:[/b][/color] Yes, I would. I don't just create a single product, sell it for 3 weeks, and then drop it. I'm here to stay and I involve myself in anything I believe to be profitable or beneficial for my line of products. Marketing, advertising, services. Everything. Management and sales, efficiency, innovation. I pride myself in these abilities, and I believe they constitute a \"Businessman\" on HF. In fact, you might see a nice new group coming out related to this.\n\n[color=white][b]Ignite:[/b][/color] Looking forward to it. Now, who do you consider to be Rebel's biggest rival?\n[color=#0066FF][b]Infinity:[/b][/color] Rivals come and go. At the moment I don't think there is a single booter that I would consider real competition. At this point in time we simply outclass everyone else in terms of quality. Not trying to sound cocky, as that's not my style, but I firmly believe it to be true. However, when twBooter is released in a few weeks, we will probably lose some sales to them. But Orgy is my developer, and I benefit from his projects as well, so I don't see it as full on competition.\n\n[color=white][b]Ignite:[/b][/color] Alright, well this rounds up the end of the interview. It's been a pleasure interviewing you sir, do you have any tips for those who want to try and become as succesful as yourself when selling a product?\n[color=#0066FF][b]Infinity:[/b][/color] Actually I do. I was just discussing this with someone who messaged me on Skype earlier, and I gave them a few simple rules to follow. \n1. Always be honest with your customers. \n2. Be fair with your pricing, don't try to rip anyone off.\n3. Excellent customer support can never be overrated.\nThanks for the interview.[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Yellows[/font][/size][/color][spoiler=]\n[b][color=#1466FF]Kottonmouth[/color][/b]: Hey Yellows! So, before we begin, I'd like to thank you for allowing me to interview you! \n[b][color=#1466FF]Yellows[/color][/b]: Why are you thanking me? This is a [i]great[/i] pleasure. Quite frankly, I've always secretly wanted to me interviewed. \n\n[b][color=#1466FF]Kottonmouth[/color][/b]: Is there anyone you'd like to give a shoutout to?\n[b][color=#1466FF]Yellows[/color][/b]: Sure is! Allow me to give a shoutout to [url=http://hackforums.net/member.php?action=profile&uid=890293]CaLLMeNick[/url], [url=http://hackforums.net/member.php?action=profile&uid=923753]Juicy Booty[/url], [url=http://hackforums.net/member.php?action=profile&uid=837416]Soulmate[/url], [url=http://hackforums.net/member.php?action=profile&uid=420630]Cute[/url], [url=http://hackforums.net/member.php?action=profile&uid=182754]Orgy[/url], [url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url], and anyone else who helps me out tremendously and converses with me on a day to day basis.\n\n[b][color=#1466FF]Kottonmouth[/color][/b]: To start off this interview, I'd like to ask; How'd you come up with your username \"Yellows\"?\n[b][color=#1466FF]Yellows[/color][/b]: To be honest, Xbox. I have made it through years with this alias and one other that is quite similar ('Yeiw', a shortened word for 'Yellow'). The reason that I've always chosen a username with the word (or variation) of the color yellow is because, well, it's my favorite!\n\n[b][color=#1466FF]Kottonmouth[/color][/b]: Why and when did you start posting with right alignment? I'm sure everyone wants to know this.\n[b][color=#1466FF]Yellows[/color][/b]: I have only started posting with the right alignment since the early or the middle of October. The reason I started posting with right alignment isn't a very clear one, really. I honestly can't remember why I started posting with it (It's only been a couple months, Y U NO REMEMBER!??), but I do know why I currently use it. I use it both for originality, fame (That's a joke, all), satisfaction, and frankly because it [i]really[/i] pisses some users here off. The main (and most important) reason I post with the alignment is because I personally love it.\n\n[b][color=#1466FF]Kottonmouth[/color][/b]: How did you find Hack Forums, and why did you decide to stay?\n[b][color=#1466FF]Yellows[/color][/b]: I originally found HackForums through an enemy on Xbox. The guy kept hittin' and holdin' me offline thinking he was apart of those hardcore 'XBL heckers' out there. Through the guy, I found out about this website and joined hoping to learn how to host boot. I got a free (crappy) booter and didn't return to HF for six months or so. Since I've joined back up, I've stayed active because of both the great community and because I'm still trying to string off the last of my Gamertags. \n\n[b][color=#1466FF]Kottonmouth[/color][/b]: Since you've registered here on Hack Forums; What are some good and bad changes you've seen? What do you think SHOULD be changed now?\n[b][color=#1466FF]Yellows[/color][/b]: While I was inactive for many of the major changes of HackForums (Or so I am told), I think I can still answer this question with assurance. To start off, a couple of the bad things that this site has gone through since I've been active is both the addition of post count in all sections and more recently, the hacking of Judge Dredd's account (Both small things, I don't find too much wrong with HF). Some great things that have happened is the removal of the HMSE section, the announcement to reset ALL reputations, the removal of thread views, and the new rule about proxy selling. One major thing that I'd love to have changed is the addition of news Staff members. It seems to me that currently Staff do not have as many people on their to deal with the numbers of reports. A smaller, less significant bit that I think should be changed is the addition of a Mentors list, similar to the stafflist.php.\n\n[b][color=#1466FF]Kottonmouth[/color][/b]: What do you think of the general Hack Forums community, in terms of maturity, activity, etc?\n[b][color=#1466FF]Yellows[/color][/b]: At times I feel that the average age of maturity here is lower than the level required to join, but I sincerely enjoy that level at times. On the other hand, some members here are very knowledgeable with a high maturity level, are master debtors, and overall are great people.\n\n[b][color=#1466FF]Kottonmouth[/color][/b]: Well, I think this is it! Thanks for taking the time to take this interview with me Yellows! Would you like to rap up this interview with anything?\n[b][color=#1466FF]Yellows[/color][/b]: Well I think that's just about it! I'd just like to say that I really enjoyed this interview and that it was a pleasure talking (and arguing today) with you!\nI wish everyone the Merriest of Christmases.\n[/spoiler]\n\n[align=center][img]http://goo.gl/G1F5k[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=zdE4-csy8RY[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Zach\n--Leadership\n---Wolves (http://goo.gl/SVw0Y)\n--Awards---DragScope (http://goo.gl/Cqe5x) - Grammar Nazi - Style.\n---Tay (http://goo.gl/ptGzQ) - FPS Gawd - Thy powers are awesome.\n---Team Angeldust™ (http://goo.gl/a0YzL) - Black Hatter - One of the more interesting things I've read.--Misc.--Questions---[/spoiler]",
      "subject": "*"
    },
    {
      "pid": "18389517",
      "uid": "515249",
      "dateline": "1324539074",
      "message": "[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aquarius:[/font][/size][/color][spoiler=]\r\nWhile everyone around you is running around madly socializing, by contrast, you are seeking sane, soothing shelter. (With or without alliteration.) There's only so much insanity a person can handle. Plus, privately, your sexual energy is very high now. This means you want privacy for lots of reasons! Play it low-key. Work alone or behind the scenes because this is the perfect time of year for you to plan what you want your new year (birthday to birthday) to be all about. Be specific about what you want to achieve next year. The more specific you are about your goals, the more likely they will materialize. (But you know this.)\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Pisces:[/font][/size][/color][spoiler=]\r\nYou're facing a social whirlwind ahead for the next six weeks. Accept all invitations. Everyone wants to see your face. Not only will you enjoy the company of friends, you'll also be very involved in clubs, groups and organizations. The month ahead is a wonderful time to share your hopes and dreams for the future with others because their feedback will definitely help you. With Mars opposite your sign, you are a bit impatient with others. (Oh yes, you are.) Use this very social month to smooth over troubled waters. Pick up the tab for lunch. Give someone flowers. Remind them how truly caring and thoughtful you really are. (Works every time.)\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aries:[/font][/size][/color][spoiler=]\r\nHeads up! The Sun will be at high noon in your chart for the next six weeks and this is the only time all year this happens. This has the effect of casting a spotlight on you, making bosses, parents and VIPs notice you more than usual. Furthermore, this is definitely great lighting! (\"You look mahvelous dahling, mahvelous.\") Because of this, you will be asked to take on increased responsibilities for something. Fear not, you won't have to be a super action hero to handle it. Ironically, it will require nothing special! Therefore, say \"Yes!\" Meanwhile, in the depths of your book-lined-leather-furniture-with-Aubusson-rug den (whaaat?), give thought to your life direction in general. Do you know where you're headed?\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Taurus:[/font][/size][/color][spoiler=]\r\nYou've got the travel bug. (Forgive me, this current bedbug infestation is scary, isn't it?) Nevertheless, you intend to travel because you want to broaden your horizons. You want to grab more of life. If you can't travel, you'll read and watch documentaries of exciting places. You're hungry to learn more and you're also hungry for adventure. Think of the joys of eating scrumptious, exotic foods yet to be discovered. Do make this happen because you want to take a vacation! You want some fun! Add a dash of romance and sprinkling of flirtation and you're set. You must give yourself a treat like this in the next month (or longer).\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Gemini:[/font][/size][/color][spoiler=]\r\nIn the next six weeks, you will feel much more passionately intense than usual. Yes, this passion will apply where you might hope. (Two guesses.) But not only will you feel highly sexed, you'll feel passionate about practically everything! In addition to your recreational stimulation, you'll also focus on dull, boring, red-tape material connected with insurance, inheritances, wills, taxes and shared property. You can't avoid this. You might have to enter into discussions about these topics, or you might just be cleaning up old paperwork. (What fun!) Nevertheless, you actually have the energy to do this now, so do it. You'll love yourself later for getting it done. (Kiss-kiss, hug-hug.)\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Cancer:[/font][/size][/color][spoiler=]\r\nYou're going to need more sleep in the next six weeks, just accept this. In fact, don't just accept this, respect your need for it. Get more sleep! The Sun is now as far away from your sign as it gets all year and the Sun is your source of energy. Do the math. However, this opposition of the Sun also brings up another matter, namely, heavy-duty focus on partnerships and close friendships. (Oh yeah.) Observe yourself in these relationships (carry a mirror at all times) to see your style. You've been coming on a little heavy lately, haven't you? Are people raising their hands in front of their face? (That's always a good clue.) Gently, dear Cancer, gently. (Don't get your belly in a rash.)\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Leo:[/font][/size][/color][spoiler=]\r\nSuddenly, you're running around with an outboard motor on your ass. You're on this big kick to turn over a new leaf and get organized. You want your home cleaned, you want your workplace cleaned, you want your car cleaned, you want your closet colour-coded and smelling great. (Yes, this includes finding the closet floor.) What's up? For many, it means company's coming. You like to entertain in style and you certainly like to look like you have your act together (even if you don't). One does have a reputation to keep up. But actually, you just have the urge now to be efficient, effective and productive. Good luck!\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Virgo:[/font][/size][/color][spoiler=]\r\nYou have a fabulous month ahead! You're high energy because fiery Mars is in your sign. (Say no more!) In addition, other planetary configurations are encouraging love affairs, romance, and all kinds of fun, social diversions. You couldn't pick a better time for a vacation. Slip away somewhere if even for a weekend or a few days. Your month ahead is also a great time for sports, the arts and playful activities with children. Enjoy movies, the theatre, parties and schmoozing with everyone! Essentially, an explanation for why this is a wonderful combination is (a) you have the motivation to have a lot of fun (b) you have the opportunity to have a lot of fun, and (c) you have the energy to actually do it!\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Libra:[/font][/size][/color][spoiler=]\r\nWithout question, your focus turns to home, family and your private life. (Bake those cookies. Easier yet - buy quality dark chocolates.) Invite the gang over. If you put out fresh flowers you don't have to dust. Theatre is really just smoke and mirrors. Family relationships, especially with a parent, will be lively and dynamic. Something hidden, behind-the-scenes is present but no worries. It is what it is. Enjoy good times with loved ones. And while the place is looking so good, entertain everyone you know! They might bring the cookies! It's much easier to entertain back-to-back because everything is set up. (You know what I mean.)\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Scorpio:[/font][/size][/color][spoiler=]\r\nThe next six weeks are going to be busy because the tempo of your days is accelerating! You're doing the white rabbit routine: \"I'm late! I'm late, for a very important date!\" Just accept the fact that life will be hairy because of your jam-packed schedule, including short trips, mucho errands, and running around talking to everyone. But you will love it! The air has more electricity and you feel alive! Group activities are particularly boisterous (but do watch out for heavy-duty competition that could become fractious). You love meeting new people and picking up tidbits of gossip. \"Really? Last week?\"\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Sagittarius:[/font][/size][/color][spoiler=]\r\nMoney, money, money! You're thinking a lot about cash flow, how to earn money, and how to earn even more money. That's because you have ambitious plans! And when you have big ideas (and when does a Sagittarius not have big ideas?) you need money! Fortunately, you have lots of money-making ideas right now. (Clever you.) Make an effort to stay on top of your scene: watch your cash flow, be aware of your assets, liabilities and even your possessions and how you might possibly turn something into some folding green stuff. On a more serious note (money isn't everything) you're thinking about your values in life. You want to know what you can do with all that money.\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Capricorn:[/font][/size][/color][spoiler=]\r\nOnce again, the Sun has returned to your sign where it will stay for the next month recharging your batteries for the rest of the year. Yay me! This is a glorious opportunity for you because it attracts people and favourable circumstances to you. Quite obviously, you want to make the most of this because you feel high-energy, witty and quite dazzling! (This year is, after all, your hour, n'est pas? In fact, you're in for a long, fabulous run.) Continue to make travel plans. (Have you even unpacked your bags from the last trip?) School plans look exciting. Explore opportunities in the media, publishing, medicine and the law. So many choices. Tra-la, tra-la, it is to laugh.\r\n[/spoiler]\r\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/news.png[/img][/align]\r\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list]\r\n[*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/WpABi]0OTF[/url]\r\n[list][*]Headlines\r\n[/list][/list]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions\r\n[/list][/list]\r\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[list][*]User News\r\n[/list][/list]\r\n[list][*][url=http://goo.gl/jZvPh]TheHackersLove[/url]\r\n[list][*]World News[/list][/list][/list]\r\n\n[list][*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*]Position Available.\r\n[/list]\r\n\n[*][color=white][b]Web Show Co-Host[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/gGUxd]Astonish is NJ[/url]\r\n[/list]\r\n\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}