{
  "posts": [
    {
      "pid": "27071364",
      "uid": "515249",
      "dateline": "1349641646",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#00BFFF][b]112th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\r\n[color=white][b]Rap Battles And Hip Hop Subforum[/b][/color]\r\nLast week, the Headlines discussed the possibility of a Rap Battles section being imposed. After all of the positive responses on the thread posted by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], he decided to add this forum earlier this week. The subforum lies under the Melody, Harmony, Rhythm and MP3 forum, alongside the Dubstep subforum. It was named \"Rap Battles and Hip Hop\" and has already taken off smoothly, with almost 3000 posts and well over 150 threads already! Although, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] failed to come up with a description and offered HF users the chance to come up with one. There have been 300 posts in this thread so far and plenty of competitive entries. This thread can be seen by clicking on the following link: http://goo.gl/DWVlX\r\n\n[color=white][b]Group Forums Rearranged[/b][/color]\r\nA minor change occurred earlier this week in relation to group forums and was explained briefly by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] on Hackforums official Twitter mid-week. As stated, it's \"no biggie\", although news is news. It was stated that group forums were rearranged to be listed according to post count [b]and[/b] popularity. This was to simply clean up the group tab, and although it isn't anything major, it's good to see that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] is paying attention to detail in relation to the site. Even though it was stated 'post count and popularity', it seems that post count is the major factor in this arrangement. The Group and Crews General Discussions forum still holds the top spot, although [url=http://hackforums.net/member.php?action=profile&uid=323740][b]Positive[/b][/url]'s group, Rhythm, holds a close second place and hopes to sweep the top spot in due time.\r\n\n[color=white][b]Group Recruitment[/b][/color]\r\nThis week has been prime time for applying to join those groups which rarely open up recruitment. Some of the most well-renowned groups that aren't solely invite-only have opened up strict recruitment, allowing any member who meets the requirements to apply to join. To browse for official recruitment threads, users can view the Group and Crew General Discussions forum under the group tab. This week, Graphic Masters and Respawn continued their recruitment which has been running for quite a while. Rhythm closed their recruitment thread after almost two weeks of having it open. The HF Wiki team (Writers) continued their recruitment, although the other partition of the Writers, HF News, also opened recruitment for a few select positions. It seems that recruitment for the HF News is just about done, although there may be time to rush over for last minute applications. The Alliance and InFaMoUs opened up recruitment earlier this week, which is a relatively rare occasion for these groups. The Alliance isn't taking any ignorance or slack, as shown when they had a 30-minute suspension period for everyone due to multiple members failing to read the application process listed in the original post. Head on over if you wish to apply to join a group!\r\n\n[color=white][b]Reinforcing Rules[/b][/color]\r\nWeek in, week out, you see on this very thread users being repfucked and banned on a regular basis; and that's only well-known members! Why, you may ask? Sure, some members are banned for innocent reasons, such as vacation bans and whatnot, although most bans/repfucks are simply for breaking rules. I strongly suggest that, even if you feel you are a master and know every rule there is to know, you read the Help Docs and try to better familiarize yourself with each and every rule. If you are not sure about something, don't just go ahead and do it; check that it's allowed. On top of this, be sure to read section rules and guidelines before posting or making a thread. If you don't, you'll regret it. Even some of the more well-known members choose to disregard this or think that they are above the law. Sorry to break it to you, but rules are much like laws; they apply to everyone. A prime example would be the case of [url=http://hackforums.net/member.php?action=profile&uid=285508][color=black][b]Pocky[/b][/color][/url]. For those that didn't know this user, he had well over 2000 reputation and is one of the top posters on HF (top 5). Despite this, [url=http://hackforums.net/member.php?action=profile&uid=285508][color=black][b]Pocky[/b][/color][/url] was still repfucked and banned (for 3 months) by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] for breaking the rules earlier today. This shows that rule breaking isn't taken lightly and does indeed apply to everyone. Don't be a fool and get yourself banned.\r\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\r\n[color=white][b]User News[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=797403][b]630[/b][/url] reached 1,000 reputation points.\r\n[url=http://hackforums.net/member.php?action=profile&uid=183072][b]Mr Kewl[/b][/url] is now a Mentor! Congratulations!\r\n[url=http://hackforums.net/member.php?action=profile&uid=454666][b]adampelletgun[/b][/url] reached 10,000 reported posts.\r\n\n[color=white][b]Repfucks[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=285508][color=black][b]Pocky[/b][/color][/url] was repfucked for over 2000 rep (largest repfuck ever, stated Omniscient).\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1004046][color=#0066FF][b]Isolate[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=black][b]mybboss[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1450962][color=black][b]Reptar ツ[/b][/color][/url] was repfucked.\r\n[/list]\r\n\n[color=white][b]Bans[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=285508][color=black][b]Pocky[/b][/color][/url] was banned for Marketplace violations.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=879431][color=black][b]Sіgma[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=820667][color=black][b]Ceanko[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=992333][color=black][b]Accident[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=black][b]mybboss[/b][/color][/url] was banned for trolling.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=828184][color=black][b]Airon[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1450962][color=black][b]Reptar ツ[/b][/color][/url] was banned.\r\n[/list]\r\n\n[color=white][b]Awards[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=515249][b]Sir[/b][/url] received the Diamond award, what a badass.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] also received the Diamond award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=89623][color=#0066FF][b]Mark Webber[/b][/color][/url] received the Da Bomb award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=180711][b]Strange Leader[/b][/url] received both the Master Donator and Ass Kisser awards.\r\n[/list]\r\n\n[color=white][b]Group Leadership Changes[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=923197][b]KyleWTF[/b][/url] is now a leader of the Empire.\r\n[/list]\r\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] -  [url=http://hackforums.net/showthread.php?tid=2915681][b]How Romney Failed the Entire Presidential Debate[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1455348][b]d3vill0ck[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2919135][b]Men or Machine to lead your country?[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=485087][b]ChRoNiC™[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2921291][b]Can someone explain to me why America is such a good nation?[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=869669][color=#FFD700][b]nickpick41[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2918808][b]My teacher mind fucked me. Is it true?[/b][/url]\r\n \r\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=949857]Thrust[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 112nd edition of the HF News, we have Thrust as our guest today. Any shoutouts you want to make to the readers?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust:[/color][/b][/url] Yeah I would like to give a shoutout to my main man Glassy and my amazing friend Cody.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: They're both great people. How did you come to be close to those guys?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust:[/color][/b][/url] I became close to Glassy when he approached me in my 1 Year HackForums thread. We're both from the same area and live close to each other. I became close with Cody when he started helping me with Vitality.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: How did you get started with Vitality, and do you think it's turned out how you wanted it to?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust:[/color][/b][/url] I got started with Vitality because I wanted to celebrate my birthday with something special, so I started Vitality and planned it 2 days on my birthday and the group went live on my 15th birthday. I was in Florida and I started getting graphics made, people to help out with the group, etc. I think it turned out amazing. For the month of September we had tons of giveaways and tutorials. Vitality died out but I'm bringing it back better than ever this time.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Glad to see Vitality is making a comeback. You've been in a lot of official groups, what has your experiences in them been like?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: I was in over 10 official groups up to now. My experience has been amazing in each and every single one. I got invited personally via PM in 5 or more of those group as well.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Out of them all, which has been your favorite group and why?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: Ah my favorite group, It would have to be either Reverence, Respawn, Propitious or Infamous.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: And why is that?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: I still remember the same exact day, same hour that Propitious was made, It was me and TheHackersLove in a Skype call talking, I was helping him w/ a phone issue and I just said, \"Dude check the fucking Group Memberships.\" That was when he seen that it was official and I got invited the first hour or so that it was created.\r\nI had been in there for a few months after creation, Me and iNviZ and TheHackersLove grew a bond, but sadly later on me and TheHackersLove got into a argument here and there and our bond broke, Everything between me and iNviZ is still fine, Wish everything was still fine w/Me and THL though.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I suppose it helps to have personal friendships to group leaders. Are you sad that official groups are done being sold on HF, and have you considered buying WiFi's group?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: All people think like that. \"Suppose it helps to have a personal friendship to group leaders...\" It doesn't help, it would only help if the leader is a complete retard. It's fine knowing the person but don't invite them just because you have a personal friendship w/ them, I tried to get into 143 and a few other groups before and the leaders even denied me \"I tell all my friends the same thing\", It's not a personal thing it has nothing to do w/ friendship at all that's my perspective.\r\nI was thinking of buying WiFi's group, but my house burned down (1 room) and repairs costs over $1,000 out of my money that I was screwed out of. I decided to help repairs and not a official group on HackForums.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I hope your housing situation is better now. Spend your money on something a little smarter... how did you have that much money in the first place?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: I had about $2,500 saved up from working, I work fixing computers, I buy and resell phones, I sell phones etc, I do tons of things.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Do you have any regrets about things you did on HF as a whole?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: Yes, I regret getting into a fight with TheHackersLove and I regret doing things to get me repfucked multiple times.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: We all have regrets about things. But what has been your bright moment on HF?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: My brighest moment on HackForums is when I got perm-declined for ub3r.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Lol. Turn something bad into something memorable. To wrap this all up, do you think that HF has changed with you having been around in a good way?\r\n[url=http://hackforums.net/member.php?action=profile&uid=949857][b][color=white]Thrust[/color][/b][/url]: Yep, my group did a major impact with doing basically the most a group has ever did in a month, with so many contributions and giveaways, same goes for me. I'm glad I got declined, show's other people you don't have to be ub3r to go far on HF.\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=143654]Kr4z1[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, Kr4z1, to the 112th edition of the HF News. As always, any shoutouts before we get into it?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Shoutout to the oldfags of HF, you know who you are.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure they will be happy to see that, if they can comprehend the true meaning of 'oldfag'. Anyhow, tell us about your HF life.\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Haha alrighty... well, where to begin. I joined during late 2008. I was a young kid then exploring the XBL scene and my friend Intent and Aaron spoke of a site where we could make money off selling booters and stuff. Well, my first registered account was something like \"KraZi is OdG\" and I failed at trying to earn money because I wasn't really known on the site and I didn't understand the concept of rep. So, I quit browsing HF and made a new account in late '09, roughly a year later. I was hell-bent on making a name for myself, seeing as my Xbox life was getting rather boring and I wasn't in school anymore. I spent hours making helpful threads, doing giveaways and doing account upgrades. I also had a LOT of reported posts. One thing led to another and I got a PM from Jesse about 2 months before Halo Reach came out and he asked if I wanted to become Staff. Ofc I said yes! I was an active Staff member for about a year... and then I went inactive again. When I came back Jesse asked me to step down. I agreed. I couldn't browse HF like he needed me to. I still can't. (note: his old account was merged by iBF due to hacked emails - join date taken from old account)\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: How did being a Staff member change your HF life, or you as a person? What perks stood out and what was most memorable?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Well, I gained a load of rep at once (not like I need it anymore). As a person, I spent more time on the site than I ever did before. Hours, days, weeks.... constantly doing reports. Doing reports are basically all that matters to a HF Staff member. Dealing with everything else as a Staff member comes second to doing reports. The perks were amazing. Being able to ban and warn was an amazing perk, but by far the best perk out of all of them was the ability to repfuck someone. =) That was my favorite button! The most memorable thing about being a Staff member was actually becoming one. Before I was invited I had recently exposed the ex-Staff member Yin as the scammer/infecter he was. I showed full proof to Omni and everything. It was a real shocker for everyone. Shortly after that I got the PM from Jesse!\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Exposing a Staff member (especially one as prestigious as Yin) must've taken some work. What skills did you have to use to expose him (DOXing, DDOSing, RATing, etc) and what exactly did you expose him for? What led from his exposure?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: I was reputable member of sorts then. I was also very helpful. I always a full Inbox of members asking questions of sorts. One member came forth and tried explaining to me that my friend \"Yin\" was a scammer. And yes \"my friend Yin\" is correct. Yin and I were extremely close before I exposed him. I took the lead from this kid who apparently had \"proof\" Yin infected and scammed him for all his money. At first I was hesitant to believe this; I mean, Yin was a highly reputable member and he was also in HJT. I looked over the facts and I brought this to the attention of the Staff member, most of you know him as an Admin, F8! He also had reasonable suspicion that Yin was a scammer and an infecter. Backdooring his products, doing Ponzi like schemes, etc. I worked closely with F8 to make a video alongside a huge scam report which I uploaded for Jesse and I was given permission from F8 to take full credit in exposing him. I felt bad later for Yin but what he did was unacceptable. He stole literally 1000's of dollars and infected many HF members.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Wow, that's definitely quite an amazing story. If someone asked you to pinpoint your most memorable moment on HF, one that stood out to you most of all, what would it be?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Hands down... the moment I read Jesse's PM explaining he was inviting me to become a Staff member was single-handedly my most memorable moment on HF. I was so damn excited. I locked myself in my room and stayed on HF for 17-18 hours trying to learn how to work the MOP CP. Haha.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Haha, nerdgasm's at their finest! Well, where are you today? You are obviously no longer a Staff member, nor are you as active as back when you were, although you still tend to hop on HF. What are your future plans, both IRL (if you feel like sharing) and on HF?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Tbh, I'm trying to become steadly active on HF, but I think becoming a Staff member and working so hard to stay as one really burnt me out. Also, you have to take into consideration that the HF I was extremely active on is not the same HF we browse today. ALL NEW FACES, some old ones, but too many new ones for me to keep up with. I'm working on my 3rd year of college after the new year. After my 4th year I want to try to look into going to med school possibly. HF... I try not to plan what I do on HF. I kind of let it take its own path. Whatever lies in front of me in the future on HF is definitely not planned.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, good luck if you do decide to go to med school. Being an oldfag yourself, you'd surely be able to spot what has changed on HF since. Do you think HF is better or worse now compared to then and why?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Honestly, I think HF has seen worse days than what you may experience now. The lack of \"spontaneous\" content is what really drives me to taking these long breaks from the site. The older HF was more relaxed, less rules and less idiots. HF has changed so much. I know Jesse is making FAT BANK with all these upgrades, usersgroups, stickies, accounts gifts, Ads, etc. Just the whole shabang!\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: He'd surely be raking in the cash. Tell us about groups. What were they like back then (if they were even around back then), how many were there, how were they created, what were they, how have they changed, etc?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: There was very few groups and one of the first ones I joined was HJT. HJT is, I believe (don't quote me I'm probably wrong cause I'm too lazy to check), the only original group still around from the older generation of HF. I tip my hat to anyone who's in the group and who's graduated from that group. They do big things in that section and are probably the most helpful people I've ever met when it comes to PC security and safety. Anyways... all these new groups... I haven't even taken time to really look into them. Some seem very pointless, while others seem cool I suppose.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Are there any other changes that you've noticed? What do you think of the current Staff?\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: All these new damn awards Jesse has added. I'm loving them lol. I wish I had the ninja award hehe. Current staff? There's some new staff members I really don't know. The only staff/admin I ever knew personally was F8, bugga, and TRRS. I miss them dearly. I owe them a lot.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for the interview today Kr4z1. I'll let you sign us off with any wise words, comments or issues that you'd like to address.\r\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=white][b]Kr4z1[/b][/color][/url]: Please HF skids, no more f**king shell booters.. FOR THE LOVE OF ALL THINGS GOOD!!!!\r\n[/spoiler]",
      "subject": "[10/7/12] - HF News"
    },
    {
      "pid": "27071370",
      "uid": "515249",
      "dateline": "1349641669",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=white][b]Pool Tournament[/b][/color]\nOMGPOP Pool has become a relatively well-renowned trend on Hackforums recently. Yellows is currently hosting the 5th OMGPOP Pool tournament (all which have been hosted by him). If you are wishing to participate, you can register in the tournament thread, although hurry as registration is almost closed. Why not try? You could win yourself some awesome prizes! You can view the thread for the current tournament [url=http://hackforums.net/showthread.php?tid=2916522]here[/url]. \n\n[color=white][b]MoH Warfighter Beta[/b][/color]\nThe Medal of Honor Warfighter beta is now available on the Xbox LIVE Marketplace. It took off to a shaky start, however once downloaded you will be having a lot of fun. The beta offers one map and a new playing mode. The beta is only available to Xbox LIVE Gold Members until October 15. MoH Warfighter (full version) is set to be released on October 23 in North America. If you want to learn more about the beta, visit this thread [url=http://hackforums.net/showthread.php?tid=2915341]here[/url].\n\n[color=white][b]MoH Warfighter Beta Gameplay[/b][/color]\nAre you missing out on the beta? Couldn't download it or you are on PC or PS3? Well, I've got some goodies for you. A few players have uploaded gameplay and it's definitely worth checking out. Remember to subscribe if you enjoy the content! You can view the gameplay [url=http://www.youtube.com/user/StuckAtSpawn/videos?view=0]here[/url].\n\n[color=white][b]Halo 4 Forward Unto Dawn[/b][/color]\nThe first episode of the new online series \"Forward Unto Dawn\" was released on Friday. This new series will be released every week until the Halo 4 launch, where limited edition owners will receive a copy of the whole series with the game. Forward Unto Dawn can be viewed on HaloWaypoint or the Machinima Prime YouTube channel. Halo 4 comes out on November 6th. You can view the first episode of Forward Unto Dawn  [url=http://www.youtube.com/watch?v=BfJVgXBfSH8]here[/url].\n\n[color=white][b]Halo 4 Flood Mode Detailed[/b][/color]\nHalo 4 is one of the most anticipated games this year. 343 Industries recently posted information about one of the new modes in Halo 4; Flood Mode. “Flood is the spiritual successor to Infection, a fan-favorite game type from Halo 3 and Reach,” explains a new post over on Halo Waypoint. “Our goal was to recreate it and push the mode to be new and different from previous versions.” “As both War Games and Spartan Ops fit within the fiction of the UNSC Infinity, we wanted to use Halo fiction in this mode too, which led to us to create the Flood form in Multiplayer. Flood-converted humans are much faster and focus on melee attacks, so they were a natural fit for Infection’s successor.” “Halo 4’s Flood mode is a round-based, ten-player game. It is a true asymmetric experience with the added twist of dynamic teams; this really changes things up as each game is different, especially in the incredibly intense and high-action final seconds.” “At the beginning of each round, two players spawn as Flood forms and eight players spawn as Survivors. Survivors are standard Spartans equipped with shotguns and magnums, while Flood moves very quickly and can only use a melee attack.” “When a Survivor gets killed by a Flood, the Survivor will convert and respawn as a Flood. The round ends if a Survivor makes it to 3:00 or if all players are converted to Flood.”\n\n[color=white][b]Xbox Music[/b][/color]\nAccording to reports, Xbox Music may be released to the public on October 26. Familiar Xbox reports also stated that \"Xbox Music will offer the choice of a free service with ads, or an ad-free subscription model, similar to Spotify\". The Verge wrote an article saying the service will launch along side of Windows 8, however nothing has been finalized. You can see the E3 2012 trailer for Xbox Music [url=http://www.youtube.com/watch?feature=player_embedded&v=bs9R9-vbeN4]here[/url].\n\n[color=white][b]Cliff Blesinzski Resigns[/b][/color]\nCliff Blesinzski has announced he is leaving Epic Games. “In 20 wonderful years with Epic, Cliff Bleszinski has grown into a true design luminary, and his contributions to the ‘Unreal’ and ‘Gears’ series have helped shape the game industry into what it is today,\" writes Epic’s founder, CEO and Technical Director, Tim Sweeney. \"Cliff leaves Epic with our gratitude for his many contributions, and our wishes for continued success in the next chapter of his life!” \"I’ve been doing this since I was a teenager, and outside of my sabbatical last year, I have been going non-stop. I literally grew up in this business, as Mike likes to say. And now that I’m grown up, it’s time for a much needed break.\"\n\n[color=white][b]Minecraft Update Finalized[/b][/color]\n4J Studios have polished and finalized the next update for Minecraft Xbox 360 edition. 1.8.2 will introduce many new features, including creative mode and also includes fixes and improvements of previous features. You can view the list of new features, improvements and fixes [url=http://www.xbox360achievements.org/news/news-13007-Minecraft--Xbox-360-1-8-2-Update-Finalised--Loads-of-Patch-Notes-Here.html]here[/url].\n\n[color=white][b]HF Threads To Check Out[/b][/color]\nA few members of the community have posted threads in the gaming section that should be noted this week and are as follows:\n[list]\n[*][url=http://hackforums.net/showthread.php?tid=2916002]Major Games List[/url] posted by [url=http://hackforums.net/member.php?action=profile&uid=180711][b]Strange Leader[/b][/url]\n[*][url=http://hackforums.net/showthread.php?tid=2916522]OMGPOP Pool Tournament [5][/url] posted by [url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url]\n[*][url=http://hackforums.net/showthread.php?tid=2919905]HackerCraft Update[/url] posted by [url=http://hackforums.net/member.php?action=profile&uid=1488226][color=#0066FF][b]Mr.H[/b][/color][/url]\n[/list]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Possible Hezbollah Drone Struck Down[/b][/color]\nA drone strike has occurred near the border of the occupied West Bank area. The Israeli air force spotted the drone above the Mediterranean Sea somewhere near the Gaza Strip. A military spokesman announced that the explosive event took place on Sat, Oct 6 at 10 A.M. Defense Minister Ehud Barak exclaimed that the Israeli Air Force's strike was \"sharp and effective\". Miri Regev, of the Israeli Parliament, has tweeted that the drone belonged to Hezbollah, a Lebanese Shi'ite group which has been at odds with Israel in the past. There is no official message on who was actually responsible for the attack, as the defense officials have made no such confirmation. The Israeli government has released an official short clip that is said to be the strike of the drown. You can view the short clip on YouTube by clicking on the following link: http://goo.gl/V1dJL\n\n[b][color=white]Producer of “Innocence of Muslims” Faces Possible Jail Time[/color][/b]\nDo you remember the recent storm of protests and riots that broke out across the Middle-East in retaliation towards the parody humiliating Mohammed? The man responsible for the film, ironically titled \"Innocence of Muslims\", is said to be an immigrant of the US from Egypt named Mark Basseley Youssef. The 55 year old producer of the film is set to appear in a Los Angeles federal court for a probationary hearing that includes the examination of possible violations. The probation stems from bank fraud charges that occurred in 2010. Aside from his upcoming court date, he was already arrested by U.S. Marshals on the 27th of September where he faced a federal judge and a district attorney accusing him of a violation of probationary conditions. He is currently being held in a federal prison without the possibility of bail in Los Angeles, California. If Youssef is found guilty, he faces the possibility of up to 24 months behind federal bars. This may come as a relief to him, considering he has a price on his head.\n\n[b][color=white]April Jones' Suspected Murderer Charged[/color][/b]\nThe alleged abductor and murderer of April Jones, a joyful 5 year-old girl, was charged on Saturday for his suspected transgressions. Coupled with those charges, he was also charged with \"attempting to pervert the course of justice\". While 46 year-old Mark Bridger remains in jail, the police are continuing the search for April in an almost desolate area of Wales called Machynlleth. Prosecutor Iwan Jenkins sympathetically stated “I realize that this is an incredibly difficult time for April's family, friends and the community\". Expert search teams have been deployed to find the missing body wide and low, but have yet to make any discoveries. Many of those in the community have tried their best to help the police in their hasty search. The mother of April Jones has reached out publicly for support in helping the discovery of her daughter's body. Prime Minister David Cameron has even remarked that the ordeal was \"every parent's nightmare\".\n\n[color=white][b]Pope's Ex-Butler Sentenced to 18 Months in Prison[/b][/color]\nPaolo Gabriele, the Pope's ex-butler, was sentenced to 18 months in prison earlier this week. He was convicted of aggravated theft for leaking confidential files taken from the Pope's apartment. Police reports state that more than 1,000 papers were found in the apartment of Gabriele. This is the largest case out of the Vatican in decades and has received so much attention following the publishing of a related book. The book is based on the leaked papers revealing corruption within the Roman Catholic Church hierarchy. Along with the papers, a golden nugget and a check made out to Pope Benedict XVI for 100,000 Euros was taken.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple - iPad Mini[/b][/color]\nYes, it's exactly what it sounds like. The [i]iPad Mini[/i]. Not quite a tablet, too big to be a phone. Basically, an uncomfortably sized iPod Touch. Rumors are starting to spread of the 7-inch tablet, with images and renderings dripping through the leaks of Apple. So far, there is no official announcement of its existence, but analysts are saying it could go for as much as two-hundred dollars, possibly to compete with the Kindle Fire.\n\n[color=white][b]Nintendo - Pokemon[/b][/color]\nAll the Pokemon fanatics out there should be excited, as Pokemon Black 2 and White 2 are on there way to the United States. Not much has changed since the first version, yet it seems to take place fifty or so years in the future. Gamers will notice slight changes in the gameplay mechanics and overall aesthetic differences. So, to celebrate this upcoming release, those who hop on the pre-order train will get a free download, much like Mystery Gift, of the pokemon \"Genesect;\" a new legendary pokemon for the aforementioned games.\n\n[color=white][b]Facebook Reaches The Billions[/b][/color]\nThat's correct, with a \"B.\" Facebook has reached its billionth member. The stock may be in the toilet, but their activity is still quite high. Many people rely on this website for communication and catching up with old friends. With around a seventh of the world's population as members, there's no doubting its success. However, there are still several markets it's yet to pierce, such as Russia. Once it has successfully thrust itself into the social media market of the entire world, who knows how many people will be updating their status. \n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Jack White Abandons Radio City Music Hall Concert[/b][/color]\nAfter playing for only 55 minutes, Jack White, former front man of ‘The White Strips’, abruptly abandoned his concert on Saturday night. The packed Radio City Music Hall crowd was left confused and angry after a bizarre performance from the musician. White performed several of his new solo songs, but also played a few from his White Strips days. Throughout the performance he asked the audience to quiet down because he “couldn't hear himself think”. Later, contradicting himself, he shouted “Jesus Christ, is this an NPR convention?” after performing “Love Interruption”. This was despite the fact that the entire crowd was standing and cheering loudly. Eventually he left the stage completely without offering an explanation. Most fans believed this to be some sort of intermission, and appropriately broke out in a “Seven Nation Army” sing along. After minutes of waiting, it became clear that White was not returning. The crowd quickly changed their chants to “Fuck Jack White!”. A stage usher later offered an explanation for the performer’s odd behavior and actions: \"He wasn't happy with the sound”, he said. However, staffers and audience members said that the sound was fine. \n\n[color=white][b]The Black Keys And Foo Fighters Fight Poverty In Central Park[/b][/color]\nA five-hour concert took on place Saturday night in Central Park, New York, headlined by The Black Keys, Foo Fighters, Neil Diamond, and Crazy Horse, among others. The concert was held to raise awareness and money for the “The Global Poverty Project”; an organization that aims to end poverty. Over 60,000 people attended the concert, which was free pending one stipulation. In order to receive tickets, fans had to accumulate points by supporting several charities. Once they had received enough points they were entered into a lottery and chosen from there. The concert was also streamed live across several websites including YouTube. The Black Keys performance included “Same Old Thing” and “Howlin’ For You”, while the Foo Fighters performed “My Hero” and “Times Like These”. Smaller sets included the Indie-Rock composition Band of Horses and Somali rapper K’annan. Several celebrities, including Katie Couric and Selena Gomez, presented statistics on poverty to the crowd, but thankfully, did not perform. \n\n[color=white][b]Mumford & Sons’ Babel Biggest Album Debut Of 2012 [/b][/color]\nMumford & Sons’ sophomore album “Babel” topped the Charts this week at #1, selling 600,000 copies in its first week of release. This easily toppled the 2012 record, which was held by Justin Bieber’s “Believe” (374,000).  It was the biggest album debut since last November’s “Take Care” by Drake (630,000). Mumford & Sons released their first album in 2010, “Sigh No More”, but its success was very slow to materialize. Mumford & Sons weren’t the only ones to experience success last week, however, as Green Day’s first album since 2009 took the #2 spot. “Uno!” sold 139,000 copies, while No Doubt’s “Push and Shove” followed a close third with 115,000 copies sold.  \n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=WgBeu3FVi60[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://youtube.com/watch?v=8-r-V0uK4u0[/video]\n[video=youtube]http://youtube.com/watch?v=GoltwBHXCx8[/video]\n[video=youtube]http://youtube.com/watch?v=TMbyWSGYUgc[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nLive life.",
      "subject": "*"
    },
    {
      "pid": "27071384",
      "uid": "515249",
      "dateline": "1349641685",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you think of the new Gauth security?\"\n\n[i]\"I think that Google Authentication will be a good step in providing extra security for accounts. \nI believe that if everyone uses it when it is out of testing and actually implemented, the number \nof account thefts will drop significantly. The only problem now is that I have to charge my iPod \nevery time I want to do something significant. I think that it will also allow hassle free account \nrecovery. All in all I think it is a good idea and I hope to see it implemented in the near future.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018479][i]-Phaxol[/i][/url]\n\n[align=right][i]\"I think the new Gauth Security is a great idea, atleast it will stop the scammers \nfrom saying \"my account got hacked and went on a mad scamming spree\". Now everyone will find \nout who the true dirty cunts are now!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=548259][i]-r0flez[/i][/url][/align]\n\n[i]\"I think once the Gauth is released it shouldn't be mandatory but will be a nice edition to the forum \nas I am constantly seeing new threads ratted or by people claiming that they have been hacked and \nblaming any scams that went on down to the person who hacked them etc to be fair alot of which \nthreads are just people trying to scam for the sake of making some money, Overall I think it will be a \nnice edition to know that our accounts are yet a little bit more secure.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1119610][i]-Winner[/i][/url]\n\nThe topic for next week is \"What will you do on the new HackerCraft server?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/i5DZenwKujTDf.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/mc4oZ.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/ib1irrGTE2yBC6.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]Phytrix[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]Sir[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}