{
  "posts": [
    {
      "pid": "36265101",
      "uid": "515249",
      "dateline": "1384233703",
      "message": "[align=center][IMG]http://i.minus.com/iFr3ysSi8zt0B.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFA52C][b]168th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/ibbtDZ715LhhGY.png[/img][/align]\n[color=white][b]Away With The Bling[/b][/color]\nThis past week, Hack Forums has experienced something rather unusual. On a normal day, awards on Hack Forums are highly sought-after square pixel arrays given out by the owner of the website, [url=http://hackforums.net/member.php?action=profile&uid=1][b]Omniscient[/b][/url], rarely. While exceptions can be made, such as the member [url=http://hackforums.net/member.php?action=profile&uid=295848][b]Qwazz[/b][/url] giving out his [url=http://hackforums.net/myawards.php?awid=62][b]Qwazz Star[/b][/url] award, they are normally only added to a member's profile page for achieving something reputable and being noticed by [url=http://hackforums.net/member.php?action=profile&uid=1][b]Omniscient[/b][/url]. These achievements can range from donations to showing signs of being a \"Mad Scientist\", generally being of a positive nature and allowing the recipient to feel more accomplished within the community. Over the course of the past few days, several members have opted instead for the removal of their hard earned pixels. Keeping in mind that some of these awards can never be earned again (such as the \"LR Head\" award), these actions are permanent. Using various explanations for their decisions, the general consensus was that the awards simply made their profiles too \"flashy\", choosing instead to commit to the forum and show their potential without the need of extra icons. In particular, one member by the name of [url=http://hackforums.net/member.php?action=profile&uid=63387][b]Black Shadow[/b][/url] has had a total of 13 awards removed. In addition, the memebers [url=http://hackforums.net/member.php?action=profile&uid=608523][b]Sh1eld[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=787112][b]Saturday[/b][/url] have also removed a portion of their pixel arrays. While these decisions were most likely not taken lightly and after a lot of thought, one can only hope they do not come to regret their choices in the future.\n\n[color=white][b]Bitcoin Gambling Kicked To The Curb[/b][/color]\nWhile expected by some, it may come as a complete surprise to others to know that [url=http://hackforums.net/member.php?action=profile&uid=1][b]Omniscient[/b][/url], has decided to disallow all promotions of gambling sites in the [url=http://hackforums.net/forumdisplay.php?fid=277][b]Crypto Currency[/b][/url] section. Included in the announcement is the statement that the mere discussion of crypto currency gambling is a punishable offense that can result in consequences including warnings, repfucks and even account closures. [url=http://hackforums.net/misc.php?action=help&hid=21][b]Referring to the Hack Forums Help Documents[/b][/url], he reminded members that gambing in itself has long been against the rules. As Bitcoins, Litecoins, and other crypto currencies such as ASICCoins are not considered a \"real\" currency by some, rest assured that the gambling rule now covers them as well. The confusion about the discussion of gambling within the section now being cleared, it leaves the road open for the intullectual discussion of the various rises and falls of the coins in addition to assisting those who have just started mining for riches on their family laptops. If you wish to view the announcement, you may do so by visiting the thread [url=http://hackforums.net/showthread.php?tid=3856094][b]here[/b][/url].\n\n[align=center][img]http://i.minus.com/iyobmhGt2yol0.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1050193][b]Connected[/b][/url] won the MOTM contest for November.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=792136][b]Krew[/b][/url] hit 10,000 posts.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=870436][b][color=#00aaff]PoisonKnife[/color][/b][/url] hit 1,000 reputation points.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1043300][b]Abel[/b][/url] hit 2,000 reputation points.\n\n[/list]\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=586597][b][color=#00aaff]aSmoo[/color][/b][/url] was repfucked in regards to [url=http://hackforums.net/showthread.php?tid=3843478]this[/url] thread.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1465028][b][color=#00aaff]Swirl[/color][/b][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=127732][b][color=#383838]`P R O D I G Y™[/color][/b][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1043071][b][color=#383838]MHC[/color][/b][/url] was repfucked in regards to [url=http://hackforums.net/showthread.php?tid=3851731&pid=36191736#pid36191736]this[/url] post.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1261919][b][color=#383838]Continuum™[/color][/b][/url] was repfucked for scamming.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1913126][b][color=black]-Correct[/color][/b][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1368133][b][color=black]€xploit[/color][/b][/url] was repfucked for reputation abuse.\n\n[/list]\n[color=white][b]Active Bans[size=x-small]*[/size][/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1913126][b][color=black]-Correct[/color][/b][/url] was banned for repfuck complaining.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1452196][b][color=black]-Nas[/color][/b][/url] was banned for posting a marketplace style thread outside of the marketplace.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1586527][b][color=black]Ravager[/color][/b][/url] was banned with the reason: \"The slightest discussion of PayPal fraud is unacceptable.\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1813300][b][color=black]Dr. Business[/color][/b][/url] possibly had their account stolen and was banned as a security precaution.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=690666][b][color=black]404™[/color][/b][/url] possibly had their account stolen and was banned as a security precaution.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1368133][b][color=black]€xploit[/color][/b][/url] was banned for reputation abuse.\n\n[/list]\n[color=white][b]Closures[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=127732][b][color=#383838]`P R O D I G Y™[/color][/b][/url] had their account closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1043071][b][color=#383838]MHC[/color][/b][/url] was repfucked in regards to [url=http://hackforums.net/showthread.php?tid=3851731&pid=36191736#pid36191736]this[/url] post.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1261919][b][color=#383838]Continuum™[/color][/b][/url] had their account closed for scamming.\n\n[/list]\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1050193][b]Connected[/b][/url] received the MOTM award.\n\n[/list]\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1659032][b]Cyph Jr[/b][/url] is now a leader of *#@&%!.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1114693][b]Keeper[/b][/url] is now a leader of Dynasty.\n[/list]\n\n[align=right][size=x-small][color=white][b]*[/b][/color] - As of scheduled release date for the HF News edition.[/size][/align]\n\n[align=center][img]http://i.minus.com/ibtD6mgmzoGVeX.png[/img][/align]\n[i][b]Lounge Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3441765][b]Stupidest Thing You've Heard About Computers?[/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=875895]Haste.[/url] - A thread discussing some of the stupid things you've heard about computers.\n\n[i][b]Gaming Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3844626][b]What makes CoD so attractive?[/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=382745][color=#00aaff]Kn1gh7[/color][/url] - A thread to discuss why so many people are interested in CoD.\n\n[i][b]Lounge Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3842030][b]Show off your room/setup[/b][/url] by [url=http://hackforums.net/member.php?action=profile&uid=687175]Hubert[/url] - Share your gaming/computer/room set-up here.\n\n[align=center][img]http://i.minus.com/iV2Z5H1KVQP4W.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=7807]VipVince[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Hello! Welcome to the 168th edition to the HackForums news. Today I have the pleasure of interviewing VipVince. How are you doing? Any shoutouts before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] Hey, I am good just finishing breakfast. No shout outs to anybody in particular, just to the community as a whole.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] April 10th, 2008. That was 5 and a half years ago and earned you the user ID of 7807. What brought you to HackForums half a decade ago? \n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] Half a decade, damn. I never thought of it like that...\"half a decade of destruction\", sorry if you do not watch WWE you will not get that, its a gimmick used with the Undertaker (decade of destruction). Anyways back on topic, I was drawn towards Hackforums when I was adolescent I had been ratted after frequenting a chat site. I was amazed at how somebody could have so much control over my computer whilst sitting at theirs. I was mad but I was amazed, now I have realize it was only a matter of some social engineering and sending me a crypted server which I foolishly ran. When I discovered CMD and Telnet, I was like a kid with a boner watching a Carmen Electra flick. I am very much a different kind of person today, I have no time for ratting and those that consider themselves \"hackers\" for doing so. Its a misconception from the general society that these kids that DDoS servers all day and rat people are actually hackers.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] I noticed you were the very first member ever to win MOTM in early 2009. Has the MOTM competition changed at all since it originated so long ago?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] I believe it has changed hugely, and not for the better. I received it for Omni when this scheme was first implemented at that stage it was literally who Omni felt was making the most HQ contributions and the member of the month. Now its just a popularity contest, and is influenced more on who you know rather than what you know. \n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] While we're on the topic of awards, you're quite the drinker judging by that drunk award, eh?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] I received that from IBruteForce, he had seen some pictures from my Summer in Ibiza, one of which I looked absolutely wasted in. He found it rather humorous and granted me with the drunk award, I am not the same drinker now. I have had some bad experiences whilst intoxicated and to be honest alcohol intimidates me. It can come at a price, and my debt to alcohol has been paid. I still drink, but only an amount in which I still have control over my actions and thoughts.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] So of the 5+ years you've been on HF, you've accumulated an astounding 8 months online time. That's one of the highest amounts I've seen. What kept you coming back day after day?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] That made me cringe a little haha, but yeah 8 months is a long time. I have not been at the keyboard that whole time, I regularly have my Hackforums logged in even when I am out or asleep. It is an addictive forum, not to the point in which I am making videos on here and sharing how my day went or anything like that, but I have grown accustomed to being on here. I enjoy writing tutorials and sharing my knowledge, I remember ferociously chasing down every tutorial I could find to try and learn more and more, of course I am still learning but I have grown into a position of the teacher rather than the student. Hard work and evolution my friend.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] I'm assuming all that dedication led to your promotion of Mentor. When did that happen and how did that come to be? I bet that PM from Omni was quite the surprise.\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] I was staff and then mentor, the first PM in which Omni messaged me asking would I be interested in becoming a staff member made my heart race a little, I won’t lie. I had an idea as I had a few staff members at that time on my MSN, and then were hinting at it. It was obviously being discussed with the staff community and Omni behind closed doors if you may. I jumped at the opportunity, however its not as glamorous as it looks from the outside. It requires hard work and constant dedication, as I was so eager to learn at the time, by reading tutorials etc I felt the responsibility of being staff took away from my leisure and own prerogative. Thank you Omni for the opportunity however.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Moving on, HackForums has gone through TONS of changes over the years. What was the biggest or most notable change to the forum that you remember?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] The biggest was probably when Omni announced that he was selling, that really shook the community to its core. It shocked a lot of us, and the unexpected had a lot of people nervous. Thankfully that fell through though, as for physical change nothing too notable, I imagine Omni has a \"if its not broke don’t fix it\" mentality, he does a lot of work with plugins, and recently the new theme, but nothing to the extent I feel like my browsing experience is much different. The theme etc does not affect me, I seen a lot of members complaining etc, but I am here for the quality within the text of the threads, the layout and color scheme and text within the banner is all very trivial to me personally.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] While we're on the topic of change, what are your thoughts on the modern theme? Do you use it or are you too oldskool?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] I actually had to go into my user CP to check which theme it was called, that just shows how irrelevant it is to me. My theme is the Modern HF, it is refreshing to have a change I guess.\n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url]  I see, so more about you. What do you like to do outside of the forum? \n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] Outside the forum I go to the gym regularly, I enjoy going to nightclubs and I am actually surprisingly social for someone who has 8 months of online activity on Hackforums haha. \n\n[url=http://hackforums.net/member.php?action=profile&uid=787112][color=#FF69B4][b]Saturday:[/b][/color][/url] Thank you so much for allowing me to interview you. Do you have anything to say before we conclude this session?\n[url=http://hackforums.net/member.php?action=profile&uid=7807][color=white][b]VipVince:[/b][/color][/url] I am still finding my plan and path, but I am content and believe being happy with yourself allows you to be happy with others. No major announcements or things to announce, other than wrap up, it’s cold out there. I wouldn't want you little pets getting a cold![/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url][/font][/size]\n[spoiler=][b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Hey there - welcome to this weeks edition of the News! Today we're going to interview the legend that is Skulltraill. Hey man - how are you doin'? Any shoutouts before we begin?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] Gee thanks man! I know this is going to be cliche, but I have quite a few shout outs (I mean I have been on this site for 5+ years, I've met a few people...):\n\nFirst I'll start off by thanking you for interviewing me. Next [url=http://hackforums.net/member.php?action=profile&uid=752389]eiqhtworks [/url]for suggesting me to be interviewed in the first place (I linked his profile because it seems he likes to change his username a lot).\n\nEveryone likes to shout out to Omni, and that's fair enough, he is out admin after all. However, Omni along with a few other oldfags (Pins222, s9TeeN, Psinetic, Crow, Kn1ght, Soldier of Fortune, and many many more that I'm sure I've missed) have truly played a part in my life, they are like my parents/teachers online. When I first came on this site I was only 12/13. I was a child, and this was one of the first sites I ever visited... I didn't really understand the proper way to conduct myself in a large social environment, and I made a fool out of myself many times. All my accounts back then were on -rep, even this one got a -10 from Omni within the first few weeks.\n\nBasically I was an immature, spoilt idiot who always wanted my way. I wont go in to too much details, but many of the older members here through their harsh words and critisicm actually made me reflect on myself and become a better more mature person. I'll put more details and more shout outs when I make a 'feedback' thread.\n\nSome other names I'd like to throw out: Stay Plural, Buzz Lightyear, the old GFX Masters group, the old group Wraiths, most of the old staff who I used to be friends with... iBruteforce was a good guy. I've missed loads of people, I'm sorry... basically if you used to know me during 2007-2009 then I respect you.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Seems like you've made quite a bit of friends over the years on the site. So, you've been here for ages now. What's the section that you're most active in? Why?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] That's a bit of a hard question. I initially came on this site to get hacks for games, then saw that it was mainly about computer hacking, and I tried my hand with it, did a little bit, learned a little you know... but soon I realized that was not for me. So I decided to check the other sections. I couldn't get in the 'XXX' section because I was too young on my profile, and I always got flamed in the lounge, so I tried the graphics section. I found out it was full of great members, and was sort of separate from the rest of the site... like it's own little community. So I stuck there, I was already kinda into graphics, so it was a good 'home' for me. I made most of my friends there, and I was VERY active in it. I once had the thread with the highest post/view count for my 'free signature' service back in the day. It was massive, lasted for ages, and I made thousands of signatures over the course of that thread's life. At one point I had the 5th highest post count, and AFAIK most of the posts would have come from the GFX section.\n\nAfter I took a big break in 2010 (my country got banned), when I came back, all the old GFX peeps were gone, and the GFX scene had changed... that section no longer interested me, and nor did any other section really, so I got into the Lounge... sort of like 4chan's /b/ (another site I used to frequent a lot since I was a kid)... I enjoyed seeing people's troll posts, jokes, forum games, life stories etc etc... ever since then I think that must be my biggest section... lol.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Sad to hear that your buddies vanished from that section, So, you joined the site just to learn about game hacks, or is there more to that? Were you referred by a friend?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] Sadly that's pretty much it haha, I wanted an edge on games so I looked for various terms like \"game cheats\", \"game cheat software\" and I saw some people on various forums calling them \"hacks\" so I googled \"hacks forum\" and HF came up...\n\nNope... came here on my own, no friends haha, although I did get a few of my friends on HF ages ago, they aren't into it anymore all accounts closed.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] I actually had the same intentions when signing up too. So, be honest with us here; Could you live a day without HF? Or are you glued to the site like most of us are.\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] During 2008-2009 nope. Those were my 'golden years' on HF. Home from school, lunch, straight onto HF until dinner... maybe playing a few games in between. During 2010 I spent most of the year with no access to HF, ever since then I've never been on 100% every day... usually only when I have a little time to kill.\n\nI am addicted to it though... it's almost like a home to me, I can never forget, and I may take huge breaks, but I'll always come back...\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] It's like a drug. That's for sure. How was it way back in the '08 -> '09 period? Much different compared to the here and now?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] Haha I could write a 10,000 word dissertation on that topic haha... I'll try to keep it short, I've tortured you enough already with my long replies.\n\nYes, it was very very different. Much smaller, much more like a family. All the l33ts knew each other, and it was like an elite club. I remember the guy who bought me l33t(I was too young to buy it myself)... his name was ganjafreak. I did him loads of GFX, and he bought me l33t. It was great man. It's hard to explain without going into detail... the best way I can put it was as I said above, it was very close-knit and exclusive-y. Also the groups were much better and always stood for something. Unlike today when they're just like relabeled wads of cash, no purpose, no exclusivity... I have to admire hexicidal a little for trying his best to give Void some purpose instead of just another \"shiny toys club\".\n\nAlso we had more mature/older members back then.\n\nHF is still a great place, just different :)\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Ganjafreak, eh? Hahaha. Not a problem. I'm actually intrigued by your story. Let's say that you the option to change one thing on the site. (Only one) What would you change?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] Once again there are so many things I could pick haha... but if it had to be only 1 then I guess one of the following:\n\nReverse time back to 2008/9 but at the same time my account stays the same (post count, awards, uber/leet) and be with the old crew... but that's pretty impossible.\n\nSo I guess the other logical thing I could want is maybe something like my own group where I could let in all the old people (if they were still active), and any other new mature, nice members, and it would be kinda cool. But once again that isn't feasible.\n\nAlso maybe another thing would be that the site would be invite only and have a member limit like popular private torrent sites, but again, not feasible cause Omni makes a living from this site...\n\nAll what I've said above are just childish desires of mine that will never actually happen. The way Omni is running the site right now is very very good. He's balancing everything well, and keeping things very fair. Considering it's his livelihood and he has to make money out of the site, there is nothing much I could possibly change! :)\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Invite only would most definitely be interesting. How's school going for you? Are you currently employed?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] I am currently 18 years old and in my 3rd and final year of university in the UK. (I joined uni when I was 16). It's not too bad, definitely not as easy as first and second years, especially since I skipped the first 3 weeks for some personal reasons.\n\nLooking to get employed after that, and I don't think that'll be too difficult, but I'm more concerned about right now... doing pretty bad with my finances (I suck at managing money) and I'm trying to earn a little online.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] You liking school? Best of luck on job hunting as well. Do you think that HF influenced how you are in real life?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color] Yeah it's not too bad haha... Thanks man.\n\nOh absolutely HF did influence my personality beyond my online interactions. It helped me to be more open mined, mature, and less needy/selfish/arrogant. It also helped instil a few core values, such as respect and patience.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] That's great to hear! Do you projects that you're working on? Either on the site or offline?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=33319]Skulltraill[/url]:[/b][/color]Off site at the moment the only major project I'm working on is my Final Year Project and other assignments at Uni.\n\nAs for on site, I have nothing started yet, but I am planning to make a very big and detailed 'feedback'/'story' thread, with everything I can remember from Winter 2007 to now. Also, if I ever have a spare $6k I'll buy a group and work on it.\n\n[b][url=http://hackforums.net/member.php?action=profile&uid=1148878][color=#FFA500]Clique:[/url][/b][/color] Can't wait for you to make your feedback thread man! Any closing statements?\n[color=white][b][url=http://hackforums.net/member.php?action=profile&uid=649674]Skulltraill[/url]:[/b][/color] And I can't wait to make it, haha, but it'll be a lot of work.\n\nJust a few things to close up, once again, thanks for this interview, thank you Omni for this wonderful site, good job staff, I know you all try your best, honestly I need to throw a shout out to Sir for HF news, he's done so much for it.\n\nYeah that's about it... I look forward to my 10th anniversary here. Good times may come, good times may pass, but through thick and thin SkullTraill shall prevail. :)\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1579189]Catalyst[/url][/font][/size]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] Hello everyone. Welcome to this weeks edition of the HF News! Today we'll be interviewing my close personal friend and Python enthusiast Cᴀᴛᴀʟʏsᴛ! Welcome buddy, any shout out's you like to make before we proceed?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] Thanks for the warm welcome! I would like to give shoutouts to Skyla Blue, Vitafortis, and Magic.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] So how did you end up on Hack Forums?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] I found the site when I was looking to buy some rsgp, and kept seeing hackforums repeated in the search results. Initially I was hesitant to join the site, thinking it was full of viruses and scammers, but I ended up joining about a year later out of curiosity.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] We're glad you did! So you've acquired a lot of posts in the Python section. Would you mind telling us more about all of why you post there so frequently?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] Well, it just so happened that around the time I joined Hackforums I was also starting to take an interest in programming (Python being the language I was learning at that time). I was excited to learn of the Python section on HF, and was actually asking questions and trying to provide answers to others, as it was something I enjoyed doing. Initially I had an extremely limited amount of knowledge in programming, so I was often unable to answer some of the questions that arose in the section, but as my knowledge grew I was able to help more and more.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] I can vouch for that too. You provided me with tons of help and I'll always be grateful for that! I'm a slow learner, and Cᴀᴛᴀʟʏsᴛ was beyond patient. So what are you doing these days to keep busy?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] These days, between school and work, I don't have too much time for recreation. Most of my extra time is taken up with my girlfriend, and the small residual time is spent browsing HF and programming.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] You've been on Hack Forums for sometime now. If you could change one thing about Hack forums what would it be and why?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] Yeah it's been almost a year! There isn't much I could say that I would want to change, but maybe adding a few more sub-sections in the Coding sub-forum for some lesser known/less widely used languages (ie. Scala), or just some that haven't already been included (ie. Lisp and Haskell).\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] What are some of your goals you'd like to achieve on Hack Forums, and in real life if you don't mind me asking? \n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] For real life, I guess my personal goals would be to go to university, get a Bachelors of Software Engineering, and then acquire work that has some relation to software development or computer science. I might then consider going for a Masters, or even a PhD in Computer Science and maybe become a computer science professor. On Hack Forums, I don't have many set goals, except to maintain the friendly relationships I have with some of the members that I have built up over the year I have been on HF.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] I could totally see you being a professor, that suits you. So do you have any other hobbies that aren't computer related? Do you play any sports‏?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] I have played a few sports over the years, but currently my only other hobby would be music related (Guitar, drums and piano). Used to play baseball and basketball, but quit for a variety of reasons. I am an extremely introverted person in real life, and really don't like to associate with many people. Being around more than one or two close people is typically quite stressful for me.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] I see, do you suffer from generalized or social anxiety by any chance?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] I do have Generalized Anxiety, yes. Unfortunately it dramatically reduces my desire for social interaction, which has hurt some relationships that I have had with local friends over the years.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] I can relate. Sorry to hear about that. However it's easy to overcome assuming you're willing to meet new people and get out there.‏ So how often do you get out and part or meet with friends?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] I meet with my friends probably... once a month. Between Generalized Anxiety and Clinical Depression, it's not a very calm or enjoyable experience to be around many people, unless I am with someone I feel extremely comfortable around (which as it stands right now, is only my girlfriend). Even then, I still feel more comfortable being in a private or semi-private setting, but it does make it more manageable.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] Well I hope you can slowly recover and branch out. It's no fun being alone, even though it's always easier. So how long have you been with your girl friend?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] We are just coming up on three months. She has been extremely helpful for me as far as dealing with my depression, and has helped me to move on from some of the bad ways that I previously dealed with it. I feel like the luckiest guy in the world to be with her.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1653635][b][color=#FFD700]Carson Clark:[/color][/b][/url] That's really good to hear man, I wish the both of you the best. I'd like to thank you for joining me. Do you have any final thoughts before we conclude this interview?\n[url=http://hackforums.net/member.php?action=profile&uid=1579189][color=white][b]Cᴀᴛᴀʟʏsᴛ:[/b][/color][/url] Thank you for having me! Just that if anyone happens to need any help in python or scala, feel free to pm me![/spoiler]",
      "subject": "[11/11/13] - HF News"
    },
    {
      "pid": "36265117",
      "uid": "515249",
      "dateline": "1384233776",
      "message": "[align=center][img]http://i.minus.com/iJLlX4wyRdaA7.png[/img][/align]\n[color=white][b]Xbox One Early Shipments[/b][/color]\nNumerous Xbox One consoles were shipped to buyers after Target had a system error. Microsoft confirmed that these consoles will be restricted from Xbox Live until closer to launch. \"Due to a retail partner's system issue, a very small number of Xbox One consoles were shipped to consumers before the November 22 street date,\" a Microsoft representative said. \"We're pleased to see the initial response to Xbox One has been so positive, but given we are still putting the finishing touches on our games, UI, and online services, as well as confidential partner and media agreements, these console units will be restricted from connecting to Xbox Live until closer to our launch date.\" A buyer had their console shipped early and started to post details about the console online. He posted a lot of information on Twitter and made an unboxing for YouTube. However, Microsoft responded by removing the video and suspending the Xbox One console. Although, Major Nelson soon caught up with the user in a private phone call and discussed some private details. Major Nelson stated that the ban was temporary and he would be allowed back on closer to the Xbox One release date. The user had his unboxing video reinstated, but set to private for now. Major Nelson also invited him to the Xbox One Launch event, but further details about this were kept secret. Target also responded by giving this user a $100 gift voucher for the Target's online store. The Xbox One launches on November 22nd.\n\n[color=white][b]Sony Bundling $10 PSN Credit With PS4[/b][/color]\nGamers who are purchasing a PS4 at lunch will receive three limited-time vouchers for PSN. You will receive $10 worth of PlayStation Network credit, 30 days of PlayStation Plus, and a 30 day trial to Music Unlimited. \"The $10 credit can be used towards anything in the store including new PS4 launch titles, such as Assassin’s Creed IV: Black Flag, Battlefield 4, Call of Duty: Ghosts, and Killzone: Shadow Fall,\" said Sony Network Entertainment vice president Eric Lempel. The music unlimited voucher is only available to new customers. As of publication, the promotion is only available in US and Canada. \n\n[color=white][b]Xbox Skype: Free 6 Months[/b][/color]\nMicrosoft has announced that gold subscribers will receive six months of free calling on Xbox One. Users will be able to place group video calls, up to 100 minutes of worldwide minutes per month for calls to mobiles and landlines in over 50 countries. You can view the Xbox offer [url=http://www.skype.com/en/legal/xbox-offer-terms/?intcmp=blogs-_-generic-click-_-top-5-exciting-new-features-for-skype-for-xbox-one]terms[/url] here. However, this offer must be redeemed through the Skype application on Xbox One by March 31st, 2014. Microsoft stated that Skype calls on Xbox One will display in 1080p and that users can place normal and/or video calls while playing games or other entertainment applications. Skype on Xbox One allows users to walk wherever in a room and the camera on Kinect will follow. You can see more about this feature in the video of the week below.\n\n[color=white][b]Launch Applications[/b][/color]\nMicrosoft and Sony have revealed their launch and launch window applications for the Xbox One and PS4. Sony will have Amazon Instant Video, Crackle, Crunchyroll, EPIX, NBA Game Time, NHL GameCenter Live, Redbox Instant, VUDU, YuppTV, Netflix and Hulu Plus. Microsoft will have Amazon Instant Video, Crackle, CWTV, ESPN, FOX NOW, FXNOW, HBO GO, Hulu Plus, Machinima, MUZU TV, Netflix, Redbox Instant by Verizon, Target Ticket, TED, The NFL on Xbox One, Twitch, Univision Deportes, Verizon FiOS TV, VUDU. However, other regions may vary in app availability. Microsoft details their applications [url=http://news.xbox.com/2013/11/xbox-one-partners-unveiled]here[/url].\n\n[color=white][b]Video of the Week[/b][/color]\n12 minutes of Xbox One UI.\n\n[align=center][yt]http://www.youtube.com/watch?v=xhe6jV-APwM[/yt][/align]\n\n[align=center][img]http://i.minus.com/iX3LnqNnUtm2v.png[/img][/align]\n[b][color=white]Minecraft in an armband![/color][/b]\nMineCon attendees had the opportunity to buy MineCon exclusive armbands that allows users to take their Minecraft saves with them on the road, in a fashionable manner! The armbands are built up with a USB plug that connect to your computer and on the fashion side it consists of green and black colors. The armband works as a storage device that will save and transfer your worlds/saves, and also some mods to other computers if you were go play at a friend's house. The Gameband armband was only supposed to be sold at MineCon, but due to its success, may be commercially sold.\n\n[b][color=white]Skyrim in Minecraft?[/color][/b]\nA lot of mods already exist for Minecraft on the PC that allow you to feel like you are playing The Elder Scrolls V: Skyrim. However, this is more than just another fan-based mod! On November 1st Bethesda and Microsoft announced that the 360 version of Minecraft will have a purchasable mashup-pack that for the price of 4 dollars will allow the player to experience that Skyrim feeling in Minecraft on the xbox. The pack will not change the Minecraft game play, Bethesda states, so as for that it's up to the players own imagination.\n\n[b][color=white]Notch on TV![/color][/b]\nNotch appeared on The Late Late Show for the very first time. The interview had been described as a bit awkward, but Notch pulls it through and the interview is actually rather entertaining. Minecraft is of course being discussed, but it's always nice to get to see Notch talk about other things than just Minecraft, he and interviewer Craig Ferguson have a little fun and it is definitely worth a watch. Go watch it for yourself [url=http://www.youtube.com/watch?v=3xIAZDg6yww]here[/url].\n\n[b][color=#43a828]Hacker[/color][color=#9428a8]Craft[/color] [color=white]News[/color][/b]\nDue to a lack of newsworthy activity in the last few weeks, the HackerCraft news will be postponed until further notice. Updates will be kept in the Hackercraft section.\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]HeroCraft[/color][/b]\nSo you want to be a hero? HeroCraft offers you the chance. You will be appointed classes as well as quests as you embark on an adventure in a world built for you. You will never have any questions as the server is crowded with friendly people. You can level up your classes and become even stronger as you go through the game. Sounds fun? Join at mc.herocraftonline.com\n\n[align=center][img]http://i.minus.com/ibx5gFlLxx9bJ1.png[/img][/align]\n[color=white][b]Pollution Foils Chinese Surveillance[/b][/color]\nChina has suffered a serious pollution problem for the past couple decades as the country's industrialization was met with very little ecological restriction. Recently, however, the smog has gotten to record high levels and this increased filth has had unexpected results. The Chinese government has found that the 20 million cameras installed earlier this year are ineffective due to the vision obscuring “fog”, as the state media calls it. To compete with this national security risk, two teams of scientists were assigned to resolving the issue. According to a leader of one of the teams, Yang Aiping, the solution would be to “heavily revise, if not completely rewrite, algorithms” (via [url=http://qz.com/143660/china-discovers-that-pollution-makes-it-really-hard-to-spy-on-people/][i]Quartz[/i][/url]) instead of attempting to solve the pollution problem.\n\n[color=white][b]United States and Israel Lose UNESCO Voting Rights[/b][/color]\nProtesting Palestine’s admission to the United Nations Educational, Scientific, and Culture Organization (UNESCO), the United States and Israel refused to pay their dues and consequently lost their voting rights. Criticism for US laws that disallow funding for any UN organization that recognizes Palestine's membership has flared up as tensions rise. UNESCO attempts to fight extremism by running programs that work to fight poverty and educating people in 3rd world countries. US fees amounted to $80 million, 22% of the organization's budget.\n\n[color=white][b]India Launches Mars Orbiter With Hopes to Become the Fourth to Reach the Red Planet[/b][/color]\nIndia successfully launched the Mars Orbiter Mission last Tuesday to begin its 300 day flight. Only three space agencies have reached the red planet. The mission will measure methane levels in the Martian atmosphere which, if found, may indicate either volcanic or biological activity. Despite the success of the launch itself, critics are concerned that the country, which suffers from massive rates of malnutrition and starvation, misappropriated its resources.\n\n[color=white][b]Powerful Typhoon Kills 10,000[/b][/color]\nTyphoon Haiyan, one of the most powerful storms ever recorded, devastated the Philippine city Tacloban last Friday. The death toll is unconfirmed as of this writing, however if speculations are proven true, the catastrophe will be the deadliest in Philippine history by twofold. Many towns have not been reached yet and even more do not have clean water and little food.\n\n[align=center][img]http://i.minus.com/ibnGw6pRzIThtL.png[/img][/align]\n[color=white][b]Nissan’s New Electric Sports Car[/b][/color]\nNissan is working on a new futuristic style sports car. The car, known as the BladeGlider, has a futuristic concept and is made for speed. The car itself has a carbon fiber-covered body and is shaped like an arrow. It also has the driver’s seat right in the middle, with two seats right behind it. The company has not said much more about it yet, but they do promise it is much more than just a concept.\n\n[color=white][b]Russia Takes The Olympic Torch To Space[/b][/color]\nRussian cosmonauts had taken the Olympic torch into space this past week, a few months ahead of the winter Olympics. The two cosmonauts took the red and silver torch into space and it was in the open. This is the first time this has happened, but not the first time the torch has made it to space. The torch was in space in 1996 and 2000, but they were not in the open like this one. \n\n[color=white][b]1.2 Million Dollars Worth Of Bitcoins Hijacked[/b][/color]\nBitcoins are in the news again, this time for a large scale theft that has just taken place. A hacker had recently got access to a Bitcoin wallet service known as Input.io, and successfully stole 4,100 Bitcoins which are worth about $1.2 million at this moment. The owner of the site says the hacker got in through a method of social engineering to reset the site’s password. After this event, many people are left questioning how safe Bitcoin wallet services actually are.\n\n[color=white][b]Smart Power Strip Offers Cheap Automation Of Your Home[/b][/color]\nMany companies have been trying to make home automation a thing of ease, but at a cost. There is one new device coming out in the near future known as Smart Power Strip that could take the world by storm. This small device is like any normal power strip on the market, but has a WiFi module built in. It also has controls that let you turn separate outlets on and off using a smartphone app. This will make it easier for people to automate their home without spending too much money. As of now, there is no release date set for Smart Power Strip.\n\n[align=center][img]http://i.minus.com/i8dSB5532O5GV.png[/img][/align]\n[b][color=white]Lady Gaga Says Marijuana Helped 'Numb the pain'[/b][/color]\nLady Gaga is apparently a stoner. She's previously admitted that her latest album was recorded while she was high off marijuana. But while her candid admission is no surprise to fans of the outlandish star, Lady Gaga says her use of the drug turned into outright dependency after she suffered a debilitating hip injury. The 28-year-old singer was wheelchair bound after undergoing surgery last February to treat the damage caused to her cartilage – the result of rigorous nightly performances during her Born This Way world tour. She stated in an interview, \"Fuck, if I know what hurts the most, you know? I would break the habit and it would sneak back in and I would break it and sneak back in.\"\n\n[b][color=white]Lady Gaga Announces 2015 Space Show[/b][/color]\nLady Gaga is planning on having the first \"concert\" in space and it's great she's performing in her hometown: space, where she belongs. Gaga is scheduled to blast off on Virgin Galactic's SpaceShipTwo in early 2015, according to press reports. Gaga will reportedly sing one song during her trip into suborbital space. Gaga joins the ranks of other celebrities with tickets to ride into space with Virgin Galactic. Justin Bieber, Leonardo DiCaprio and Ashton Kutcher have all signed up for seats according to Space.com.\n\n[b][color=white]Miley Cyrus Promises No Foam Fingers Will Be Harmed In EMA Performance.[/b][/color]\nWell enough with Gaga. Miley has promised to take extra precautions and does not want to offend anyone. She has mentioned the idea of dressing up like an alien (weird), stating \"God, I don't know [what people will think]. If I only knew,\" she laughed. \"But I can't think of any kind of prop that I would use in disrespect and offend. So I think I'm good about that. No Foam Finger Association is going to call me. I made custom [alien costumes for her performance], I made my own. No one owns aliens.\" Robin Thicke has also released a statement vowing that he will not pull any offensive stunts this time either and is at least attempting to play it \"safer\".\n\n[align=center][img]http://i.minus.com/ih4DkNmH5M949.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nInfinity. The mere idea of infinity is rather perplexing. While we can understand the fundamentals of something without limits, to actually think about what it means to be infinite leaves us at an impasse. Our entire lives, we've been built around limits and ends. For example, space. Try thinking of the entire galaxy, then beyond. We simply cannot fathom infinity, as there must always be an end. I mean, to our knowledge, our universe and spacial dimension could literally go on forever. How? I do not know. It's a quandary.",
      "subject": "*"
    },
    {
      "pid": "36265119",
      "uid": "515249",
      "dateline": "1384233793",
      "message": "[align=center][img]http://i.minus.com/ibvB54RmtuIUlF.png[/img][/align]\n\n\"How do you feel about the header-delete?\"\n\n[i]\"It's a good thing. Prevents the people who like to whine about it, \nalso means Omni wont have to hire anyone to design it, seeing as \naccording to the majority of HF his graphics skills aren't good enough. \nPersonally I think Omni doesn't like to use the logos greated by other \nmembers because he doesn't want to feel like he owes them anything, \nespecially since they'll be able to claim the credit of \"hey Omni was \nstruggling with the logo but I did it no probs!\".\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=33319][i]-SkullTraill[/i][/url]\n\n[align=right][i]\"Pretty crappy, if I'm honest. I've got used to a header \nbeing there. The Halloween one (the latest one) was amazing, I really \nreally liked that! I thing something based on the whole green & purple \nwould really be a good idea. For now, this temporary header is okay.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=823754][i]-McDork[/i][/url][/align]\n\n[i]\"Personaly I feel as if it would look good if it it changed a bit. I like it alot \nmore with a header but if Omni doesnt want one, I cant stop him. Anyway \nif \"Welcome to HackForums.net\" was the same size as the \"Current time:\" \n(or vice-versa) I cant really look at it due to different placement and size, \nwell you know. Anyway I would really like to see a header back up there. \"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1884994][i]-P r a v u s[/i][/url]\n\n[align=right][i]\"Honestly, having no header is boring but it is Omni's descision, \nbut I'm pretty sure he did that because of the negative feedback on each \nnew header he is getting, so he just decided to do not use header and just \nadd a text, and if you are thinking this is sucks why don't you make us one?\nThat's my opinion on the new header, which is keeping this until we get a good one.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1913126][i]--Correct[/i][/url][/align]\n\nThe topic for next week is \"Which next-gen console will you be buying?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/iD2yZbLEetACs.png[/IMG]\n[img]http://i.minus.com/ibzEFe8fUasHjb.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/ibvCM1Z22wtoEe.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/hUMKYiU.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://lunarbaboon.squarespace.com/storage/comicooze.jpg?__SQUARESPACE_CACHEVERSION=1384141062394[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://24.media.tumblr.com/f591ff856e5fae1870c4cdca57258b38/tumblr_mw2ydzyumR1sd2kxeo1_1280.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://24.media.tumblr.com/d8311f8405ced9defb779e22189a5ef5/tumblr_mvnqufvFmI1qznskro1_500.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Rob/starving.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://formalsweatpants.com/comics/2013-11-11-The-Cloak.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/iOxJ1fCJvvnsB.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1082656]Mohatu[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1079277]Harlem[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=956054]Emylbus[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=752389]drugs[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1148878]Clique[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1653635]Educate[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=787112]Saturday[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451]Yellows[/url] & [url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}