{
    "posts": [
        {
            "pid": "15705221",
            "uid": "515249",
            "dateline": "1316049706",
            "message": "[align=center][img]http://goo.gl/zbWpg[/img][/align]\n\n[align=center]Welcome to the [color=#bad235][b]1st Misc. News edition[/b][/color]. To read the father News edition, please go [url=http://hackforums.net/showthread.php?tid=1715039]here[/url].\n[/align]\n\n[align=center]The HF News Misc. editions began quite a while ago by [url=http://hackforums.net/member.php?action=profile&uid=136025][color=#0066FF][b]www.RuneGear.net[/b][/color][/url] (The Elite) and were then discontinued. \nA short while ago, Cobalt and I had an idea to bring back the webshow, but we didn't think it would be beneficial to put it alone in its own thread,\nso we decided to bring back the Misc. editions and add more content. \nIn the Misc. editions, you will now find, the Interviews, Notable Account Changes (Bans, Repfucks, Limitations, Closings), and the Webshow.\n\nNow, to explain the webshow. Astonish is NJ and I will be the speakers, and there will usually be a guest speaker, who will also take part in a vocal interview. \nThe other components will be:\n[b]Awards [/b]- The latest people to receive awards\n[b]Leadership Changes[/b] - New leaders, staff changes, anything among leadership\n[b]Misc.[/b] - We will talk about topics or answer questions sent in through [url=http://hackforums.net/showthread.php?tid=1719133][color=white]this thread[/color][/url][/align]\n\n[align=center][img]http://goo.gl/9wMJo[/img][/align]\n\n[url=http://goo.gl/gGUxd][color=#AAAAFF][b]Astonish is NJ[/b][/color][/url] - This won't be a normal part of the Misc. edition, but since it happened after the video was finished, it seemed news-worthy enough to be posted. Astonish has received the moderator position of the Visual Basic and .NET Framework section. Congratulations!\n\n[url=http://goo.gl/s6gga][color=#0066FF][b]Thoth[/b][/color][/url] -  Even though Thoth was in the father edition, he happened to be repfucked for the fifth time after that edition was posted. Good luck Thoth.\n\n[url=http://goo.gl/nVQf8][color=black][b]Sтяιdєя[/b][/color][/url] - Not long ago Sтяιdєя reached the coveted 1k rep, but was then repfucked, losing over 1,300 rep. Later he was banned for this reason: \"Account perma closed. Severe rep abuse.\"\n\n[url=http://goo.gl/LgKfu][color=black][b]Hуѕтєяιa X™[/b][/color][/url] - To anyone outside the Red Lions, he has just gone of vacation.\n\n[url=http://goo.gl/3SSxV][color=black][b]Kick Buttowski[/b][/color][/url] - The well known member was banned permanently and repfucked by Omniscient for the inability to follow policy.\n\n[url=http://goo.gl/O8NJY][color=black][b]BlackChaos[/b][/color][/url] - Also the writer of Worlds News for HF, has gone on vacation and won't be back for the next couple of editions.\n\n[url=http://goo.gl/erfFu][color=black][b]cobija[/b][/color][/url] - He has left for Dollywood! Have a good vacation!\n\n[url=http://goo.gl/0m6kK][color=grey][b]D1G1T4LM4N_616[/b][/color][/url] - The original reasons for this user's ban are unknown, but in [url=http://hackforums.net/showthread.php?tid=1714988]this thread[/url] he was seen appealing to Omni for his ban. At the last post, Omni replied \"Account open since May. Obvious you don't respect the rules here.\" since Digital had used a new account, that he had registered several months ago... thusly, he is now closed.\n\n[align=center][img]http://goo.gl/6bjLl[/img][/align]\n\n[color=#FFFFE0][size=large][b]SRPP Thread(s)[/b][/size][/color]\n[i][b]Most Replied Debate[/b][/i] - [url=http://goo.gl/SEzBu]=♣ Official 9/11 Conspiracy Debate Thread ♣=[/url] - [url=http://goo.gl/vrVD6][color=white][b]HakkuR[/b][/color][/url] - Yes, yes, there are a lot of 9/11 threads, but this one received the most views, replies, and had the most activity, it also includes a lot of information for the conspiracy.\n[i][b]Most Interesting Idea[/b][/i] - [url=http://goo.gl/kYXDo]Terrorist America[/url] - [url=http://goo.gl/e7nfN][color=white][b]Clobbersaurus[/b][/color][/url] - I must say that I have thought about this a bit, but the member Clobbersaurus really puts down a lot of supporting facts and is actively debating the subject with others.\n\n[color=#FFFFE0][size=large][b]Members Contest Thread(s)[/b][/size][/color]\n[i][b]Coolest Contest Thread[/b][/i] - [url=http://goo.gl/TMdca]My 1,000th post giveaway email Pigs@SlaughterHou.se[/url] - [url=http://goo.gl/AD0zN][color=#FFCC00][b]SkipEarth[/b][/color][/url] -  SkipEarth is giving away the oG email, Pigs@SlaughterHou.se for his thousandth post.\n\n[color=#FFFFE0][size=large][b]Suggestion Thread(s)[/b][/size][/color]\n[i][b]Most Supported Suggestion[/b][/i] - [url=http://goo.gl/F4Ias]Add A Battlefield Section In The Gaming Forum[/url] - [url=http://goo.gl/oiwII][color=#0066FF][b]Industrialized™[/b][/color][/url] - Many members are crying out for a Battlefield section especially with the upcoming Battlefield 3 release. \n[b][i]Good Suggestion[/i][/b] - [url=http://goo.gl/j8qc2]XSS Attacks discussion : Subforum required[/url] - [url=http://goo.gl/50Wp3][color=#0066FF][b]Calculus[/b][/color][/url] - Since SQLi has its own section, it's only fair that XSS does too, Omniscient himself is considering this idea \"This isn't a terrible idea actually. An XSS/RFI forum might be useful to separate some content. It will be considered.\"\n\n[color=#FFFFE0][size=large][b]Guide/Tutorial Thread(s)[/b][/size][/color]\n[i][b]Most Thorough Guide[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1598616]How to be a Hacker | The Ultimate Guide[/url] - [url=http://hackforums.net/member.php?action=profile&uid=430736][color=white][b]Eminent[/b][/color][/url] - This guide was especially thorough and explained everything one would need to know about hacking.\n[i][b]High Quality Guide[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1410937]Wireless - A comprehensive guide about wi-fi hacking[/url] - [url=http://hackforums.net/member.php?action=profile&uid=807552][color=white][b]Magnus[/b][/color][/url] - To show this guide was worthy, it received a sticky, and the Magnus the sticky man award. An impressive piece of work, truly.\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - alabama[/font][/size][/color][spoiler=]\n [b][color=white]Cobalt+: [/color][/b]Hey, alabama. How are you doing today?\n[b][color=white]alabama: [/color][/b]Hey, I'm doing pretty good. Watching the Cowboy's and Jet's game. \n\n[b][color=white]Cobalt+: [/color][/b] So, you're into sports? Do you play any?\n[b][color=white]alabama: [/color][/b] Nope, I don't play any currently. I used to play football but then I switched to a school that didn't offer any sports.\n\n[b][color=white]Cobalt+: [/color][/b] That doesn't seem like a very fun school. Do you do good in school?\n[b][color=white]alabama: [/color][/b] Well, last year I was going through some personal problems, and I dropped out. I just started back this year going to an alternative school. It copes with me very well.\n\n[b][color=white]Cobalt+: [/color][/b]Well, I hope those problems are resolved. Do you think your time on HF effects your school work?\n[b][color=white]alabama: [/color][/b]Definitely not. I put real life responsibilities before any online activity. And yes, everything is getting better. =)\n\n[b][color=white]Cobalt+: [/color][/b]Seems like you know your common sense. When you joined HF, what kept you here?\n[b][color=white]alabama: [/color][/b]When I first joined, I believe I found it through googling msn spammer or something. I didn't actually start becoming an active poster until about May or so. I registered on January 1st. \nAt first, I was confused, the forum was huge, there were many members, and overall I was lost. I started making a few friends and eventually found my way around. \n\n[b][color=white]Cobalt+: [/color][/b]My journey was the same way. It seems you've kept your name as alabama for the most part. Any reason behind this?\n[b][color=white]alabama: [/color][/b]Hmm, I've thought about it, and I can't come down to the origin of where I got my name. I started using it as an online alias in about 2009.\n\n[b][color=white]Cobalt+: [/color][/b]Hmm, I see. Well, I have to wrap this interview up. Any shoutouts or comments you would like to make?\n[b][color=white]alabama: [/color][/b] I'd like to make a shoutout to ScripT, Sync, and Rhythm. They've been good friends for awhile now. Is it alright if I say a joke?\n\n[b][color=white]Cobalt+: [/color][/b] Sure, go ahead.\n[b][color=white]alabama: [/color][/b]I was going to tell you a gay joke, butt fuck it.\n\n[b][color=white]Cobalt+: [/color][/b]Haha, that was a good one. Well, you have a good day.\n[b][color=white]alabama: [/color][/b]Take care.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 2 - Dylan[/font][/size][/color][spoiler=]\n[b][color=#FFFFE0]Astonish:[/color][/b] Hello Dylan, and thank you for participating in the Misc edition of the HF News. Would you like to make any opening statements?\n[b][color=#FFFFE0]Dylan:[/color][/b] Nope\n\n[b][color=#FFFFE0]Astonish:[/color][/b] So lets jump right into this one, Why did you join HF?\n[color=#FFFFE0][b]Dylan:[/b][/color] I can't really remember the original reason I joined HF, but I do remember the reason I started visiting HF more often. About a month after I joined I thought I had gotten infected by someone and needed help figuring out if I really was infected or not. It turns out I wasn't infected :) Ever since then I have been actively participating (mainly browsing) on HF.\n\n[color=#FFFFE0][b]Astonish:[/b][/color] I hear a lot of people whom join that way. Who was your first friend on Hack Forums and how did you get to become friends with him?\n[b][color=#FFFFE0]Dylan:[/color][/b] To be honest, I don't remember. I'm not even sure if I had a first \"friend\" on HF. I try not to \"befriend\" many people on HF due to the nature of the site and nature of most of the users on the site. Although there are a few people I talk to sometimes.\n\n[color=#FFFFE0][b]Astonish:[/b][/color] Sounds cool. If you had to pick one person to give the Member of the Month award to, who would it be?\n[color=#FFFFE0][b]Dylan:[/b][/color] Hmm...sort of a hard question. I honestly do not have an answer for you. :(\n\n[b][color=#FFFFE0]Astonish:[/color][/b] You have been here since early 2010, What big changes have you seen in this forum?\n[b][color=#FFFFE0]Dylan:[/color][/b] I've seen a lot of forum structure changes, staff changes, and more recently quality changes. Omni is continuing to improve HF more and more every day it seems.\n\n[b][color=#FFFFE0]Astonish:[/color][/b] hahaaa Going from that, How does it feel to be an owner/leader of a group?\n[b][color=#FFFFE0]Dylan:[/color][/b] It feels pretty good I guess. It's pretty fun leading a group in my opinion. I have gotten a lot of people saying things like \"Why would you spend $2k on something on a forum?\" though. I don't regret spending the money thus far.\n\n[color=#FFFFE0][b]Astonish:[/b][/color] Would you say  leading a Hack Forums group easier or harder than you expected?\n[color=#FFFFE0][b]Dylan:[/b][/color] Harder than I expected.\n\n[color=#FFFFE0][b]Astonish:[/b][/color] Ok. When you were younger, what did you do for fun?\n[b][color=#FFFFE0]Dylan:[/color][/b] I played video games\n\n[b][color=#FFFFE0]Astonish:[/color][/b] What would you say is your favorite food?\n[color=#FFFFE0][b]Dylan:[/b][/color] Ribs or steak\n\n[color=#FFFFE0][b]Astonish:[/b][/color] Would you say Reputation is taken to serious?\n[b][color=#FFFFE0]Dylan:[/color][/b] Yes. Very much so. I see people getting angry or whining in the lounge and other forums all the time because someone gave them negative rep.\n\n[color=#FFFFE0][b]Astonish:[/b][/color] Damn, this went by fast do you have any shoutouts you would like to make before saying goodbye?\n[b][color=#FFFFE0]Dylan:[/color][/b] I guess a shoutout to kingdavidd, my best friend on the internet.\n[/spoiler]\n\n[align=center][img]http://goo.gl/zEtV9[/img][/align]\n[align=center]\n[i]Sorry for the sound quality at times.[/i]\n\n[size=large][b]Part One[/b][/size]\n[video=youtube]http://www.youtube.com/watch?v=XSdWyZDkOXQ[/video]\n\n[size=large][b]Part Two[/b][/size]\n(Pink Floyd's Interview)\n[video=youtube]http://www.youtube.com/watch?v=sPALwCE_ecE[/video][/align]",
            "subject": "[9/14/11] - HF News Misc."
        }
    ]
}