{
  "posts": [
    {
      "pid": "6864305",
      "uid": "136025",
      "dateline": "1286334808",
      "message": "[align=center][IMG]http://i52.tinypic.com/28r1ux.jpg[/IMG][/align]\r\n\r\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 18th FULL edition. It is for the dates of 9/30/2010 to 10/6/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\r\n[align=center][IMG]http://i54.tinypic.com/qstieq.png[/IMG][/align]\r\nThis week on Hack Forums has been a week filled with confusion and sadness, as well as anger. Hack Forums and it's members have been subject to saddening news, whether it may be affecting their position on Hack Forums, or somebody elses. One of the main headlines is that the Reviewers group has been affected and influenced by countless changes over the last few days.\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nPrettykitty, one of the founding leaders of the Reviewers group, has been caught conducting unlawful practices which include the Reviewers group. He has been found to be accepting payments in return for a position in to the group. It was the final choice of Omniscient which had lead to the demotion and removal of Prettykitty. We would like to wish him good luck with his future endeavors. \r\n\r\n[b][color=#1E90FF]You can read more about this [url=http://hackforums.net/showthread.php?tid=718386]here[/url].[/color][/b]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nResulting from the recent actions of Prettykitty, it was brought to the attention of the legitimacy of the Reviewers group to Omniscient. This had lead to the removal of over 20 members of the crew. Many members that were accepted legitimately were struggling to understand as to why they were removed even though they were active. Skill the head leader of the crew has reassured former members that their position would be reinstated to them.\r\n\r\n[color=#1E90FF][b]You can read the post stating that [url=http://hackforums.net/showthread.php?tid=718386&pid=6833148#pid6833148]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nIt has been brought to the attention of the members of Hack Forums that iBruteforce has graciously stepped down as Administrator of Hack Forums. This is a saddening event as iBruteforce has had an immense influence on Hack Forums. Crow has stepped up and taken the position of Administrator, we would like to wish him the best of luck.\r\n[color=#1E90FF][b]\r\nYou can read the thread [url=http://hackforums.net/showthread.php?tid=713257]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nOmniscient has recently added two new awards to Hack Forums. These awards have added more activity to the forum, allowing participation from all the members of Hack Forums. The awards are called 'YouTube' and 'Fish Err Man'.\r\n\r\n[color=#1E90FF][b]You can find the awards [url=http://hackforums.net/myawards.php]here[/url].[/b][/color]\r\n\r\n[color=#1E90FF][b]You can read the thread [url=http://hackforums.net/showthread.php?tid=719856]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nOmniscient and his family have been subject to an extremely inappropriate prank. There local enforcement department were contacted by a fraudulent person stating that there was some sort of emergency, large enough to lead to Omniscient's house being 'SWATted'.\r\n\r\n[b]SWAT is defined as:[/b]\r\n\"Special Weapons and Tactics: a military-like unit within the US police force, trained to deal with specially dangerous situations, such as hostage-taking and riots.\"\r\n\r\nWe hope the perpetrator is caught, and wish luck to Omniscient in this terrifying ordeal. Hopefully justice will be served.\r\n\r\nIf you have any possible information, remember to contact Omniscient through Private message.\r\n\r\n[color=#1E90FF][b]You can read the thread [url=http://hackforums.net/showthread.php?tid=722403]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i54.tinypic.com/30rmg0j.png[/IMG][/align]\r\nThere have been multiple changes with member positions and roles on Hack Forums in the past week.\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=144134]Far[/url] has been banned permanently once again. This has occurred previously, approximately 4 times. We wish Far good luck with his future endeavors, as well as his participation with the recent events including the prank.\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=64480]BFF HA Y AN BOI[/url] has notified members that there may be possible infections with the adf.ly links that Hack Forums is using. \r\n\r\n[color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=715653]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=472935]iDoItAllForTheLuLz[/url] might be contacted by the FBI soon, reason is unknown. It seems that he has committed something extremely illegal to have legal implications at this level. Omniscient seems to be angered by this member. We hope justice can be served.\r\n\r\n[align=center][IMG]http://i51.tinypic.com/1zd6eja.png[/IMG][/align]\r\nIn similar news, every leader excluding Skill has had their power of managing applications removed. Stemming to the creation of a new Reviewers application being opened. All members must re-apply to have a chance at entering the group.\r\n[b][color=#1E90FF]\r\nYou can read Skill's post [url=http://hackforums.net/showthread.php?tid=703353&pid=6836222#pid6836222]here[/url].\r\n\r\nYou can find the new application thread [url=http://hackforums.net/showthread.php?tid=719756]here[/url].[/color][/b]\r\n\r\n[align=center][IMG]http://i51.tinypic.com/2w4f95h.png[/IMG][/align]\r\nThis week we got an interview with Kn1ght, one of the veteran Staff members.\r\n\r\n[color=#1E90FF][b]1.[/b][/color] When did you join Hack Forums? And what were you looking for when you stumbled upon it?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]Specifically June 7th, 2008 at about 2 AM. I am a little ashamed to admit it but when I first came to HF I was looking for help creating a virus. At the time it was all really just batch.[/i]\r\n\r\n[color=#1E90FF][b]2.[/b][/color] That's quite interesting. What was that going to be specifically used for? \r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]I had no intention of using it. I had been wanting to learn more about computers and I felt that something of that nature would be able to intrigue me into delving deeper and make learning easier or more fun.[/i]\r\n\r\n[color=#1E90FF][b]3.[/b][/color] Where were you mainly active in Hack Forums? \r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]Beginner Hacking.[/i]\r\n\r\n[color=#1E90FF][b]4.[/b][/color] Had you ever posted any tutorials, helped out or were you just lurking around trying to find information?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]When I joined I knew pretty much nothing so I had no tutorials.[/i]\r\n\r\n[color=#1E90FF][b]5.[/b][/color] When did you upgrade to L33T, did you purchase it or was it a gift from another member?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]I can't say for sure when. I believe it was around 3 months after I joined. I had it bought for me as a gift from a member I befriended. [/i]\r\n\r\n[color=#1E90FF][b]6.[/b][/color] When you received the special PM from Omniscient regarding a Staff position. What did you feel and how did you react (in real life)?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]I never actually got a PM from him. He made a thread for the application which I filled out. At one point he did say he wanted my email address but he never messaged me. Then one day I went away from my computer for about an hour, I came back with several hate messages about me being staff as well as a Purple name. (I think it was still purple at that time).\r\n\r\nI shit a brick pretty much. At that point in time I had been on HF for a while and did love the site. I had tried to be a great member and I felt rewarded.[/i]\r\n\r\n[color=#1E90FF][b]7.[/b][/color] Do you have a favourite Staff member, and would you like to thank anyone for being there for you when necessary?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]I can't really say I have a favorite Staff member. Most every staff member that has been here for a while I have formed IMO strong friendships with. Crow and I have talked a a lot. TRRS, Xchange and I have spent hours playing XBL together. I talked a lot with Psinetic and I liked InfamousBytes and Rasei a lot.[/i]\r\n\r\n[color=#1E90FF][b]8.[/b][/color] What are two things you've learned on Hack Forums?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]1. I learned how to deal with people online and conduct myself professionally and calmly.\r\n2. I learned a lot about hacking. Most people say negative things about HF regarding it's content. However it does have a lot of information which is useful and can help lead to more advanced methods or things of that nature.[/i]\r\n\r\n[color=#1E90FF][b]9.[/b][/color] Do you feel you've influenced the Staff team, and why?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]I created the biggest tutorial I have ever done which details every action of the Mod CP and controls so I always attempt to guide new mods who aren't familiar with MyBB. I would like to believe it has been beneficial. Also I have throughout my career as Staff helped other Staff who were unsure of actions just as they have me.[/i]\r\n\r\n[color=#1E90FF][b]10.[/b][/color] Thanks for such an amazing interview, I appreciate it. Is there anything you would like to finish off with?\r\n[color=#32CD32][b]Kn1ght:[/b][/color] [i]Something to say to HF.... \"I'm watching you\".[/i]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nTune in next week for another great edition of HF News.",
      "subject": "[9/30/2010] - HF News"
    }
  ]
}