{
  "posts": [
    {
      "pid": "27669927",
      "uid": "515249",
      "dateline": "1351484349",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#00BFFF][b]115th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\r\n[color=white][b]Halloween Theme[/b][/color]\r\nWell, it is that time of year again; Halloween is approaching! For those who reside in a country that does not celebrate the day, it'll be celebrated on the 31st of October, mainly by festive activities such as  trick-or-treating, costume parties, pumpkin carving and other horror/thrill-related activities. In light of the coming day, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has uploaded the Halloween themed banner for our viewing pleasure in celebration. The tradition of [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] changing the banner of Hackforums to the corresponding holiday has become a staple for nearly everyone in the community and brings joy to many.\r\n\n[color=white][b]The Creed Suspended[/b][/color]\r\nThe official custom usergroup known as \"The Creed\" was suspended this week due to the final payment for the group not being received by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], and his requests being consistently ignored. The official statement came from HF's official Twitter account, where [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] stated \"[i]Creed group is suspended. They've not made any payments to the balance and they have not responded to payment requests[/i].\" This lack of communication from The Creed in their final payment surely correlates with the account closing of The Creed leader known as Primal Rage, who was rumored to be in-charge of the financial stability of the group. The future of the group is currently hazy. The group may be paid off, it may simply be closed, or it may be auctioned off (similar to Coders). Only time will tell.\r\n\n[color=white][b]2000+ Replies Thread Closed[/b][/color]\r\nA new policy from [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has led to some of the most popular threads on Hackforums being closed this week. It was stated on the official Hackforums Twitter \"[i]I've just closed all threads with over 2000 replies. This is to avoid problems with large threads and mysql.[/i]\" Many of the Marketplace's most popular threads are now closed due to the new policy.\r\n\n[color=white][b]HackerCraft Now Open[/color][/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], along side Mr. H, has no shot the HackForums Minecraft server dubbed HackerCraft into its full version this week. Although many have complained that the server is lacking in various ways, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] and Mr. H seem to have a strong vision of what the server will become. The official statement on the matter can be found [url=http://hackforums.net/showthread.php?tid=2960144]here[/url].\r\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\r\n[color=white][b]User News[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] reached 1,000 reputation points!\r\n\n[color=white][b]Repfucks[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1290620][color=#0066FF][b]Designer[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1180170][color=#FFD700][b]Autopost[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=431267][color=#0066FF][b]GiGz[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1246572][color=black][b]USMC Chris[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=74674][color=black][b]Blazin[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=black][b]mybboss[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=538867][color=#FFD700][b]Skill4kill[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=828184][color=#0066FF][b]Airon[/b][/color][/url] was repfucked.\r\n[/list]\r\n\n[color=white][b]Bans[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=600771][color=black][b]Αnonymous[/b][/color][/url] was banned for posting a Marketplace thread outside of the Marketplace.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1246572][color=black][b]USMC Chris[/b][/color][/url] was banned for harrassing [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url].\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=74674][color=black][b]Blazin[/b][/color][/url] was banned for multiple accounts.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=black][b]mybboss[/b][/color][/url] was banned for being low quality; again.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=454666][color=black][b]adampelletgun[/b][/color][/url] was vacation banned.\r\n[/list]\r\n\n[color=white][b]Awards[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1290620][color=#0066FF][b]Designer[/b][/color][/url]'s GFX Guru award was revoked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] finally received the 24k award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=570186][color=#0066FF][b]TheHackersLove[/b][/color][/url] received the Gravel of Dredd award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=8981][color=#0066FF][b]Twinkles[/b][/color][/url] received the Asswipe award to wipe away her tears of joy.\r\n[/list]\r\n\n[color=white][b]Group Leadership Changes[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] is no longer a leader of Rhythm.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=787112][b]Saturday[/b][/url] is no longer a leader of Rhythm.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=725160][b]McFlurry[/b][/url] is no longer a leader of InFaMoUs.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=660659][b]-Analog-[/b][/url] is now a leader of Logic.\r\n[/list]\r\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=91531][color=#0066FF][b]ven0m[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2961956][b]Ex-staff, Ex-admin & Mentor list[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=522041][b]BaussHacker[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2962380][b]C# Programming Tutorials!!! (Console- & Windows Form Applications)[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1070150][b]tdog0403[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2960833][b]The groups of now, and then[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=397679][b]Anarchy[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2973045][b]New banner[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2975658][b]HF OMGPOP Pool Tournament 6 - REGISTRATION OPEN.[/b][/url]\r\n \r\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=646916]Genuine[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: One of our staff members, [url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url] has been chosen as tribute for the 115th edition of the HF News! Any shoutouts you want to make to friends before we go on?\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: Thank you for including me. I'd like to give a shout-out to Bay, Conception, Existence, LockMythMonster, Jesus, and iNviZ. Then comes the Staff team, Red Lions, and Infamous.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: How did you rise through the ranks of the Red Lions? I know you're a long time member of the group, but most people don't know the details behind it.\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: I was a member for a few months after Hysteria resigned as leader and promoted both Morchid and Glassy. Morchid and I used to play Xbox and talk over Skype a lot, so I started giving him ideas of how the group could be more active within it's sub-forum. Shortly after, Morchid was Rep fucked and banned from HF, so he was demoted as the leader of Red Lions which only left Glassy in-charge because Nokia2mon2 isn't as active. I PMed Glassy with the ideas that I gave Morchid and he took them into consideration. A few days later, we exchanged our Skype contacts and would discuss the ideas we had over calls. I'm not sure the exact date on when I was promoted to co-leader, but I was extremely excited about it.\r\nContributing & dedication is what it takes if you're planning on being promoted to a higher rank. You just have to work hard for your position because nothing comes free.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: Life lessons for the rest of us. Did these morals help you get promoted to staff, or how did that come about?\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: Yes and no. I did have dedication on helping members, but never thought I'd even gain Mentor position at that time. I wasn't as active nor did I even post in other sections that often. After I was given Mentor, I started working hard for a staff position and about two weeks later, Omniscient sent me the PM inviting me. Of course I accepted it, and later started getting used to everything.\r\nSo dedication is what helped me the most as far as Staff goes. I also read the Help Documents and tried to memorize them the best I can. So when the time did come, I was fully prepared for the position.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: Glad that all of the studying and preparation came in handy. How did you find yourself on HF? What attracted you here?\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: I found HF by Google searching host booters and how they worked. Being an active Xbox player on Halo 3, you come across plenty of cheaters in certain playlist. I decided to send a voice-mail to a suspected cheater, and he told me which shell booter he was currently using. With that information, I searched the name of it which led me to HF. A few days later, I signed up and decided to purchase Atomic Booter for myself. It worked out well and have been a customer of Mark (Webber) for quite a long time. (Over a year now)\r\nWhat keeps me active on HF now is being a staff member and having groups to look forward to. Without any of these, I wouldn't be logging on everyday.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: We all have the things that keep us coming back. Have you applied anything that has happened on HF to real life?\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: Actually I have. When I first joined the site, my grammar wasn't as nearly good as it is now. HF has also has inspired me to become more of a white hat. I remember PMing T3h Hack3r about HJT training when he was a staff member here. He encouraged me to become a trainee at another forum, which I enjoy doing on my free time. Malware removal is something I hope to do has a hobby in the future. Other then that, I can't really think of anything else that plays a major roll in my life.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: So many people I've interviewed in the past have cited the HJT Team as a future goal of theirs. Glad to see we all have our sights set high. What happened with you and Valor? You were a leader for a time, but you left the group.\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: HJT is among the greatest contribution towards the site IMHO. I'm happy to see Omniscient charging members for undergoing training here. It's well worth it.\r\nI enjoyed being leader of Valor, but since it was once related to Blackshades I couldn't handle the stress anymore. I would receive constant PMs for an explanation on why they were removed from the group. When I told them it was for inactivity, some will threaten to open up a scam report because they've paid Xviseral. Existence and I tried our best to make the group exclusive but it was extremely hard since the members didn't think it was fair.\r\nBV1 asked if I wanted to lead with him shortly after Existence was demoted, but I decided to resign to protect my reputation as a staff member.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=white]+Entity[/color][/b][/url]: And today it's just BV1. Any closing remarks to the population?\r\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=lime]Genuine[/color][/b][/url]: Yep, and he's doing a nice job as far as I know.\r\nAs for my closing statement, your [i]friends [/i]aren't always set out to be the good people.\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=133256]Himura Kenshin (Xypher)[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 115th edition of the HF News, Himura Kenshin (better known as Xypher). Any shoutouts before we start?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: Just to everyone but TA, cus y'know, they all suck. :3\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Haha. You've been on HF for almost three years! What originally brought you to the site and what were your intentions?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: In '08 I used to co-own a very popular Maplestory private server. One day we got hacked and I wanted to learn to be one of those, 'l33t h4x0rs' that DDoSed us, found HF, leeched for the longest time, then in '09 was forced to make a new account, leeched for a month or so, then decided to start helping the newer guys with what I had learned.. I never got my revenge. :c\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Ah, well, as some say, \"Success is the best revenge\". From what I've heard, you have a very interesting past in relation to HF usergroups. Care to share your experiences with groups, past and current?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: Oh god, where to begin. The first group I ever joined was an unofficial group called, \"Inject.\" It was created and owned by the once famous member, Carbon. We never really did much, but that is what sort of brought me to be really active on the forum. A few weeks after being really active, I decided to apply for every official group I could, the only group I got into was The Black Knights. At the time there was sort of an unofficial war between who was better, The Black Knights or The Alliance. Of course being a Knight myself, I sided with BK and was anti-TA. A few months passed and the group was virtually dead, and then myself, Stoner, and Maximo were promoted to actual leaders of the group. We brought the group to be rather active, we revamped it, raised its reputation, made it a good group again. Then I applied and was accepted into The Alliance. After nearly a year in the group, developing close relationships, etc., the group started to die. Paradoxum had disappeared due to school, Saged didn't have time due to school as well, and Skill was busy with his job and his staff position on HF and SF. After many posts and threads about how we could get TA active and going, I got a PM from Saged one day, all it said was, \"You're leader, don't fuck it up.\" It still remains to be the best day I've ever had on this forum. After about 4 or 5 months of leading TA I resigned from leading both BK and TA due to personal issues. Other than that I was also close to being a leader of Reverence/Respawn, the RATs crew, and The Red Lions, but those were all due to friendship with the owners, so nothing special to talk about there.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Oh wow, that's definitely interesting. How exactly did you revamp The Black Knights, and how did you change TA with your leadership position?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: With TBK I tried different systems, different subject targets, etc. I tried to divide the group into teams or factions, I tried to make it a project oriented group, but we never got the members' dedication that we needed for it to work. As for TA, I didn't change anything. In my opinion TA has had it right the whole time and doesn't need changing. If you look at every group that exists today, they have all cloned and copied TA's way of recruiting, TA's way of acting as a group, and TA's expectations of quality. They copy TA because they know TA is amazing.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I've definitely seen some quality members from TA, although I haven't experienced it myself, so I'll leave it at that. How do you feel HF has changed since you joined the site, and do you think it's better or worse (in what aspects)?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: When I first joined HF, it was still a hacking forum. The most popular sections were still the hacking and coding sections. Yes the lounge still had the most posts compared to other sections, but it wasn't the focus of the forum. If you deleted the lounge back then you would literally lose maybe a dozen or so members. Today you would lose hundreds and hundreds. Now HackForums.net is simply a way to advertise. This is truly a generalized forum with sections about all sorts of subjects across the board. I understand that this is a business for Omni, but I disagree with it. I also feel that Omni has distanced himself from the community in an attempt to keep up his professional persona. Though something I think he has forgotten is friendly, social interaction is a huge part of a great business. Though on the flip side of that, he did create HackerCraft and I've heard he does go on it from time to time, so I think he is starting to get his touch back. HF has multiplied in size 20 fold since I first joined, that's a lot of expansion for Omni to have to deal with, so I can sort of understand why he got like that.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Yeah, I'm an active user of the official HF Minecraft server Hackercraft, and last week particularly, he was on it a [b]lot[/b]. You tend to use The Lounge a lot yourself, having close to 5K posts in the section. Why do you use it so frequently, and what do you think of it?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: I use it frequently because I no longer feel that this is a community I want to share my knowledge with. My last attempt at a grand guide, one I spent a few weeks working on, was my beginners guide to cryptography. A guide to REAL cryptography, it got like two posts other than the people who helped me move it around and such. The people on this forum claim to want to learn things, but really they just want free, private things that they can claim as their own, especially when it comes to the programming section. The places I'm most knowledgeable in are; Programming, cryptography, and graphic design. The programming section is filled with leechers who I don't feel deserve 90% of what is released to them, why should I share, oh say my private encryption methods that have yet to be cracked? Because it would be \"contributing?\" Been there, done that, I'll give to those who will be thankful instead, and I will give it to them via PM, Skype, or some other means where leechers will not be able to take it openly. As for cryptography, well.. HF isn't interested in real cryptography, they're too lazy for that. And as for graphic design, I am knowledgeable in the critique side, but I cannot do as much as I can critique, so I do not feel I should be active there yet.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Alright. What are your future goals on HF then?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: Honestly, the only sections I really find myself attached to now are The Alliance, Anime Adventures, and sometime in the -hopefully near- future, the graphics sections, so my goals are pretty limited. My only three goals at this point are to work towards getting an official group for Anime Lovers, become a leader of TA again, and to gain the silver medal award. Not sure what it is about it, but it's always sort of seemed like a mark of quality for me. Most of the people I have ever idolized on this forum have it and they've all been the most quality members in my eyes, I wish to some day join them.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: You have a lot of name changes, although you are commonly known as Xypher. What do some of your previous names mean (including Xypher) and do they hold any significant value? Also, what does your current username mean?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: Really my current name is the one that holds real value to it, well.. personal value. Xypher was just me trying to find a cool sounding name. I always thought the word Zephyr was a relatively cool one and I just thought of a way to make it unique, though about my love for cryptography and ciphers, combined cipher and zephyr together and got Xypher. As for Bad Blood, that was my favorite song at the time, not sure why I felt the need to change it. As for Oldies and escafLow, just me trying to be someone else. I was tired of being Xypher, I was tired of the expectations that seemed to come with the name, so I just jumped around with random names for a time. Then when I returned I came back to being Xypher, then shortly after I changed my name to -Snowbunni. That's the name I go by on most games I play, then shortly after that I decided to change my name to Himura Kenshin. Himura Kenshin is the name (or persona) of the main character in my favorite Anime series, Rurouni Kenshin. It was the first series I ever watched, nearly 16 years ago and it remains to be my favorite. I find a scary similarity to Kenshin and I, we both have pasts with certain similarities that will haunt us for the rest of our lives. ^_^\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, I'm sure people will appreciate this interview, just as I have. Thanks for the opportunity. Any final thoughts or comments before we leave?\r\n[url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Himura Kenshin[/b][/color][/url]: Crack is whack kids!\r\n[/spoiler]",
      "subject": "[10/28/12] - HF News"
    },
    {
      "pid": "27669929",
      "uid": "515249",
      "dateline": "1351484360",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[b][color=white]GTA V Release Date Leak[/color][/b]\nDuring the discovery of a supposed Grand Theft Auto V poster, we have learned that the latest in the series is expected to be released in Spring of 2013. While the news may not be a surprise to many of us, who have been tracking leaked information concerning the game, it is the first bit of confirmation on a release date. As indicated on the poster, there still appears to be no hope for a release on the Wii, while Playstation 3 and Xbox 360 will be expected to have a release. We will keep all of you updated on any new, important information that surfaces concerning this highly-anticipated release. Click the following link to check out the poster: http://goo.gl/yhc25\n\n[color=white][b]Minecraft Winning the Popularity Contest[/b][/color]\nAlthough it may be expected, it appears that Minecraft now beats Modern Warfare 3 in the popularity race. This unique game has brought in sales revenue of roughly 80 million dollars, as a result of more than 4 million copies being sold. Coupled with the game's ability to rake in sales, it has also exceeded Modern Warfare 3 in activity on Xbox Live for the week of the 15th. Speaking of sales, the game has also received remarkable sales during its first week, reaching a total of 1 million copies being sold in only 5 days.\n\n[b][color=white]Assassin's Creed III Launch Trailer[/color][/b]\nAs if the GTA release date leak isn't exciting enough, Ubisoft has officially released the launch trailer for Assassin’s Creed III. Also serving as a reminder, Americans, be prepared for the release on October 21st. The European release date is set for the 31st of October. Check out the trailer for yourself: http://goo.gl/9sJLA\n\n[b][color=white]GTA: Vice City Going Mobile[/color][/b]\nIt may be unexpected to hear this game in recent news, but Grand Theft Auto: Vice City is once again making a return. In celebration of the Vice City's 10th anniversary, it appears as the Rockstar is planning to release the game on iOS and Android software sometime this fall. Rockstar has also promised to give users the \"full experience\" found on Playstation 2 with several unique improvements. One of those improvements includes a higher resolution relative to the Playstation release. The release is also set to include new, stunning artwork along with a trailer.\n\n[color=white][b]New Game Achievements [/b][/color]\n[url=http://www.xbox360achievements.org/game/toy-soldiers-cold-war-w8/achievements/]Toy Soldiers: Cold War (W8)[/url] - 20 achievements, 200 points. \n[url=http://www.xbox360achievements.org/game/angry-birds-space-w8/achievements/]Angry Birds Space (W8)[/url] - 20 achievements, 200 points. \n[url=http://www.xbox360achievements.org/game/jetpack-joyride/achievements/]Jetpack Joyride (W8)[/url] - 20 achievements, 200 points. \n[url=http://www.xbox360achievements.org/game/sleeping-dogs/achievements/]Sleeping Dogs - Nightmare in North Point[/url] - 5 achievements, 125 points.\n\n[color=white][b]Gaming Video of the Week[/b][/color]\nAs for the video of the week, a little something for the many Minecraft lovers of HF:\n\n[spoiler][youtube]http://www.youtube.com/watch?v=WXA4IsJTvRo&feature=plcp[/youtube][/spoiler]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Former Prime Minister of Italy Sentenced[/b][/color]\nFormer Italian Prime Minister, Silvio Berlusconi, has recently been convicted of tax fraud and sentenced to a 4-year prison term. The man is a billionaire media Mogul in his late 70's who only has 2 more chances to appeal the case until the sentence is set in stone. For about 19 years, Berlusconi was a powerful and influential politician in affiliation with the People of Freedom party. Fabrizio Chicchito, a member of PDL, has stated, \"This is not a sentence, but an attempt at political homicide\" as the sentence demands that Silvio cannot hold office for at least 5 years. The courts discovered that the former Prime Minister was causing inflation of the selling price for TV rights as a means for him to profit, and set up a slush fund. \n\n[color=white][b]Britian's Stance on Iran[/b][/color]\nThe United Kingdom has stated that, \"at the moment\", they are highly opposed to military action towards Iran for their suspected developments of a nuclear weapon(s). The nation insists that economic sanctions and effective diplomacy should be the course of action. The Prime Minister's spokeswoman stated that \"The government does not believe military action against Iran is the right course of action at this moment, though no option is off the table.\" She continued to note that, \"We want to see the sanctions, which are starting to have some impact, working, and also engaging with Iran.\" Prime Minister David Cameron pointed out that building up military forces for a pre-emptive strike is not only illegal, but it would also ruin the significant progress made with the current policies and sanctions in place, as the people are growing more irritable over the sanctions. However, America and Israel have growing concerns of the nuclear programs that have been the cause of talk for military action.\n\n[b][color=white]al-Qaeda Set to Kidnap Westerns[/color][/b]\nAyman al-Zawahri, an al-Qaeda leader, has implored Muslims to kidnap Westerners. In delight of the kidnapping of Warren Weinstein, the Al Qaeda leader declared \"We are seeking, by the help of Allah, to capture others and to incite Muslims to capture the citizens of the countries that are fighting Muslims in order to release our captives.\" Zawahri displays discontent, to put it lightly, over what he accuses the global community of giving Syria's President Bashar al-Assad; free reign to kill citizens. \"I incite Muslims everywhere, especially in the countries that are contiguous to Syria, to rise to support their brothers in Syria with all what they can and not to spare anything that they can offer,\" remarks Ayman al-Zawahri. Not stopping there, the terrorist group leader also spoke on Egypt, saying \"The battle in Egypt is very clear. It is a battle between the secular minority that is allied with the church and that is leaning on the support of the army, who are made by (former president Hosni) Mubarak and the Americans... and the Muslim Ummah in Egypt that is seeking to implement the sharia.\"\n\n[color=white][b]Australia's Economy Remains Strong[/b][/color]\nDespite global recessionary gaps in many economies around the world, Wayne Swan, the Australian Treasurer, announces this week that Australia has a strong AAA credit rating. Swan explains, “This coveted trifecta is another ringing endorsement of our nation’s economy, which continues to kick goals against the backdrop of ongoing global headwinds.” Fitch Ratings describe Australia's economy as a “high-income developed economy, credible macroeconomic policy framework with scope for policy flexibility, and standards of governance that rank among the world’s strongest.” However, they have been affected by a decrease in demand for coal and iron exports due to a slowed growth in China's GPD.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]The iPad Mini is Here[/b][/color]\nThe long awaited iPad Mini has been revealed by Apple, and it comes at the price tag of $329. Not only is it wearing an expensive price tag, Apple has also designed it with the emphasize of the word \"mini\" in mind, as the screen is only 7.9-inches. The Mini also comes with different sizes of storage space at different prices. While the $329 dollar model gives you 16GB, there is also a 32GB model that weighs in at $429. For those who really need all the storage they can get, there is the 64GB model that is $529 dollars. The screen resolution is still the same as the iPad 2, which is 1,024x768. In comparison to the iPod Touch, it will come with an A5 processor. The FaceTime camera, which is capable of 720P, is on the front side of the iPad Mini, while there is also a camera on the back(5.5-megapixel). Check out more here: http://goo.gl/b5p1P\n\n[b][color=white]Twitter and its Half Billion Daily Tweets[/color][/b]\nTwitter's CEO and the man who appeared on last month's Charlie Rose, Dick Costolo, addressed a wide audience in London with commendable news. According to Costolo, the service is now handling roughly 500 million tweets daily. Evidently this news is not slowing Twitter's appetite to remain an evolving company, as it was stated by the CEO that they are trying out \"star\" buttons and \"like\" buttons that will act as a replacement for the current \"favorite\" system. The new replacements are not new news, as it was previously stated by other sources, but it is the first time it has been confirmed by Twitter's CEO. While this may come as positive news, there are critics who ask the question: \"How many of these users are actually users?\" As many of you on Hack Forums may be well-aware, Twitter is susceptible to bots and spam, which shouldn't count towards actual tweets. On the other hand, the company usually commits to being very precise on their numbers.\n\n[color=white][b]Google/Samsung[/color][/b]\nPhotos taken with the Nexus 10 were released earlier on, and now, the new tablet, made by Samsung and Google, has had photos of itself release. 16 screenshots of the new device can be found [url=http://briefmobile.com/google-nexus-10-samsung-android-4-2]here[/url]. The device will feature a Exynos 5250 dual-core processor at 1.7GHz, 2GB RAM, 16gb storage, and a 5MP rear camera, with an unidentified front camera.\n\n[color=white][b]Samsung Products Skyrocketing[/color][/b]\nWith the Samsung Galaxy S III on 4 of its 5 strongest weeks, all since Apple released their iPhone 5, they are definitely feeling the power. Many are suggesting that consumers held up until the iPhone 5 was released only to be quite disappointed and moved on to the Samsung Galaxy S III. Samsung is rumored to keep the ball rolling with their long awaited tablet known as the Samsung Galaxy Note 2, which is set to be released sometime in the coming holiday season, near Christmas. The device, bigger than a phone, but smaller than a tablet, was initially mocked by critics who thought it looked silly. But Samsung said the company has slowly won over people despite the large size, and are pressing the category even further with the larger Galaxy Note 2.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Ra Ra Riot Announce New LP[/b][/color]\nNew York indie band, Ra Ra Riot, have announced the release of their follow up album to their 2010 chamber pop success, “The Orchard”. The album, “Beta Love”, is set to be released on January the 22nd of next year by Barsuk. It is their first record to be released since the departure of their cellist, Alexandra Lawn, and their third LP overall. The band also announced the launch of their new tour, set for 2013, with several late 2012 dates that will be performed in support of Passion Pit and The Joy Formidable.\n\n[color=white][b]Indie Rock Band Arcade Fire Working Hard On New LP[/b][/color]\nIndie rock gods Arcade Fire are hard at work on a new LP, according to drummer Jeremy Gara. In the interview with Ottawa radio station CKCU 93.2, the band member revealed that the band was working “full-time” in the studio in order to get their follow up album to “The Suburbs” by late next year. This will be the Canadian’s fourth LP to add to their list of highly successful releases.\n\n[color=white][b]The Black Keys Sell $2 Million In Concert Tickets In One Week[/b][/color]\nThe Black Keys have sold $2M worth of tickets within a week’s period over the course of 4 California shows in 3 venues. The shows, which took place from October 2nd to October 8th, included a $1.2 million, two-day stop at the Staples Center in Los Angeles, which had a combined audience of 24,821. The band has been touring since January in support of their 2011 LP “El Camino”, headlining several European and American music festivals. Earlier this week the band kicked off a stretch of Australian tour dates and will travel back to Europe before the year’s end to perform several concerts. Their final 2012 shows will take place in Las Vegas on the 30th and 31st of December.\n\n[b][color=white]Music Videos Of The Week[/color][/b]\n[spoiler][video=youtube]http://m.youtube.com/watch?v=OJ8Gtx45Fmc[/video]\n[video=youtube]http://m.youtube.com/watch?v=asY08yquddo[/video][/spoiler]\n\n[b][color=white]Member Submitted Videos [/color][/b]\n[spoiler][video=youtube]http://youtube.com/watch?v=GQtY0reAWjs[/video]\n[video=youtube]http://m.youtube.com/watch?v=0Uc3ZrmhDN4[/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI'm often disappointed in the nature of humanity, as we cannot understand what we have until we have lost you. You've probably heard that before, but it's really quite true. This morning, did you wake up feeling fine and able to eat your breakfast? Yet, maybe, tomorrow morning, you'll wake up with a sore throat, unable to swallow. It's things like this that we don't have the capacity to feel thankful for. On days that we are in full health, we just live out the day. Only when we're missing something do we realize its importance and worth.",
      "subject": "*"
    },
    {
      "pid": "27669932",
      "uid": "515249",
      "dateline": "1351484365",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you think of all of the recent changes on Hack Forums?\"\n\n[i]\"I think omni is a smart person and is only making changes for the better. \nAlthough many dislike \"change\", I'm sure everyone will get used to it. I personally \ndon't really mind if omni adds/removes/changes things on the site, as long as I \ncan do the basics; PM people, post threads etc. Regarding the \"Thread Prefixes\" - \nI think they help, to better organize all the threads. Regarding the \"Thread Ratings\" \nplugin - I would have preferred it wasn't added but even if it stays added, I don't \nreally mind.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=875998][i]-The Dark Knight[/i][/url]\n\n[align=right][i]\"I don't really think most of the changes are going to improve HackForums. \nEspecially the thread ratings, as they are already being abused. The marketplace is full of \n1 starred threads and I'm sure there are people that keep themselves busy with 1 starring \neverything. There are however some good changes too like the disputedb and the upcoming \nPOW3R rank will probably be a good update as well. \"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1433804][i]-eXpan[/i][/url][/align]\n\nThe topic for next week is \"What do you feel is your biggest accomplishment? Details, please.\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/imDb2XJ00ZNc8.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/maxgi.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/idLND7L5oDOVg.png[/img][/spoiler][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=660659]-Anal OG-[/url]\n[list][*]Headlines\n[*]Tech News\n[*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News\n[*]Tech News\n[*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}