{
  "posts": [
    {
      "pid": "17257608",
      "uid": "515249",
      "dateline": "1320902474",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]66th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://goo.gl/A6Crc[/img][/align]\n[color=white][b]Marketplace Cross Posting Rule[/color][/b]\nA recently added rule to the Marketplace is now in effect. In order to cut down on spam Omniscient has added a rule that will stop users from posting in both the Premium and Secondary Sellers Section, meaning you must now decide which forum you would like to stay and post in. If you have a friend, or your: \"partner\" post in one of the sections for you this also violates the new rule, causing a 25% warning to your profile. Not abiding by the rule in general will give you a 25% warning level stay tuned because [b]in the near future, more restrictions are coming to the Marketplace.[/b] \n\n[color=white][b]New Marketplace Categories[/b][/color]\nThe Marketplace is being updated quite a bit this month, Omniscient added the sub-category called: “Webmasters”, which includes user to be able to sell the following: Domains, Website Marketing and Hosting Services. This should cut down on spamming in the “Service Offerings” where users tend to post their: “free hosting” in that forum. Users are actively posting in this section and when Omniscient announced that all of those sections were going to be added everyone was glad.\n\n[b][color=white]Quantum is no longer Moderator.[/b][/color]\nQuantum has been stripped from his Moderation privileges in the Marketplace Discussion section; he was demoted for an undisclosed reason. He was then repfucked by Omniscient. He had told our new writer Cartel that he was repfucked and banned for: \"screwing with Omniscient\". This would normally be in the Webshow and User News area, but since it was such a change, not just a demotion, but a repfuck, ban, and negative reputation. He really went from the top to rock bottom.\n\n[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"What's your take on the MotM? Do you agree with this contest, or do you disagree?\"\n\n[i]\"I think that the MotM is just a joke to be honest. I mean sure, I'll nominate a person \nevery now and then, but for most people, when they vote, they vote for the person they \nsee around most. I think that Omniscient was right when he shut it down—it's just a popularity \ncontest, not an actual Member of the Month contest. That's just the thing too. It's sort of \nhard to actually make it like that. You would have to do extensive work in order for it NOT to \nbe a popularity contest, more work than what should be put into the MotM. One other thing, \nI think that it should be \"put out there\" more than it is. Then I think that the voting would be \nmore accurate. However, I think that it should keep going as it is and always has been, as it \ngives members something to look forward to and something to dream to achieve.\"[/i]\n[url=http://goo.gl/FOYZZ][i]-Cobalt+[/i][/url]\n\n[align=right][i]\"I disagree with this system, as I find it unfair. It is basically a popularity contest. \nI  take the time to research the current contestants, you will realize that these members all have \na large reputation. Now, I am not against the contestants in general, however, If you look at some \ncontestants' posts, they are generally in [i]The Lounge[/i], private forums, and in the [i]Rules, \nAnnouncements, News and Feedback[/i]. Are the members with ten, to twenty posts per day in the \n[i]Beginner Hacking[/i] section not good enough to be in the MotM? I believe that people who contribute \nto the whole community should be put in the list as-well. If this is what the [i]Member of the Month[/i] is all \nabout, then I believe it should be renamed to the [i]Most Liked Member of the Month.\"[/i]\n[url=http://goo.gl/57jom][i]-Cronus-[/i][/url][/align]\n\n[i]\"My opinions on MOTM are pretty neutral. Basically everyone votes for a friend or the person with high \nreputation and awards. There is no best member on the forum when there is well over 200,000 active members \nhere. I think members should nominate users and the staff of HF should pick the MOTM. This why the contest \ndoesn't get rigged and it's fair. If this would happen, the award would actually go to the best member of the month. \"[/i]\n[url=http://goo.gl/3BOhP][i]-Genuine[/i][/url]\n\n[align=right][i]\"The Member of The Month contest is a great way to reward members who have been an influential help to \nHackforums.Most of the time it rewards the members who have constantly maintained a high standard and \nare dedicated to helping the new and uninformed. This is where i think the good aspects of it ends. People \nwho are more well known than others would probably receive more votes as they have done something notable \nin the past, or have been very active, and in my opinion, people vote for the eligible people who they see most, \nnot necessarily who have done something good to help the members of Hackforums. The system can be corrupted, \nbut people should be able to see past their own personal opinion, and look at how a person has helped others. \"[/i]\n[url=http://goo.gl/KHhGf][i]-+Pirate[/i][/url][/align]\n\n[i]\"Member of the Month is one of the most biased contests on HF. Most users (as seen in the past) get their buddies \nand fellow custom group members to vote for them. Funnily enough, the people who nominate the contestants in \nthe nomination thread are either 1.) friends with their nominee or 2.) a fellow group member. I just took a look at the \nnomination thread for October and found my hypothesis to be true. HJT members voting for other HJT members, Alliance \nmembers voting for other Alliance members, and so on. Half of the people who make it to the actual poll barely do \nanything that really contribute to the community. Being a good group leader (Infalliable, for example) does not contribute \nto the rest of us at all. Nor does being a good teacher, mentor, or friend. I think that MotM should be solely based on \nmembers who actually have impacted the community as a whole. \"[/i]\n[url=http://goo.gl/6uWGM][i]-alabama.[/i][/url]\n\nThe topic for next week is \"How do you feel about the Marketplace and how it runs?\" \n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[align=center][img]http://goo.gl/B9LTO[/img][/align]\n[color=white][b]Michael Jackson trial: Conrad Murray Guilty[/b][/color]\nYes, some of you may recall the tragic day we lost Micheal Jackson. It has come to our attention that The 58-year-old cardiologist, who was found guilty of involuntary manslaughter on Monday, has been assigned special protection by prison authorities to prevent him being attacked by other inmates. He will have a single cell and an escort will go with him when he moves around inside the Los Angeles County jail. Murray faces a maximum sentence of up to four years in jail when he is sentenced on Nov 29. Murray said: \"He could not really enjoy his property, I mean, paparazzi were here, fans were here, everyone was looking into the property. We escaped many a time, actually in this said vehicle. He would climb into the back seat and lay low and he would tell security 'Don't follow us.' My heart pounded a little bit. He liked those risks.\" Murray also described how Jackson had never had a pedicure or a manicure and was \"walking around with painful feet\" and \"unbelievable callouses\".\n\n[color=white][b]Joe Paterno Retiring: Penn State Football Coach Stepping Down At End Of Season[/b][/color]\nJoe Paterno, the Penn State football coach who preached success with honor for half a century but whose legend was shattered by a child sex abuse scandal, said Wednesday he will retire at the end of this season. Paterno said he was \"absolutely devastated\" by the case, in which his one-time heir apparent, Jerry Sandusky, has been charged with molesting eight boys over 15 years, including at the Penn State football complex.\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://goo.gl/yEOV8[/img][/align]\n\n[align=center][img]http://goo.gl/b4JkO[/img][/align]\n[url=http://www.gamecove.net/][img]http://gamecove.net/images/gamecoveHF.png[/img][/url]\n\n[align=right][url=http://www.mostskillful.com/][img]http://i1192.photobucket.com/albums/aa330/Mostskillful/comefly.gif[/img][/url][/align]\n\n[align=center][URL=http://goo.gl/VX8xv][IMG]http://img710.imageshack.us/img710/580/contactforadvert.png[/IMG][/url][/align]",
      "subject": "[11/9/11] - HF News"
    },
    {
      "pid": "17257615",
      "uid": "515249",
      "dateline": "1320902503",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://goo.gl/DyX5H][color=white][b]Prokill[/b][/color][/url] this Prokill has been confused with the American Prokill, which was the one who hacked over thirty-five people. Our Prokill only hacked about twelve to thirteen, and of that, he only made Selena Gomez's Facebook public. This Prokill is not sentenced for life, yet his is on bail. The team is sorry for the confusion.\n[url=http://goo.gl/bv1ZE][color=white][b]Tsgh Mike[/b][/color][/url] went on vacation until 11/11/11 to take a break from Hack Forums, but has returned early.\n[url=http://goo.gl/ReqOu][color=black][b]SeaNanners™[/b][/color][/url] was banned until 11-17-2011 for Flaming, Threatening, or Harassing.\n[url=http://goo.gl/Gt0Av][color=black][b]-paradox-[/b][/color][/url] was banned until 12/06/11 for posting gay porn.\n[url=http://goo.gl/gaXp9][color=black][b]Verilog[/b][/color][/url] went on vacation and returned today.\n[url=http://goo.gl/OWGcJ][color=black][b]BaussHacker[/b][/color][/url] was banned until 11/20/11 for low quality posting.\n[url=http://goo.gl/14Xml][color=black][b]Confidence[/b][/color][/url] was hacked earlier this week and posted a thread about it [url=http://goo.gl/orDsR]here[/url]. Confidence still doesn't have his account back, and apparently the hacker wants $200 for it to be returned.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]SE Thread[/b][/i] - [url=http://goo.gl/jd4Wr][Clarification] What is Social Engineering?[/url] - [url=http://goo.gl/tylXE][color=#0066FF][b]Cynical Soul[/b][/color][/url] - The Social Engineering section has long been a joke to the \"hacking\" community as a ton of people would post \"SEing\" threads, that really weren't Social Engineering at all. With this tutorial and guide, Social Engineering is really explained and people can understand what it's really about. \n[i][b]Informational Thread[/b][/i] - [url=http://goo.gl/7UtJR]Warning System Explained[/url] - [url=http://goo.gl/yC4mH][color=white][b]Genuine[/b][/color][/url] - A lot of members have come around not understand \"Warnings\" or the percentage you may receive for each different rule. Genuine has explained all of this, and more. Be sure to read it, you may even learn something!\n[i][b]Members Contest Thread[/b][/i] - [url=http://goo.gl/ivwV1]HUGE BLACK TRINITY GIVEAWAY! OVER 1000$ IN PRODUCTS![/url] - [url=http://goo.gl/c8KgI][color=#0066FF][b]Mother Teresa[/b][/color][/url] - Mother Teresa is doing a giant contest of over one-thousand dollars worth of stuff! This is the same member who recently received the [i]Master Donator[/i] award.\n\n[color=#FFFFE0][size=large][b]Gaming Thread(s)[/b][/size][/color]\n[i][b]Gaming Thread[/b][/i] - [url=http://goo.gl/X19ME]★ What is the Counter Strike and Steam Section? ★[/url] - [url=http://goo.gl/6gNxc][color=#0066FF][b].Nielz[/b][/color][/url] - Nielz wrote an amazing guide on the Counter Strike and Steam section, explaining the games, frequently asked questions, and even some links to other threads. Then at the end, he states that if anyone has any questions, he is open to be messaged about them. \n[i][b]Battlefield 3 Thread[/b][/i] - [url=http://goo.gl/s955k]How to Get Crazy Battlefield 3 Points | EOD Boosting[/url] - [url=http://goo.gl/DNcFB][color=#0066FF][b]DragonX433[/b][/color][/url] - Dragon shared a great method of how to gain a crazy amount of BF3, many members can vouch for this method. It actually works!\n[i][b]Grand Theft Auto Thread[/b][/i] - [url=http://goo.gl/qvzO4]My GTA SA server.[/url] - [url=http://goo.gl/GbyRj][color=white][b]Tsgh Mike[/b][/color][/url] - Our very own mentor Tsgh Mike has started up a brand new GTA Server, he plans on spending a ton of time on this server and keeping it up!\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Riggs[/font][/size][/color][spoiler=]\n[color=#1466ff][b]Daniel Faraday: [/b][/color]I just want to say thanks for accepting this interview. Do you have anything you want to open with?\n[color=white][b]Riggs: [/b][/color]Hello Daniel, thanks for the opportunity.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Do you have a favorite forum on Hack Forums?\n[color=white][b]Riggs: [/b][/color]I can’t really answer that. I tend to only ever use the “View New Posts” link. The Science, Religion, Philosophy, and Politics section appeals to me, but I wouldn’t say it’s my favorite.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]You have a decent standing on Hack Forums. Would you define that as being \"HQ\", or is it just part of who you are.\n[color=white][b]Riggs: [/b][/color]I think my reputation is primarily responsible for portraying my “decent standing”, but my character is what I believe a lot of the community tend to give me recognition for. I think High Quality can be defined by our character as opposed to our reputation, because our character is what we really are, while our reputation is merely what others think of us.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]You seem to be very popular with Omniscient and in Tiny Chat, do you take part in them often?\n[color=white][b]Riggs: [/b][/color]I wouldn’t say I’m hugely popular with Omniscient, more so the other TinyChat participants. Omniscient is like me in the sense he doesn’t appear on TinyChat very often, but when he does he makes it enjoyable for everyone. Logically - the less you have of something that makes you happy, the more you appreciate it when it’s there. Like Omniscient, I appreciate TinyChat for being a place to relax and socialise with the option to express myself beyond the boundaries of a keyboard.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of the direction the site is headed in?\n[color=white][b]Riggs: [/b][/color]I think it’s important to remember that many members will never be happy with changes. Given we orientate a hacking community, it seems appropriate to me there will always be a negative bandwagon looking to publicly recognise the defects in changes to an already working system.\n\nI’m hoping progressive development will remain consistent.  However, I respect Omniscient’s commitment and I think a lot of members fail to acknowledge just how demanding his work schedule really is.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Are there any things that you want changed or support change for?\n[color=white][b]Riggs: [/b][/color]Given I avoid the Marketplace at all costs; maturity is by far the biggest issue for me on HackForums. If I could support anything it would be a change in staff discretion regarding the Etiquette of HackForums. Acting like you’re older than 16 even if you’re not has always been a mandatory rule that lacked any staff enforcement and I see immature members deviating from it regularly. It’s great to have a laugh, but some posts are just not funny. A lot of posts don’t even make sense.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]How do you think membership in the Marketers affects your life on Hack Forums?\n[color=white][b]Riggs: [/b][/color]Although the Marketers are still very new, I’ve noticed it’s already an extremely versatile group. Like the other members, I tend to give as much advice as I take and we all sit well with an unofficial “mutual sharing” rule. For me this means a lot less time is wasted in The Lounge and a lot more is invested in gaining knowledge with the potential to help me in the real world.\n\nI personally like to mix the information resources of our private sub-forum up with some of the public black hat tutorials available in the forums. This means HackForums opens new doors for me. Possibly steel barred ones, but with the benefit of always having enough money to make bail.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of the new wave of members?\n[color=white][b]Riggs: [/b][/color]I’ve always expected the community to grow with a rapidly increasing incline. As long as the staff keep post activity manageable, I’m confident the board will only benefit.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of the new usergroups and what they bring to the forum?\n[color=white][b]Riggs: [/b][/color]I think user groups are a great official asset to anyone looking to feel a part of something and socialize with others sharing similar interests. I think they bring a sense of exclusivity to the forums and for a lot of members, another target to reach. Though group owners that think their few extra text-based privileges make them powerful forum Gods do make me laugh.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Are there any specific members that you think are benefiting the site en masse?\n[color=white][b]Riggs: [/b][/color]I won’t name specific people/groups as making exceptions for only some might offend others, and I can’t sit here typing out a list of names to accommodate for everyone. Financially, probably quite a few. Educationally, everyone.\n[/spoiler]\n\n[align=center][img]http://goo.gl/G1F5k[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=_bguiLEfu9U[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Genuine\n--Leadership\n---Black Shadow (http://goo.gl/6ZUuv) - Rats Crew - >Leader\n---Ron Paul (http://goo.gl/rZV0z) - <Moderator Runescape\n--Awards\n---Mother Teresa (http://goo.gl/iXYRU) - Master Donator - Thank you very much. You deserve this merit. You've been a good member.\n---Glassy (http://goo.gl/cJlB7) - The Protector - Honor and glory to the protectors of HF.\n---Dylan (http://goo.gl/fpujy) - Ninja - I think you deserve this award. Enjoy it. Looks good.\n---Teflon (http://goo.gl/bqBDN) - Businessman - Never any nonsense or problems from you in Marketplace. Thanks for that.\n---iNviZ (http://goo.gl/DNWc5) - Member of the Month - October 2011 \n---Black Shadow (http://goo.gl/6ZUuv) - Rat Expert - A true leader of the RATs crew.\n---Splodge0007 (http://goo.gl/bDd66) - Cool - Sometimes it take just one sentence.\n---.Nielz (http://goo.gl/cQg9c) - Sticky Man - http://hackforums.net/showthread.php?tid=644991\n--Misc.\n---\n--Questions\n---\n[/spoiler]",
      "subject": "*"
    },
    {
      "pid": "17257623",
      "uid": "515249",
      "dateline": "1320902531",
      "message": "[align=center][img]http://goo.gl/C6j11[/img]\n[size=xx-small][i]iceybunneh's interview was too long to fit in the post above.[/i][/size][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - iceybunneh[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey iceybunneh! Thanks for sitting down and taking the time to do this interview! Before we begin, are there any special members you would like to give a shout out too?\n[b][color=#1466ff]iceybunneh[/color][/b]: Super special awesome shout out to my husband, Viral Dragon! Also, everyone I talk to in Innuendo, but that may be more than fifteen if I name them individually! Well, maybe more than 20!\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I understand you are quite active in the Innuendo section, earning the nickname \"Queen of Innuendo,\" forum-wide. Why do you think you're most active in that section?\n[b][color=#1466ff]iceybunneh[/color][/b]: I admit to being a computer geek, but I'd still be considered one of those pesky newbs in the hacking forums, lol. Innuendo I stuck to because of the romance writer in me, or maybe the stubborn married woman part of me that says, \"There are easy fixes to relationship problems!\" If that makes sense xD\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Of course, no one can answer questions about women better than a woman! I also see you are a prominent author, after reading all 6 chapters of \"Control,\" religiously. Do you plan on making a career out of your writing talent?\n[b][color=#1466ff]iceybunneh[/color][/b]: Oh, yessir, I do! Control has been a project I've been trying to finish and revamp for years but other stories in my head have been completed. I finished a 201-page manuscript for another erotic romance entitled \"Forbidden Paradise\" that I will be actively looking to get published professionally. I've been putting a lot of research into the publishing industry and I still have a lot of work to go!\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I hope I have the pleasure of reading that novel as well! Do you plan on releasing any more novels/chapters on Hack Forums any time soon? I understand the last chapter of \"Control,\" that was released was Chapter 6.\n[b][color=#1466ff]iceybunneh[/color][/b]: Yep! Unfortunately, chapter 7 or chapter 8 are among the final installments of the incompleted story! I've been meaning to release chapter seven for a while now but with my random bursts of activity and inactivity and other story projects I'm working on, it got pushed back. That doesn't mean that I've forgotten about it though lol\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Be on the lookout for new installments of iceybunneh's novel \"Control,\" Hack Forums! I have to ask, what role, if any, has Hack Forums played in your marriage with the HF user Viral Dragon?\n[b][color=#1466ff]iceybunneh[/color][/b]: Oddly enough, it's helped strengthen it! There was a brief period of time where Viral and I posted together in Innuendo (before my laptop died and I had to start using his computer). He and I would share our own perspectives on the same topic and maybe compare it to our own relationship. Now that we're fighting for internet time on the same machine, HF is just another thing we have in common. His involvement with Eminence and the calls Wifi have made brought me back to HF recently :P\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I know the Innuendo section has been missing you, after seeing countless threads asking for help from you. You are certainly a huge asset to that section of the forum and HF in general! Since your registration in 2010, how has the Innuendo section, and Hack Forums in general, changed?\n[b][color=#1466ff]iceybunneh[/color][/b]: Aw, I miss being able to post daily in Innuendo! I try to get online when I can but life (and Viral's work, tee hee) can sometimes get in the way. Since my registration...hmm. I'm not sure if I can accurately guess trends, but it is at least nice seeing all those cluttered porn requests gone out of Innuendo and other places. I may write porn but that doesn't mean I want to see dozens of horny kids asking for porn passes :P I haven't been around much lately so I don't know if things like the trolling has really died down or what, but there are times where I think Innuendo ran quite smoothly with people trying to help each other out. Or at least...less blatant trolling! XD I've only been able to randomly pop in and out and Innuendo at least is kind of the \"same old, same old,\" with familiar topics and questions. I guess in terms of relationship questions, HF is still the same!\n\n[b][color=#1466ff]Michael Westen[/color][/b]: For sure! Other section have had an onslaught of trolling that moderators and mentors have been battling, it's glad to see Innuendo hasn't taken such a huge hit! Speaking of porn, what is your opinion of the posting of adult content? Do you think it should be allowed, even if  to a degree for educational purposes? It's definitely a big no-no right now, but I'd like your 2 cents on it!\n[b][color=#1466ff]iceybunneh[/color][/b]: I think that posting something even for educational purposes would somehow be trolled to death! Lol. Porn for educational purposes might not work anyway, but say, anatomical diagrams or something? It would be nice to see people reacting maturely to it but come on, have you ever seen anyone sit through a sex ed class without snickering? As for posting actual porn, I don't think it's a good idea...it opens up the door for all that disturbing shock porn that's certainly screwed up my mind. When the next \"blue waffle\" or what have you pops up, and porn content is allowed, you know people won't be able to resist posting it! *shudder* The adult content I post however... things like \"Control\" and my one shot story \"Party\" are meant to be sexual but other things I write focus more on the romance between characters. The staff has no problem with text-based sex, and I think that's because it's not all up in your face at once XD As for visual porn with you know, the fake boobs and stuff? Definitely pass. I'll go to a porn site for that, you know?\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definitely, I could see it aiding in explanations or such but many people learn about sex in school but a lot of porn is very exaggerated and would do little as far as \"teaching,\" would go. Remember that posting Adult Content is against the rules and will result in warning level and possible suspension guys! Where do you see, or hope to see yourself, in 10 years, as far as your career and Hack Forums membership are concerned?\n[b][color=#1466ff]iceybunneh[/color][/b]: As for a career? Ooh, I would love to see myself as a successful novelist. I'm branching out from erotic romance to what I'm currently writing, which is a modern-day epic fantasy, so maybe I can branch out to more family-friendly works as well! As for HF? I'd love to be able to come back fully. When I can get a new laptop (if I can anyway, said the starving artist!) you can bet on me being back full time like I was before. I'd love to continue helping people either on the forums or over PM/IM as I have done in the past. I've made so many great friends from it and I'd really like for those relationships to grow as well! Assuming the same people are still on HF in 10 years, I'm going to try my best to keep up with them! ;]\n\n[b][color=#1466ff]Michael Westen[/color][/b]: You mention making many great on friends on Hack Forums - Who would you consider your best friends on HF?\n[b][color=#1466ff]iceybunneh[/color][/b]: Hmm...well Viral, but I think that's rather obvious. Joey Tribbiani has also got to be on that list! He somehow manages to put up with my bouts of \"oh I'm here, oh wait I'm not\" and still talk to me. I've met Indirect and Impurity in real life (Impurity was over here just a few days ago, in fact), and they are amazing people to be around! I had a huge list of people in my sig at one time as my HF family, and later a topic in the old Testing forum...but when that Testing forum disappeared, so did my topic! But the above mentioned are exceptional, I think <3\n\n[b][color=#1466ff]Michael Westen[/color][/b]: It's great to see such Camaraderie between members! I think that wraps it up for me, do you have anything you'd like to say the members of Hack Forums?\n[b][color=#1466ff]iceybunneh[/color][/b]: I totally miss talking to all the great people, especially all the regular Innuendo people. I hope things are running smoothly there, in addition to all the rest of the forums! HF is a kind of home for me online and I miss it greatly :D\n[b][color=#1466ff]iceybunneh[/color][/b]: Also, many thanks to the interview team. it was quite a pleasant surprise to get asked for an interview ;]\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definitely, it was my pleasure! Thanks again!\n[b][color=#1466ff]iceybunneh[/color][/b]: Thank you so much! <3\n[/spoiler]\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/horoscopes.png[/img]\n[size=xx-small][i]These horoscopes were not written by us as we don't have the ability nor knowledge to do so.[/i][/size][/align]\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aquarius:[/font][/size][/color][spoiler=]\nYou have the ability to now to make a dramatic change to someone else's situation and this \nmight involve giving your heart. It could involve giving in other ways. In any case, a small \ngesture on your part could completely transform a situation causing tension or anxiety in \ncertain quarters. Before committing or making a gesture, be sure you're in a position to deliver \nwhat you're promising. If you can, a permanent and positive change within a relationship can \noccur.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Pisces:[/font][/size][/color][spoiler=]\nMany people with wonderful, creative ideas struggle to make them happen because they're unable \nto transfer thoughts or images in their head into something real and tangible. What they see in \ntheir mind doesn't become something they see with their eyes for many reasons. You know in your \nmind what you want to happen but are being prevented from making it happen due to certain \nrestrictions. The sky insists an idea pursued now will find its own way of manifesting.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aries:[/font][/size][/color][spoiler=]\nSome people believe there is no problem on Earth that money cannot solve. There are enough clichés \nsurrounding money's inability to buy love but you appear to be in a situation regarding someone close \nto you that would be enhanced greatly if only more funds were available. You have other resources \navailable to bring someone closer. Try investing in the sky's ability to work a small miracle.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Taurus:[/font][/size][/color][spoiler=]\nWe often hear people described as 'born' salesmen or 'born' leaders. Nobody is born possessing any \nsuch abilities. These are formed over time through learning curves and life experiences. Becoming \n'good' at something requires desire to learn how to do something and remain dedicated to learning \nover a period of time. Don't be hard on yourself if there is something you believe or have been told \nyou can't do. You can do it. You just haven't learned how to do it – yet![/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Gemini:[/font][/size][/color][spoiler=]\nIt's interesting how people reply when asked what they love about someone close to them. Immediate \nresponses usually involve traits or characteristics about the person they like or adore. People aren't \nusually as quick to say how proud the person makes them feel. Your feelings for a certain person run \ndeep but it might only be occurring to you how proud you are to know or be with them. Remember that \nwe tend to regret only what we don't do or say in life.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Cancer:[/font][/size][/color][spoiler=]\nHelp from certain quarters would be appreciated. That's not to say your world is devoid of assistance \nbut where one person appears to be quick to lend a helpful hand, you appear to be encountering resistance \nor complete lack of willingness from someone else to do their bit. In the same way crabs willingly carry the \nburden of a shell upon their backs, you could be inclined to take on more than your fair share of a task now. \nDo not be afraid to speak up or delegate.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Leo:[/font][/size][/color][spoiler=]\n'Why's everybody always pickin' on me?' So sang The Coasters and, more recently, The Bloodhound Gang. \nCurrent influences could be causing you to believe you can do nothing right in some peoples' eyes. For every \none step forward you take, addressing issues or placating certain people causes a step backward to be taken. \nThis is all part of a leadership role you've recently adopted. Try not to resent how much others are looking to \nyou for answers now.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Virgo:[/font][/size][/color][spoiler=]\nI could be lazy and insert today's forecast for Aries in this space because of how similar your forecasts are. \nDoing so probably wouldn't help put your mind at ease about a financial issue that has presented itself. An \nopportunity has presented itself that requires more funding than your bank balance will allow. You are, \nunderstandably, considering letting the opportunity pass you by. Have faith in the fact that financial help \ncould come from the most unexpected quarters.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Libra:[/font][/size][/color][spoiler=]\nWhen we pursue particular plans of action, it's usually because we've had time to weigh up and think through \nthe implications of what we're considering doing. Whilst we all act impulsively sometimes, pretty much everything \nwe do is determined by a thought process first. When other people see only the action itself, they don't understand \nhow much thought we have given it first. Be prepared to justify an action to someone now.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Scorpio:[/font][/size][/color][spoiler=]\nPeople often dip their toe in pool water or put their hand under a streaming shower to gauge temperatures. In a \nsimilar way, you appear to be 'testing' something – or possibly, someone – now. You seem keen to ensure you \ndon't make a move before ensuring the temperature is right to step into. Even if there is an initial cold shock before \nyou acclimatize to warmth, you can trust it won't last long and what you're stepping into will bring comfort not \nexperienced in some time.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Sagittarius:[/font][/size][/color][spoiler=]\nAny questioning process that requires an immediate answer relies on the right sort of questions being asked. Police \ninterrogators tend not discuss the weather with suspected criminals. Salespeople aren't usually willing to discuss \ncompetitors' products in length with potential customers. You now need to take control of a discussion process before \nit goes off on unhelpful tangents. They way to do this is to ask questions you really want answers to.[/spoiler]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Capricorn:[/font][/size][/color][spoiler=]\nIf something is to change for the better, then realistic time must be allowed for the change to occur. You are becoming \nimpatient with how much time something is taking to show signs of improvement. You appear to be bracing yourself for \nhaving to return to Square One due to a setback. You could only see what is happening at a basic level. Trust there is \nmuch going on in the background that will bring relief very soon.[/spoiler]\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/news.png[/img][/align]\n[list]\n[*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/hyBHH]cartel[/url][list]\n[*]Headlines[/list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list]\n[*][url=http://goo.gl/jZvPh]TheHackersLove[/url][list]\n[*]World News\n[/list]\n[/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/JJuWm]Daniel Faraday[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/gGUxd]Astonish is NJ[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]\n\n[align=center][img]http://i432.photobucket.com/albums/qq50/tasemu/Hf%20News/notices.png[/img][/align]\n\n[list][*]The News will be posted every Wednesday, so if you are in a time-zone different from the Pacific time-zone, it will probably come out on Thursday for you.\n[*]We had a new writer this week take over Headlines, thank you cartel. There was just some miscommunication between the Writers, but it's all good now.\n[*]The HF News team feels that this is the best News edition to date, please give your feedback![/list]",
      "subject": "*"
    }
  ]
}