{
  "posts": [
    {
      "pid": "20589713",
      "uid": "515249",
      "dateline": "1331176163",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]82nd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]New group[/b][/color]\nThe new and very secretive group Illuminati has recently been opened under the leadership of BELLAGIO. The group seems to be based on monetizing, and other money making methods. At the moment the group is strictly invite only and there has been no information suggesting that they will ever be opening recruitment. To view Omniscient's tweet announcing the new group click the following link: [url=goo.gl/h9wlB]goo.gl/h9wlB[/url]\n\n[color=white][b]Ban on MC account deals[/b][/color]\nOmniscient recently banned all discussions and sales related to selling minecraft accounts on HF. This new rule will be in effect in all sections of the forum, also all previous threads relating to this subject have been junked. This new rule is most likely due to the increase in account sales in the past few weeks. To view Omniscient's thread regarding the new rule click the following link: [url=goo.gl/OjFGy]goo.gl/OjFGy[/url]\n\n[color=white][b]Reputation recount[/b][/color]\nEarlier this week the reputation has been recounted by Omniscient. This isn’t anything major however it may have caused a few reputations to be removed so if you are having a problem it’d be best to contact a staff member for help. To view Omniscient's tweet about the recount click the following link: [url=goo.gl/H1jZ1]goo.gl/H1jZ1[/url]\n\n[color=white][b]MOTM Winner[/b][/color]\nHF’s most loved transparent member, Glassy, has won the MOTM award in an extremely close race with Viral Dragon. After several nominations this member has finally achieved this award so congratulations Glassy. To view this month's MOTM thread click the following link: [url=goo.gl/60qKE]goo.gl/60qKE[/url]\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=588781][b][color=#0066FF]Hуѕтєяιa X™[/color][/b][/url] was rep fucked because he kept asking JD to RF him.\n[url=http://hackforums.net/member.php?action=profile&uid=879431][color=black][b]Dr. Wily[/b][/color][/url] has requested to banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=306832][color=black][b]CORPSE.[/b][/color][/url] was banned and rep fucked for reputation abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=964996][color=black][b]P2thedr™[/b][/color][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=752389][color=black][b]eiqhtworks[/b][/color][/url] was banned for LQP.\n[url=http://hackforums.net/member.php?action=profile&uid=938306][color=black][b]Date[/b][/color][/url] has requested to banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=273264][color=black][b]xan0nym0usx[/b][/color][/url] was banned for UB3R junk abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=498988][color=black][b]P!nk[/b][/color][/url] has requested to banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=542514][color=black][b]Thoth[/b][/color][/url] was banned and rep fucked.\n[url=http://hackforums.net/member.php?action=profile&uid=543303][color=black][b]DestinyCoder[/b][/color][/url] has requested to banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=492095][color=black][b]Levi[/b][/color][/url] was banned for LQP.\n[url=http://hackforums.net/member.php?action=profile&uid=371340][color=black][b]Ensain[/b][/color][/url] has requested to banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=816875][color=black][b]Daring[/b][/color][/url] was banned and rep fucked for assisting a ban evader.\n[url=http://hackforums.net/member.php?action=profile&uid=1034361][color=black][b]Nazzr[/b][/color][/url] has requested to banned while on vacation.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Application Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2260887&pid=20442754#pid20442754]HF on Iphone?[/url] - [url=http://hackforums.net/member.php?action=profile&uid=831753][color=#0066FF][b]GamersGodly[/b][/color][/url] - For those who are interested in a mobile application, Omniscient has just announced that he is working on one for public use.\n\n[i][b]Tutorial Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2282718][Respawn] HD PVR Quality Tutorial [Respawn][/url] - [url=http://hackforums.net/member.php?action=profile&uid=620668][color=white][b]Renowned[/b][/color][/url] - For those of you who have an HD PVR and don't know how to use it correctly, this tutorial will help you understand what you need to do.\n\n[i][b]AV Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2244713]Anti-Virus Megathread: The Ultimate Guide To Protection [Includes recommended AVs][/url] - [url=http://hackforums.net/member.php?action=profile&uid=195796][color=#0066FF][b]phybeя[/b][/color][/url] - This is a compilation of everything you need to know about AV, it's a great guide.\n\n[i][b]Userscript Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2282161][HF Userscript] Post Preset[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1114432][color=white][b]PyroStorm[/b][/color][/url] - If you've ever wondered how to have preset text in your replies, this will show you have you can do it yourself.\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Renowned[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Renowned! Thanks for taking part in this interview! Before we begin, would you like to give a shoutout to any special members?\n[b][color=#1466ff]Renowned[/color][/b]: Hey,  yes I would like to shoutout to Legacy, Confuse, Bugga and M@$K.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Are you sure you're not forgetting anyone? :)\n[b][color=#1466ff]Renowned[/color][/b]: I could be forgetting someone but seeing as you're interviewing me, I'm sure you don't need a shoutout. ;)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fair enough <3 So Renowned, how did you find Hack Forums?\n[b][color=#1466ff]Renowned[/color][/b]: Well that's a question I've asked myself a lot recently, I'm sure I actually randomly stumbled across it. I was looking for ways to hack Xbox Live (Immaturity level was sky high) anyway, I came across HF and I've stayed for the community.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I know from experience that you are very active in the Call of Duty, Xbox, and Video Editting sections - Would you consider those your passions?\n[b][color=#1466ff]Renowned[/color][/b]: My passion is gaming, it's been something I've loved since I can remember. I always wanted to become someone who people wanted to game with, so I bought myself a PVR. That's where the video editing came along, I'm hoping by becoming good at video editing and making videos people like. I'll become someone people want to be around when gaming, someone people enjoy watching. Although I'm not very active in the Video Editing section, I'm sure soon enough it will be my favoured section.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: You certainly are a great person to game with, I miss our HLG days. We should bring those back sometime for shits and giggles. What would you consider your favorite game?\n[b][color=#1466ff]Renowned[/color][/b]: Oh yes our HLG days, we had some good fun then. We definitely should bring them days back! My favorite game at the moment has to be Battlefield 3, for some reason I'm becoming more attracted to the larger maps and destruction. Don't get me wrong though, I absolutely love Modern Warfare 3 for close quarters. Battlefield just has a more subtle approach to entertainment, whereas Call of Duty is more in your face and sharpen your reflexes.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I'd still have to say Counter Strike: Source and Garry's Mod are my favorite. Simple! No killstreaks, no overpowered weapons - Just fun! I hear you were recently accepted in a group, would you care to talk about that?\n[b][color=#1466ff]Renowned[/color][/b]: I've never actually had a chance to play either of those games, when I get some more money you'll have to show me around them. ;) Yeah I was accepted into Respawn, a pretty fitting group for someone like me. Especially as I've already told you that gaming is my passion, my escape and definitely my favorite thing to do.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That's great! You'll definitely be a big contributor in that group! If you were admin on Hack Forums for 24 hours, what would you do?\n[b][color=#1466ff]Renowned[/color][/b]: That's a very hard question, I honestly don't know if there would be much I can do to benefit HF. So far I think the current Administrators are doing a pretty good job, I'm pretty glad Factor8 got admin. He's always been a fair guy. If I had to change something though, I would remove the reputation system. It causes too much hate and flame between members, other members also get judged and abused for having low reputation. I would also stop Omni from creating the new P0W3R group, with ub3rs having the ability to -5 the reputation system will be even more abused. \nStill I'm sure the current admins will do something to prevent things like that happening.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That would prove to be interesting - As for myself, I would assemble a special group of Staff to handle scam reports. I think scams are one of the worst aspects of Hack Forums, and the internet in general. How did you come up with your username?\n[b][color=#1466ff]Renowned[/color][/b]: I would actually like to see something like that also, scams reports are always popping up on HF. It's a shame to see it happen to so many members. Well after having the username iKraZee for such a long time I wanted something a little smarter. I'm not even sure why but the word Renowned popped into my head, and I chose that. Also to everyone who wants to laugh at me, check my username history I misspelled the first time. ;)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: A little ironic that you misspelled something while trying to choose something smarter :P That about wraps it up for me, do you have any final words for the readers?\n[b][color=#1466ff]Renowned[/color][/b]: It really is, never mind though I laughed at myself when I realized. You can also hardly talk, you thought it was spelled the way I did also. ;)  Thanks for interviewing me Michael Westen. I don't have anything else I would like to say other than thank you for reading, I hope that soon we can game together. :)\n[/spoiler]",
      "subject": "[3/7/12] - HF News"
    },
    {
      "pid": "20589795",
      "uid": "515249",
      "dateline": "1331176405",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]The new iPad[/b][/color]\nApple recently released its latest iPad.  There are many new features with this revolutionary new tablet including a breakthrough in retina display with 3.1 million pixels which are powered by the new A5X chip, a 5MP iSight camera with advanced optics, a backside illumination sensor, auto white balance, face detection, and 1080p HD video.  Not only was the hard ware upgraded, but there are over 200,000 iPad apps on the AppStore, and Ultrafast 4G LTE has finally been introduced allowing you to browse the web at amazing speeds.\n\n[color=white][b]Kony 2012[/b][/color]\nWhether you saw it on YouTube, Vimeo, or Facebook, 'Kony 2012', 'Cover the Night', and 'Invisible Children' has gone viral.  This organization seeks to bring attention to Ugandan terrorist, Joseph Kony, in effort to provoke US interference with the group.  Kony is a warlord and leader of a rebel army, and for decades, he has been kidnapping tens of thousands of children, only to used them as forced labor, soldiers, and sex slaves.  The Invisible Children is an organization which recently created a promotional video on YouTube and Vimeo which quickly went viral and spread alert to this issue.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[color=white][b]The iPad 3 (Officially known as The New iPad) was released today.[/b][/color]\nAnd as some rumors have said it has a retina display, a brand new dual-core processor. It’s mostly like the iPhone 4S, as in just hardware changes. The iPad 3 has a new 5-MPS-rear camera and with the release of the new iPad, iOS 5.1 has been released. This update doesn’t change much expect an addition of the language Japanese to Siri and the new Lockscreen Camera has been updated.\n\n[color=white][b]Apple TV has been updated.[/b][/color]\nThe rumors for an iTV are still going on because all Apple did was update their current Apple TV and add a new UI to it. The new Apple TV is still at the introductory price of $99. Their may still be a release of a new iTV later this year. Walter Isaacson, author of “Steve Jobs” mentioned that he left out details from Steve Jobs Biography/Autobiography because he wanted Apple to release the news and he thought it would be more respectful that he didn’t release that information.  \n\n[color=white][b]The FBI has captured the leader of L'ulzSec(Anonymous.)[/b][/color]\nHe was captured in an iRC room where Sabu (leader of -L'ulzSec-) forgot to mask his IP. From there, the FBI has been following him. They moved in really fast to stop Sabu from deleting any of his hard drives. Sabu turned on all of -L'ulzSec- and betrayed them. The FBI is now trying to hunt down for the other people.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]Madonna[/b][/color]\nMadonna's \"Girl Gone Wild\" hit the iTunes store on March 1st. This new single is headed for the Billboard Hot 100 this week.\n\n[color=white][b]An Odd Combo[/b][/color]\nLimp Bizkit and Lil Wayne are releasing a new single titled \"Ready To Go\". It will be released online this week.\n\n[color=white][b]What Doesn't Kill You[/b][/color]\nThe two month old song by Kelly Clarkson, Stronger (What Doesn't Kill You) is currently number one on the billboards.\n\n[color=white][b]Davy Jones' Locker[/b][/color]\nThe family of the late Monkees singer, Davy Jones plan to have a private funeral for him in Florida where he died on February 29th.\n\n[color=white][b]Music Videos of the Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=9iCd6UHR-3I&ob=av3n[/yt]\n[yt]http://www.youtube.com/watch?v=Xn676-fLq7I[/yt]\n[yt]http://www.youtube.com/watch?v=cimoNqiulUE&ob=av3e[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nRead your horoscopes, put faith in something. You'll be surprised of what you can accomplish with your mind. Things have a way of following what you believe and put your thoughts on, so read your horoscopes. They may help you more than you think. - Sorry it was short.",
      "subject": "*"
    },
    {
      "pid": "20589854",
      "uid": "515249",
      "dateline": "1331176568",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"Which do you prefer? Moderation or Staff, why?\"\n\n[i]\"I think that staff is better because when you are staff, you can\n control the whole forum in some way not just an alone section. I think\n also that being a Staff will make you do your best to protect this\n community by cleaning the entire forum, rather than just being a moderator\n and not even taking an action in your forum. I wish that the actual moderators\n such as Hysteria X will do some work in their sections rather than just not\n even looking at the forum. Thanks.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=509788][i]-Makaveli The Don[/i][/url]\n\n[align=right][i]\"Which do I prefer? If you're asking which I'd prefer to be I would say\n staff. I would say this because staff are looked up to, they are the face of the forum\n and I'd love to be faced with such responsibilities and attention that is brought to them.\n Now, will I ever receive staff? I very much doubt it however I'm here if you need me\n Omniscient ;).\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=298746][i]-Grammar Rays[/i][/url][/align]\n\nThe topic for next week is \"How do you feel about KONY 2012?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/L6AUj.jpg[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3190469_460s.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3191360_460s.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=MNQhFOQ4kRM[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=128873][b][color=white]T3h Hack3r[/color][/b][/url] resigned from staff.\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b][color=white]Positive[/color][/b][/url] received the  Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b][color=white]Positive[/color][/b][/url] received the Cool award.\n[url=http://hackforums.net/member.php?action=profile&uid=900087][b][color=white]Starstruck[/color][/b][/url] received the Frog award.\n[url=http://hackforums.net/member.php?action=profile&uid=1092620][b][color=white]LK)[/color][/b][/url] received the  Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=749834][b][color=#0066FF]Ancient Productions[/color][/b][/url] received the Cool award.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Innocence.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}