{
  "posts": [
    {
      "pid": "11335879",
      "uid": "295848",
      "dateline": "1303316339",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFmainbanner.png[/IMG][/align]\r\n\r\n[color=#98FB98][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\r\n\r\nThe edition you are currently reading is the [b]38th full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\r\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFheadlines.png[/IMG][/align]\r\n\r\n[align=justify]Tomorrow, April 21st, marks Hack Forums' fourth anniversary. This site has gone through many changes in this time, and has seen many good members come and go.\r\n\r\nSpring break or Easter holidays as some like to call it, have put quite a bit of stress on the current HTTP servers. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] has announced he will be purchasing a new server this week that should solve the slow loading time issues. You can read more about that [url=http://hackforums.net/showthread.php?tid=1221172]here[/url].\r\n\r\nDue to the increase in activity, Hack Forums has had quite a bit of downtime lately as we have all noticed. This should be taken care of shortly, when the new server arrives.\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=101228][color=#0066FF][b]Tate[/b][/color][/url] has created a thread titled [b]Reputation Unveiled: A Horrible Addiction[/b], which provides an in-depth, yet humorous explanation on the darker sides of online reputation. If you dare read it, the full story can be found [url=http://hackforums.net/showthread.php?tid=1205986]here[/url].\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=#0066FF][b]Paradoxum[/b][/color][/url] has been promoted to a leader of the Reviewers.  \r\n\r\nThere is a new trend sweeping the [url=http://hackforums.net/forumdisplay.php?fid=12]Bragging Rights[/url] section in which members are creating full achievement and goal lists, instead of making new a new thread every time they reach one of their milestones. A few of the notable ones are the ones made by [url=http://hackforums.net/showthread.php?tid=1158570]Cняιs ★ Hуѕтєяιa X™[/url], [url=http://hackforums.net/showthread.php?tid=1212005]panDa.[/url], [url=http://hackforums.net/showthread.php?tid=1174693]Qwazz[/url], [url=http://hackforums.net/showthread.php?tid=1166994]Xypher[/url] and [url=http://hackforums.net/showthread.php?tid=758584]-paradox-[/url].[/align]\r\n\r\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFusernews.png[/IMG][/align]\r\n\r\n[align=justify]The accounts of [url=http://hackforums.net/member.php?action=profile&uid=77274][color=#0066FF][b]Anubis™[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=89623][color=black][b]Mark Webber[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=488102][color=black][b]Господин[/b][/color][/url]  have all been compromised this week. You may read more about the Mark Webber issue in [url=http://hackforums.net/showthread.php?tid=1216218]this[/url] thread.\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=73200][color=black][b]Hack - Forums[/b][/color][/url] has been banned for 6 months due to large fraudulent donations.  \r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=36878][color=black][b]iBored1x1[/b][/color][/url] has received a two week ban for leaking other members programs; he will return on the 27th of this month.\r\n\r\nCongratulations to [url=http://hackforums.net/member.php?action=profile&uid=128873][color=white][b]T3h Hack3r[/b][/color][/url] on his recent promotion in the HJT Team, he is now an undergraduate. After quite a bit of time and devotion to the team he has obtained this rank. [url=http://hackforums.net/member.php?action=profile&uid=70909][color=white][b]AsSaSs@iN[/b][/color][/url]'s official statement can be read [url=http://hackforums.net/showthread.php?tid=1209917]here[/url]. \r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=36418][color=white][b]Lord_Sinister[/b][/color][/url] has released a new dubstep radio station, that will be playing music twenty-four hours a day, seven days a week. So if you need something to listen to check out Lord_Sinister's music main page [url=http://www.sinister-radio.info/]here[/url].\r\n\r\n[color=white][b]Volenar[/b][/color] has added another tutorial on Windows 7 to his collection. So far he has three of them and is planning on making more. If you would like to check them out here's the [url=http://hackforums.net/showthread.php?tid=1193349]first[/url], [url=http://hackforums.net/showthread.php?tid=1188420]second[/url] and the [url=http://hackforums.net/showthread.php?tid=1190685]third[/url].\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=480356][color=#0066FF][b]Johnny Test[/b][/color][/url] has been moved into the Dead Account user group for an unknown reason, thus announcing his leave from Hack Forums. \r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=163196][color=#ffcc00][b]Sickshot[/b][/color][/url] has been reinstated to his HF L33T status. He was from the Dead Account user group. This is a very rare occasion, being that such a thing has only happened once before. \r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=137645][color=#0066FF][b]mothered[/b][/color][/url] almost has 2,000 reputation points; he is second on this site for having the most reputation points. Top on the list is of course, our only head Administrator, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url].\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=109620][color=#0066FF][b]Mike.[/b][/color][/url] has appealed his ban, and has had it revoked. He has also been repfucked, losing 600+ reputation points.\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=300616][color=#0066FF][b]Thoth[/b][/color][/url] is finally warning-free! Now the question on everyone's mind is how long will it last?\r\n\r\nAccording to a recent poll created by [url=http://hackforums.net/member.php?action=profile&uid=21113][color=#0066FF][b]:'D[/b][/color][/url], a vast majority of Hack Forums members consider themselves atheists or agnostics, when asked about their views on religion. If you would like to place your vote do so [url=http://hackforums.net/showthread.php?tid=1196599]here[/url].[/align]\r\n\r\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFothernews.png[/IMG][/align]\r\n\r\n[align=justify][list][*][color=pink][b]April 15th marks OnlineCrypter's 8th monthsary.[/b][/color][/list]\r\nThey are now ranked [b]number one[/b] on Google for more than five keywords. On March 15th the whole service was rebuilt and secured. [url=http://onlinecrypter.com/]OnlineCrypter[/url] with more than 3,000 registered users, and over 600 orders in the past month, had their service become quite popular. Take note that the latter was founded by four of Hack Forums' very own members, those members being [url=http://hackforums.net/member.php?action=profile&uid=53264][color=#ffcc00][b]bK[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=4792][color=#0066FF][b]Cracker666[/b][/color][/url],  [url=http://hackforums.net/member.php?action=profile&uid=345384][color=#ffcc00][b]OnlyTheChosen[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=89332][color=#0066FF][b]Synurgy[/b][/color][/url]. For those who don't know much about OnlineCrypter, it first originated in hopes to sweep the scene of a newfound high quality service to be brought to everyone all across the Web. The goal was to offer an all-in-one service with a low cost without the need of downloading material from untrusted sellers. They are now in the midst of talking with big companies to work out a yearly subscription, and smaller companies for high-end personal use for private engines and custom setups. Their official website is http://onlinecrypter.com/ for those that are interested in using their service(s). \r\n\r\n[list][*][color=pink][b]As many people already know today is April 20th (420). Also known as International Marijuana Day, but do you actually know its origin?[/b][/color][/list]\r\nThe term 420 originated at San Rafael High School, in 1971, among a group of about a dozen pot-smoking wiseacres who called themselves the Waldos, who are now pushing 50. The term was shorthand for the time of day the group would meet, at the campus statue of Louis Pasteur, to smoke pot. Intent on developing their own discreet language, they made 420 as a code for a time to get high, and its use spread among members of an entire generation. While our parents feel that they know something we don't, you can let them in on the fact that it was your generation that came up with the numbers. If you would like more information on this subject click [url=http://www.snopes.com/language/stories/420.asp]here[/url].[/align]\r\n\r\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFinterviews.png[/IMG][/align]\r\n\r\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - Xch4ng3[/color][/font][/size]\r\n[spoiler]\r\n[align=justify][color=white][b]ROCKST★R:[/b][/color] Hello Xch4ng3, thanks for agreeing to take part in an interview for Hack Forums news I am sure this will be fun for both of us. 😁\r\n\r\n[color=white][b]ROCKST★R:[/b][/color] When you first joined the forum were you a skid so to speak?\r\n[b][color=lime]Xch4ng3:[/color][/b] Hate to sound cocky, but no. I knew what I was doing - and rather than just clicking and achieving an effect, I wanted to understand how something worked.\r\n\r\n[color=white][b]ROCKST★R:[/b][/color] As a staff member what changes have you seen Hack Forums under go throughout the years?\r\n[b][color=lime]Xch4ng3:[/color][/b] I've been here from HF's early years. Not as early as the previous staff members but about a year in. I've seen the introduction of Ub3r (Carbon and a few others being the lucky early ones.), rise and fall of staff members, new sections, and HF's massive growth from a minor forum (where I was able to post in almost every thread when I could) to where I now only contribute to about 0.01 of total post count. (:\r\n\r\n[color=white][b]ROCKST★R:[/b][/color] You were recently re-added to Staff. What do you have to say on this topic?\r\n[b][color=lime]Xch4ng3:[/color][/b] Just glad to be back. Even though I conduct business on HF, I only really spend time doing reports and helping members out. Posting in threads doesn't serve that much of a purpose to me, I find myself repeating things a lot.\r\n\r\n[color=white][b]ROCKST★R:[/b][/color] Who on forum do you find to have the highest quality posts. Also who do you think has the lowest quality?\r\n[b][color=lime]Xch4ng3:[/color][/b] SRRP for highest. A lot of well thought out responses and as for the lowest - I don't really have one. For a while it was the Botnet/IRC section due to everyone thrashing threads about CP bots, I think every section in HF is now pretty HQ, especially after the removal of warez threads.  \r\n\r\n[color=white][b]ROCKST★R[/b]:[/color] What is your favorite section on Hack Forums? Least favorite?\r\n[b][color=lime]Xch4ng3:[/color][/b] Favorite would be Marketplace, I love business and I often spend my spare time hand moderating that little section. \r\n\r\n[color=white][b]ROCKST★R:[/b][/color] What are you goals? I see you have no awards and you don't speak of awards nor goals. \r\n[b][color=lime]Xch4ng3:[/color][/b] I don't have any particular goals at the moment. I don't really mind awards, if Omni sees fit he'll assign me them. I don't really need an icon to remind me of my achievements but hey, if it's shiny and pwetty hand it over!\r\n\r\n[color=white][b]ROCKST★R:[/b][/color] As a staff member is there any helpful advice you can give the new members of Hack Forums? \r\n[b][color=lime]Xch4ng3:[/color][/b] Read the rules, seriously. I've been on the brink of rage sometimes because people can't follow rules. Unlike other forums, I think this is a pretty unique one. I've seen people go from normal members to staff and normal members to fairly well off people - all thanks to HF. Why give up the chance? This is a great place, whether to just have some fun in the Lounge, to make money from your skills or to learn about the workings of a particular aspect of computing. We have people cloning HF - goes to show much they love us. 😝 \r\n\r\n[color=white][b]ROCKST★R:[/b][/color] Thank you for participating in a HF News interview.[/align][/spoiler]\n\n \n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - flAmingw0rm[/color][/font][/size]\n[spoiler][align=justify][color=white][b]ROCKST★R:[/b][/color] Hello flAmingw0rm, I'm going to ask you a few questions for the HF News. Why did you join Hack Forums?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] Well, I've been browsing Google for some hacking tutorials and I've came across many forums and I've been on all of them, but Hack Forums inspired me the most. It was the most active of all and the most of content on HF was very useful to me, so I decided to register and stay on this forum.\n\n[color=white][b]ROCKST★R:[/b][/color] Who were your first friends on Hack Forums if you had any?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] My first friend on Hack Forums was The 7th Sage. He taught me everything, from the beginning to the end, explained me about Hack Forums, how does it work and so on. I met him the first days I registered HF and I'm very thankful to him. His account is currently closed, but we are still able to talk on MSN and his forums.\n\n[color=white][b]ROCKST★R:[/b][/color] What is different about Hack Forums now from when you joined?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] Well, a lot of changes happened on Hack Forums since I joined. Firstly, the reputation changes and repfuck add. Before you were able to ask for reputation when you giveaway items or anything else. The Runescape (all discussion banned on HF) section removal due to many people bragging how many accounts they hacked and not discussing about the game itself, and many others. The only change that never happened, but most of people want it is banning scammers.\n\n[color=white][b]ROCKST★R:[/b][/color] You have accomplished a lot but do you have any goals on Hack Forums? Awards, rep, posts?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] I don't have any goals on Hack Forums. I'm here to learn new things, help members, make friends... Awards, reputation, posts don't mean really much to me. This may sound a bit silly, but I had a goal to get into the Staff, but it seemed like impossible so I gave up.\n\n[color=white][b]ROCKST★R:[/b][/color] What is your favorite section on Hack Forums? Least favorite?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] I don't have any favorite section to be honest, I just browse for new posts/threads whole time I am on Hack Forums. However the sections I browse the most are the Hacking and Coding sections, because they interest me the most.\n\n[color=white][b]ROCKST★R:[/b][/color] Are there any members on Hack Forums that inspire you or that you look up to?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] Well, there are many members on Hack Forums which are very knowledgeable, but right now I can't name any of them.\n\n[color=white][b]ROCKST★R:[/b][/color] If you had the power to change one thing on Hack Forums what would it be?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] Well, the first change I would make is add a rule to ban scammers. That's the only change I could think of right now. Maybe I would allow posting of dumps. 🙂\n\n[color=white][b]ROCKST★R:[/b][/color] What advice would you give to the new members of Hack Forums?\n[color=#0066FF][b]flAmingw0rm:[/b][/color] I would advice to new members to be high quality as much as possible and don't cry if they get a negative reputation because that would lead them to getting more negative reputations. Just don't complain about anything by making threads, PM Staff instead.\n\nThank you for interviewing me. 🙂[/align][/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 3 - Paradoxum[/color][/font][/size]\n[Spoiler][align=justify][color=white][b]Chick-Fil-A:[/b][/color] Hello Paradoxum, thank you very much for your time!\n[color=#00BFFF][b]Paradoxum:[/b][/color] Looks like we've an energetic interviewer. I thank you as well, for selecting me.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Would you like to make any shout outs, to your favorite members on Hackf Forums?\n[color=#00BFFF][b]Paradoxum:[/b][/color] I have a few favorites; most of them are in The Alliance. I would not disclose them separately, but I'd rather include the ones I am rather fond of. I suppose I'd just like to tell them I am back. I have been gone for quite a long while. The following are: --([-S7N-])--, AsSaSs@iN, cobija, Factor8™, Hawkins, iBruteforce, Itachi Uchiha, Kaden, kutmustakurt, Magiic™, NaDe, Notorious Mental, Panik, Saged (don't smirk at me, Fred), Soldier of Fortune, Skill, Verdande, Xch4ng3, Xypher. I'll let you guess my utmost favorite member.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What is your view on the quality of posting in 'The Lounge'?\n[color=#00BFFF][b]Paradoxum:[/b][/color] Honestly, I haven't been there for a long time. I find it funny that this always gets asked, as if The Lounge is the most rotten part of this forum. With that being said, I'll go check. [i]Mh-hm... a pizza threat, one having problems because he had too many stealer logs, a rant regarding the quality of the forum and a guy wanting to get his e-peen hard.[/i] [s]I find it funny that this always gets asked, as if The Lounge is the most rotten part of this forum.[/s]\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you feel as though you are a quality member, and your profile reflects that?\n[color=#00BFFF][b]Paradoxum:[/b][/color] I'm not going to boost my online ego. My profile can be amazing to look at, but it does not mean much, really. I would be proud should these achievements account to anything in real life. About the quality, I try to be what is expected of every member. Posting properly is not hard at all, and it is a useful habit to keep. Oh, English isn't your main language? Lots of people here, who have a good--or even excellent--command of the English language aren't even identified as people whose mother tongue is English. Myself being one of them.\n\n[color=white][b]Chick-Fil-A:[/b][/color] You have 8 awards, which is very respectable, care to explain how you achieved them?\n[color=#00BFFF][b]Paradoxum:[/b][/color]\n[list][*]Sapphire of Ub3r[list]\n[*]Verdande and Kaden bought me HF Ub3r. <3[/list]\n[*]Emerald Donator[list]\n[*]Skill gave me this. <3[/list]\n[*]Silver Medal[list]\n[*]I don't exactly know. I just finished posting something when I saw this. Apparently, it was for, \"High quality posting all over the forum. A great help.\"[/list]\n[*]White Hat Helper[list]\n[*]I was once a full-time bot at the HijackThis and White Hat Help section.[/list]\n[*]The Protector[list]\n[*]And was also once a full-time reporting bot. Reported Posts: 3968.[/list]\n[*]Support Feather[list]\n[*]Yeah.[/list]\n[*]Rich Bitch[list]\n[*]I donated $100. It was a way of thanking this forum.[/list]\n[*]YouTube[list]\n[*] http://www.youtube.com/watch?v=fOnlWQ_tgC8[/list][/list]\n[color=white][b]Chick-Fil-A:[/b][/color] So you're the leader of 'The Alliance', do you enjoy being a part of such a great group?\n[color=#00BFFF][b]Paradoxum:[/b][/color] Skill has recently passed ownership to me. I will, however, always consider him as the founder. And yes, The Alliance is what I call my Hack Forums family. I pride myself in leading a crew of people who share the same faith. Another, they are active but not at a hazardous level.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What type of leader are you? Organized, Strict, Helpful, etc.?\n[color=#00BFFF][b]Paradoxum:[/b][/color] You can ask our members. 😝 I am betting more on strict, though organized is also one. We have threads for everything. \n\n[color=white][b]Chick-Fil-A:[/b][/color] You're also a Leader of 'The Reviewers', how do you feel about that group?\n[color=#00BFFF][b]Paradoxum:[/b][/color] It is an official site crew hence my actions and decisions regarding it are always well thought out. It represents the forum in general so I am more careful and stricter when it comes to it.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What were your feelings when you learned you've been selected to lead the The Reviewers?\n[color=#00BFFF][b]Paradoxum:[/b][/color] I was positively shocked. I've just been recently promoted and I have never thought of earning the position.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Which group do you feel is more respectable, 'The Alliance', or 'Official Reviewers'?\n[color=#00BFFF][b]Paradoxum:[/b][/color] I cannot say. Both are respectable in their own way. I move that no comparison be made.\n\n[color=white][b]Chick-Fil-A:[/b][/color] If you could give a 'Member of the week' award, whom would you give it to?\n[color=#00BFFF][b]Paradoxum:[/b][/color] Member of the Week? That is tough. I can only answer this if I can monitor everyone. Well, Qwazz then, obviously.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you think HackForums has changed you in any ways?\n[color=#00BFFF][b]Paradoxum:[/b][/color] It has. I've developed better communication skills (does it sound wrong?), I've been more mature and I learnt what priority really means. There were times when I had to take care of a lot of logs, and my exams were coming the next day. I honestly worried of it, because I do not take these lightly. People needed help. But I chose what I should. Now, I can easily make decisions (shut up, it doesn't concern the Internet anymore) simply because of learning what to give up.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Have your contributions to Hackforums made you feel like they are worth it?\n[color=#00BFFF][b]Paradoxum:[/b][/color] I feel half-hearted. As I've said, I have been very busy with my life and I have decided to give Hack Forums up. That is why I was gone for many months. In the sense that it taught me life lessons, yes. However, when it comes to the pressure it gave, then no. I considered this as my job and it was ridiculous that I did. Oh well.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Any final statements?\n[color=#00BFFF][b]Paradoxum:[/b][/color] Go make me a sandwich. Seriously, don't go nuts at Hack Forums, especially when Omniscient has to do his daily 5-minute maintenance.[/align][/spoiler]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFWebshow.png[/IMG][/align]\n\n[align=center][yt]http://www.youtube.com/watch?v=FC4AERM6uHc[/yt][/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFcredits.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url][/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=133256]Xypher[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url][/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=380661]Mango![/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url][/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=92059]Chick-Fil-A[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=246042]ROCKST★R[/url][/list]\n[color=white][b]Editors[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url][/list]\n[color=white][b]Graphic Designer[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]\n[color=white][b]Webshow Host[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=242000]Sharks[/url][/list]\n[color=white][b]YouTube Channel owner[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=639914]VanCliffe[/url][/list]",
      "subject": "[4/20/2011] - HF News"
    }
  ]
}