{
  "posts": [
    {
      "pid": "19176413",
      "uid": "515249",
      "dateline": "1326952406",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]76th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]Removal of the Black Knights[/b][/color]\nThe now unofficial group ‘Black Knights’ was recently dismantled and removed. In a sentence or two, Omniscient’s reason was that the group was poorly led, extremely small population wise and it was a free group in the first place. After the removal of the group, one of the former members decided to attempt to revive the group by recruiting new members as an unofficial group. The link to the recruitment thread can be found here: [url=goo.gl/ABeZe]goo.gl/ABeZe[/url]\n\n[color=white][b]Great Milestone for HF[/b][/color]\nHackForums has recently passed the well-known forum, [url=http://forums.digitalpoint.com/]Digitalpoint[/url], in forum size. This is a great accomplishment for HackForums and shouldn’t go unnoticed. Omniscient himself has said “DP is one of the largest forums online that I’ve been a part of since 2005”, implying that HackForums is now one of the largest forums on the internet. The original tweet by Omniscient can be found here: [url= goo.gl/ba71g]goo.gl/ba71g[/url]\n\n[color=white][b]Extensive downtime[/b][/color]\nOn January 14th HackForums experienced an extensive length of downtime expanding to around 7 hours. According to the official announcement the server went offline while Omniscient, however as stated in the thread he was able to fix the issue within 5 minutes implying it was only a minor problem and nothing to worry about. To read the announcement posted by Omniscient click the following link:[url=goo.gl/oV4l4] goo.gl/oV4l4[/url]\n\n[color=white][b]HackForums Protests SOPA and PIPA[/b][/color]\nAs of January 18th HackForums has joined the 24 hour protest against SOPA and PIPA. As you can see Omniscient has changed the banner with a shape resembling a stop sign, which reads “STOP SOPA PIPA NOW”. Also when clicked it brings you to an announcement thread posted by Omniscient which seems to have been made to inform and persuade the member to protest these acts before it is too late. The thread also clears up a bit of confusion as it states that the SOPA bill is on hold at the moment, however PIPA is still active and the voting will start on the 24th of January. The announcement posted by Omniscient can be found here: [url=http://goo.gl/dO3QL]http://goo.gl/dO3QL[/url]\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=275104][b][color=white]Delicious[/color][/url][/b] - has hit the 10k posts mark this week!\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b][color=white]Mr. Anderson[/color][/url][/b] - was accidentally repfucked for a sarcastic comment that was taken seriously. Read the post [url=http://hackforums.net/showthread.php?tid=2111610&pid=19132498#pid19132498]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=285508][b][color=white]Nemesis[/color][/url][/b] - formerly known as Apock, reached 1000 reputation.\n[url=http://hackforums.net/member.php?action=profile&uid=817877][b][color=white]Guess who is Back[/color][/url][/b] - reached 1000 reputation this week.\n[url=http://hackforums.net/member.php?action=profile&uid=132817][b][color=black]S7ON3R[/color][/url][/b] - was banned for the reason \"Low Quality Member\".\n[url=http://hackforums.net/member.php?action=profile&uid=812779][b][color=black]Nfmusic[/color][/url][/b] - was repfucked and banned for changing his username to \"Omniscient\".\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=black]Diabolic[/color][/url][/b] - was repfucked twice and lost over 1000 reputation.\n[url=http://hackforums.net/member.php?action=profile&uid=752389][b][color=black]eiqhtworks[/color][/url][/b] - was banned and repfucked for calling someone a scammer in rep and not leaving a scam report on the reputation.\n[url=http://hackforums.net/member.php?action=profile&uid=965574][b][color=black]Fanta[/color][/url][/b] - was also banned and repfucked for +repping a scammer.\n[url=http://hackforums.net/member.php?action=profile&uid=847488][b][color=black]Deltron[/color][/url][/b] - has recently requested a vacation ban.\n[url=http://hackforums.net/member.php?action=profile&uid=816875][b][color=black]Daring[/color][/url][/b] - has also been banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=black]D3xus[/color][/url][/b] - another member to be banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=520579][b][color=black]biasa199[/color][/url][/b] - received a ban for the reason \"LQP (post to pm me bullshit)\".\n[url=http://hackforums.net/member.php?action=profile&uid=699373][b][color=black]TreeHugger[/color][/url][/b] - was banned and repfucked for harassing members.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Important Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2123087]Free the Internet from SOPA and PIPA[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] - Seeing as this thread occupied the banner location, it is quite an important thread. Omniscient explains a bit about SOPA and PIPA, and how we can stop it.\n\n[i][b]Xbox Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1853653][TuT]Get Xbox LIVE for $1 a Month (Updated)[/url] - [url=http://hackforums.net/member.php?action=profile&uid=398194][color=#0066FF][b]туℓєя[/b][/color][/url] - If you play Xbox Live, you should read this tutorial. It will teach you to (successfully) get Xbox Live for $1 a month.\n\n[i][b]SotW Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2115872]SoTW #8 [SciFi][/url] - [url=http://hackforums.net/member.php?action=profile&uid=467759][color=white][b]Flying Dutchman[/b][/color][/url] - The Signature of the Week threads have been getting more popular, and you should go vote on the next one!\n\n[i][b]Giveaway Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2113642]░▒▓██████ Want FREE PayPal Money? ALL MEMBERS [$2,000 left to giveaway] ░▒▓██████[/url] - [url=http://hackforums.net/member.php?action=profile&uid=371170][color=white][b]OVO™[/b][/color][/url] - Anyone interested in receiving a donation? Post here and you may get a chance. OVO has given away a lot of money, and will continue to do so!\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Odd Future[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]:  Hey Odd Future! Thanks for letting me interview you today! Before we begin, would you like to give a shoutout to any special members?\n[b][color=#1466ff]Odd Future[/color][/b]: I'd like to give a shoutout to Pharaohs, Skirex, Blink, and anyone that helped me over the years become the member I am now. I don't talk to many members here personally.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fantastic! They’ve certainly done a good job. What lead you to Hack Forums and why did you stay?\n[b][color=#1466ff]Odd Future[/color][/b]: What lead me to Hack Forums was all the talk about it over Xbox Live several years ago. Some old friends like Hazic, SoLaR, and TsGh sniper really got me into things like hostbooting and such, which is mainly what got me here.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I can definitely relate to that. I recently saw your thread regarding the mystery of the cicada. Why don't you tell the readers more about your recent thread regarding /b/ and the secret image?\n[b][color=#1466ff]Odd Future[/color][/b]: Ahh, the 4chan thread. I'm glad you asked me about that.  It's very mysterious in its own way. I've never seen or heard of a real life ARG before and it seemed interesting enough to read up on. It started off really crazy, maxing out a thread at 100+ pages in 3 days. The second thread is at about 550+ posts and doing well. It's most likely advertisements for an upcoming movie.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: For those of you who didn’t catch it – It was a secret image with a lot of weird pictures and GPS coordinates. Crazy stuff. Why is your name \"Odd Future?\"\n[b][color=#1466ff]Odd Future[/color][/b]: My name is Odd Future because of the simple fact that I, like many other members, obsessed over the musical group during the summer. Seeing as it wasn't taken, I took it quickly knowing that it would be taken eventually by another member.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Very cool – I was also surprised to see my name was taken so I snatched it immediately. Odd Future has definitely gotten pretty big quickly and is still growing. If you could change one thing in the world, what would it be, and why?\n[b][color=#1466ff]Odd Future[/color][/b]: This one took me a while to think about. I'd change the public school systems work. I don't know why I thought of something as simple as this, but I just think it should be run like it's known to be in parts of Asia. Students that don't pass a test to enter high school should be kept out. The way it is now is unacceptable in my opinion. It might be the fact that I live near the ghetto and share a school with idiots.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I see – As I go to a fairly good public school, I’m not as affected by it as you may be, but I’m sure it would be a good change. It’s difficult to understand how America trails so far behind in schooling. What is your opinion regarding SOPA? If you aren't familiar with it, it's the Stop Online Piracy Act and would effectively shut down many sites that share information (YouTube, Wikipedia, etc).\n[b][color=#1466ff]Odd Future[/color][/b]:  I've been seeing A LOT regarding SOPA in the last couple months and just want to mention I don't think it'd ever be passed in the first place even without everyone's help. That whole list of sites \"blacking out\" January 18th including Google, Reddit, etc. will be pretty crazy. Sites like Facebook, Youtube, and some others make WAY to much money to lose their sites randomly over this bill.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I agree – It’s far too controversial to pass, though the NDAA was very controversial as well. You never know! Let’s get away from the negatives; if you could have any one thing, what would it be?\n[b][color=#1466ff]Odd Future[/color][/b]: One thing I'd ever want? Steady legal income for the rest of my life. $2,000 a week would be awesome.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I think I would be more impulsive, I would really want the water jetpack thing that I’ve seen on YouTube. Very cool, though I suppose I could save up for it with a steady income of two grand a week! What's your favorite section on Hack Forums?\n[b][color=#1466ff]Odd Future[/color][/b]: I think you already know the answer to this one by just looking at my post activity. If it's not the lounge, I'm in the Gaming section or selling in the Premium Sellers section.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I admit I’m quite the lounge whore myself. That about wraps it up for me; Do you have any closing words for the readers of HF?\n[b][color=#1466ff]Odd Future[/color][/b]:  I'd like to thank you for asking to interview me. It honestly came as a total surprise. I love sharing my views with members here at HF and hope to stay another 2 years. You're all great!\n[/spoiler]",
      "subject": "[1/18/12] - HF News"
    },
    {
      "pid": "19176424",
      "uid": "515249",
      "dateline": "1326952437",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\r\n[color=white][b]SOPA Blackout[/b][/color]\r\nOn January 18, 2012; Wikipedia, Reddit, and many other popular websites went dark in effort to protest SOPA (Stop Online Piracy Act) and PIPA (Protect IP Act).  In essence, these acts give media providers such as NBC full power to block access to any website with pirated material on it.  The head of the Motion Picture Association of America stated that the blackouts were \"irresponsible\" and merely  \"a disservice to people who rely on\" them.  Popular websites opposing these acts are Google, Yahoo, Facebook, Wikipedia, Reddit, Boing Boing, and a hand full of others.\r\n\n[color=white][b]UK Scientisis find Darwin's 'lost' Fossils[/b][/color]\r\nBritish scientists recently found the missing fossils that the evolutionary theorist Charles Darwin and his co-mates had over 150 years ago.  It was said that Dr. Howard Falcon-Lang came across the slides that had be pushed away in a gloomy corner of an old wooden cabinet of the British Geological Survey.  While viewing one of the specimens,  he noticed that one of them was labeled 'C. Darwin Esq.\"  This find included a collection of 214 slides by Charles Darwin, John Hooker, and Rev. John Henslow, his mentor at Cambridge. \r\n \r\nFalcon-Lang stated that one of the most bizarre slides he found was a specimen of prototaxites, which are a 400 million year old tree sized fungus.  It was also noted that these slide were assembled in 1846 by Hooker who shortly worked at the British Geological Survey. \r\n \r\n\"To find a treasure trove of lost Darwin specimens from the Beagle voyage is just extraordinary,\" Falcon-Lang added. \"We can see there's more to learn. There are a lot of very, very significant fossils in there that we didn't know existed.\"\r\n \r\n[color=white][b]$62Million Dell Insider Trading Charge[/b][/color]\r\nFBI arrested for people on Wednesday, and 3 privately earlier on the charges of insider trading.  After the latest alert of a sweeping probe meant to track suspicious activity at hedge funds, the defendants were caught, arrested, and an 11 year prison term was sentenced.\r\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\r\n[color=white][b]Breakthrough in Jailbreaking[/b][/color]\r\nHacker pod2g has released a new video showcasing the iPhone 4S being jailbroken untethered on the new A5 Apple processor on iOS 5.0.1! This is a huge; this has been trying to be done for a while now. Apple has gone through thick and thin trying to block all the bugs that let the hackers exploit the iOS platform. People you need to update to iOS 5.0.1 before its too late and Apple stops signing it, in order to preserve your jailbreak ability. Also if you’re on a A4 device (iPhone 4<) then save your SHSH blobs if you can.\r\n\n[color=white][b]CES[/b][/color]\r\nCES has come to a end. The tech giants have shown some amazing work. From a self healing case for the iPhone from Nissan the automaker to Samsung’s dual vision TV that lets you watch 2 shows at once at the same time. These new gadgets have been already released and some are going into mass production shortly. The amazing thing is that next years CES for Microsoft has already sold out! There is no way to get tickets for the Microsoft Floor or Demo.\r\n\n[color=white][b]Apple - Education[/b][/color]\r\nApple has a press conference coming up on Jan. 19, which is dedicated to education. Apple has been trying to change education. People have known Apple for a little while now to change the way we look at things, from the release of the iPod to the iPhone; now there tackling education. Will Apple make textbooks that have touch interfaces?  Maybe even bring iPads to every school out there and help really make learning fun. Be on the lookout for the press conference on Jan, 19! \r\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\r\n[color=white][b]Guns N' Roses[/b][/color]\r\nGuns N’ Roses is releasing a new album this week called Absolutely Our Main Priority! The announcement was made by DJ Ashba, Guns N’ Roses’ guitarist. If you don’t know who Guns’ and Roses are, they’re a classic rock group from the 80’s. The last album they released was back in ’08. The album, known as Chinese Democracy, had rather odd reviews back when it was made.  It was rated ¾ stars by USA Today but  was rated 5.8/10 by Pitchfork Media. The reviews were very mixed but their new album is one of the most anticipated upcoming albums in all of the rock community. As one commenter says, “well anything that ashba has been involved with seems to have #1 hits on it so with axl voice and input this album could very well blow the dam roof off!” I’m looking forward to seeing how this turns out and I hope you are as well!\r\n\n[color=white][b]Led Zeppelin 2[/b][/color]\r\nLed Zeppelin 2 will be touring this season in 2012. To start off their tour they played two distinctive albums in Chicago. The band will be recording a cover of a song from the Yardbirds as a special tribute to their fans. Led Zeppelin will be playing their 1971 and 1975 music sets during the tour. The tour has been highly anticipated in the rock and roll community and there are many fans booking tickets before they run out.\r\n\n[color=white][b]Jay-Z[/b][/color]\r\nHave you heard Jay-Z's song \"Ni**as In Paris\"? Well if you have you should check [url=http://www.worldstarhiphop.com/videos/video.php?v=wshhqOA4pa14bzlffcr3]this[/url] out. There was a hidden message in the instrumental shouting \"We Killed Tupac\"\r\n\n[color=white][b]In Other News[/b][/color]\r\nLupe Fiasco Detained at LAX\r\n\n[color=white][b]Music Videos[/b][/color][spoiler=]\r\n[video=youtube]http://www.youtube.com/watch?v=3buvu8B4qNM[/video]\r\n[video=youtube]http://www.youtube.com/watch?v=A7JRUV4IWXQ[/video]\r\n[video=youtube]http://www.youtube.com/watch?v=FGEYTOyP-WQ&ob=av2e[/video]\r\n[/spoiler]\r\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\r\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\r\n---\r\nI want to write this section today about a paper I recently read, the title was \"The Tool I Couldn't Live Without.\" The entire paper focused on two emotions of humanity, love and fear. The author stated that all other emotions are a sub-emotion of the top two, love and fear. Yet his point was that he couldn't live without love, love is a necessity and it has guided him throughout his life. I can honestly say that I sympathize with his standpoint, the need for love and acceptance is an integral part of humanity and I am not shamed to say that I follow the same suit. There isn't really a point to this one in particular, just something to think about.",
      "subject": "*"
    },
    {
      "pid": "19176437",
      "uid": "515249",
      "dateline": "1326952498",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\r\n\nWhat do you think of the leadership on Hack Forums?\r\n\n[i]\"We must not complain about selected members to the leadership of\r\nHackForums, such as Staff, Mentors, etc. Omni chooses who he thinks\r\n is capable of taking that position. If Omni chooses a specific member for\r\n a specific leadership, that member must be a trustworthy & old membe\r\r\nof HackForums to get chosen. Not anybody can do this, not even voting fo\r\r\na member to be a leader of HackForums seems logical to me.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=251883][i]-Dяea[/i][/url]\r\n\n[align=right][i]\"I think that the staff here are doing the best they can. I like \r\nthe idea of using mentors and staff members, however, I think there should \r\nbe more mentors. I think a better way to do all of this would be to have staff \r\nmembers go to each section and try to identify a main helper. Then proceed to \r\nassign that person to mentor the section. But everything is working out now the \r\nway it is and I am happy with Hackforums.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=127950][i]-Rhynorater.[/i][/url][/align]\r\n\n[i]\"I think that the staff of HF do a great job managing a community of ove\r\r\n240'000 people. 99.999% of the time the staff & admins great, fair people. It is \r\non the rare occasion when their buttons are pushed by a slanderous member in \r\nwhich we can see them loose their cool. People sometimes say that omni is very \r\nhard on his members, but try to see it from his point of view. It would be amazingly \r\nhard to have to deal with over 240k people in one forum, especially when not all of \r\nthem play by the rules. If Omni showed any leniency, then it may not send a message \r\nto other people who are considering doing something against the rules. If Omni enforces \r\nthe rules to the letter, then there can be no confusion to what is and what is not \r\nallowed, and people know what will happen if they step out of line.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url]\r\n\nThe topic for next week is \"How do you feel about PIPA and SOPA?\"\r\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\r\n\n[hr]\r\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\r\n[align=center][img]http://i.imgur.com/desiN.png[/img][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\r\n[align=center][spoiler=]Explosm was down :'([/spoiler][/align]\r\n[align=center][spoiler=]Reddit was down :'([/spoiler][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\r\n[align=center]\r\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\r\n[video=youtube]http://www.youtube.com/watch?v=pmZavtZgzy4[/video][/align]\r\n\n[spoiler=[i][b]Written topics[/b][/i]]\r\n[b]Awards[/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=572367][b][color=white]The MammoTh[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=25]Cool[/url] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=619030][b][color=white]iNviZ[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=62]Qwazz Star[/url] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=115612][b][color=white]-BoodyE-[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=50]Master Donator[/url] award.\r\n\n[b]Leadership Changes[/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=154890][b][color=white]iMario[/color][/url][/b] was demoted from moderator of the monetizing section.\r\n[url=http://hackforums.net/member.php?action=profile&uid=234024][b][color=white]Deities[/color][/url][/b] was demoted from leader of The Alliance.\r\n[url=http://hackforums.net/member.php?action=profile&uid=234024][b][color=white]Finarfin Palantir[/color][/url][/b] was promoted to leader of Eminence.\r\n[url=http://hackforums.net/member.php?action=profile&uid=656453][b][color=white]ReactionZ[/color][/url][/b] was promoted to Mentor.\r\n[/spoiler]\r\n\n[hr]\r\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\r\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\r\n[list][*]Headlines[/list][/list]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions[/list][/list]\r\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\r\n[list][*]World News[/list][/list]\r\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[list][*]User News[/list][/list]\r\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\r\n[list][*]Tech News[/list][/list]\r\n[list][*][url=http://goo.gl/YQXAV]OVO™[/url]\r\n[list][*]Music News[/list][/list][/list]\r\n[list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*][url=http://goo.gl/piymJ]Innocence.[/url]\r\n[/list]\r\n[*][color=white][b]Web Show Co-Host[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[/list]\r\n[/list]\r\n",
      "subject": "*"
    }
  ]
}