{
  "posts": [
    {
      "pid": "9403171",
      "uid": "0",
      "dateline": "1296248515",
      "message": "[color=#FF4500][u][b]My brother EctoPlasm asked if I can post his HF news to fulfill his duty.[/b][/u][/color]\r\n\n[align=center][img]http://img269.imageshack.us/img269/8496/headlinesr.png[/img][/align]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] created a group called \"Dead Group\" for permanently disabled accounts. People who make the group can no longer become a normal member again. To view his announcement you can check out his twitter page. http://twitter.com/HackForumsNet/statuses/27462312101158913\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=4066][b][color=#00BFFF]Hanzo[/color][/b][/url] has made a simple yet critical thread in the annoucement section on how to avoid getting Rep Fucked and Banned 101 by [url=http://hackforums.net/member.php?action=profile&uid=4066][b][color=#00BFFF]Hanzo[/color][/b][/url]. If you want to save your self from being thrown in the red zone view this thread and read it twice. [url=http://hackforums.net/showthread.php?tid=1012384]CLICK HERE[/url]\r\n\nAfter about a week of adjustments to MySQL 5.5 which was a recent upgrade,[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] is happy to say that he believes our database serving needs are finally fulfilled.\r\n\n[quote=Omniscient]It's like we're serving a small site again[/quote]\r\n\nHis next focus will be our HTTP server which is having heavy load. It's now a 2 year old server and we've grown 500% since original rent date. The upgrade of our webserver should be a lot smoother than the DB server. He states that it is going to basically be the same config except with better hardware.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] has been thinking of starting a Share-Cash Experiment as this of course would benefit HF with funds and members with an additional way to upgrade,donate and earn awards. The benefits a member would get after completing [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] request would be that he will either give the member a new award (not yet created), a donation award, or upgrade their account.\r\n\nHackForums has just acomplished a goal of going past 1 Million in the TID, (Thread ID). \r\n\nCongratulations to [url=http://hackforums.net/member.php?action=profile&uid=136025][b][color=#1E90FF]The Elite[/color][/b][/url] for accomplishing the one millionth Thread which can be read here. http://hackforums.net/showthread.php?tid=100\r\n\n[align=center][img]http://img211.imageshack.us/img211/300/usernews.png[/img][/align]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=144367][b][color=#FFD700]Raacs[/color][/b][/url] has been caught messing with his school's security system called \"LanSchool\" He ended up making over 130 computers disk tray open and close constantly causing massive chaos in his school. To read more click [url=http://hackforums.net/showthread.php?tid=240623]here[/url].\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=81075][b][color=#00BFFF]Robbieava[/color][/b][/url] has made a song that Officially went live and is currently being sold on Itunes, to check out the song and his thread click [url=http://hackforums.net/showthread.php?tid=1003425]HERE[/url]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=234024][b][color=white]Deities[/color][/b][/url] has made a new userbar for the Red Lions, effort is only a edit away for this great GFX master, hope to see more work from him in the future.\r\n\nCreator and leader of the Red Lions [url=http://hackforums.net/member.php?action=profile&uid=80618][b][color=white]Nokia2mon2[/color][/b][/url] has donated 1000$ recently to Hack Forums, this is a very generous offer and I'm sure alot of people respect him for such a gracious decision he has made, along with his many other donations he has given to this forum.\r\n[url=http://hackforums.net/member.php?action=profile&uid=65141]\r\n\n[b][color=#1E90FF]Bellita[/color][/b][/url] Got banned for making 10+ threads in the lounge whilst he was drunk. Many people have made threads while drunk but in this case it looked like he needed some time off.\r\n[url=http://hackforums.net/member.php?action=profile&uid=491112][b][color=#FFD700]\r\nKILLM3[/color][/b][/url] has made a thread regarding the exploits of Youtube and the conversation he had with the Youtube Bug support team. To read further click [url=http://hackforums.net/showthread.php?tid=1005173]HERE[/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=492684]\r\n[b][color=#1E90FF]WIZCRAFT[/color][/b][/url] Was perm banned for scamming. He is better known as an official reseller for Maniac Booter and the maker of Nether Stealer V2.\r\nWhy it should be in HF news: Some of his products were very popular and people should know that his products will not be for sale anymore on this site due to him being perm banned.\r\n\n[align=center][img]http://img199.imageshack.us/img199/6619/othernews.png[/img][/align]\r\n\nAnybody in the Red Lion's usergroup was able to give out 10 reputation points per day instead of the usual 5. We believe this was due to [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] literally making a copy of the Staff usergroup and then changing up some settings and totally forgetting about some minor settings such as how many reputation points we can give per day. We were lead to believe this because the first few days of the Red Lion's, when you had it as your main display group, your reputation points wouldn't show. (similar to staffs) The permission issue was reported by [url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] and has since been sorted and changed back to the original 5.\r\n\nSomething out side of HF has caused uproar around the world. Tunisian citizens has led a massive revolution against the president causing his family to flee out of the country in hiding. Due to this success, countries like Egypt and Sudan citizens are trying the same thing to hopefully get rid of their corrupted president. This is a really good change in the Arab world\r\n\n[align=center][img]http://img341.imageshack.us/img341/8763/videootw.png[/img][/align]\r\n\n[align=center][b]\r\nThis is a video of a US Soldier doing a prank that will give driver and front passenger seat a HEARTATTACK. A Grenade will be thrown in truck.[/b]\r\n\n[yt]http://www.youtube.com/watch?v=GhedLgSVewA&feature=player_embedded[/yt][/align]\r\n\n[align=center][img]http://www.piclion.com/images/whitehat.png[/img][/align]\r\n\nWelcome to HF’s White Hat part of HF News. I am [url=http://hackforums.net/member.php?action=profile&uid=393774][color=#1E90FF]Disruption[/color][/url] and I will be writing this part of the news.\r\n\nThis area is to discuss information that occurs in the White Hat Help area and the HJT area. Now lets begin with some events’ that have occurred that brought our attention.\r\n\nI would like to announce that I shall be accepting peoples' submission for this section. If you would like to apply for a chance in this part of the HF News, please view [url=http://hackforums.net/showthread.php?tid=998627]THIS THREAD.[/url]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=58683][color=#1E90FF]Zeon[/color][/url] has wrote a phenomenal thread and we have decided to give it some well deserved recognition. This thread lists tons' of secondary scanners' that can assist a user in the process of removing malware. To view this thread, you can find it [url=http://hackforums.net/showthread.php?tid=950428]HERE.[/url]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=170785][color=#1E90FF]Infallible[/color][/url] has taken a one week break from the HJT section due to real life matters. We wish him well and hope to see him back in action with his real life issues' fixed.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=81119][color=#1E90FF]tsgh mike[/color][/url] has made a thread describing some tips based on safe online browsing. In this thread, it gives pointers to being safe and the ability to not fear infections. Although it's short and sweet, it nails the main points of keeping you safe from harm in a few paragraphs. To view this thread, you can locate it [url=http://hackforums.net/showthread.php?tid=969500]HERE.[/url]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=393774][color=#1E90FF]Disruption[/color][/url] (myself) has made a thread giving new white hat members' some pointers' to getting started in the White Hat Help section. In the thread, it shows that grammar and the understanding of tools' are needed. Without these basics, you could easily harm a machine. To view this thread, it can be located [url=http://hackforums.net/showthread.php?tid=1000564]HERE.[/url]\r\n\nDue to Adfly causing harm to some people due to the links Adfly uses, [url=http://hackforums.net/member.php?action=profile&uid=45246][color=#1E90FF]Valiant[/color][/url] has allowed people to use there own canned speeches to assist users. This was never disabled to HJT members, but was never suggested. To view other opinions on the usage Adfly on canned speeches, you can locate it [url=http://hackforums.net/showthread.php?tid=996305]HERE.[/url]\r\n\nWith that, this concludes the White Hat section of HF News. I hope you enjoyed and if you have any suggestions to this section, drop me a pm and I will take it into consideration. Thanks for reading!\r\n\n[align=center][img]http://img257.imageshack.us/img257/1076/interviews.png[/img][/align]\r\n\n[color=#1E90FF][b]1.[/b][/color] When did you join Hack Forums and why? What were you looking for?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] 1 and a half year back when I was looking for Gmail bruteforcer I discovered this site, I didn't signed up at that time, again another day I was looking for a way to get free brazzer passes, I saw a tut on here.I bookmarked it, that day I joined hackforums.[/i]\r\n\n[color=#1E90FF][b]2.[/b][/color] What factor of Hack Forums kept you here, what made you want to stay and become active?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I used to see members bragging about rooting website/making money/making their own keylogger, I started using Rats/loggers in July 09 and became much active in the Hacking tools and Vb.net section.\r\n [/i]\r\n[color=#1E90FF][b]3.[/b][/color] When did you upgrade and who bought it?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I bought it myself after selling 2-3 torrentleech invites in October 09 which I got from my logs.\r\n [/i]\r\n[color=#1E90FF][b]4.[/b][/color] After knowing that Hack Forums was a community you'd like to stay in, what section were you most active in?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I started learning Vb6 and Vb.net, gave out some free crypters and loggers to the community. I stopped giving out free tools after I got banned and accused of infecting Hf members.There was big scene after I got banned, Check out my threads for more info.\r\n [/i]\r\n[color=#1E90FF][b]5.[/b][/color] What inspired you to write your e-Book?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] Some members recommended me to write an eBook after seeing my spreading skills and thread in service offerings.But I was never into writing eBooks before.\r\n[/i]\r\n[color=#1E90FF][b]6.[/b][/color] How did you feel when it got leaked?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]Obviously I wasn't happy to see something making you money being given out for free, Actually Yin never liked me and never did I.But now I could care less.\r\n [/i]\r\n[color=#1E90FF][b]7.[/b][/color] Many people know you were scammed for over $1,000, can Hack Forums and it's members know what actually happened?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] Yep, incident reminds me of ol days, I trusted him too much that was my fault, I got scammed for $1257, I gave that money to a guy named \"Mr.Xchange\" for exchanging it to WU.He ran out with money.I was shocked to see how that all happened in front of my eyes.But still I believe what happens is for good.Life carry's on..[/i]\r\n\n[color=#1E90FF][b]8.[/b][/color] Are there some things that you have learned that you owe to Hack Forums?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]Never trust anyone on the internet from the bottom of your heart. I have seen scammers like Vaqxine and Xchange, difference was situation made him scam and the later scammed taking advantage of the situation. I still feel for vaqxine.\r\n [/i]\r\n[color=#1E90FF][b]9.[/b][/color] Did you ever see yourself as a Staff member on Hack Forums?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] I never thought I would make up to staff but yep I'm happy :)[/i]\r\n\n[color=#1E90FF][b]10.[/b][/color] How did you feel when you were contacted and asked to become a Staff member?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I woke up in the morning, sat before my PC, logged into hf and I was shocked to see Omni's PM wih the title \"The invite\", that was my luckiest day on hf. :P [/i]\r\n\n[color=#1E90FF][b]11.[/b][/color] What are your future goals on Hack Forums?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I want to be a member of this great community as long as it is there. I don't think I'll be active much in the coming months but still I'll try to keep Hf clean and spam free with my efforts. :) [/i]\r\n\n[color=#1E90FF][b]12.[/b][/color] Is there anything you would like to finish off the interview with? Maybe a message to the members or a quote.\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] Well, you ain't asked about the \"P3\" in my usertitle so I won't be saying anything.I would like to end up saying this famous quote - \"Faith consists in believing when it is beyond the power of reason to believe\". The one and only best friend I've got on this forum is \"Factor8\", I want to be your bffl.\r\n\nThank you and I'd like to apologize for my bad english.[/i]\r\n\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]",
      "subject": "HF News 1/28/2011 "
    }
  ]
}