{
  "posts": [
    {
      "pid": "28227036",
      "uid": "515249",
      "dateline": "1353373756",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#00BFFF][b]118th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]HEY YOU FUCKING ASSHOLE[/b][/color]\n... is what Omni would say if he was pissed off about people talking about hacking, exploiting, or attacking chat services. Well actually, that's what he did say. Omniscient seemed rather annoyed, suggested by the title of his thread, which is identical to the title of this article, by the amount of blackhat discussion that has been happening in recent times in the Tinychat/Skype/Join.me Invites section. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] warned users that he'd \"...immediately close your fucking account and tear apart any good-will you ever had here\" if you think you're above this section's rules. This happened approximately a week ago, although it serves as a reminder to all; don't piss the big man off. Read the full thread [url=http://hackforums.net/showthread.php?tid=3014583]here[/url].\n\n[color=white][b]HJT Updates[/b][/color]\nThis last week has been a busy one for [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] and the Hi-Jack This Malware Removal Team that is native to Hackorums. Things all kicked off with [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] announcing on his Twitter that \"HJT new recruiting will begin this week. Stay tuned for more updates and info on the groups new procedures.\" The full story can be found [url=http://twitter.com/hackforumsnet]here[/url]. Furthermore, he then announced that the Hi-Jack This Malware Removal Team, that has been around since early 2009, will be renamed to \"Hackforums' Malware Removal Team\", or what will commonly be referred to as \"HF MRT\". With the announcement, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] , created a thread on the behalf of the newly named \"HF MRT\" looking for all new graphics in the group, including a userbar, logo, and ficon. The thread can be found [url=http://hackforums.net/showthread.php?tid=3021751]here[/url].\n\n[color=white][b]Downtime[/b][/color]\nYou may have noticed downtime recently, specifically mid last week. It was stated on HF's official Twitter that this was due to maintenance. This downtime was predertermined, and users were warned prior. Although, only a day after this maintenance, the site again went offline. This time, however, was due to hardware failure. \"Apparantly\" ([url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s words, not mine) there was some form of motherboard failure. The issue was relatively quickly resolved.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=454666][b]adampelletgun[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=522041][color=#FFD700][b]BaussHacker[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=89623][color=#0066FF][b]Mark Webber[/b][/color][/url] reached 1,000 reputation points. Congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=1452467][b]DafuqDude[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=298746][color=#FFD700][b]Grammar Rays[/b][/color][/url] reached 10,000 posts. Congratulations!\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=952310][color=black][b]Taco[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1180170][color=#FFD700][b]Autopost[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=80320][color=black][b]Mr. Jerkoff[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1246572][color=#0066FF][b]USMC Chris[/b][/color][/url] was repfucked. Again.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url] was temporarily banned due to a \"Marketplace Violation\".\n[*][url=http://hackforums.net/member.php?action=profile&uid=325600][color=black][b]Crash-Override[/b][/color][/url] was banned for flaming.\n[*][url=http://hackforums.net/member.php?action=profile&uid=570186][b]TheHackersLove[/b][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1450962][color=black][b]Reptar ツ[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=80320][color=black][b]Mr. Asshole[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=260570][color=black][b]Fetus Flipper[/b][/color][/url] was banned for disobeying Staff.\n[*][url=http://hackforums.net/member.php?action=profile&uid=27314][color=black][b]PurpleHaze[/b][/color][/url] was banned for trolling.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=67718][b]PubMaster[/b][/url] received the Gamer award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] no longer has the 24k award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=274613][color=#0066FF][b]Яǝʌǝɹsǝ[/b][/color][/url] received the Hustler award for coming up with the sub-forum's description.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1357063][b]Aeon ‹3[/b][/url] received the Master Donator and the Militant award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1320406][color=#0066FF][b]Froggy[/b][/color][/url] received the Frog and Cuddly and Cute awards.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\nNone.\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=1138215][color=#FFD700][b]Salvatore[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=3024964][b]Spotify Web (Beta)[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] -[url=http://hackforums.net/showthread.php?tid=3028011][b] Empire | HF OMGPOP Pool Tournament 7[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1119610][color=#0066FF][b]Winner[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=3027832][b]HF radio [Become a DJ NOW!!][/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1306528][color=#0066FF][b]xadamxk[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2966445][b]iDevice/ Android Section Changes[/b][/url]\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=847499]Brandenx781[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 118th edition of the HF News, Brandenx781 has been kidnapped from his farm to answer our questions. Any shoutouts you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: I'd like to make a shoutout to my two families. The Alliance and the HJT Team which will soon have a name change.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: You've been closest to the HJT Team. How did you get involved with the group?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: I actually was a dumb person back then. I accidently clicked a link and had paranoia that my computer was infected. I posted in Support Forums for a check-up on my computer and Paradoxum analyzed my computer. After the cleansing of my machine, I then asked a query involving the HJT Team over there, and Paradoxum said that recruitment was still open. I took a shot and applied to the HJT Team, and was accepted. I had around 33 posts that time of my acceptance.\nWhen I was accepted, I was training with two other students, RDCA and Deltron. We were Paradoxum's original students. During some time of our trianing, we were then transferred to Hack Forums so we were able to get a more unique and wide field of teachers. From there, our training continued off at Hack Forums, where we graduated from the program, and are now teachers.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: You've certainly come a long way since then. What have you learned from the team that you've applied to real life, if anything?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: I've learned many things from this program. I never understood anything about malware removal, and here I am, a teacher. Malware removal is pretty complicated. I learned things such as malware removal tools, specific infections, and learned a more detailed way on how to research and analyze things about a computer. \nIn real life, I use these learnings to fix computers. A lot of my friends are pretty stupid, so they tend to get infected a lot. I offer them the assistance they asked for. Although I do not charge for my services, I get picky on who to help. I do not like being a person people take advantage of, so my support is offered to those who are really close friends.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: That's the same with me. My parents always say I should charge money for iDevice related services, but what I do is simple enough that I feel bad about it. I help my friends out with fixing their iPhones (since everyone has one [except me]) and jailbreaking them. But what motivated you to join the team? Was it curiosity to learn more, or what?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: It was simply the fact that I was so impressed of how Paradoxum analyzed my computer system. I was like \"Wow, this homie G is a boss.\" I wanted to learn and wanted to follow a little bit in Paradoxum's footsteps.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Don't we all want to be the very best, that no one ever was? Did what you experienced with the HJT Team help you in The Alliance?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: ... Totally nice reference. :D. And, nope. The Alliance became something more separate than the HJT Team, as I wanted to experience learning in classes they had to offer. They had many classes that interested me, so I decided to participate in the activities in the subforum. Although, RDCA and I are hosting a mini malware removal class in The Alliance.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I'm looking forward to the class. :3 You basically own the HiJack This Log Analyzer forum. How do you do it?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: LOL. All the other professionals from the team stopped replying to the logs as they were mostly on vacation or lazy. Deltron is trying to take over the section now lol. I got my motivation from Tha Sneak, another HJT Teacher. When I used to be a trainee, he took around 40 logs all at the same time. I was stunned at the amount he could take. However, he has become inactive, so I decided to keep his legacy continuing. \nI go through each un-replied log, and analyze each log carefully. I spot many different infections, and then post the reply in a saved canned speech. I do the same thing for each log. However, I analyze differently because of the different infections I see while analyzing. When you've analyzed over hundreds of logs, you get used to the format and know what you are looking for. Each log is significant. It takes me a few minutes to thoroughly analyze each log and know what tools to use to dis-infect a computer. Although I reply fast to a lot of logs, accuracy is what I aim for.\nJust remember that accuracy is key of essence.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: All bow down to the wanna be robot. xD Do you have any other inspirations besides Tha Sneak?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: My other inspirations are all the HJT Teachers. They are what makes me keep in line and keep up with the team. Without them, I would've never been a student in this program.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Respect your elders... Any closing comments for our readers?\n[url=http://hackforums.net/member.php?action=profile&uid=847499][color=white][b]Brandenx781[/b][/color][/url]: Love and peace yo.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1251587]Hazy[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, Hazy, to the 118th edition of the HF News! Any shoutouts?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: Hey Phytrix! Thanks for letting me finally get an interview! I'd like to give a shoutout to all my friend in 143, Soulmate, Tibit, and Yellows(Lumberjack), Bullet, Chief, Natha, Positive, and anyone else I missed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure they'll be greatful to see their names up there. So, what brought you to HF and what have you learnt since?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I hope so. I was brought to HF by one of my friends because he was talking about stealing accounts and making money, and back then I had no clue about anything blackhat. I joined to get involved in it all and try it out, but I never really followed up with it. Instead, I looked at other sections and set myself here on HF. Since then, I've met some friends, learned some things in RAT'ing, Graphics, and other random sections I've explored around the forum.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds good. I know you are(were) a very contributing member to various groups. What are/were the highlights of your group experiences on HF and how did each contribute to you?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I recently was in a lot of groups, correct. I think I've been in seven user owned groups overall, but the only one I'm currently in right now is 143. I've learned that each group is different and they require a lot more work then you think. You meet a lot of people and learn more and more about each field the group is about than I would ever learn just on the public sections on HF. I have been having a harder time keeping up with things around the forum, so I left the groups I wasn't kicked from when they changed directions because I only want to be able to contribute my all to the groups. They all gave me knowledge and a wide group of people I can go and talk to that I never had before, and I recommend anyone that is questioning a group to try it out, cause you'll probably really enjoy it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I can definitely vouch for the effort part, especially with certain groups. Anyhow, you are relatively active on the official HF Minecraft server; Hackercraft. What do you think seperates this server from others?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I think it seperates it from most other servers because it has dedication and a lot of interest. I've never seen Omni so interested in a project and actually interacting this way with people, and we have a wide base of players that come on every day looking to join in on the fun. There is a lot for any person to do on the server, and it makes people want to come back and play the next day. This server is going to keep growing and everyone that is a part of the server is very hard-working and wants to see it go a long way as well as the users who take part, like me and you.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What do you see as the current downsides of the server, and how could they be improved?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I feel like they've done a great job recently with fixing stuff up, but the server still has a long way to go. Some main downpoints of the server are faction qualities, the money system, a better spawn, and some more staff interest and members. Factions are great, but it's not everyone's thing and I think that it feels unsafe to people who aren't in factions to go out incase they get raided. Fighting isn't everyone's thing, so there should be some protection against this. Also, raiding has become a bit harder as everything inside faction zones are protected and getting power for your faction seems like it is way to easy and some what abused. Next, the spawn needs a touch-up. It looks decent for the average Minecraft player, but for someone that's been playing for over two years, it looks like any other server. We need to make it nice, grand, and something that people won't forget. Right now, it looks like an open area with walls and random towers sitting all around it, so a lot could be done to improve. Finally, I think the staff need to take more of an initiative to help. It seems like the only one that really works on the server is Dan, and Froggy tries to do whatever she can. Otherwise, there really is no interaction with higher powers on the server. I noticed a lot of this can be related to Viral Dragon's answer from the last issue, but I just agree with what he has said and this is how I feel.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Do you actively play any other games? If so, what console(s) do you play on and what attracts you to them?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I used to be a big Xbox 360 addict, but recently stopped playing over the summer after playing for four years. I liked it because I had lots of different games that I enjoyed and most of my friends at school would always play with me which made it more enjoyable. I also used to play Gameboy games a lot too like Pokemon, cause who doesn't like Pokemon?\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What activities do you participate in outside of HF, if you don't mind sharing?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: Outside of HF, I go longboard'ing, snowboard'ing, and play soccer. I recently started riding longboards, but I find it really enjoyable and the person who actually got my first board setup was Minnesota Nice here on HF. It's a fun thing to do with friends and just cruise around when you need to get out of the house. I also like to go snowboarding in the winter when I don't have soccer like I do all the other seasons of the year, indoor and outdoor.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Is there any particular story behind the name Hazy?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I don't think so. I was buying an aim from Christy when I first joined HF, and I remember that I made a signature a long time ago with the word in it. I bought the aim and ended up just using it as my identity here and any other forum I joined.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: There is hype over the P0W3R group which is expected to be fully released very soon. Where do you see this extra upgrade taking the forum and its members?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: When it finally comes out (whenever that is), I think it'll bring a lot of interest back here on HF. I know that over time for me at least, things seem to dull down and get less exciting as you get into them, so it will be a great addition for anyone that is looking for something new and to get up to pace with HF again. It'll bring new features for people that don't feel like what we have is enough, and I think for the general populous, it will please us for the most part.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for the interview today Hazy! Any final thoughts or comments to wrap it up?\n[url=http://hackforums.net/member.php?action=profile&uid=1251587][color=white][b]Hazy[/b][/color][/url]: I just wanted to say thanks to everyone that I've gotten to know on HackForums and all the groups I've been able to enjoy throughout my time here. Thanks again for letting me get an interview on the HF News Phytrix! ♥\n[/spoiler]",
      "subject": "[11/18/12] - HF News"
    },
    {
      "pid": "28227047",
      "uid": "515249",
      "dateline": "1353373809",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][img]http://f.cl.ly/items/1t3k3K3d2U2H1F2n0V1z/Image%202012.11.17%207:58:52%20PM.png[/img][/align]\n[color=white][b]Xbox LIVE Turns Ten![/b][/color]\nEarlier this week, Xbox LIVE officially turned 10. The service launched back in November 2002 with games like MechAssault, NFL Fever and Ghost Recon. Microsoft have revealed enormous stats about the service and have also gone crazy on freebies this week. Players who have been Xbox LIVE members for an undisclosed time will receive a special avatar helmet. Thats not all! Xbox LIVE members can also grab a few freebies and discounts on the Xbox LIVE marketplace for a short period of time. Oh, did I mention that Xbox veterans are receiving limited edition consoles? Yeah, now thats cool. Microsoft revealed some very big numbers... \n\n[align=center][i]Since Launch[/i]\n122,265,266 friendships have been forged\n4.5 billion achievements have been unlocked\n270 billion achievement points earned[/align]\n\n[color=white][b]Black Ops 2 Makes $500 Million In First Day Sales[/b][/color]\nThe newest Call of Duty title, Black Ops II, has earned more than $500 million on launch day, according to Activision. It passed both MW3 ($400m) and Halo 4 ($220m). There were over 16,000 midnight launches for the game, with over one million copies sold from Gamestop at midnight. Activision haven't announced how many copies were sold, but it's obviously a lot. \"With first day sales of over half a billion dollars worldwide, we believe Call of Duty is the biggest entertainment launch of the year for the fourth year in a row,\" said Activision CEO Bobby Kotick. \"Life-to-date sales for the Call of Duty franchise have exceeded worldwide theatrical box office receipts for Harry Potter and Star Wars, the two most successful movie franchises of all time.\"\n\n[color=white][b]Video of the Week[/b][/color]\nWe have a few videos this week to show off, the first being the latest Minecraft Let's Play which was suggested by a user - you can view the video right [url=http://www.youtube.com/watch?v=j8eEzU-zu3s]here[/url]. Black Ops 2 is finally out, and it seems there is a lot of lag. WoodysGamertag might have your solution, which you can view [url=http://www.youtube.com/watch?v=9sTbiVMnDdY&feature=plcp]here[/url]. He also has a video to fix PS3 consoles from freezing when playing the game, which can be viewed [url=http://www.youtube.com/watch?v=KCKWDG3uIrY&feature=plcp]here[/url].\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[b][color=white]Israeli-Hamas Explosive War[/color][/b]\nSo far, roughly 47 Palestinians have been killed as a result of the Israeli bombings, a dozen of which are children. At the same time, over 500 rockets have hit Israel, leaving 3 dead and dozens severely injured. The current war is a result of a Hamas commander being killed by Israeli forces. Hamas and Israel have had an ongoing conflict over the years. Abu Ubaida, a Hamas military spokesman, has stated that, \"This round of confrontation will not be the last against the Zionist enemy and it is only the beginning.\" Also, the Israeli forces have been preparing for ground as Major-General Tal Russo has stated that it is was \"definitely\" possible.\n\n[b][color=white]Egyptian Bus Crash Leaves 50 Dead[/color][/b]\nNear Manfalut, an Egyptian bus crash has taken the lives of 50 children and a bus driver. Even more disheartening, the children were all aged between 4 to 6 years old. Doctor Mohamed Samir told Reuters, \"They told us the barriers were open when the bus crossed the tracks and the train collided with it.\" President Mohammed Mursi told his ministers to aid the families of the victims. The crossing guard, who happened to be asleep, was arrested and charged as a result of the incident.\n\n[b][color=white]French Protest Against Gay Marriage[/color][/b]\nOver 70,000 protestors in Paris, along with protestors in other French cities, took to the streets against the legalization of same-sex marriage. President Francois Hollande had publicly stated that he would make it legally possible for homosexuals to marry. Marthe Vignault, one of the protestors, explained, \"A child needs a father and a mother, he needs the paternal and the maternal side and with this bill that might not be possible any more.\"\n\n[b][color=white]UN Responds to Rebels in Congo[/color][/b]\nThe U.N. Security Council, in an attempt to disuade more violent acts, threatened to increase sanctions on rebels for their attacks launched on the Congolese Army. M23 rebels, with the support of forces in Rwanda, conflicted with the army, which resulted in U.N. helicopters bombarding the rebels. French U.N. Ambassador Gerard Araud claimed, \"We must stop the M23...would, inevitably, become a humanitarian crisis.\"\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nApple suffered a loss of around $2M earlier this week due to theft of stock. Approximately 3500 iPad Mini's were stolen last week in a New York airport. Renel Rene Richardson, who was an employee at New York's JFK airport, enquired consistently towards his co-workers to receive information about Apple's iPad Mini shipment details. The FBI managed to squeeze vital info from Richardson and eventually figured out that the products were loaded into a truck by the thieves with the use of a forklift, while Richardson was left a measly 3 iPad Mini's for himself. This action took place on Monday night at the Cargo Air Services Building at JFK. Reports say that, after the arrest, Richardson was teaming with the FBI to found the stolen iPads. The FBI has yet to release details about the known or suspected location(s) of the stolen goods.\n\n[color=white][b]Anonymous[/b][/color]\nIn retaliation to the attacks that are taking place in Gaza, Team Anonymous has hacked protest support websites, along with various other websites dedicated to other primary topics, although featured protest support material. According to Anonymous, the 'hack count' for this project is currently at 663 websites. Among these sites is the Bank of Jerusalem, which is one of Israel's largest financial institutions. Anonymous managed to gain access and wipe their entire database. Swiftly after Anonymous tweeted of this particular feat, the site was taken offline, leaving a database error message. The site is still offline. Dumps including full names, email address' and IP address' of the breached databases were also released over the internet. Anonymous, in a press release, stated \"They crossed a line in the sand. As the former dictator of Egypt Mubarack [sic] learned the hard way -- we are ANONYMOUS and NO ONE shuts down the Internet on our watch.\"\n\n[color=white][b]Facebook[/b][/color]\nMark Zuckerberg, the CEO of Facebook, has finally mobilized Facebook for 5 billion users. This change was done in order to attract more developers and more data to provide a much more efficient environment to the DNA. Mark stated that Facebook is positioned better on mobile rather than on computer. Every day, 6 billion mobile subscriptions and 75 percent of the world's population has access to some kind of mobile phone or smart phone, so Zuckerberg has decided to concentrate and further specialise Facebook with this trend. Zuckerberg stated, \"One of the big trends we see is that the amount that any individual shares in a given year seems to be growing at this exponentially increasing rate. It is this social networking version of Moore's Law. What that suggests to me is that if we expect that this rate is going to double every year, then look out ten years, 2 to the 10th is 1024, ten years from now people will be sharing about a thousand times as many things.\"\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b][color=white]Vampire Weekend, Others Play NYC Benefit Concert [/color][/b]\nIndie rock bands Vampire Weekend, Dirty Projectors, Real Estate, Walkmen, and others played an acoustic benefit concert to raise money for Hurricane Sandy victims this past week. To attend the show you had to pay a minimum $30 donation. The lineup was stacked, but the venue was rather odd. All performances took place at a church in Brooklyn. \n\n[b][color=white]Miami Set To Host Kurt Cobain Tribute[/color][/b]\nMiami's Gusman Center will play host to a December 6th Kurt Cobain tribute. The exhibition will include a short film, KURT, showcasing the multiple masks and personalities of the late Cobain. The show will also include a performance headlined by Thurston Moore. \n\n[b][color=white]Music Video Of The Week[/color][/b]\n[spoiler][video=youtube]http://youtu.be/brZTvGIzeGg[/video]\n[video=youtube]http://youtu.be/xlyMTzDjqNo[/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nPotato juice is vodka. That is all.",
      "subject": "*"
    },
    {
      "pid": "28227052",
      "uid": "515249",
      "dateline": "1353373814",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"Where do you stand on decriminalizing versus legalizing Marijuana?\"\n\n[i]\"There are a lot of people that don't want weed legal, some being straight-edgers, \nothers being people that make a living off the distribution of marijuana, so really all the \ngovernment needs to do is get the growers from the rings, and just give them an offer \nthey can't refuse. Decriminalization of marijuana would do more good then bad, when the \nlegalizing, it comes with restrictions and taxes, and controlling by the government, which \nno one in the business wants.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=37251][i]-Baked[/i][/url]\n\n[align=right][i]\"If we decriminalized marijuana, it would take a lot of pressure of the police. \nHowever, people would start to grow it and there would be a LARGE amount of it circulating \nand being smoked. It should remain illegal.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=875998][i]-The Dark Knight[/i][/url][/align]\n\n[i]\"I am of the opinion that marijuana and other similar drugs should not be legalized because \nthere will be people buying it who can't afford it. The rest of the country will be left with high \npoor people to take care of, causing more tax dollars to be given to people who willingly wasted \ntheir money.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=947940][i]-webdev77[/i][/url]\n\nThe topic for next week is \"What are you looking forward to in the 'future'?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iIzeiHXvsvctf.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibj5YMBVwfJC7f.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibzHQWr5ku9qWZ.jpg[/img][/spoiler][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=660659]-Anal OG-[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=903914]Prince™[/url]\n[list][*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=138559]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}