{
  "posts": [
    {
      "pid": "4805659",
      "uid": "74244",
      "dateline": "1277591947",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 7 [/align]\r\n\n[size=large][color=#FFA500]Headlines[/color][/size]\r\n[color=#FF1493]\r\nThis week, two new sections were added. The first one was the [url=http://hackforums.net/forumdisplay.php?fid=169]Modern Warfare [/url] section under the Live Gaming (Xbox 360) forum. Modern Warfare 2 is an extremely popular game at the moment. This section will consist of prestige lobbies, maps, and just general gameplay. This should hopefully sort things in the Live Gaming section, as a ton of those threads were for Modern Warfare discussion. [/color]\r\n\n[color=#FF4500]The other section added this week, was the [url=http://hackforums.net/forumdisplay.php?fid=168]Halo[/url] forum. This is also a popular game, which sparked the section addition. The discussion will be about anything Halo related, from cheats, to ranks. Halo seems to be more of the discussion, with 836 threads compared to Modern Warfare's 720. A little fun fact about the 720 threads. Isn't it funny that there's going to be a Xbox 720 and there's 720 threads for Modern Warfare? However, some of the threads were not moved, so Modern Warfare probably out does the Halo subforum in terms of theads.[/color]\r\n\n[color=#1E90FF]This week, there were a lot of DDoS attempts. Omniscient dealt with them swiftly, and laughed at the fail attempts of the DDoSers. These are quotes from after Omniscient dealt with multiple this week -\r\n\n\"DDOS mitigated completely. It's now rendered ineffective. Sorry you fail skids. source: [url=http://twitter.com/hackforumsnet]Twitter[/url]\"\r\n\n\"Back online. Another FAIL by skids to take HF down. When will they learn? source: [url=http://twitter.com/hackforumsnet]Twitter[/url]\"\r\n\nAt most, it's an annoyance. There's not been many DDoS attacks that take us down for more than an hour or so, and usually, that's because Omniscient is sleeping, or is out from his home.[/color]\r\n\n[color=#32CD32]The last headline of the week, which wasn't too much of one, was pruning of private messages. Any REGULAR member (non l33t/ub3r/staff/admin), that were older than 6 months, were pruned. This erased PMs from many inactive people. One that came to the top of my head, was Vaqxine unless his was cleaned out. Vaqxine no longer has his staff position, and his L33T expired, and he did get a load of PMs (Vaqxination). There's also other members that have a lot of PMs that have not been touched for months. This cleared about 240MB of DB space in all of the 200,000 private messages deleted. Any extra DB space is great for the forum, and doesn't hurt.[/color]\r\n\n--\r\n[size=large][color=#1E90FF]User News[/color][/size]\r\n\n[color=#32CD32][url=http://hackforums.net/member.php?action=profile&uid=120522]Nympho[/url] posted a thread [url=http://hackforums.net/showthread.php?tid=500607]here[/url] to say that he had bought 10 member upgrades for people. That is an astounding number for someone to donate to the site and help people out. The total of the entire donations was $162. Thanks Nympho for making 10 people very happy! This is the kind of things that brighten moods of HF members.[/color]\r\n\n[color=#FF1493]Earlier today, I read a thread [url=http://hackforums.net/showthread.php?tid=501957]here[/url] posted by Smokestudley. The thread is basically him showing off his new site, www.gamephreak.com, which I thought was pretty interesting. To help him get a little boost off, I'm helping him out by posting this in this week's edition. To get a voucher code for 100% off the fees (picture fees, buy out, setup, etc), the code is \"28fe1eb65ff3\". Enter that without the quotations and you'll get a setup. It does not include homepage features, bolding, etc. Best of luck to you with your site Smoke.[/color]\r\n\n[color=#FF4500]I also noticed another random act of kindness from [url=http://hackforums.net/member.php?action=profile&uid=57913]Killerpop89[/url] in his thread [url=http://hackforums.net/showthread.php?tid=504733 ]here[/url] in which he bought 6 people UB3R in just ONE day! This is much appreciated by the members that received it, and by me. I like seeing these acts of kindness, it brightens the mood! It also takes us away from the flaming, and negativity, and brings a positive! Thanks Killerpop89![/color]\r\n\n--\r\n[size=large][color=#6B8E23]Just Plain Weird[/color][/size]\r\n\n[color=#1E90FF]Wills posted a thread [url=http://hackforums.net/showthread.php?tid=503142]here[/url] about him going from being a hacker to being a pedophile. The story in a sentence? Wills got a drunk, a 14 year old woman seduced him, and had sexual intercourse with him, and he's released on bail until the 12th of July. The morale of the story? Alcohol does bad things to you. I have much respect to Wills for sharing his story, and admitting he was wrong. Much luck to him in his future endeavors. \r\n[/color]\r\n\n[color=#FF1493]HF User posted a thread [url=http://hackforums.net/showthread.php?tid=504225]here[/url] about a thread that's a year old, in which a guy expressed his views about Omni. It's funny how dumb he is, but it's actually a pretty interesting thread. It's interesting in the fact that it got that far without being closed. It's 35 pages, so if you don't want to read it all, read the first and few last ones. Omniscient slammed the door on the thread with a \"This show's over, it was fun though.\" post. [/color]\r\n\n--\r\n[size=large][color=#FF1493]Other Information/News\r\n[/color][/size]\r\n\n[color=#FF4500]I know I said I was posting it on Friday, but I didn't have much time yesterday.[/color]\r\n\n[color=#FF1493]Lastly, if you're into Graphics, take some time to look at [url=http://hackforums.net/forumdisplay.php?fid=157]this section[/url] for the weekly SoTW. The inactivity has been low for a bit, and it's a fun little contest. This weeks winner is one of the two following, which is still open for voting, you can vote [url=http://hackforums.net/showthread.php?tid=501418]here[/url].\r\n\n[img]http://img80.imageshack.us/img80/6632/22610cars2.jpg[/img]\r\nand\r\n[img]http://img337.imageshack.us/img337/9228/sotwa.png[/img]\r\n\nThose are the ones on top this week, with a close game between the two. The poll is ending soon, so cast your last minute votes now![/color]\r\n\n[color=#1E90FF]A little note for those UB3Rs that PM me everyday to know when they can apply for the Reviewers.. Expect something soon. Skill and I are going to work on inactivity booting and adding 5-6 (don't want to make it some 70+ member group) members to the group to keep an even pace.[/color]\r\n\nComments on this week's edition will be greatly appreciated.",
      "subject": "[6/20-6/26] HF News Week! [COMMENT]"
    }
  ]
}