{
  "posts": [
    {
      "pid": "27470043",
      "uid": "515249",
      "dateline": "1350876639",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#00BFFF][b]114th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[b]Thread Ratings[/b]\nContrary to many user's disapproval, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has re-implemented the infamous 'Thread Ratings' plugin. The plugin was removed a few months ago due to the massive abuse it received; especially in the Marketplace by fellow competitors. Many popular Marketplace users spoke out against the implementation of the feature saying that it will be abused again but it appears that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] will keep things under control. The official statement firstly came from the Official Hackforums' Twitter feed, although an official thread has since been created by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], which can be found [url=http://hackforums.net/showthread.php?tid=2950343]here[/url]. It should be noted that this feature will be Ub3r exclusive to rate, although every member can view thread ratings.\n\n[b]Thread Prefixes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has activated a new plugin known as 'Thread Prefixes'. The primary use of this feature is to add a set prefix to a thread that gives a vague description on what the thread is about. Each section is expected to have its own set of prefixes based on what sort of section it is. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] will be adding the prefixes to most sections over time, with the group sub-forums being of lowest priority. The official statement by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] can be found [url=http://hackforums.net/showthread.php?tid=2950320]here[/url].\n\n[b]New Section[/b]\nA new forum under the 'Hacking' tab was created earlier this week. The section is known as 'Premium Hacking Tutorials', in which only the better hacking tutorial threads will be placed. Only Staff members of Hackforums can move threads. It's safe to assume that the reasoning behind the new section is to improve the quality of this section and to give more recognition to well made guides. It will surely be a hit to newly registered users of Hackforums.\n\n[b]Hackercraft Updates[/b]\nA few significant updates are/have been happening this week in regards to [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s new-found and established project known as Hackercraft. For those unaware, Hackercraft is a Minecraft server that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has invested in and spearheaded its development along with Mr.H. According to [url=http://hackforums.net/showthread.php?tid=2938109]this[/url] thread, the server is reaching its final phase of open-Beta play. With such development, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has gone into further discussion on paid factions, donations and other payments which can be found [url=http://hackforums.net/showthread.php?tid=2943634]here[/url]. The server is set to go into full action for the public within the coming weeks, which is widely anticipated.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1011113][b]Dan.[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=1137768][b]Kohsti[/b][/url] reached 1,000 reputation points!\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=83317][color=black][b]Automatic Coding[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=329361][color=black][b]Valik ϟ[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=83317][color=black][b]Automatic Coding[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1280788][color=black][b]PackTheMoon[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=817663][color=black][b]νιятυαℓнα¢кєя[/b][/color][/url] was banned for financial fraud.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544][color=black][b]Cody[/b][/color][/url] went on vaction ban.\n[*][url=http://hackforums.net/member.php?action=profile&uid=329361][color=black][b]Valik ϟ[/b][/color][/url] was closed.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=661940][color=#00FF00][b]bugga[/b][/color][/url] received the Dog Lover award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=398007][b]Apathy[/b][/url] received the Sticky Man award for making a detailed thread on how to debate.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\nNone.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=316828][color=#FFD700][b]BlackCap[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2942376][b]Online IDE[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2939843][b]143 [❤] - [ Emotional Support - Relationship Support - Advice/Input ] Look Here[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=847197][b]Control Panel[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2953843][b]HF Legends,Superstars, Well Known, Semi Well known Members List[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=675453]Cyber-Security[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 114th edition of the HF News, [url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url] is in the hot seat. Any shoutouts or comments you want to make before we continue?\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: Shout out to my friend V for Vendetta and for the members of the Batch section. Thank you for giving me the opportunity to be interviewed, it's an honor.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: The pleasure is yours. What brought you to Hack Forums; what about the forum attracted you to become a member?\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: Well, it all started when I was reading a Popular Science magazine. A certain article stood out to me. This article was about how Chinese Hackers may have already got hold of the cyber infrastructure of America. The idea of becoming a elite hacker (the ones you see in movies) enticed me to look up one word in the article. It was DDoS. After learning about these and how to start one, I stumbled upon HackForums. At that time, I had no idea how forum sites worked so this was all new to me. I registered with the name Cyber-Security just because it was the first thing that came into mind. The size of the community is what attracted me to become a member, the content was great.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I'm sure the term DDOS was different from what you first thought it meant before you looked it up. What have you learned on the forums that has stuck with you?\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: I didn't know what it meant at all before I looked it up, I just knew that it was a threat in cyberspace. What have I learned here? Probably all I know on computers, which is a lot to be honest. I got into coding here, malware removal, hacking, and a whole lot of other skills that will benefit me in the future. What I like about HackForums is that it is a diverse member base, each member has different skills. If there is a problem with anyone's PC, I can almost always fix it because of all the different tutorials I looked at. \nThis brings me to another great trait I have gained from being here. This trait is procedural writing, so making tutorials. My first tutorial is the second most replied to thread in the Beginning Hacking section, I really enjoy helping others. My ultimate goal was to make a mega tutorial, which has been stickied in the batch section. HF is also my source of news, I never have to look at news sites. Finally, I have learned how to make money online which is a definite proof of what I have accomplished here.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: You got the sticky man for one of your tutorials as a L33t member, an accomplishment in and of itself. What attracted you to batch coding?\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: Batch coding was my entry point into the whole coding industry. Since it is such an easy language to pick up, I learned from wherever I could. I read through hard manuals and wasted a lot of time because some of the commands were outdated. This is why I made a tutorial on Batch. Everything I had learned up to that point would be shown clearly so I could save the time of some newer members. I wanted to make their resources clear for their first languages. In each new coder lies potential, who knows, one of them could have benefited from the tutorial and gone on to make coding their career. It fills me with joy to know that I changed someones life, that I inspired them. Currently, I have a YouTube channel with Batch file tutorials. Every week, I get messaged by young and old people who appreciate the tutorials I put out. They ask me all sorts of questions, even the ones that are in University. I feel like a true leader, this is an area in which age is not a factor.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: University students? That's pretty high level. Has your knowledge of batch, or computers in general, affected your schooling or college prospects?\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: Indeed. My parents want me to go into the sciences area (become a doctor) so I'm still trying to see which path to take. I've dreamed of becoming Bill Gate's successor many times over because his life is comparable to mine but I have no idea how I would pursue that. Every chance I get to get involved in technical or computer based courses/clubs, I take. I'm currently in the robotics team (competing in a competition soon) and I have helped my IT technician in grade 8. There were students who were shutting down computers using remote shutdown. So what I did is I created an invisible program with constantly checks for shutdown commands being applied to the computer. It was completely independent of Deep Freeze (what schools use to auto shutdown multiple computers and keep their files the same). I was really proud of that, the technician installed it on all the PC's in the school. That was the first time my software was useful to a corporation of some sort.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: A little ambitious, no? Don't worry, we all wanna be Bill Gates. I've actually helped my own school out on multiple occasions by pointing out a hole by which you could access the Registry Editor. What keeps you on HF versus leaving? I know you had a lengthy hiatus before but have only recently come back from it.\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: I am a bit too ambitious, but I still have yet to hit my limits. What keeps me from leaving HF is what I have done here. The reason I first joined HF was to learn. This went on for a year but I have now learned a lot and have become more independent. The reason why most people stay is because it is a time filler, HF is addicting. You shift from learning to looking better in the community. You start focusing on ego, reputation, awards, etc..., Omni has set up this site in a smart way. I've realized my motives now. The reason I choose to stay is to help new people, have discussions, monetize, and learn whenever I can. I'm no longer addicted to HF, which makes me feel a lot more in control.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I was addicted to HF at one point as well, but after taking my own break, that changed massively. Any closing comments to the crowd?\n[url=http://hackforums.net/member.php?action=profile&uid=675453][color=white][b]Cyber-Security[/b][/color][/url]: Nothing much, but I do have a bit of advice for those new to HF. Stay positive. The most important thing about your stay here is your personal motives. Learn what you are good at, learn how your stay will benefit you personally. If you find this, you will succeed much more. A final tip is to stay away from actions influenced by your social reputation here, you will frown upon it in the future. Thank you for your time Entity+, I enjoyed this interview. Best of luck with everything.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1018876]Phytrix[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: Hi Phytrix and welcome to the 114th edition of the HF News. Do you have any shoutouts or kind words for my team before we get started?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Hello mal! I'd like to say hello to everyone. In particular, hello to all Writers and Rhythm members. I'll pick out a few and say hello to Cryptic™, Webmasters, Apathy, -Analog-, Yellows, Tibit, illuminati, Delusion, Eternal, Saturday, Positive, Sir... just everyone. Too many people to list.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: You've changed so much in your time here, something I was always curious about: When you joined you were very much into Runescape, do you still play? And if not why?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Ah, I certainly have. When I first joined, I didn't really post a whole lot. Proud to say I wasn't like most people who first join, although I didn't post or contribute a lot. I was a lurker for a few months. I then started posting guides and threads in relation to Runescape, and was relatively active there. There's a very peculiar story behind this, though. I was becoming semi-addicted. There was a skill called Dungeoneering which I quickly no-lifed. I reached level 115 in a matter of months, and was aiming for 120. I then received a wad of money from selling floors (RS players will know what this is). I bought a hosting spot in a relatively popular dicing clan, and soon gathered a minor gambling addiction. I'd rake in the money and waste it on other hosts just for fun. I decided to quit that as I was starting to spend money IRL on it, but I couldn't fully quit. After a few months of battling it, I finally did and vowed to never go back. I enjoy the game itself and would go back, although it's changing far too much for me. That, and a huge majority of the RS community is immature past an acceptable level.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: That is a very interesting story. Must have been hard to find the time with boarding school. Since you are an attendee and a supporter of Boarding Schools. What would be the biggest misconception you would like to clarify for people?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, I only started boarding school this year (which was roughly 9 months ago, I guess). I frequented RS before that, although carried it into school. Boarding schools are interesting. They are fun, you get to meet people and form relationship, although finding time for yourself isn't all that easy. I usually have to go for a 30 minute jog to just get away from things when I'm getting frustrated or it just gets too much, and I usually just sit there for a few hours and relax. The largest misconception? Probably that all-boys boarding schools would be considered 'gay', or a majority of the boys are gay (not that it makes a difference), and hence the whole environment is like that. This is not the case. I have nothing against homosexuals, although the stereotype of boarding schools (in particular, all-boy boarding schools) being a gay environment is really quite offensive to the majority (not because it's gay, but because you're labeling a whole party).\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: It seems that your experience with boarding school may have shaped your feelings towards homosexuals. You once stated that you believed homosexuality was a choice. Do you still believe this considering the overwhelming medical evidence to the contrary?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I do still believe it's a choice, yes. I think (in fact, I know) there are other factors (the way the brain thinks and is formed) that influence this, although I think that physical factors can either be fought or embraced. I think if someone has a stronger tendency towards the same sex rather than the opposite, they should accept that and embrace it if they feel comfortable with it. If they don't feel comfortable with it, and its societies fault, then shame on society. Although, some people may not feel comfortable with it for other reasons (such as the survival aspects of size). To summarize, I believe it is a choice as with anything, although there are other factors which affect it. People without any of the medical evidence can still be homosexual, and likewise with those that do.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: Many people are influenced to feel this way due to their faith and you don’t mention your Catholic beliefs very often on HF. Is that because you are afraid to discuss them, because you are not confident in them anymore, or because it makes you feel uncomfortable?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I no longer have Catholic beliefs. malichi, you've helped me see the light! Even when I was introduced to HF, I didn't believe in the Catholic god. I simply thought I believed in the morals that the religion brought into place, although I now realize that I really don't. I despise what it stands for. I despise religion and now can see the effect it has on society. I feel ashamed for what it stands for and the comments that are made. An example of this was how the Pope said a few weeks back that homosexuals and non-believers aren't fully developed human beings. It makes me feel uncomfortable that I once could not see nor understand this, yet I've become much older and much more mature since I've joined this site. It's helped me become interested in various topics, and ultimately become much more mature and intelligent. I've still got a fair way to go, though.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: Glad I helped. Since you mentioned how things have changed for you on HF, when was it that you became more critical of the spelling and grammar of others, or have you always been a grammar Nazi?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Phytrix/Isaac: I've always had decent grammar, although it was only at the start of this year that I really started to understand it more. I'd say... roughly around April I started getting pissed off when I saw major grammatical errors and spelling errors from those who are an appropriate age and are educated, and should know how to spell/use words. Text talk is disgusting. Shortening words... I hate it. Unless it's an acronym or something (#YOLO), I see no need to shorten something like 'later' to 'l8a'. It's just plain lazy and looks messy. I have medically diagnosed OCD, so that's probably why I aim for accuracy. Not sure, details have always been very important to me. If I had any wise words to provide, it'd be to strive for accuracy in everything you do. This is the key to success. I recently received Dux (for those of you that Dux is, it's the person who received the best grades) in both Math B and Math C (I take two Math classes, and those are the two highest ones in Australia). When my teacher was asked to give a speech, he mentioned that showing full working and wording in every question is why I succeeded, which is very true. I suppose I'm over-the-top many times, as with earlier today (inside joke), although I'm usually lenient with those who have English as a second language or are uneducated for certain reasons. Everyone who is offered an education and chooses to do it dismay is an idiot, though.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: It would be interesting to see if you are as critical on those in your groups as you are in other sections. Do you still feel strongly about leaving Valor in response to what +Awesome did? And in general what is your opinion on your groups?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: My resignation from Valor had nothing to do with that issue. I just came to a realization that the quality of the group at the time wasn't something that I wanted to be associated with. I felt what happened unfair, and the group's direction isn't what anyone expected. My groups are great. They're what make me have so much fun on HF. Writers is good. There's not a whole lot of discussion there, mainly work, but the discussion I do have with other Writers is great. The Empire is a great group. It's very active, and all of the members are very friendly. It really is a great balance of quality and activeness. Logic is very intellectual and I learn a lot there. I have good friendships with multiple Logic members and I enjoy myself when I do visit. Rhythm is my favorite. I'm currently a Rhythm leader and have over 3.5K posts in the subforum. It's a very active group and everyone is friendly and enjoys coming to the subforum. While we are on the topic, we will be changing the group in the coming days. We have a name set, although details won't be released publicly. More will be told in the coming days, and it should be big. Everyone, keep your eyes peeled!\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: I am sure we will all be keeping an eye out for the “New Group”. Since I wanted to cover all three taboos; being Australian you have no real connection to the US. What are your thoughts on US politics, and specifically the presidential election in 19 days?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I don't have a strong opinion, as quite frankly, I don't care what happens. I think US politics is really over-the-top. I think the debates are cool, and I have actually watched the ones so far. Just for political information, not because I particularly care. Australian politics is much more laid back IMO. Both parties really do stand for similar things, just with slight differentiations. I feel that in Australia politics, we use seats as a currency and rather than feed lies, extend the truth. I feel there are far too many lies in American politics, and that the parties are too different. Sure, they need to stand for different things, although it's more like vodka vs. muddy water rather than red cordial vs. orange cordial. I feel America needs to bring their opinions back to home and unite as a nation more. From what I hear and see, it's still segregated in various parts. Not to an extreme, although there are obvious levels of power and respect. I feel equality needs to be reached. Full equality will never be gained, of course, but at least to the point where people don't act based on generalizations and stereotypes. I think Obama would and should win, although he needs to learn to keep things brief. I'm sure not everyone in America is relative with politics and politic talk, so he really needs to dumb things down in a sense. People want to hear a quick why and how you're going to do things, not why, when, who, how, to what extent, etc. Too much unnecessary info.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: That sounds slightly similar to Canadian politics in the sense that there is not a vast difference in the parties (as there is in the US parties). To wind down I was wondering about your feelings on a few things. When you were a regular members,  you attempted to upgrade from reg to Ub3r and were denied the first time. Why do you think that was?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Probably because I applied too quickly. I applied with few posts, rep and threads. I was denied with the PM system, and was approved roughly a week and a half later (or something like that) when I applied with the new system. I think Omni just needed to see that I would be active and wasn't just jumping in to get Ub3r and scam, or something of the sorts. I don't think it was anything about me, although I'll never know. I'm sure Omni has his reasons for everyone he approves or denys. I had an influx of posts a short time before I applied, so it wasn't like it was particularly balanced over the months. I decided to upgrade because I was treated like shit. People didn't respect my word or what I had to say, and I felt I could make something of myself on the forum if I upgraded.\n\n[url=http://hackforums.net/member.php?action=profile&uid= 1044864][color=white][b]malichi[/b][/color][/url]: Thanks for the opportunity to interview you Phytrix. Anything else you wanted to add before I go?\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for interviewing me. There aren't enough hours in the day, so I'll stress to you all to have fun with the few that you have.\n[/spoiler]",
      "subject": "[10/21/12] - HF News"
    },
    {
      "pid": "27470094",
      "uid": "515249",
      "dateline": "1350876775",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[b][color=white]Xbox 360 Sells Over 70 Million Consoles![/color][/b]\nEarlier this week, Microsoft confirmed that they have indeed sold over 70 million Xbox 360 consoles worldwide. You heard right; 70 million. It was confirmed and backed-up by Microsoft's earnings report for the 2013 financial year this quarter (after reviewing Xbox 360 sales numbers). Microsoft has sold 20 million additional consoles since last year, which is a great milestone for any company. “Xbox continues to be the top-selling console in the U.S., where it now has a 49% market share.”\n\n[b][color=white]Halo 4: Forward Unto Dawn Episode Three[/color][/b]\nThe next episode in the Halo live-action series, Forward Unto Dawn, is finally here. \"Just as Hastati Squad is confronted by a video of secret ONI super-soldiers, their war and their whole universe are changed forever by a much more deadly surprise.\" This episode can be found on Halo Waypoint or the MachinimaPrime YouTube channel. Halo 4 is set to launch on November 6th at your favorite games shop. You can view the latest Forward Unto Dawn episode [url=http://www.youtube.com/watch?feature=player_embedded&v=WbBYG77VeCE]here[/url]. \n\n[b][color=white]Facebook And Twitter Apps Removed From Xbox Dashboard[/color][/b]\nAvid Xbox players may have noticed that the unpopular Facebook and Twitter applications on your dashboard are missing. These apps were removed in the latest Xbox Fall Dashboard update. Sources say that it was done to \"spur gamers to use the new Internet Explorer browser included with the update.\" The report states that these apps are still listed on the Xbox Partners page, however they can't be downloaded from the Xbox itself. If you still have them on your dashboard, you may still use them, however new users will never have the option to see these apps. Microsoft is slowly rolling out the new dashboard to Xbox LIVE members, however it may not be pushed to your console until the 23rd of October. \n\n[b][color=white]New Game Achievements[/color][/b]\n[url=http://www.xbox360achievements.org/game/sonic-and-sega-all-stars-racing-transformed/achievements/]Sonic & All-Stars Racing Transformed[/url] - 50 achievements, 1000 points. \n[url=http://www.xbox360achievements.org/game/far-cry-3/achievements/]Far Cry 3[/url] - 50 achievements, 1000 points. \n[url=http://www.xbox360achievements.org/game/family-guy-back-to-the-multiverse/achievements/]Family Guy: Back to the Multiverse [/url]- 48 achievements, 1000 points. \n\n[b][color=white]Gaming Video Of The Week[/color][/b]\nThis week's gaming video of the week comes to us from RoosterTeeth and is the 21st episode of their \"Let's Play\" series.\n[spoiler]\n[align=center][video=youtube]http://www.youtube.com/watch?v=I2XdnuZKMlM&feature=g-u-u[/video][/align]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[b][color=white]September 11th Terrorist Rambles on in Court[/color][/b]\nIn the Guantanamo Bay Naval Base courtroom in Cuba on Wednesday, Khalid Sheik Mohammed was given right to speak without interruption by the judge, Army Col. James Pohl. \"When the government feels sad for the death or the killing of 3,000 people who were killed on September 11, we also should feel sorry that the American government that was represented by (the chief prosecutor) and others have killed thousands of people, millions,\" said Mohammed. The not-yet-guilty terrorist, fitted with a military-style camouflage vest, stated that the United States were unjustly committing inhumane acts under the guise of national security. \"Many can kill people under the name of national security, and to torture people under the name of national security, and to detain children under the name of national security, underage children,\" stated Mohammed. \"The president can take someone and throw him into the sea under the name of national security and so he can also legislate the assassinations under the name of national security for the American citizens.\" He continued his rant saying \"The president can take someone and throw him into the sea under the name of national security and so he can also legislate the assassinations under the name of national security for the American citizens.\" These claims were an obvious reference towards the sea dumping of Osama Bin Laden's body and the drone strikes on suspected terrorists and their supports. As for the camouflage outfit Mohammed was sporting, no self-comment(s) were made, although his lawyer, Army Captain Jason Wright, stated that \"Mr. Mohammed has previously distinguished himself on the battlefield by wearing a military-style vest or clothing. He did it in Afghanistan for the U.S. Government during that proxy war, he did it in Bosnia, and he has a right to do it in this courtroom.\" Khalid Sheik Mohammed and the rest of Al-Qaeda's unlawful belligerents are currently facing the death penalty.\n\n[b][color=white]No Need For Abortion To Save Mother’s Life[/color][/b]\nThe Illinois Republican Representative Joe Walsh served an uproar after he suggested that abortion is never necessary or relevant, even if to save the life of the otherwise considered to-be-mother. After a debate on Thursday with Tammy Duckworth, he stated “There’s no such exception as life of the mother,” Walsh ranted following the debate. “And as far as health of the mother – same thing. Advances in science and technology. The health of the mother has been, has become a tool for abortions any time and for any reason.” As you may already know, the American Republican party plans to illegalize abortion, even if the woman is raped. On the other hand, the Democrats are pro-choice. Walsh continued to stir the already boiling pot further as he explained that \"the research is pretty clear that with the advanced in modern medicine, an invasive and traumatic procedure like an abortion is not necessary to save the life of a mother.\" He did change his position slightly on Friday when he said that there were some exceptions, although he retained that they were very rare. However, the ACOG stated that there were many abortions needed \"to save the life of a woman or to preserve her health.\" They specifically reported that there are 600 annual deaths due to childbirth related complications. Distinguished medical expert, Dr. Anne Davis of Columbia University, asserted her expertise as a gynecologist and stated that there are many cases where abortions must be performed in order to save the life of a woman.\n\n[b][color=white]The CIA's Discovery Of Militant Links[/color][/b]\nThe CIA station chief declared only a day after the Benghazi attack that it was indeed a planned militant ambush, and not an unexpected murder that was only the result of an uncontrollable mob. As you may know, the US President's handling of the situation has become highly politicized. There have been debates from both sides of the isle on whether President Obama called it an act of terror the day after the attack, or if he disguised it as the action's of a spontaneous mob. President Obama stated \"No acts of terror will ever shake the resolve of this great nation, alter the character or eclipse the light of the values that we stand for.\" Obama said that this was his indication of it being a terror attack, but republicans retorted saying that it was used in a broader context. The Congressional Intelligence Committees are pressuring the White House to cough up documents to say leak further details, such as location, time and people involved, in relation to the attack. The delay in the case is reportedly due to conflicting stories as officials have stated that they could not differentiate if \"extremists took over a crowd, or they were a crow.\"\n\n[b][color=white]Hacker's Extradition To US Blocked[/color][/b]\nThe United States Government attempted to extradite Gary McKinnon for what was named one of the greatest hacks of all time. However, the extradition was blocked on Tuesday by the United Kingdom. Theresa May, Home Secretary, said his extradition should be blocked because \"there is such a high risk of him ending his own life that a decision to extradite would be incompatible with his human rights,\" as he is diagnosed with Asperger syndrome and depression. The 46 year old hacker has been subjected to the possibility of extradition for 10 years, which his mother calls \"an emotional rollercoaster.\" McKinnon undeniably broke into Pentagon and NASA networks to see if there was any data concerning the existence of UFOs.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Google[/b][/color]\nApple has been receiving continuing complaints about the new map app in  the recently released iOS 6. This OS was released primarily for the new Smartphone, the iPhone 5, although works on various other iOS devices and versions. In retaliation to this, Google has planned to develop a mapping app specifically for iOS 6. Various photo leaks and rumors about this app says that this app will be vector-based and will allow users to use two finger rotation anywhere on the app. It's been stated that this app will be super-fast in comparison to Apple's default map app. According to reports, Google will also add 'Google Earth' to this app to make it more convenient for users. After Apple's apology to Google for dumping Google's mapping system as their default one, it'll be interesting to see what Apple has to say on this matter.\n\n[color=white][b]Apple[/b][/color]\nApple's iPad Mini tablet is expected to hit markets very soon. There hasn't yet been an official announcement in relation to this product's release, although as always, speculation has hit the streets - hard. One leak says that the iPad Mini will be available in 4 types; 8GB, 16GB, 32GB and 64GB. Apple fanboys expect this product to compete against Google's Nexus 7 and Amazon's new Kindle Fire tablets. Apple has also planned to release the iPad Mini with the back panel coming in a variety of colors, other than the current plain black or white options. It has been said that the production of the iPad Mini has already started in Asian and European countries. Along with the iPad Mini, Apple is preparing to release new Macbooks next week. Alike with the iPad Mini, these Macbooks have their fair share of rumors and speculation.\n\n[color=white][b]Microsoft[/b][/color]\nMicrosoft's surface tablets are set to be available for pre-order just a week before the iPad Mini arrives. This is Microsoft's first tablet, although it's expected to be made, presented and marketed in such a way that it'll give other competitors a run for their money. The three models are priced at $499, $599 and $699 (depending on which model). The $499 model comes equipped with a 32GB storage space, while the $599 model includes a keyboard and a cover, although still has a 32GB storage space, while the higher-end $699 model will be 64GB. Microsoft stated \"Surface is available online in eight markets across the world: Australia, Canada, China, France, Germany, Hong Kong, the United Kingdom, and the United States. Online availability adjusts based on orders and inventory. Regardless of online availability, beginning Oct. 26, 2012, all three Surface SKUs will be available for purchase at all Microsoft Store locations in the United States and Canada, including in all 34 new holiday stores.\" \n\n[color=white][b]Facebook[/b][/color]\nFacebook has decided that they'll be removing the 'Questioning' feature for their users. Pages and groups shall still pertain the ability to use this function, which acts in a similar fashion to a multiple choice poll. In addition to this, in India, Facebook is testing out something new. It's offering a Rs.50 talktime ($1 USD approx.) to people who join Facebook through referrals. A Country Growth Manager of Facebook, Kevin D'Souza, said \"We keep on trying new things because we do not know what will work. This is one of the tests. Just to get a feel of it, this particular test is being done in India.\"\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Local Natives Announce Sophomore Album[/b][/color]\nLos Angeles indie rock band, Local Natives, has announced the release date of their highly anticipated follow-up album to their surprisingly successful '09 album, Gorilla Manor. The album, Hummingbird, is set to be released on January 29 by Frenchkiss. The National's Aaron Dessner co-produced the album, which was recorded in his New York home studio. Along with the announcement, the band also released the lead single from the album, entitled “Breakers”. You can listen to the track below. \n\n[color=white][b]Swedish House Mafia Claims Their First UK No. 1 Single [/b] [/color]\nAn appropriate farewell gift to the world and themselves, Swedish House Mafia’s single “Don’t You Worry Child” reached the top spot on the UK music charts. This was the first time in the trio’s history that they've achieved a top spot on National charts. The song is the last to be released before the group goes on an indefinite hiatus. The track sold 135,000 units, beating out Adele’s “Skyfall”, which sold 92,000 units. The song is said to be inspired by the beauty of Australia. \n\n[color=white][b]The Rolling Stones Sell Out London Shows - In 7 Minutes![/b][/color]\nThe Rolling Stones' two London concerts took only minutes to sell out; literally. The least expensive tickets (around $152) sold out in 3 minutes, while it took the pricier seats (around $601) about 5 minutes longer. Due to the high traffic, Ticketmaster’s site crashed before all of the tickets were even sold! To no surprise, almost as quick as the tickets were bought, the hot seats were being resold online for as much as $20,000. The highly anticipated shows take place on November 25 and 29 at the O2 arena.  \n\n[color=white][b]Music Videos Of The Week[/b][/color]\n[spoiler][video=youtube]http://www.youtube.com/watch?v=_OGw6SwDveQ [/video]\n\n[video=youtube]http://www.youtube.com/watch?v=SeWxEH9tb0c [/video]\n\n[video=youtube]http://www.youtube.com/watch?v=ZQHRjdlYbQU [/video]\n\n[video=youtube]http://www.youtube.com/watch?v=XvRqNUPYfPk [/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nHow we treat others does a lot more than one might thing. Be careful how you reflect a bad attitude unto others, as it may come back to bite you in the end. It's important to keep your own person inhibitions away from the way you interact with people, as it may cause a chain reaction. Your bad mood could travel twenty people before it lightens. Just my short word.",
      "subject": "*"
    },
    {
      "pid": "27470101",
      "uid": "515249",
      "dateline": "1350876782",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"How useful is the Marketplace on Hack Forums to you? Explain?\"\n\n[i]\"The marketplace here on Hackforums is very useful to me. If I have extra money, I \nalways do some searching around there for interesting products. The only problem is, of \ncourse, scammers. I have only been scammed once out of about ~10 times? But it is still \na bad problem all around Hackforums. Anyways, I believe that the marketplace is a very \nuseful place for members to buy/sell/trade thier things and hope to see something implemented \nto cut down on scamming sometime in the future.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018479][i]-Phaxol[/i][/url]\n\n[align=right][i]\"The marketplace is my livelihood. Without it, I would have no idea where I'd \nbe right now. Competition is fierce making it a challenge to get your products to the top. \nIt's like a game, practice and you'll succeed.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1014929][i]-Chloe Moretz[/i][/url][/align]\n\n[i]\"The marketplace has been a great place for me! When ever needing anything all I need to \ndo is go looking in there and the product would be in there. Everything being made in the marketplace \nis always getting better as well every week, so its always good to see what's new in there. To \ntop it off it once was a place where I made a few £££ there too, so quality! The only thing that \nlet's the marketplace down is the scum of HF scammin every poor Fucker\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=548259][i]-r0flez[/i][/url]\n\n[align=right][i]\"I think this is very helpful for virtual items but for physical items I would not recommend. \nI think it's not safe to buy physical items from the marketplace unless you get a recorded delivery( tracked) \nbut for virtual items it is the best. Scammers really don't help themselves now a days and they just try and \nruin the market place. What I think would be helpful is that Omni release a type of award that lets users \nknow if they are trusted or not. I think that this will stop many scams and it will become a safer environment \nfor everyone and that they can buy items without hassle.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=733456][i]-Dalek Youb[/i][/url][/align]\n\nThe topic for next week is \"What do you think of all of the recent changes on Hack Forums?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iPb1q71rDb5o2.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibfW69Ud4rZSL6.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/iUnWRvTNOE5Gg.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=660659]-Anal OG-[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]Prince™[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=%201044864]malichi[/url] (Once)\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}