{
  "posts": [
    {
      "pid": "34127165",
      "uid": "515249",
      "dateline": "1374561924",
      "message": "[align=center][IMG]http://i.minus.com/jKNmbtspH7Pil.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#E42217][b]152nd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jbd50RvJc3HTdt.png[/img][/align]\n[color=white][b]P0W3R Isn't Dead After All[/b][/color]\nWell as we all know the discussion of P0W3R formed quite some time ago, but generally died off, and [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] said P0W3R will not be coming to Hack Forums. Yesterday a thread started by a user named [url=http://hackforums.net/member.php?action=profile&uid=42221][b]tester[/b][/url], which we all know if you have been around Hack Forums for quite some time, is [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s testing account for testing new features, groups, and other little updates. The [url=http://hackforums.net/member.php?action=profile&uid=42221][b]tester[/b][/url] account has a userbar which have never been seen before and reads \"HF 3p1c\", which is a new usergroup [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] is working on. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] claims this usergroup will most likely be under $20, and even $10-12, but BTC will probably be the only currency accepted for this group. For those who are confused, this is just an add-on group. There is no approval required, and no status requirements. Regular, L33T, and UB3R may purchase this add-on. The features of this group will be shorter flood times for PMs, searching, and possibly even more PM space. [b][color=white]You may view the official thread here: [/color][/b] http://hackforums.net/showthread.php?tid=3629832\n\n[color=white][b]Staff Changes and Re-Promotions[/b][/color]\nHF member [url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus[/b][/color][/url] has now been promoted to Staff after serving as a Mentor for a few weeks. [url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus[/b][/color][/url] is currently only on probationary status, which is basically a term for staff on trial. We wish him luck on his journey. Former reputation abuse manager [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#00FF00][b]Judge Dredd[/b][/color][/url] has been promoted to Staff after being demoted from Administrator. [url=http://hackforums.net/member.php?action=profile&uid=65784][color=#4DD0FC][b]Xch4ng3[/b][/color][/url] has been promoted to Administrator status and is now in charge of all account related issues, contact form included. Last but not least [url=http://hackforums.net/member.php?action=profile&uid=47360][color=#0066FF][b]The-Ex[/b][/color][/url], formerly known as Saged, has been demoted from Staff to Mentor status. [color=white][b]You may view the new staff changes here: [/b][/color] http://hackforums.net/showstaff.php\n\n[color=white][b]Marketing Group Illuminati Opens Recruitment[/b][/color]\nGroup owner [url=http://hackforums.net/member.php?action=profile&uid=677529][b]Αnonymous[/b][/url] of the infamous marketing group Illuminati has opened recruitment. The illuminati has the description of \"The illuminati is based on marketing, monetizing, selling, buying, trading, currency exchanging, free services & giveaways. In addition to the supposed shadowy and secret organization we are just overall into helping those who desire the passion of making money online & offline.\" So if you think you may have the skills to get accepted into this marketing group, and wish to apply, visit the link below. [color=white][b]You may view the recruitment thread here:[/b][/color] http://hackforums.net/showthread.php?tid=3628559\n\n[align=center][img]http://i.minus.com/jbrPyz6ReCubi3.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=65784][color=#4DD0FC][b]Xch4ng3[/b][/color][/url] was promoted to Administrator. Congratulations to him!\n[url=http://hackforums.net/member.php?action=profile&uid=4066][color=#00FF00][b]Judge Dredd[/b][/color][/url] is site Staff once again.\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#00FF00][b]D3xus[/b][/color][/url] is now Probational Staff.\n[url=http://hackforums.net/member.php?action=profile&uid=1148878][b]Clique[/b][/url] has hit 10,000 posts.\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b]Positive[/b][/url] has been promoted back to Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=47360][color=#0066FF][b]The-Ex[/b][/color][/url], previously known as Saged, is no longer Staff and is now a Mentor.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1007343][color=#383838][b]BELLAGIO[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1702377][b]Poliwag[/b][/url] was banned with the reason: \"Your dog is ugly.\"\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1007343][color=#383838][b]BELLAGIO[/b][/color][/url] had their account closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=183072][color=black][b]Mr Kewl[/b][/color][/url] has taken a vacation ban.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=677529][b]Αnonymous[/b][/url] donated for the Bitcoinage award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=275104][color=#0066FF][b]Delicious[/b][/color][/url] donated for the Bitcoinage award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1374668][color=#0066FF][b]Deployment[/b][/color][/url] was gifted the Gift award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=956054][b]Emylbus[/b][/url] was gifted the Gift award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=987097][b]Tarn[/b][/url] was gifted the Gift award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=40895][color=#0066FF][b]Citizen Snips[/b][/color][/url] was gifted the Gift award.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=42927][b]Lani[/b][/url] is now a leader of Illuminati.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=770060][b]Invisus[/b][/url] is now a leader of Illuminati.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1017396][b]Prox[/b][/url] is no longer a leader of The Empire.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1589910][b]Operate[/b][/url] is now a leader of Void.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url] is now a leader of Complexity.\n[/list]\n\n[align=center][img]http://i.minus.com/jMSrdyQChTalc.png[/img][/align]\n\n[i][b]Helpful Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3620042][AV, AM, AS] Security Tools Ultimate Compilation [with Rating] [Mega Thread][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1431113][color=#0066FF][b]Antigen[/b][/color][/url] - A compilation of the recommended Anti-virus, Anti-mwalare & anti-spyware tools.\n\n[i][b]Helpful Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3569941]The Ultimate Compilation of Hack Forum Userscripts[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1306528][b]xadamxk[/b][/url] - A fantastic compilation of Hackforums most helpful userscripts.\n\n[i][b]Group Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3628559]Illuminati | Official Marketing Group | Applications thread[/url] - [url=http://hackforums.net/member.php?action=profile&uid=677529][b]Αnonymous[/b][/url]- Apply for the official Hackforums group Illuminati here.\n\n[align=center][img]http://i.minus.com/jun9oZkuCHRrn.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=509788]Makaveli The Don[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Today on the HF News, we are interviewing a wearer of the Blackhat award without the Master Donator award! Welcome to your interview for the Hack Forums News, Makaveli. Anything you'd like to say before we begin? Any shout outs?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: I would like to thank you for giving me this oppurtunity. Shout out to Bugga, Tweety, Judge Dredd, Tando and you Connected. 😝\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: When did you join Hack Forums and why?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: I was just a noob like everyone else, searching for hacking related sites. I was visiting some arabic forums before and learning some site hacking and carding. Then I joined Hackforums. I was crap at english at the time but everything improves with time and work.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: After spending some time on HF, what were the initial goals you set for yourself?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: I didn't really have much goals back at time. I didn't post much and was visiting the hacking sections to improve my hacking skills. I wasn't a bad user but you know the community hates on noobs who doesn't know shit and ask random questions. I was getting a lot of neg reps. So one my goals was to get to 0 reps. One day, I was visiiting the contests section and I saw an upgrading contest by Rainbow Dash(Idk if he's still around). It was gonna end so I said why not. He did a random.org and got some numbers, then he decided to add an additional number and it was me. I was so happy and after time, I got L33t. I was so happy so I set my goal to get out of negatives. Then after that, some shit went down, and someone made a thread breaking rules and to be honest many were involved without knowing, then Omni came on, close the thread and repfucked everyone including me. Again, my goal was still to get to the positives again. I did it in under 2 days and if you check my username history, you'll know how. =)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: What sections do you like the most on Hack Forums and why?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: The sections I like are the most I visit daily. I always open hackforums, check the Announcements section, The Groups section including subforums of groups I'm in, then I check the Marketplace and sometimes the lounge. I used to be a lounge whore but I now don't post much there. I focus mostly on site news, helping users and marketing.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: I see you recently got a leader position within the Complexity group. Congratulations on that. What sector are you in and what's your goal as a leader?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: Thanks. I was the marketing sector Head. I'm still even if I got leader. My goals would be to make Complexity one of the best groups in HF history. I know it sounds ridiculous but it doesn't hurt to try. I feel bad when I hear negative sayings on the group, but trust me, I'll change all of that. ;)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: How much have you made with your marketing skills so far? Without going too in-depth, tell us about the techniques you use.\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: I make a lot when I put time and effort in. Most people on HF doesn't realise that there is only one step behind being successful which is taking action. I see complaints of people saying they read ebooks and it won't work for them. It's because you actually just read it and close the PDF thinking the cash will come to your mailbox. That's a wrong idea and you should all start sweating a little in order to see some results. Omni said the same thing about the matter and you can refer to his post:[quote='Omniscient' pid='34027998' dateline='1374177126']\nOld adage comes to mind.  Your mileage may vary.  \n\nWhich basically means that a \"Make $50 per day\" ebook isn't going to make $50 per day for every member that buys it.  YOU are the biggest factor to any money making scheme.\n[/quote]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: That's right. Many people think that a written method they found will brind them in cash. I can't stress that enough, even to the buyers of my e-book: \"Tweak the method to something you like better. If it comes to it, make it your own method.\" Anyhow, do you have any plans about products you will release in the near future?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: I can't reveal much but I'm planning on releasing High Quality products as I always do. My plan is to change the HF market's ideas about most of products and prove that not all the products that you buy on HF are shit and ran by 12 years olds who don't know what they're doing.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: I was testing your marketer intelligence there. Not revealing your produdcts is the smartest thing you can do at this stage. People can easily copy you if your idea is original. Now, tell me about a section that you dislike on Hack Forums.\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: Thanks. The section I hate mostly is the SRRP section. It's one of the most sections I avoided since I joined. I just feel like people shouldn't judge others religions, ideas etc... I think it's pretty useless to be honest. Nothing will change based on the mouth of a 14 years old and nothing good comes out of that section. All the HF trolls will always come to that section to make a group of people angry by insulting them or dragging some historical events into the chat without knowing anything about the background of the group. I think people should grow up and start to learn before they talk. As for me, anyone who will try to say bad things about me without knowing me, I would always respond to them that only God can judge me.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: What are your goals for your future on Hack Forums?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: My goals for me would be to help the most of users I can with my way. I also want to accomplish an official status on the forum. I've always wanted to be a mentor/staff because I see a lot of people who joined after me getting these ranks. I'm not the one to decide on such matter but Omniscient only. I also hope that one day my country gets unbanned from HF because I struggle a lot with VPNs just to come here and help users.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: I'm going to cut on some personal questions per request. What are your hobbies in real life?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: Well, I mostly like sports. I have been bodybuilding for like more than a half year now. I stopped for like 3 weeks now since it's summer and I fast since I'm a muslim, But I won't stop at all. I'll be back to hit the gym eventually in a week or so. I like to watch football matches (not american football) a lot. I also like to play video games on my xbox 360. I spend my most of free time planning marketing techniques etc...\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Football ftw! Me and my friends call it football but on the internet I'm limited to calling it soccer because of the American members 🤣. Anyways, thank you for making this interview possible, it was fun. Any final words?\n[url=http://hackforums.net/member.php?action=profile&uid=509788][b]Makaveli The Don[/b][/url]: Thank you for giving me this chance. I just wish that HF users mentality changes with time. I also want to say that despise the bad users, the community is good in general. I hope everyone reads the rules and keep themselves up to date to make it easy for themselves and for the HF staff. Thanks again and good night to everyone. Stay awesome. c:\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Will do. Readers, please send a private message to me  [url=http://hackforums.net/private.php?action=send&uid=1050193&subject=Interview%20Feedback][b]here[/b][/url] with feedback and comments about this interview.[img]https://cdn1.iconfinder.com/data/icons/mazes/07%20Cool.png[/img]\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=65784]Xch4ng3[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: For the 152nd edition of the HF News, we have our newest addition to the admin team, Xch4ng3. Any shoutouts or comments you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I try to keep a low profile on here so not much interaction with the members but everyone who was around June 2009 when I first joined deserves a shout out. This is a community at the end of the day and I wouldn't have progressed if there wasn't some level of acceptance from them. Everyone on the current staff roster and ex-staffers deserve a shout out too for their efforts in keeping HF clean.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Awesome. How did you find your place on HF, originally in the Marketplace and then as staff?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I tried to be as general as possible when I came here, I leaned more towards the hacking section since I had a strong interest in reverse engineering but as time went on I started focusing more on the monetizing section. I had some interest in the marketplace but in all honesty that was only because of my exchanging service I used to run.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Did being on the staff, and now administrative, team force you to close the exchange service? Or what was the cause?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: It was more of a personal reason. I've dealt with chargebacks, and most of the time I can deal with maybe $50-$100 because I can catch up in terms of recovering the loss but a few bad deals netted me a loss into the thousands and I thought it might be a good idea to call it a day. Staff did play a fairly big role, so closing the service allowed me to focus on staff duties and get some free time that I needed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: That's understandable. Can you explain the full bounds of your role as an administrator over multi-accounters?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I can't go into too much detail for obvious reasons, but I can do enough to keep ban evaders and multi accounters under control. The nature of the Internet means it's almost impossible to keep anyone away but I believe that I can do as much as possible to make life harder for ban evaders and multi accounters.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: What sort of tools do you have at your disposal, that you can publicly mention?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I wouldn't want to mention anything publicly anyway. The less people know about how I catch ban evaders the better. I wouldn't want to give away anything that ban evaders can use to work in their favour. :)\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: My mistake for bringing it up. What was your initial reaction to receiving the invitation?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I was quite surprised. I'd just woken up so I was fairly groggy. Took a while to sink in to be honest.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: I remember it being similar for me. Did you react the same for your staff appointment, or differently?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: It was pretty much out of the blue for my staff invitation too. I didn't see myself as a important member on HF at all, so for me to invited onto staff for just doing what I usually do was quiet surprising.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: You've seen a lot of staff members come and go. What are some of the more memorable or interesting things that have happened during your time?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: Interesting question. To be honest, there's always something interesting on HF. Either someone's on a scamming spree, some members made a huge HF development, group changes or changes in site policy.\nI'd have to say the hacker22 fiasco was quiet interesting to see unfold. Mainly because he did it for the attention rather than a malicious purpose and he essentially got what he wanted.\nA lot of things happen but I find that HF eventually moves on, occasional remarks about events occur but HF as a whole generally moves on.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Do you think the new server and security addons, such as the new reputation system and server setup, will provoke things in the future? Or will things remain monotonous for the most part?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I think people will always try to attack HF in some way. There's a lot of members who have been banned, I won't go into whether they deserved it or not but they're annoyed. So they'll find some way to disrupt HF and make Omniscient's life harder. I don't think there's been one day on HF since I've been here that I haven't seen some kind of malicious activity towards the community or the site. Thankfully it's in very small doses.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Omni has done a lot of work to keep HF online. Why do you, personally, think so many people want to attack the site?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I personally think it's because they're pissed off. Either at the state of HackForums or if they have a personal issue with Omniscient. Either way, I don't think Omniscient really cares who the attacker is. The way I see it, an attack is an attack and instead of worrying about who it might be he probably just focuses on getting the site back up.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: One of the most prolonged attacks, VIP HF, has caused a lot of controversy and irritation to its owners. Do you see an end to this debacle in sight?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: I'm sure it'll come to a halt some day. We've had many forums spam us over the last few years and eventually it does stop.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Hopefully sooner rather than later. That's all the time we have, unfortunately. Any closing remarks or comments?\n[url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#87CEFA]Xch4ng3[/color][/b][/url]: Just wanted to thank the community once again. Truth is HF wouldn't be where it is without you guys, so for the members who have stuck it out from the early start - thank you.\n[/spoiler]",
      "subject": "[7/21/13] - HF News"
    },
    {
      "pid": "34127198",
      "uid": "515249",
      "dateline": "1374562068",
      "message": "[align=center][img]http://i.minus.com/j3DPVBZWZdb4x.png[/img][/align]\n[color=white][b]Microsoft on Xbox One Messaging[/b][/color]\nMarc Whitten has admitted that Microsoft has not done enough to explain the Xbox One benefits. \"I think it's pretty simple. We've got to just talk more, get people understanding what our system is,\" Whitten told IGN in a new interview. \"The thing that's really gratifying is that people are excited about the types of features that are possible, and it's sort of shame on us that we haven't done as good of a job as we can to make people feel like that's where we're headed.\" Microsoft recently did a 180 on a few Xbox One Policies, including the family sharing plan. However, Marc said that the family sharing plan my return in the future. \"What it tells me is we need to do more work to talk about what we're doing because I think that we did something different than maybe how people are perceiving it,\" Whitten said. \"When I read some of the things like that petition, from my perspective we took a lot of the feedback and, while Xbox One is built to be digital native, to have this amazing online experience, we realized people wanted some choice. They wanted what I like to call a bridge, sort of how they think about the world today using more digital stuff.\" \"What we did, we added to what the console can do by providing physical and offline modes in the console. It isn't about moving away from what that digital vision is for the platform,\" he added. \"It's about adding that choice. Frankly, I think we need to just do more to let people see how the console works, what they're going to be able to do for it. I think a lot of the things they're wishing for are frankly there.\" The Xbox One launches this November for $500 US and $599 AUD.\n\n[color=white][b]PS4, Xbox One Shortages at Launch[/b][/color]\nAccording to an analyst, the next generation consoles may have an initial console shortage this holiday. Colin Sebastian spoke with GameSpot and said due to the \"complexity\" of coordinating the launches, \"it is more likely than not that there will be initial shortages.\" \"This also partly explains why the manufacturers have been somewhat judicious in allocating pre-sale units to retailers, so that there won't be a lot of unhappy customers from day one.\" However, Colin did not say which console will launch first or when. \"From a timing perspective, both platforms will want to launch before Thanksgiving/Black Friday, and ideally at least a couple of weeks in advance of that in order to replenish the retail channel,\" Sebastian said. \"In terms of who goes first, it would certainly be ideal to launch first, and gain all of the initial attention and momentum, as console launches are really the only equivalent of a 'red carpet' event for the industry,\" he added. The Xbox One is set to launch this November, while the PS4 will launch sometime this holiday 2013.\n\n[color=white][b]Weekly Video[/b][/color]\nThe Red Dragon explains some new features that Microsoft revealed at Comic Con 2013.\n\n[align=center][video=youtube]http://www.youtube.com/watch?v=6c6cXSsBUrw[/video][/align]\n\n[align=center][img]http://i.minus.com/jnu3IMOhyb7dH.png[/img][/align]\n[color=white][b]New Launcher[/b][/color]\nShortly after the release of 1.6.2, Mojang has pushed out a newly-designed launcher. Without changing the appearance completely, they managed to at least clean it up and beautify it, if you will. The launcher was given a version ID separate from that of the client– 1.11.\n\nThough the new client is similar in functionality and still serves multiple purposes such as the update log, profile editor, and development console, the client becomes inaccessible when the game itself opens. Other than that and the appearance, the new client has shown no noticeable differences.\n\n[color=white][b]New Biomes to Come?[/b][/color]\nDuring recent events/conventions, Minecraft developers had spoken vaguely of their plans to introduce new biomes to Minecraft along with the revision of pre-existing ones. Said developers had specifically mentioned their plans to go about changing ocean biomes, but again (and more importantly) did state that new biomes were in mind.\n\nMinecraft players all over are trying to anticipate what type of biomes will be released and have came up with some pretty wacky stuff. Some have even already classed the upcoming 1.7 as \"The Biome Update.\"\n\n[color=white][b]Minecon 2013[/b][/color]\nMore details for the much-anticipated annual Minecon event have arrived and been confirmed. Minecon will take place in Orlando, Florida during November 2nd and 3rd. It is said that the event will take place in Orange County Convention Center (OCCC), which is a very convenient spot if you're visiting the area out of your home state. It's a very-relatively close drive to popular places such as Orlando Studios, Islands of Adventures, and Aquatica.\n\nIt's very likely that users will be given access to a cape in some way or somehow just like the past two events.\n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]Uberminecraft[/color][/b]\nIf you've ever wanted to play a mini-game server, then Uberminecraft is your place to go. Uberminecraft hosts over 15 mini-games including, but not limited to: Minecraft DayZ, The Walls, PirateCraft, Search and Destroy, ZombieCraft, and SkyBlock. Thousands of people are always online to play with you so you'll never be alone during the server's nail-biting type of fun. Head over to Uberminecraft.com today to play!\n\n[align=center][img]http://i.minus.com/jQ5EQ2ltjeK36.png[/img][/align]\n[color=white][b]Detroit Files for Bankruptcy\n[/b][/color]The US city of Detroit in Michigan filed for chapter 9 bankruptcy on Thursday. The big city did this in an effort to bail out the city that was crumbling under billions of dollars in debt, decades of mismanagement, and loss of tax revenue. The bankruptcy filing has made Detroit the largest city in United States history to do so. After the recession when the major car companies decided to leave Detroit, it left the city in poverty, which lead to many wealthy people leaving the city. This left the city in poverty with many people not being able to pay taxes to keep the city in check.  With the city filing for bankruptcy, all civil servants had to be reduced such as police officers and firemen just to name a few. The population of Detroit has dropped over the years; it was 1.8 million in 1950 and has dropped to approximately 700,000.\n\n[color=white][b]Israel to Free Palestinian Prisoners\n[/b][/color]Israel has said it will release a number of Palestinian prisoners as part of an agreement with US secretary of State John Kerry. Yuval Steinitz, minister responsible for international relations, said that it would involve “heavyweight prisoners in jail for decades.” The release of prisoners would take place in stages, Mr. Steinitz said. According to Israeli human rights group B’Tselem, 4,817 Palestinians are held in Israeli jails. More is to be announced on the status of the Palestinian prisoners.\n\n[color=white][b]Five Guilty in Costa Concordia Trial\n[/b][/color]A court in Italy has convicted five people of manslaughter over the Costa Concordia shipwreck off Giglo Island which killed 32 people in January of 2012. Two offices, the helmsman, the head of cabin service and the head of the crisis team were given up to two years and 10 months in jail for multiple manslaughter, negligence, and shipwreck. Captain Francesco Schettino is being tried separately. He is being charged for abandoning his ship and multiple manslaughter. The captain faces 20 years in jail if he is found guilty.\n\n[align=center][img]http://i.minus.com/jbirdFfeOijxAv.png[/img][/align]\n[color=white][b]Recognition Online?[/b][/color]\nWeb-only series including House of Cards, Hemlock Grove, and Arrested Development have made history by being the first stream-exclusive television shows to be nominated to win an Emmy. With an astounding nine nominations for House of Cards, two for Hemlock Grove, and three for Arrested Development, stream-exclusive T.V. shows have taken the 2013 Emmys by storm. Most specifically noted though, House of Cards was nominated for the best television drama series. Only time can tell how well they'll do.\n\n[color=white][b]Important Update by Tumblr[/b][/color]\nOn July 17th, Tumblr pushed out an update for all of its iOS users credential to their account security. According to spokesmen for the popular app, passwords were at risk of being compromised under certain circumstances. Their obvious vulnerability was quickly fixed shortly after its recognition by the developers. No further details were provided on how the passwords were obtained or how largely it affected their user-base. Upon download of the update, users were prompted to change their passwords both on Tumblr and anywhere else the same or similar password was used. \n\n[color=white][b]You Can't Be Too Careful[/b][/color]\nUsing his 'knockoff' charger, a Chinese man named Wu Jiantong was electrocuted by his iPhone 4. During a similar case this month, another woman was also shocked and killed by answering her phone while using a third-party charger. Though they believe that the third-party charger was at cause, Apple officials stated that there would be an investigation regarding the injuries. Don't be alarmed though–-said knockoffs are easily spotted as their prices are 1/10th the price of an official charger produced and manufactured by Apple.\n\n[align=center][img]http://i.minus.com/jsSqf056c30Ww.png[/img][/align]\n[color=white][b]Jay-Z Makes History With Magna Carta Holy Grail #1 Debut[/b][/color]\nYet again, Jay-Z makes another successful album. He has currently sold over 1.5 million copies of his album, Magna Carta Holy Grail. The album sold over 527,000 copies in the first week. The Billboard that the album is listed on, has not announced that the album hit over 1 million copies sold even with the albums that were pre-ordered. This album has definitely beat his past two albums. He sold over 476,000 the first week with The Blueprint 3, and over 436,000 with Watch The Throne last year. Justin Timberlake's The 20/20 Experience had over 968,000. Jay-Z has passed over well known artists such as Daft Punk and their new album, Random Access Memories. Rumors have it that Jay is likely going to be #1 again next week.\n\n[color=white][b]Britney Spears 'talked some sense into Bieber'[/b][/color]\nJustin Bieber has been in a lot of headlines the past few months, but not in a good way. He has been seen doing negative things that most people his age wouldn't do. He's been accused for spitting on a DJ's face, peeing in a bucket at a club, and spraying a painting of Bill Clinton and saying, \"F**k Bill Clinton!\" Britney became popular around the time she was 18. She could relate to Justin; being exposed in the limelight, going to parties, having fun, and just being a teen. She too, had to go through a struggle. She went through rehab, divorced her husband, and went through tough times. The team that works with Justin wanted her to talk to him about his life. They wanted her to explain to him that you shouldn't be doing these things. Just because he has the power and the money, he should be spending his time doing other things, not ruining his reputation. She went into detail how this type of activity could lead to other things such as death, rehab, and other crazy things. He may not like it, but she said to lay off of the party life.\n\n[color=white][b]Kanye West 'unsure about marrying a Kardashian'[/b][/color]\nThis is a complete shock for some because of how far the two made it. Kim Kardashian and Kanye West have been dating for a long time now. They have even gone deeper in the relationship, and Kim had a baby. Kanye reported that he was not ready to become a member of the Kardashian family. Surprisingly enough, he does not want to get involved with the TV shows, the fights that go on, and just being on camera. 'Kanye has the perfect out, he can't marry Kim yet because he is going on world tour later this year,' a source told Radar Online. 'He loves Kim, but just isn't sure about marrying into the family.' He's also spoken to Kim's mom, Kris Jenner, that he wouldn't want a big wedding. Most likely it would be broadcasted on television, and he does not want that. This would also be Kim's third marriage and Kanye's first. It's a big deal to him and he does not want to mess it up, as well as have it broadcasted to everyone who has access to a television.\n\n[color=white][b]Music Video of the Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=Vuv2mvfO_mg[/yt]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jj0OFp0aBuwTS.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nJust some news for y'all, I broke one of my fingers yesterday and will be slightly out of commission for a short while.\nI'll still be online, but I will be less active due to typing complications.",
      "subject": "*"
    },
    {
      "pid": "34127202",
      "uid": "515249",
      "dateline": "1374562072",
      "message": "[align=center][img]http://i.minus.com/jbyZ42NjdFe8OT.png[/img][/align]\n\n\"What do you think of the possible scandal involving Black Diamond?\"\n\n[i]\"From the start BD seemed like a good group with somewhat potential, \nbut it quickly became clear that [M] had serious problems when it came \nto handling money, and that he was in fact just money hungry. A variety \nof threads really gave me the impression that he was in it to earn and not \nto help the community. I honestly feel that BD needs new leaders and or \na whole new theme in order to survive as a group, since the current state \nis, to me, feeling a bit desperate. How can you run a marketing group when \nthe very foundation of the group is based on a scam? I hope that someone \nwill take on the responsibility to lead the group and that it will go well. \nPersonally I don't see Black Diamond surviving long, because in the short \namount of time it has been, it has already made me disappointed and \nsuspicious. The group tried to sell themselves as superior and in the end \nit turned out that it was not nearly that.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=770060][i]-Invisus[/i][/url]\n\n[align=right][i]\"There never was a \"scandal\". In the wake of the events, \nI have spoken to and befriended [M] and the two of us have gone over \nevery inch of the group: it's past, future, goals, achievements and this \n\"scandal\". It was all a ploy, and I've seen numerous pieces of evidence \nto prove it. Black diamond has huge potential, and if [M] continues to \nco operate with me and a few others, we have big plans for were the \ngroup is going next. Black diamond will be the biggest and best marketing \ngroup HF has ever seen. Watch this space.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1624866][i]-Muzzy[/i][/url][/align]\n\n[i]\"Wow, I read the threw the pages on both of those threads, every \nsingle post. I honestly think there is no need for whats going on. A lot \nof things could have been prevented if they just talked it our for a little \nwile longer, for example, they we're still speaking to each other about it \nin the thread, take it to Skype and work it out. So much chaos, but if I \nneed to choose sides I am on Voxa's side for 1 reason only, [ M ] Posted \nsomething in his signature. It stated \"VoxaDub is removing everyone from \nthe group, the group will be restored.\" [ M ] was the one removing \neveryone, I know that for a fact. Voxa was just re-added the members. \nThat's my opinion.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1759389][i]-Tᴇɴᴀxɪᴜᴍ[/i][/url]\n\n[align=right][i]\"Personally, I don't understand the whole drama, but it \nseems everyone in the group is at fault. It honestly looks like The Marketers \nscam V2. People are involved in rep abuse, vouch requests,  requests, \nand all the leaders care about is money. I think people just to need to wake up.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=580684][i]-RDCA[/i][/url][/align]\n\nThe topic for next week is \"How do you feel about the new HF Ep1c?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jt8zvcWASdwiA.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ibyu8th3cwUR5z.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbgT0f4nbbOTe0.png[/img][/align]\n[align=center][spoiler=][img]http://www.toonhole.com/comics/2013-07-19-DNA_Test.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://24.media.tumblr.com/01d335a8cc9f54e0886634144139b022/tumblr_mqejcpSsDo1rbl695o1_1280.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Kris/internet.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://jbabbcomics.com/comics/2013-07-22-7-22-2013.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jlltcZhXLjBbZ.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=121196]Natha[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News\n[*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=469528]Odin the Wanderer[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692131]Anima Libera[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1050193]Connected[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=763021]Retribute[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}