{
  "posts": [
    {
      "pid": "26877510",
      "uid": "515249",
      "dateline": "1349064418",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#9f2dc5][b]111th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\r\n[color=white][b]Omniscient Offers Mercy Day/HEV Hunted[/b][/color]\r\nEarlier this week, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] stated that he was offering a 'mercy day' to those who've had their accounts closed for whatever reasons. Members with their accounts closed simply had to use the Contact Form. It's unaware if he forgave [b]everyone[/b] who applied to be forgiven, and most definitely not Honor Et Veritas. Honor Et Veritas was the previous owner of the Coders usergroup and is infamous for more or less scamming [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]  and paid members of the usergroup. Anyhow, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]  offered a 'reward' for whoever could track down Honor's new account, which Honor claimed to be 'very reputable'. It seems that Honor's new account was actually Syndicated, although the person who released this info is anonymous. You can read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s thread on the tracking down of HEV [url=http://hackforums.net/showthread.php?tid=2889796]here[/url]. You can read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet on the mercy day [url=http://twitter.com/HackForumsNet/status/250284630169763842]here[/url].\r\n\n[color=white][b]Google Authentication[/b][/color]\r\nA few days ago, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] announced that he was working on an \"exciting new feature for HF\". He also stated that it would be one of his favourites and would help protect/secure HF accounts. Only a few hours after that tweet, another tweet was posted linking the feature. The feature is Google Authentication. This Gauth system is currently only available to Ub3rs, as it's still in beta stages. \"Google Authenticator is a mobile application that allows you to generate verification codes on your smartphone without a network connection. Gauth is available on Android, iPhone, iPod Touch, iPad and BlackBerry Devices,\" MarkMare explapined. To see the feature, click [url=http://hackforums.net/gauth.php]here[/url]. To see how to use this feature, you can view MarkMare's how-to thread [url=http://hackforums.net/showthread.php?tid=2904286]here[/url].\r\n\n[color=white][b]Deal Dispute Database - Beta[/b][/color]\r\nThe [b]long[/b] awaited Deal Dispute database was finally released this week. Good timing as well, as xerotic's scam database was recently shut down for cost/time purposes. Anyhow, the DB was in a beta stage for roughly 3 days, and as such, was only available to Ub3rs. It's now available to all members. The DB has 5 columns, which include: thread, claimant, defendant, amount and status. Members can add a person to the database by going to the page and following the prompts (fill in info on the page). The DB has been going smoothly and few issues have arose yet. Hopefully it continues to go smoothly. The dispute database can be viewed by following this link: http://hackforums.net/disputedb.php\r\n\n[color=white][b]Rap Battle Possibility[/b][/color]\r\nThere have been multiple suggestions for a rap battle section over the past few months and it seems that they haven't gone unnoticed. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] announced in a thread two days ago that he is considering it and started taking inputs on the topic. It seems he is slightly on-the-fence about this one, although from the responses provided in his thread, it seems it will most probably go ahead. The thread has received 10 pages of responses to date and a decision is expected to be made relatively soon. Positive responses will most probably persuade [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] rather than he himself weighing out the pros/cons. I'm sure our poets and minstrels will be excited to see the outcome of this one! To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s thread on this matter, click the following link: http://goo.gl/ioF7E\r\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\r\n[color=white][b]User News[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=285508][b]Pocky[/b][/url] reached 20,000 posts while [url=http://hackforums.net/member.php?action=profile&uid=701593][b]Saga[/b][/url]  reached 10,000 posts! Congratulations to both of you!\r\n[url=http://hackforums.net/member.php?action=profile&uid=1442089][color=#FFD700][b]quincie♥[/b][/color][/url] reached 100 posts.\r\n\n[color=white][b]Repfucks[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1160330][color=black][b]WarrioR™[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=83317][color=black][b]Automatic Coding[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=58683][color=#FFD700][b]Zeon[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=962283][color=black][b]WinRAR™[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=506241][color=#0066FF][b]Tundrun[/b][/color][/url] was repfucked.\r\n[/list]\r\n\n[color=white][b]Bans[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1160330][color=black][b]WarrioR™[/b][/color][/url] was banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=891268][b]OnTheFly[/b][/url] was banned after having a compromised account.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=509788][color=#0066FF][b]Makaveli The Don[/b][/color][/url] was banned for impersonating Staff.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=660659][b]-Analog-[/b][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=492095][color=#FFD700][b]Levi[/b][/color][/url] was banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=83317][color=black][b]Automatic Coding[/b][/color][/url] was banned for being a low quality member.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=298746][color=black][b]Grammar Rays[/b][/color][/url] was banned for trolling... again.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=622763][color=black][b]nicker[/b][/color][/url] was banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=992333][color=black][b]Accident[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=687297][color=black][b]Le Barney[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=#0066FF][b]mybboss[/b][/color][/url] was banned for trolling.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=962283][color=black][b]WinRAR™[/b][/color][/url] was banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=129985][color=black][b]Professor Desiderius[/b][/color][/url] was vacation banned.\r\n[/list]\r\n\n[color=white][b]Awards[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451][color=#0066FF][b]Yellows[/b][/color][/url] got the Sticky Man award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544][color=#0066FF][b]Cody‍[/b][/color][/url] got the Da Bomb award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1263952][color=#0066FF][b]Daisy[/b][/color][/url] got the Master Donater award and the Cute and cuddly award.\r\n[/list]\r\n\n[color=white][b]Group Leadership changes[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=23809][color=#0066FF][b]Viral Dragon[/b][/color][/url] is no longer a leader of Root.\r\n[/list]\r\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1379117][b]Godlike_[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2896312][b]Do you believe in Aliens?[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1142415][color=#0066FF][b]Rapture™[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2894047][b]And Then 0 Multiplied.[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1388267][b]Ryan Frost[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2898093][b]Natural Timetravel[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=978570][color=#0066FF][b]Khoshy[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2905198][b]Would the existence of extraterrestrial life disprove Christianity?[/b][/url]\r\n \r\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=412979]Feir[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 111th edition of the HF News Feir! Before we get started, are there any shout outs you'd like to make?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: Everyone I pm, and people who I chat with regularly.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure they'll all appreciate that. For those of you who don't know Feir, she is a SRPP frequent, with almost 2k posts in the section, and is indeed a female. How does your gender change your HF experience, if at all?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: It doesn't really affect my experience. As most people call me bro, I'm not sure being female makes a difference. If I'm honest, I can give across a female's view sometimes, so that might be a difference?\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I see. Definitely good to see that both genders are treated equally. While we are on the topic of feminism, what is your opinion women and 'adult movies'? Do you think it is degrading and objectifying, or simply a sign of liberation of freedom?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: It depends why people are making the movies. If a woman is sexually outgoing and really enjoys making the films for money, then it would be liberating for her. She is earning her own income from doing something she enjoys. If she's being forced into it because of poverty or addiction, then it's not very liberating, IMO.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I completely agree. Where you live, capital punishment (death penalties) was abolished long ago. In other countries, however, capital punishment is still widely used. What is your opinion on capital punishment, and do you think it's justifiable?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: It's never justifiable. I think we should continue to lock people up until a time comes where people won't need punishment at all. I do believe the human race will mature into a race where we will fully understand the implications of all actions and be more careful in how we choose to treat others. In cases where a criminal will never be rehabilitated, we should lock them up for life. All life is valuable, even life that seems worthless.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Another controversial topic is that of abortion. As a female you must have a strong view on this aspect of human life. You stated that all life is valuable, and based on that I have a slight hunch towards what you may say, although some would argue that a fetus isn't 'life'. Thoughts?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: A fetus is alive, most definitely, but it's alive because two people created it. Once they create this life it becomes their responsibility. Though I do feel a fetus should have more rights, it's obvious that this world is not perfect and hasn't got the ability nor the resources to look after everything put onto it. I believe in a parent's right to  take responsibility for their actions, and if that means they have looked into every possibility and can see no other option than abortion, then they have a right to do that. I've probably contradicted myself there, but that's how I feel. I have kids and know that it's a lifetime responsibility, so I can see why some people cannot take on the responsibility of a child.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, that was a great answer. There is a fine line between contradiction and logic, which you most definitely displayed the latter with that answer. Anyhow, homosexuality. It's a huge movement worldwide, what with all of the protests and campaigns. Do you support homosexuality, and do you believe homosexuals should be given marriage rights?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: Homosexuals are humans; we all should have the same human rights, so obviously they should be allowed to get married. I'm not sure why people are so against them having rights. They want to publicly and legally declare their partnership. I do think it should legal to deny them those rights. I support anyone's sexuality, hence I don't like how people become restricted by genders or lifestyles that aren't harmful. The law won't back me up on making it illegal to deny them those rights, although I think denial of basic human rights should be illegal.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]:  I have the same thoughts. What is your view of males, in general? Of course, every man is different, although I'm sure you've formed your fair share of general thoughts.\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: Men tend to be more 'self-glorious' in comparison to women, though that's not always the case. I like how some men support women and treat them as equals. I'm sure these men treat all people as valuable though and have unbiased views on most topics. When you support women and treat them as equals, you are also advancing men and their equality causes too.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: With female equality only just starting to really catch up after centuries of male suppression, where do you think we stand as a whole with gender equality? What do you think still needs to be improved, or do you even think there is anything which needs to be downgraded in a sense?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: Downgrades for women, as in go backwards with some advantages they have? Not really. We aren't fully treated as equals by everyone, but when that time comes, we won't need any advantages at all and they'll fizzle out because the rights won't be needed. The only improvements I can see that are needed are in childcare. It's still pretty much the women who end up with the children if a relationship breaks up, or even if you stay with a partner, it's still the father who works. Childcare is expensive, so I'm not sure how we would work out how to solve this problem... you don't have to have children and the expense of them shouldn't be passed on to anyone who decided not to take on the expense of having children. Hard problem to solve right now. Maybe if women received equal pay then it would be more feasible for the father to stay home with the kids. Some countries don't give women their rights; this needs improving.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'll leave you with a final topic; ghosts. Some say they are real, some say they are fake. Who knows. Anyhow, do you believe in ghost, and what form do you think they take, if any? Why/why not?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: Aw, this is such a confusing topic for me! I haven't ever seen a ghost in my lifetime and tend to believe they do show up to people in times of stress, like a trick of the mind that is comforting (or scary, depends what type of ghost). No idea what form they are, possibly a mirage? There are many people out there trying to prove ghosts are real. I'm not sure why they do this. My cynical side says it's so they can make money from it.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Haha, don't worry. You're not the only person skeptical on the topic. Anyhow, thanks for the interview. Any final thoughts/comments?\r\n[url=http://hackforums.net/member.php?action=profile&uid=412979][color=white][b]Feir[/b][/color][/url]: Thanks for your time. I always read the news, but didn't realize how much effort went into the interviews. I hope to see Hackforums continue for a long time, as I enjoy it here. Forgot to thank all who help me in the shout out, so will do that here.\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: For our 111th edition (lucky number!) of the HF News, we have [url=http://hackforums.net/member.php?action=profile&uid=70881][b][color=lime]Paradoxum[/color][/b][/url], our newest addition to the staff team on Hack Forums. Do you have any shoutouts you want to make to the readers before we go on?\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/color][/b][/url]: That must mean I'm lucky. ♥ Let's see... Hola to iBruteforce, Miah, T3h Hack3r, AlbinoShadow, -Analog-, [b]Qwazz[/b] and a bunch of other people I can't remember right now.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: I'm probably in the \"bunch of other people\" category. :P How did you come to HF and meet your current friends?\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/b][/color][/url]: Yes, yes you are. I've been here since 2009 and I do not know why and how exactly I came across these people. If anything, I would attribute everything to two groups of people. First, Skill and Saged for making me a leader of The Alliance when I least expected--actually never thought of--it, and second, Soldier of Fortune and Valiant for picking me as a HJT Trainee quite after a few days of applying. Being in both teams is what got me started and ever since, I have been associated with a wide network of many different members, a few of which I have become real friends with.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: Those groups are some of the most coveted around HF. I'm hoping I can be a HJT Trainee one day. Any advice to those prospective trainees?\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/b][/color][/url]: I can't really say anything when the program has not been launched yet, yes?\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: Good point. I suppose only a little while longer. What got you interested in the HJT Team and TA? Why have you stuck with those groups out of any other group?\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/b][/color][/url]: I have been wondering the same thing. My main interest has always been related to the field of forensics and malware analysis and therefore I think it is given why I found the HJT Team to be a worthy pursuit. As for The Alliance, it is because of how Skill treated his members back when it started. I knew he was a leader who genuinely cared about his members. He had a good eye and picked those who understood what the group was for.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: So you were surprised but not in total shock. Having been made a Mentor must have given you a hint, maybe?\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/b][/color][/url]: Actually, it didn't. If Omniscient wanted to promote me at that time, I think he would have skipped giving me Mentor. It isn't a necessity for people to undergo being a Mentor to become Staff. This proves true in bugga's case and she is not any less competent than those who were indirectly promoted. Being a Mentor, however, played a role in the rise of my activity. In essence, perhaps it did contribute but I cannot be certain as no one really knows Omniscient's exact criteria for Staff. I know I don't.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: I see. Do you think people will ever bother to read your signature thoroughly? The blacklist grows every day.\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/b][/color][/url]: No. 🤣 I take diabolical delight in seeing a continuously growing list of people who cannot read.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=white][b]+Entity[/b][/color][/url]: Illiteracy grows every day. Do you have any final words for the crowd?\r\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=lime][b]Paradoxum[/b][/color][/url]: Learn to read? :3\r\n[/spoiler]",
      "subject": "[9/30/12] - HF News"
    },
    {
      "pid": "26877563",
      "uid": "515249",
      "dateline": "1349064600",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=#00BFFF][b]HF News Giveaway - 5x Humble Bundle Steam Keys[/b][/color]\nYes, you read that right! The HF News will be giving out five (5) copies of the newest Humble Bundle. For those of you that are unaware, the Humble Bundle is a collaboration of games. These bundles are released every so often and the price is what makes these bundles so unique. Buyers can pay what they want, and all of the money goes to either a charity, the Humble Bundle creators (as in, the people who run the project) or the game developers. How can you enter? Easy! Just post in this thread stating which Gaming News article you found most interesting in this edition. The winners will be notified by PM on Wednesday and will receive the link to the humble bundle for four (4) games that are offered in the Humble Bundle.\n\n[color=#00BFFF][b]Xbox Rewards Based On GS[/b][/color]\nEarlier this year, a widespread rumor about Xbox rewards in relation to GamerScore hit the streets. This rumor is now a reality. Xbox Rewards have introduced MyAchievements, an Xbox Rewards program where you can earn rewards based on your Xbox GamerScore. MyAchievements is available to all Xbox LIVE gold members with an Xbox Rewards account. At the moment, there are only three divisions available: Contender (3,000-9,000 GS), Champion (10,000-24,999 GS) and Legend (25,000+ GS). So, which category do you fall under? These three divisions offer a \"special gift\" in your birthday month, although it isn't yet clear what this proposed gift is. The Champion division will receive a 1% rebate on Xbox LIVE purchases every month, while the Legend division will see a 2% rebate on Xbox LIVE purchases each month. It seems Xbox GS will finally start to play a more serious role in the future.\n\n[color=#00BFFF][b]NBA Live 13 Cancelled[/b][/color]\nElectronic Arts have cancelled NBA Live 13. EA posted an official statement on their website saying \"After a lot of consideration, we have made the decision to not launch NBA Live 13\" Andrew Wilson said that the team “knew it was going to be a long journey” when they set out to revive NBA Live, and began development in a new studio with “some of the best new technology” in order to make it happen. “But making great games is not easy,” Wilson wrote, “and we're just not there yet on NBA Live 13. Having continued to look at the game over the past few days, it's clear that we won't be ready in October. And rather than launch midway through the season, we're going to sit out the full year and stay focused on making next year’s game great.”\n\n[color=#00BFFF][b]Did You Miss The Halo 4 Developer Session At The Eurogamer Expo 2012?[/b][/color]\nYou may have missed it, but don't worry. Frank O'Connor was at the Eurogamer Expo earlier in the week and hosted a small developer session. The session released the third Halo 4 campaign mission while O'Connor talked about Halo 4 and answered various questions. If you missed the session, you can view it on their YouTube channel  [url=http://www.youtube.com/watch?v=JylkzGSfnn4]here[/url].\n\n[color=#00BFFF][b]FIFA 13 Sells 353,000 in 24 Hours - North America[/b][/color]\nThe biggest and most anticipated Football game of the year, FIFA 13, was released this week. EA announced that FIFA 13 had a massive record-breaking opening 24 hours. The game sold more than 353,000 copies in North America from Xbox 360 and PS3 versions. The game also smashed paid games leaderboard on the Apple Store, becoming #1 in 55 countries and top grossing in 24 countries. \n\n[color=#00BFFF][b]Call of Duty: Black Ops II Achievements Released[/b][/color]\nYou may be an achievement hunter, or you may not be, but the achievements for the upcoming Call of Duty title have finally being released and it's big news for anyone planning to purchase the game. Campaign achievements are the first you'll see, however this time you'll see some Multiplayer achievements! At launch, there will be 50 achievements worth 1000 GamerScore on the Xbox 360. You can view the complete Xbox 360 achievement list for Black Ops II  [url=http://www.xbox360achievements.org/game/call-of-duty-black-ops-ii/achievements/]here[/url].\n\n[color=#00BFFF][b]Latest Achievement Releases[/b][/color]\n[url=http://www.xbox360achievements.org/game/need-for-speed-most-wanted-criterion/achievements/]Need for Speed: Most Wanted (2012)[/url] - 46 Achievements, 1000 Points\n[url=http://www.xbox360achievements.org/game/call-of-duty-black-ops-ii/achievements/]Call of Duty: Black Ops II[/url] - 50 Achievements, 1000 Points\n[url=http://www.xbox360achievements.org/game/reckless-racing/achievements/]Reckless Racing[/url] - 20 Achievements, 200 Points\n[url=http://www.xbox360achievements.org/game/hitman-absolution/achievements/]Hitman: Absolution[/url] - 46 Achievements, 1000 Points\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]The Worst Building In The History Of Mankind[/b][/color]\n\"The worst building in the history of mankind\" was the label that the Ryugyong Hotel was awarded as by a well-known North Korean magazine. Harsh? Some would say, although simply looking at the pictures makes the before mentioned statement seem rather viable. An unfinished hotel in North Korea's capital, Pyongyang, launched construction again recently after a 16-year hiatus. The skyscraper, which is locally and globally renowned as 'infamously ugly', resembles a poorly thought out three-sided pyramid. The walls are at an angle of 70 degrees to the ground and goes up 105 storeys (330M). The company behind 'North Korea's thwarted ambition' claim that the completion of this project may be in near sight. Names and mockeries towards this hotel have stuck, one of the more popular ones being 'The Hotel Of Doom'. Could this be another way for North Korea to further destroy their economy, or could this monstrosity of a project turn a profit? The building can be seen by clicking on the following link: http://goo.gl/x06Ce\n\n[color=white][b]Fox News Broadcasts Suicide[/b][/color]\nFox News, US, apologized late yesterday for the broadcasting of a man who fatally shot himself on live television on Friday. Covering a high-speed pursuit, Fox News captured footage of a man shooting himself in the head with a handgun. The high-speed chase began in Phoenix, Arizona. The man allegedly stole the car from a local couple outside a restaurant at gunpoint. The car was quickly tracked down after reports were made and the man began to fire rounds at a nearby police car as the officers closed in on the suspect. No officers were harmed. After the police were relatively close to the man, at which stage they were dozens of miles into the desert, the man stepped out of his car and ran for a brief period, before pulling out his handgun, putting it to his head and shooting. The man died at the scene. The TV anchor apologized for not cutting the footage as he came to a realization of what the man was doing.\n\n[color=white][b]SARS-Like Coronavirus Identified[/b][/color]\nA new illness, which results in respiratory issues (failure in confirmed cases so far), was identified earlier this week. Officials aren't aware of what other threats the new virus may pose as it hasn't been fully studied yet, nor is it overly common (actually, rather rare), although it's believed to be [b]extremely[/b] harmful if diagnosed. The virus is known to be rather similar to the SARS (severe acute respiratory syndrome) virus which killed hundreds of people soon after its acknowledgment and officials fear that this new unnamed virus may be a replication of the SARS virus. There are only two confirmed cases of this new virus, although the first man (Saudi-Arabian) has died, whilst the second man is being treated in a London hospital after being transferred from Qatar.The WHO (World Health Organization) has not recommended any travel restrictions as this virus isn't easily transmitted, stated by the WHO.\n\n[color=white][b]Nepal Plane Crash Leaves Nineteen Dead[/color][/b]\nA plane (operated by Sita Air) crashed on Friday in Nepal, headed towards the Everest region. The plane was on the outskirts of Nepal's capital at the time, and resulted in nineteen fatalities (everyone on board), seven of which were British tourists, seven Nepali nationals and five Chinese nationals. Only minutes after its take-off from tourist destination Kathmandu did the plane crash. It landed in a river bank and quickly caught fire. There were sixteen passengers and three crew members on board the twin-propelled Dornier. When the plane started making 'unusual maneuvers, it was contacted by air traffic control. Recordings recovered from the crash site confirm this, and show that the plane crashed while the pilots attempted to change directions to head back to the airport, after the pilot had hit a vulture. It is unsure if the vulture was the cause of the crash or yet unidentified technical issues.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nApple's new iPhone 5's iOS 6 has major issues with WiFi connectivity and has received, due to this, an unbelievably huge array of negative criticism towards the new iPhone 5 in general. Even though this isn't new to Apple's iOS, this time the issue by far negatively outshone previous versions. Various users say that they can connect to the WiFi network, although no data transferring takes place after a connection has been established. If you avidly follow Apple and their products, you would've come across a fair few threads in Apple's forum, and tech forums alike, in regards to the connectivity issue. The two most popular threads have reached over 150 pages of replies together, mostly by users stating that they have a similar issue. You can see the threads [url=https://discussions.apple.com/thread/4310121?start=0&tstart=0]here[/url] and [url=https://discussions.apple.com/thread/4322714?start=0&tstart=0]here[/url]. Despite this WiFi issue, the 3G and 4G LTE works fine without any problems.\n\n[color=white][b]eBay[/b][/color]\nWith the first version of eBay's Android app ending in utter disaster, a new version (eBay v2.0) was introduced into Google Play's store a few days ago. This app allows users to search, browse and manage bids and transactions via. any Android device with an internet connection. Whether you are a frequent eBay user, or even an occasional eBay user, this is definitely an app worth downloading. With this app, you can browse through the entire eBay marketplace, purchase/sell items, payout and manage transactions. The only time you are required to log in is if you wish to make a bid or use another account-related feature.\n\n[color=white][b]Facebook[/b][/color]\nFacebook has finally released its Facebook Messenger for iOS 6 and iPhone 5. This new app allows users to see who has signed in with the app, as well as offering similar features to the browser-based Facebook Messenger. This app allows users to pin their favorites on the top of the online user list. This app was released yesterday and is available to download for  6 and iPhone 5. This new app allows users to see who has signed in with the app, as well as offering similar features to the browser-based Facebook Messenger. This app allows users to pin their favorites on the top of the online user list. This app was released yesterday and is available to download for iOS 6, iPhone 5, iPad and iPod Touch on the Apple Store. Facebook stated that they're determined to release frequent updates for this app, for both Android and iOS, and updates will occur once per four weeks for Android users and once every eight weeks for iOS users. \n\n[color=white][b]Amazon[/b][/color]\nAmazon is about to start shipping wine in addition to books, movies and electronic goods which they currently offer. Sources say that Amazon's executives were in Napa this week where they visited around 100 wineries explaining the situation and forming knowledge in the market. Amazon's terms are reportedly 15% of sales, as well as a payment of $40 to join the marketplace. This project was attempted three years back, although was relatively quickly scrapped. Hopefully the project takes off this time as to 'lift the spirits' of Amazon users.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]BET Hip-Hop Awards End In Gunfire[/b][/color]\nOn Saturday night in Atlanta, the BET Hip-Hop awards took place. It was supposed to be a friendly awards night, although it turned sour rather quickly. Reports state that Young Jeezy and Rick Ross had a confrontation backstage. It is unaware if this was a physical or simply verbal confrontation, although it was quickly migrated outside in to the parking lot. Each of the singer's entourages backed-up either Ross or Jeezy, although things started to get a little too violant. Shots were fired, and although nobody was injured, it caused major havoc. The venue went into lockdown mode which police were brought in. Police officers maced various crowd members as to disperse them. Allegedly, no arrests were made. These accounts were spammed over Twitter and will most probably ignite further feuds between these two Hip-Hop artists in the near future.\n\n[color=white][b]Jennifer Lopez: I Could Be A Politician[/b][/color]\nThe singer/actress Jennifer Lopez, who also goes by the name J-Lo, stated earlier this week that she may be considering a career in politics. As she starts to age further (43 currently), she feels that she has the ambition to move into a political field. J-Lo recently gave up her seat on the judging panel for American Idol. \"Might you see me entering politics? Yeah, there are women popping up in all different places now,\" she revealed. It's unaware how serious she was when she stated this, although it was no joke. J-Lo made the Forbes list of most powerful women recently, so perhaps people may start to take her more seriously. Prior, she had been made a mockery of on various TV shows such as South Park, which may or may not have ignited a... less-serious view of her to viewers. Only time will tell. \n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler=]\n[video=youtube]http://www.youtube.com/watch?v=iW0uYfq3VLU[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler=]\n[video=youtube]http://www.youtube.com/watch?v=J9XwFecNXyU[/video]\n[video=youtube]http://www.youtube.com/watch?v=221mohEolWc[/video]\n[video=youtube]http://www.youtube.com/watch?v=CcGK0oFWTgc[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI usually just sit down and come up with this section on the spot, writing as I go and shaping my opinion as it flows itself through my fingers. Yet, today, I came somewhat prepared. Our lives are ruled too much by fear, not the fear of spiders or heights, the fear of ourselves, and others. We're always afraid to put ourselves out there and meet new people. It just ridiculous. I used to be exactly as I just said, but I decided to correct myself, and be a little more forward. It really does pay off. People respect and think more of you when you come out from the corner, or stop petting the dog at a party with many unknown people. All you need to do is talk to someone. Sure, they could ignore you, or be a complete *insert any derogatory term.* But, they could also be someone that will eventually become of some importance to you. It's really much more difficult for us than those in the past, as they didn't have mediums like we do now. Their communication was face to face, and they couldn't hide behind the computer. In the end, if you don't live your life, you existence will feel as pitifully meaningless as it actually is.",
      "subject": "*"
    },
    {
      "pid": "26877586",
      "uid": "515249",
      "dateline": "1349064676",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\r\n\n\"What do you want to talk about?\"\r\n\n[i]\"I want to talk about something that some people find awkward. Same-sex couples. Apart from the religious reasons (Only men and women should be together) what other reasons are there for discrimination against same-sex couples? If someone you love makes you happy, you want to spend as much time with them as you can. If it just so happens that they are the same gender as you, it shouldn't matter. Personally I don't see how this is such a 'tender' topic, as some politicians say. People want to keep the idea of marriage between a man and a woman. Back in the early 1960's, people thought it was okay to ban people of different races from getting married, just because they had a different colour on their skin, which today we find morally wrong. I hope that in another 20 years people will look back on today's views on same sex couples and feel the same way - that they should be supported and as equal a part of society as heterosexual couples.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url]\r\n\n[align=right][i]\"Burritos, duh :), You know what for my submission I'm just gonna shout-out people I love on this forum :) Ąle¢, BioWeegee☣, Gwamp, Juicy Booty, Judge Dredd, Ronald_McButtSex, Dan., Hug., Cody (cause he's cool), and Sir :)\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1058305][i]-Ida[/i][/url][/align]\r\n\n[i]\"What do I want to talk about? You ask. Well here's the answer to your question, which indeed was your asking of what I'd like to talk about. Well, my answer to the question at hand is that I'd like to answer this with another question to your question, which was what I'd like to talk about, which, what I'd like to talk about is... What would you like to talk about, Sir?\"[/i] [b]I already do that, Silly. Sir's Second :)[/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=994516][i]-Graveee[/i][/url]\r\n\nThe topic for next week is \"What do you think of the new Gauth security?\"\r\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\r\n\n[hr]\r\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\r\n[align=center][i]Closed until Graphical Editor is replaced.[/i][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\r\n[align=center][spoiler=][img]http://i.imgur.com/eSygM.png[/img][/spoiler][/align]\r\n[align=center][spoiler=][img]http://i.imgur.com/TLimM.png[/img][/spoiler][/align]\r\n\n[hr]\r\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\r\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/qrCWl]Phytrix[/url]\r\n[list][*]Headlines[/list]\r\n[list][*]Music News[/list]\r\n[list][*]World News[/list][/list]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]Opinions\r\n[*]Sir's Second[/list][/list]\r\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\r\n[list][*]Gaming News[/list][/list]\r\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\r\n[list][*]User News[/list][/list]\r\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\r\n[list][*]Tech News[/list][/list][/list]\r\n[list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://google.com]OPEN[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\r\n[/list]\r\n[*][color=white][b]Proofreader[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}