{
  "posts": [
    {
      "pid": "21401253",
      "uid": "515249",
      "dateline": "1333586483",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]86th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]Leadership Scam[/b][/color]\nA well known member on HackForums, Sai, recently scammed and manipulated his way to the top of the ladder and became the official owner of the Graphic Masters while only spending $50 out of his own pocket. Instead of stopping there he removed all past leaders and promoted two new leaders to replace them. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient's[/b][/color][/url] has been notified of this issue and his response to this issue was short and straight to the point \"He is the groups new owner. End of story. \". To read the whole story on how it all happened click the following link: http://goo.gl/P94n0\n\n[color=white][b]Group Changes[/b][/color]\nAs requested by the owner, the Minecrafters group has been suspended. The reason behind his is unknown, however it is likely that it is related to the owners inactivity in the group. A new usergroup has also been introduced to HackForums this week. The owners of BlackShades have decided to buy their own group for customer support and other BlackShades related topics. To view the BlackShades recruitment thread click the following link: http://goo.gl/4yb7S\n\n[color=white][b]Ban on Post and PM Me Threads[/b][/color]\nAfter quite some time [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to put a ban on all \"Post here and PM me\" threads in the monetizing section. In addition to that he also appointed the member php as moderator of the monetizing section to ensure the rule is enforced. All members caught doing this are subject to a warning, repfuck or ban depending on the staff member's decision. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient's[/b][/color][/url] announcement thread click the following link: http://goo.gl/NjlN4\n\n[color=white][b]MyBB Upgrade[/b][/color]\nRecently [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] upgraded HackForums to MyBB 1.6.7. The new version of MyBB gives members the ability to log in using their email instead of their username, thus allowing members who locked themselves out of their accounts by having special characters in their usernames now have an alternative way to log in. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has said that if this new feature is abused he will remove it for security reasons. As always if you find any bugs with the new version please report them to an admin. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient's[/b][/color][/url] announcement thread click the following link: http://goo.gl/EiF3n\n\n[color=white][b]April Fools 2012[/b][/color]\nOn the first of April [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] implemented his annual April fools joke on HackForums. Based on the feedback them members posted it seems that this year was one of, if not the best April fools day on HF. For those of you who missed it [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] pretended to repfuck every member by making all of their past reputations invisible and giving them a -10, the member could only see themselves as being repfucked though, to all other members their rep would look normal. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient's[/b][/color][/url] announcement thread click the following link: http://goo.gl/HcWOB\n\n[color=white][b]Offline for a Short Time[/b][/color]\nFor unknown reasons HackForums was offline for a few minutes on Saturday the 31st. This was most likely due to site maintenance or possibly [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] testing the April fools joke. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient's[/b][/color][/url] tweet about the downtime click the following link: http://goo.gl/XPoQV\n\n[color=white][b]Blackshades Website Link Censored[/b][/color]\nShortly after the purchase of the BlackShades group their website was censored on HackForums. According to one of the group leaders this is because the website was declared dangerous by a few site advisory websites. The BlackShades team has encouraged their customers to use their alternate domains in the meantime while they attempt to straighten out the issue.\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][b][color=#0066FF]Yellows[/color][/b][/url] was rep fucked. Several days later, Judge Dredd decided to remove all of the negative reputation points Yellows had.\n[url=http://hackforums.net/member.php?action=profile&uid=87114][b][color=white]Reptar ツ[/color][/b][/url] has reached 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=431105][b][color=white]Tɦɛ Gʀiɱ[/color][/b][/url] was rep fucked.\n[url=http://hackforums.net/member.php?action=profile&uid=651773][b][color=#0066FF]Vitani's Mate[/color][/b][/url] has reached 1,000 reputation points and 1,000 prestige.\n[url=http://hackforums.net/member.php?action=profile&uid=1086710][b][color=white]Justice[/color][/b][/url] was rep fucked.\n[url=http://hackforums.net/member.php?action=profile&uid=81075][b][color=white]Robbieava[/color][/b][/url] has reached 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=67727][b][color=black]єץє[/color][/b][/url] was banned for cross posting and rep fucked for gambling on HF.\n[url=http://hackforums.net/member.php?action=profile&uid=977824][b][color=black]Nifty[/color][/b][/url] was banned for selling outside of the marketplace.\n[url=http://hackforums.net/member.php?action=profile&uid=535046][b][color=black]Emily[/color][/b][/url] was banned and rep fucked for group nonsense.\n[url=http://hackforums.net/member.php?action=profile&uid=630102][b][color=black]iNk Jr.[/color][/b][/url] was banned for LQP.\n[url=http://hackforums.net/member.php?action=profile&uid=107777][b][color=black]ĶŔB[/color][/b][/url] requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=458073][b][color=black]Chief.[/color][/b][/url] was banned for being annoying.\n[url=http://hackforums.net/member.php?action=profile&uid=25053][b][color=black]Hawkins[/color][/b][/url] was banned because Omniscient didn't appreciate his bullshit.\n[url=http://hackforums.net/member.php?action=profile&uid=736750][b][color=black]Biggrodd[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=790138][b][color=black]!stric_tags($userName)[/color][/b][/url] was banned and rep fucked for being an asshole.\n[url=http://hackforums.net/member.php?action=profile&uid=388560][b][color=black]Øueen[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=743504][b][color=black]Cartel[/color][/b][/url] was banned for LQP.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Birthday Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2354197]Happy Birthday to my dog. :D[/url] - [url=http://hackforums.net/member.php?action=profile&uid=651773][color=#0066FF][b]Vitani's Mate[/b][/color][/url] - This is just a heart-warming thread for those who love their own dogs. See Vitani's dog on his very own cakeday.\n\n[i][b]April Fools Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2357381]╔► | WIN 500$ ON HF NOW! |◄╗[/url] - [url=http://hackforums.net/member.php?action=profile&uid=426299][color=#0066FF][b]Oldskool.[/b][/color][/url] - Oldskool ended up trolling a lot of people on April Fools day by opening a contest to win a lot of money. Many people entered, no one won.\n\n[i][b]Marketplace Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2224458]Improve Your Market Place Skills and Etiquette[/url] - [url=http://hackforums.net/member.php?action=profile&uid=526511][color=white][b][M][/b][/color][/url] - If people are new to Hack Forums, or even the Marketplace, this thread will help you understand how things are run.\n\n[i][b]Xbox Live Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2368162][TuT]Get a 48 Hour Code[EASY][/url] - [url=http://hackforums.net/member.php?action=profile&uid=398194][color=#0066FF][b]туℓєя[/b][/color][/url] - Even though there are a lot of methods out there for obtaining 48 hour codes, this one seems to be unknown and fairly new.",
      "subject": "[4/4/12] - HF News"
    },
    {
      "pid": "21401679",
      "uid": "515249",
      "dateline": "1333587494",
      "message": "[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Skirex[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Skirex! Thanks for taking the time out for this interview. Before we begin would you like to give a shout out to any special members? \n[b][color=#1466ff]Skirex[/color][/b]: Of course, I'd love to give a shoutout to Cube, Bellagio, Stayplural, Command Prompt (my bf3 and stock market buddy) and Diabolic.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fantastic! To start us off, how did you find Hack Forums? \n[b][color=#1466ff]Skirex[/color][/b]: I originally found HackForums when I mass joined a bunch of useless forums looking for Modern Warfare 2 \"Hacks\".\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Ah, I remember those days. Infections lobbies and what not.  Would you care to explain your Google exploit? \n[b][color=#1466ff]Skirex[/color][/b]: Yes, I actually would care.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fair enough!  How did your suicide prank go over? \n[b][color=#1466ff]Skirex[/color][/b]: What was so funny? The fact that it was April Fools and I had clues inside the thread proving it was fake, yet still people managed to somehow fall for it.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I checked your thread and didn’t see anything, but I’m glad it was fake. What's your favorite part of Hack Forums? \n[b][color=#1466ff]Skirex[/color][/b]: My favorite part would be the bans log. It's pretty funny looking through and seeing the ban reasons. It gives me new insults so I can be even more of a hardass.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: If you were admin for one day, what would you do and why? \n[b][color=#1466ff]Skirex[/color][/b]: I'd do admin things like shoot black kids walking out from the lounge with a bag of skittles and some tea because I'm mexican and shit.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Alright, we’ll just go ahead and skip that question. Was it strange to find out other people from Hack Forums went to your school? \n[b][color=#1466ff]Skirex[/color][/b]: Oh fuck yea that was odd as fuck. I feel cool though knowing I know IRL HF members.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Do you have any words for the readers?\n[b][color=#1466ff]Skirex[/color][/b]: Not really, do they have any words for me?\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Graphic Masters - Barneyyz, Damn., C4V, Coffee, JDBar, and Intrepid[/font][/size][/color][spoiler=]\n[b][color=#FF4500]With Barneyyz--[/color][/b]\n\n[b][color=white]Rhythm[/color][/b]: Hey Barneyyz, how are you today?\n[b][color=white]Barneyyz[/color][/b]: I'm fine thank you, how are you Rhythm?\n\n[b][color=white]Rhythm[/color][/b]: I'm splendid, thank you for asking. So how's the weather over there in Canada?\n[b][color=white]Barneyyz[/color][/b]: I've no idea, I do not live in Canada, I live in Scotland :P.\n\n[b][color=white]Rhythm[/color][/b]: I'm an American, same thing to me. Only joking, only joking.\n[b][color=white]Barneyyz[/color][/b]: Haha\n\n[b][color=white]Rhythm[/color][/b]: So, tell us a bit about this business with the GM. How do you feel about the situation that's going on?\n[b][color=white]Barneyyz[/color][/b]: The GM's a pretty sweet group, I've been in it since September last year and I've really learned allot. However, it been incredibly rough lately, specifically since Sai became the owner of GM a few days ago, which quite frankly has resulted in chaos.\n\n[b][color=white]Rhythm[/color][/b]: Yes it had been quite chaotic recently. How do you feel about the direction the group is heading, do you think the group is headed for better times, or worse?\n[b][color=white]Barneyyz[/color][/b]: In my opinion, worse. Since Sai has been appointed owner, he has not yet followed through in any of his promises, until that thread was made by you in the rules/announcements section. For example, as he promised to talk and discuss big changes with the group, to see if everyone was cool about it, he demoted leaders and appointed more, without even saying anything.\n\n[b][color=white]Rhythm[/color][/b]: True true. Some say though that Sai hasn't been given enough time, what do you think about this?\n[b][color=white]Barneyyz[/color][/b]: I somewhat agree that he should have more time to redeem himself, and prove to us that he is capable of leading GM in to a more positive future.\n\n[b][color=white]Rhythm[/color][/b]: Quite so. Alright Barney, thanks for your time!\n[b][color=white]Barneyyz[/color][/b]: No problem, it was a pleasure talking to you today, Rhythm! =)\n\n[b][color=#FF4500]With Damn--[/color][/b]\n\n[b][color=white]Rhythm[/color][/b]: Hey Damn., how are you doing?\n[b][color=white]Damn.[/color][/b]: I'm doing fine, how are you?\n\n[b][color=white]Rhythm[/color][/b]: Quite alright. So tell us a little bit about the recent situation within GM from your perspective.\n[b][color=white]Damn.[/color][/b]: Alright. The way I see it, the GM has been somewhat inactive, especially from the new recruits' perspective as they expected more. Sai wanted to bring the change and the situation came when some of the members supported his \"radical\" leadership while others didn't understand why he would be a leader considering that he had paid $50 out of $500 and not yet wasted the rest of his money on GM.\n\n[b][color=white]Rhythm[/color][/b]: Very valid points. Would you agree that the group is split in terms of their position on the issue?\n[b][color=white]Damn.[/color][/b]: It definitely is split and it can be solved different ways. Now we have at least come to terms with Sai's leadership and if it does not go as desired, the counter-movement will start opposing Sai again, so it's not settled.\n\n[b][color=white]Rhythm[/color][/b]: Very true. What do you foresee happening at the end of the two weeks?\n[b][color=white]Damn.[/color][/b]: There are two possibilities of greater likelihood that I see. If Sai manages to do the job well, he may either be met with an acceptance or he might be met with contempt if the counter-movement inherently were not planning or foreseeing him succeeding. If he fails to do a good job, there will most likely be a new leadership and everyone will agree on that. Now out of these two, I think Sai may succeed well, because he has already started, and what is started, seems to go well. An example is the Tournament that has received good response as of yet despite being difficult to pull through on this forum.\n\n[b][color=white]Rhythm[/color][/b]: Very true. It is in the end, in any scenario, a reflection of the groups wishes that will prevail here. The tournament looks to be going well, we can only hope for the best. Thank you for your time Damn!\n[b][color=white]Damn.[/color][/b]: No problem, thank you for interviewing.\n\n[b][color=white]Rhythm[/color][/b]: My pleasure, is there any shoutouts or special mentions you'd like to make?\n[b][color=white]Damn.[/color][/b]: I'd like to say; Peace, equality and understanding. Don't forget to breathe.\n\n[b][color=white]Rhythm[/color][/b]: Words of wisdom. Thank you once again for your time.\n\n[b][color=#FF4500]With C4Vendetta--[/color][/b]\n\n[b][color=white]Rhythm[/color][/b]: So C4V, how are things going today?\n[B][COLOR=WHITE]C4V[/COLOR][/B]: Quite well actually. Nobody kicked me in the balls and screamed: \"April fools!\" yet. Don't have much to complain.\n\n[b][color=white]Rhythm[/color][/b]: Ah, is that the way things work for the Dutch?\n[B][COLOR=WHITE]C4V[/COLOR][/B]: Nah. In The Netherlands they don't say \"April fools\" but \"Kikker in je bil\", which means \"Frog in your ass\". Not even kidding.\n\n[b][color=white]Rhythm[/color][/b]: Kikker in je bil, fantastic; I may have to stay away from the Netherlands. Anyways, what are your opinions on the recent situation regarding GM?\n[B][COLOR=WHITE]C4V[/COLOR][/B]: A lot of drama. I think most people are somewhat aware of the situation. Things are a bit tense and uncertain.\n\n[b][color=white]Rhythm[/color][/b]: Definitely so. Would you say that any lines have been crossed as of yet?\n[B][COLOR=WHITE]C4V[/COLOR][/B]: Most definitely. I strongly feel that Sai made a mistake by making certain choices without consulting the, then current, leaders or members of the group. A more transparent way of handling things would have done him well. I also don't like the thread that was created by Rhythm regarding Sai. I found it to be disrespectful, especially since this is a group matter, not something public. Regardless, right now things are somewhat calmed down. I don't think there are many hard feelings.\n\n[b][color=white]Rhythm[/color][/b]: Do you think the hard feelings will resume after the two week period has elapsed?\n[B][COLOR=WHITE]C4V[/COLOR][/B]: Probably. I'm quite certain at least one member will not want Sai to stay.\n\n[b][color=white]Rhythm[/color][/b]: Very possible. I suppose only time will tell then. Thank you for your time C4V, is there anything else you'd like to add or any shoutouts you'd like to make?\n[B][COLOR=WHITE]C4V[/COLOR][/B]: Shout outs to all the random people who gave Sai -rep while hardly knowing anything about the situation. Shout out to that cute redhead from last Friday. Thanks Mom, Dad, without your beatings I would never have been this socially awkward, yet awesome, human being. Thanks for interviewing me, Rhythm. It was fun.\n\n[b][color=white]Rhythm[/color][/b]: No problem, thanks for your time.\n\n[b][color=#FF4500]With Coffee--[/color][/b]\n\n[b][color=white]Rhythm[/color][/b]: Hey Coffee, what's happening?\n[b][color=white]Coffee[/color][/b]: Nothing much just working on a new iDevice theme\n\n[b][color=white]Rhythm[/color][/b]: Awesome, any previews?\n[b][color=white]Coffee[/color][/b]: I tend not to release previews until I have at least half of the theme made, that way if the icons start to go downhill early on I don't feel any obligation to finish it\n\n[b][color=white]Rhythm[/color][/b]: Ah, fair enough. Wonderful how even during these dramatic times you still stick to creating graphics. What is your opinion on the recent events that have transpired within GM?\n[b][color=white]Coffee[/color][/b]: Of course, nothing could stop me designing, it's my passion. As I've stated before I do believe that Sai might be a good leader, however his methods of gaining ownership were less than moral, that therefore casts doubts in my mind.\n\n[b][color=white]Rhythm[/color][/b]: As it did to many. Many members have found it difficult to accept Sai as a leader because of this. What you think lies in the future for GM?\n[b][color=white]Coffee[/color][/b]: Well I think that while, yes, there may be some bad blood among us. We are a brotherhood, no matter what happens we will never stop loving graphic design and we wouldn't give up the chance to recieve feedback and discuss that with other designers that have become our friends over many months of being in the Graphic Masters. For this reason I think that we will sort this out diplomatically once the drama has settled down.\n\n[b][color=white]Rhythm[/color][/b]: Excellent analysis.Thank you for your time Coffee. Is there anything you wish to add, or any shoutouts you'd like to make?\n[b][color=white]Coffee[/color][/b]: I'd like to make a shoutout to Morchid, Mr. Kewl, BlackChaos and my brothers in GM\n\n[b][color=white]Rhythm[/color][/b]: Alright then, thank you again!\n[b][color=white]Coffee[/color][/b]: No problem :)\n\n[b][color=#FF4500]With JDBar--[/color][/b]\n\n[b][color=white]Rhythm[/color][/b]: Hey JDBar, how are you feeling today?\n[b][color=white]JDBar[/color][/b]: Pretty good, I guess.\n\n[b][color=white]Rhythm[/color][/b]: Good to know! So what are your opinions on what's happened so far within GM\n[b][color=white]JDBar[/color][/b]: Well, as far as Sai's leadership goes, I think I'm still pretty neutral. From what I've experienced as a competing Merc/Kiwi Graphics member, Sai did a pretty good job leading New Age and keeping it active and competitive. He gave us a run for our money back then. I also understand why a lot of people find his method of attaining leadership to be shady, perhaps even undeserved. However, I'm fairly confident that Sai can rejuvinate GM with activity as well as he did with New Age.\n\n[b][color=white]Rhythm[/color][/b]: I see. As a Merc/Kiwi GFX Member, who was your leader?\n[b][color=white]JDBar[/color][/b]: Unreputed has been the leader of Merc and Kiwi.\n\n[b][color=white]Rhythm[/color][/b]: Ah, I had thought so. What do you believe his views on the issue would be?\n[b][color=white]JDBar[/color][/b]: I believe he's been on vacation during the majority of the ordeal. Thinking from his point of view, I think he'd prefer to see Sai be removed from leadership. There's always been some tension between him and Sai.\n\n[b][color=white]Rhythm[/color][/b]: I can definitely see that with the competing groups and all. Is there anything you'd like to add?\n[b][color=white]JDBar[/color][/b]: Only thing I'd like to say is even though I haven't been a GM member for too long, it seems new life has sparked in the subforum and I'm sure that whatever happens from here on out that HackForums will get to enjoy quite a bit more public participation from GM members.\n\n[b][color=white]Rhythm[/color][/b]: Excellent. Any shoutouts you'd like to make?\n[b][color=white]JDBar[/color][/b]: I'll shoutout to Unrep, Wrkz, Remi, iHydra, ShadowBlades, and Flying Dutchman for sticking around with Kiwi for so long, keeping our little graphics commune alive, and motivating me to learn new things. :D\n\n[b][color=white]Rhythm[/color][/b]: Awesome =). Thank you so much for your time JD, it's been a pleasure.\n\n[b][color=#FF4500]With Intrepid--[/color][/b]\n\n[b][color=white]Rhythm[/color][/b]: Hey Intrepid, how are you today?\n[b][color=white]Intrepid[/color][/b]: I'm doing great, having a splendid night out on the internet. :)\n\n[b][color=white]Rhythm[/color][/b]: That just sounds spectacular. Any plans for this night out?\n[b][color=white]Intrepid[/color][/b]: Sure is, I'm currently working on a large piece for an art collective, playing some League of Legends later on, and I've been blogging all day long as well.\n\n[b][color=white]Rhythm[/color][/b]: Art collectives, LoL, and blogging, good stuff. So what's your opinion on the recent occurances in GM?\n[b][color=white]Intrepid[/color][/b]: Sai is one cheeky cunt m8.\n\n[b][color=white]Rhythm[/color][/b]: I see. Care to elaborate on the matter?\n[b][color=white]Intrepid[/color][/b]: From what I know, Sai seemed to have conned his way into GM by paying only $50 of the $500 required, by using funds by other members.\n\n[b][color=white]Rhythm[/color][/b]: I see. This has sparked some conflicts between members of the group; some say that Sai is fit for the job regardless. He's promised to improve the group, what are your opinions on this?\n[b][color=white]Intrepid[/color][/b]: I can care less as this could easily be done as an act of desperation.\n\n[b][color=white]Rhythm[/color][/b]: True. How do you feel about the recent tournaments being hosted for GM?\n[b][color=white]Intrepid[/color][/b]: They’re going smoothly so far, but the reason why most of the tournaments don't do well is because of the viewers. They only know how to rate something based on what current knowledge they already have in that area of expertise.\n\n[b][color=white]Rhythm[/color][/b]: Very interesting analysis. So what type of graphic design do you specialize in?\n[b][color=white]Intrepid[/color][/b]: UI, Web Design, UX, photo manipulations, and Tags (signatures)\n\n[b][color=white]Rhythm[/color][/b]: Quite a diverse array you of skills you have, is there any type you prefer more than others?\n[b][color=white]Intrepid[/color][/b]: At the moment I prefer doing UI and Web Design more than any of the others, but photo manipulation is so very fun and I'm hoping to increase my skill in all of the areas.\n\n[b][color=white]Rhythm[/color][/b]: I love photo manipulations, so much fun to make them. Is there anything you'd like to say to HF, or any shoutouts you'd like to make?\n[b][color=white]Intrepid[/color][/b]: Sure uh, Rhythm is ma nigga Cherub love that kid Demer is my little feeder noob 4 lyfe Flashys a lil puss puss shout out to The Elite Dreclin Panda Keoni all you nigga who've been there for me makin this shit happen! Oh, and Diamond.\n\n[b][color=white]Rhythm[/color][/b]: Awesome, thank you so much for your time Intrepid.\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]900 Year Old Chinese Bowl Sold[/b]\nA rare chinese porcelain town was sold for $27 million on Wednesday in a Sotheby's auction in Hong Kong.  The piece was stored in an English collection since the 1920's.  It has been stated that the town is from the Northern Song Dynasty (960-1127), in which it has also been said that only 79 complete pieces are in existence from that era. \n\n[b]1940 US Census now available[/b]\nThe United States National Archives has just released the 1940 US Census online for free.  This useful tool aids in finding details about your ancestors through HD scans of handwritten data but the records are not searchable by name.  You can search by county, city, and street name.  Once locating  your person of interest, the following information is available:\n[list][*]Age\n[*]Marital Status\n[*]School history\n[*]Living situation\n[*]Employment status\n[*]Place of birth\n[*]Yearly income\n[/list]\n\n[b]Google's Project Glass[/b]\nGoogle's latest project, known as Project Glass will aid you in doing many things on your cellphone without ever taking it out. In a concept video released by Google, it was shown that the glasses could take pictures, give you directions, perform video chats, and take notes for you.[/color]\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[color=white][b]Apple:[/b][/color]\nThe iPhone rumors are here once again. Weeks after the new iPad came out, rumors of the new iPhone have surfaced.  The most recent ones have been that the new iPhone is set to have a 4.3-5.0-screen size. This might be true but 5.0 we doubt it. Another is that LTE (4G) is finally going to come to the new iPhone.  This one could come true because the new iPad did ship as a 4G LTE capable device. Lastly, according to someone from Foxconn (manufactures of Apple products) reported that the new iPhone is set to be released in June and is being worked on now. June might be a little too early to mass-produce such a high volume of phones. \n\n[color=white][b]Adobe:[/b][/color]\nPhotoshop CS6 beta is out. Photoshop is an amazing image editing program. CS6 really brings many requested features to be in Photoshop.  Photoshop can do many things that no other program can. You can download the Photoshop update from Adobe’s site. This is not forever it is a trial. You can download this and use a key you purchased to unlock it forever. \n\n[color=white][b]Instagram:[/b][/color]\nInstagram has finally been released on the Android OS. Instagram made its debut as an iPhone camera app that had filters and was cool to use. Now Instagram is a social network where people can upload their pictures and get comments on them and likes. People follow each other and see what people post. It’s sort of Twitter and Facebook mixed together. Instagram works on some Android devices. A lot have been deemed incompatible though so be careful.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]ACM[/b][/color]\nThe 47th Annual Academy of Country Music Awards, held Sunday at the MGM Grand in Las Vegas,  were a mixture of expected winners sprinkled with a couple of surprises.\n\n[color=white][b]Weird Al[/b][/color]\nWeird Al Yankovic, through his company Ear Booker Enterprises, is suing Sony Music Entertainment for $5 million.\n\n[color=white][b]Sparkle[/b][/color]\nThe trailor for Whitney Houston's upcoming film \"Sparkle\" premiered on NBC's \"Today\" show April 2nd, 2012\n\n[color=white][b]Coma[/b][/color]\nShifty Shellshock, the former singer of Los Angeles rap-rock group Crazy Town, is reportedly in a coma at an undisclosed Los Angeles hospital. \n\n[color=white][b]Music Videos Of The Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=TsMMuXZZUm8[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nSometimes you need to rely on yourself to get things done. If you have a problem or there is a deadline that needs to be met, you can't always put your faith in others. I'm not saying that you shouldn't trust anyone, but sometimes you just need to make sure that you can take care of the problem and wrap things up. There are just some things that you need to do yourself. This also applies to your own personal problems, don't rely on others to help you with your problem, whatever it may be. Strive for success and take care of it yourself.",
      "subject": "*"
    },
    {
      "pid": "21401700",
      "uid": "515249",
      "dateline": "1333587527",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about custom groups?\"\n\n[i]\"Personally I hate the custom group idea, they all killed the original groups of Hackforums.\n The groups which were there earlier on Hackforums, were more better than the current groups.\n The custom group owners just want to make profit from their group and earn from them. I\n remember when I was a [b]normal [/b]member, I was in Rat's crew and Black Knights. You\n can rarely see a normal member in these groups, (except TA and GM.) The old groups cannot\n be replaced by the current groups. The Gamers was a way better group than Respawn. I'm\n happy for The Alliance and Graphic masters still being there, they are the only group which\n select members on the basis on talent not reps or posts.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=183072][i]-Mr Kewl[/i][/url]\n\n[align=right][i]\"I think custom groups help add to how hackforums is growing. I have seen new\n members, with less than 200 posts get accepted into a group and that group inspires them\n to become more active.I recently got accepted into Respawn, which is a gaming based group.\n From joining this group I have made many friends and learned many new things about gaming.\n Custom groups are a great way for people to meet new people and learn new things that the\n group is about. An example is the graphics group. Say 1 member is really good at doing text\n effects in Photoshop but they are bad at doing smudges and shine effects. Then there a member\n who is good at smudges and shine effects but bad at text effects, these members can help each\n other out.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=874827][i]-EpicXXCrushor1[/i][/url][/align]\n\nThe topic for next week is \"What do you think of the HF News?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/l7RZb.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://www.feld.com/wp/wp-content/uploads/2011/11/Screen-Shot-2011-11-04-at-7.39.34-AM.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/elY29.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=YCNbocRu9Fs[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=656453][color=lime][b]ReactioNz[/b][/color][/url] is off his probational period and is officially a staff member.\n[url=http://hackforums.net/member.php?action=profile&uid=1052197][b][color=white]Damn.[/color][/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=421232][b][color=white]Flashy.[/color][/b][/url] were recently promoted to leader of the Graphic Masters.\n[url=http://hackforums.net/member.php?action=profile&uid=128873][b][color=white]T3h Hack3r[/color][/b][/url] was recently promoted to leader of The Alliance.\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=1011113][b][color=white]Dan.[/color][/b][/url] has received the Cat Lover award.\n[url=http://hackforums.net/member.php?action=profile&uid=1155615][b][color=white]bmendo[/color][/b][/url] has received the GFX Guru award. [url=http://www.youtube.com/watch?v=1AccLyfFtFs]Video[/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1021104][b][color=#FFD700]Mich@ael[/color][/b][/url] has received the Militant award.\n[url=http://hackforums.net/member.php?action=profile&uid=651773][b][color=#0066FF]Vitani's Mate[/color][/b][/url] has received the Star award.\n[url=http://hackforums.net/member.php?action=profile&uid=94732][b][color=#FFD700]*Drew Pickles*™[/color][/b][/url] has received the Asswipe award.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}