{
  "posts": [
    {
      "pid": "9993732",
      "uid": "0",
      "dateline": "1298235722",
      "message": "[u][b][color=#FFA500]Ωмεɢα And EctoPlasm Created This Weeks HF news. (Note: Ωмεɢα Did most of it, I just made sure everything looked neat, and in edited to be right.)[/color][/b][/u]\r\n\n[align=center][img]http://img269.imageshack.us/img269/8496/headlinesr.png[/img][/align]\r\n\nOn February 2nd, 2011, all RS discussion were banned on HackForums. The main concern Admin Omniscient had were the complaints he received due to RS related scams. Many of these scams are a direct result of the recently re-added free trade and wildy. While many people disagree with his decision, nobody should post of the topic, unless they want to be banned.\r\n\nCongratulations to [url=http://hackforums.net/member.php?action=profile&uid=46373][b][color=#32CD32]phire nuk3r[/color][/b][/url] for being promoted to staff once again! You are a great staff member and despite being demoted last month, I am sure you will do your best to help the community.\r\n\nWe are sad to say that[url=http:hackforums.net/showthread.php?tid=1052979]HERE[/url]. [url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#1E90FF]Xch4ng3[/color][/b][/url] stepped down from his staff position. He was a great moderator and will be remembered. He made a thread discussing it [url=http:hackforums.net/showthread.php?tid=1052979]HERE[/url]. [url=http://hackforums.net/member.php?action=profile&uid=65784][b][color=#1E90FF]Xch4ng3[/color][/b][/url] is now part of the yet unknown Mentors usergroup, along with the ex-Staff Kn1ght\r\n\nAdmin [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] has announced that if the vouch system is not finished by the end of the month, he will shut HF down. You can read exactly what he said [url=http://hackforums.net/showthread.php?tid=1054674&pid=9788663#pid9788663]HERE[/url].\r\n\n[align=center][img]http://img211.imageshack.us/img211/300/usernews.png[/img][/align]\r\n\nThe user [url=http://hackforums.net/member.php?action=profile&uid=333514][color=#1E90FF]Dust[/color][/url] has been banned for 2 months for trying to sell an HF l33t account on another forum called Cryptx. Goes to show that staff does not only use HackForums but many other sites aswell!\r\n\nFormer Red Lions leader [url=http://hackforums.net/member.php?action=profile&uid=127732][b][color=#1E90FF]`P R O D I G Y[/color][/b][/url] has been unbanned, having been banned for 1 week. His ban was classified as a 'Security Issue'. He was supposedly hacked, but there is still no certainty with this theory. So far, he didn't make any post explaining his situation, therefore, many people think that all the scams were actually planned and that he wasn't hacked.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=112139][color=#1E90FF]Carbon[/color][/url] has been banned for 1 month due to nonsense regarding a situation that happend where he claims that the member[url=http://hackforums.net/member.php?action=profile&uid=404298] [color=#1E90FF]Google.com[/color][/url] has scammed him 700-800 $ worth of RS Gold. [url=http://hackforums.net/member.php?action=profile&uid=404298][color=#1E90FF]Google.com[/color][/url] stated in his reputation that [spoiler=Quote][quote]DO NOT TRUST THIS MEMBER, HE SCAMMED ME AND CREATED A FAKE SCAM REPORT, HE WILL PRETEND TO BE YOUR FRIEND AND USE YOU! [/quote][/spoiler] So the exact situation is not fixed but who knows if Carbon went first to a guy that has less reputation then him.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=170785][color=#1E90FF]Infallible[/color][/url] has been banned once again as he gave staff more disrespect aswell as ban evading, his ban lift is postponed to the 11th of march.\r\n[url=http://hackforums.net/member.php?action=profile&uid=491112][b][color=#FFD700]\r\nKILLM3[/color][/b][/url] has came up with a brilliant plan where everyone votes for a troll cake on a recipe website. The winner cake would be posted on front page and a cook will try to make it.  The picture of the cake is located here. [url=http://i590.photobucket.com/albums/ss347/PhoeNix4Real/win-1.png]Click here for the Troll Cake[/url] It won with 22k Votes! Congratulations HackForums! \r\n\n[url=http://hackforums.net/member.php?action=profile&uid=46373][b][color=#32CD32]Phire nuk3r[/color][/b][/url] has now reached over 3100 reports being made while he was not staff, this may have been while Omniscient wanted him back on that staff team as he has alot of dedication and motivation to help HackForums.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=134798][color=#FFD700]‡Rank‡[/color] [/url]has been robbed for over $325 worth of things in real life, and as a loyal person to the community he says he is really upset at the fact that he has done nothing wrong to deserve this. Hopefully he finds who the thiefs were and press charges against them! \r\n\nCongratulations on [url=http://hackforums.net/member.php?action=profile&uid=175033][color=#1E90FF]Xerotic [/color][/url]for being upgraded to Leader of the Rats Crew, Hopefully you make the crew become the best it can be with your talents and skills!\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] has made a valentines video for [url=http://hackforums.net/member.php?action=profile&uid=295848][color=#1E90FF]Qwazz[/color][/url] and his girlfriend for Valentines day. Congratulations to you guys and for people who have not seen the video, you can take a look in this thread. http://hackforums.net/showthread.php?tid=1061089\r\n\n[align=center]\r\n[img]http://img199.imageshack.us/img199/6619/othernews.png[/img][/align]\r\n\nTraffic to Hackforums.net has grown by 30% since September 2010, and expectations are that this increased amount of traffic will be standard in a few months. In order to keep Hackforums.net running smoothly, Omni is arranging a new web server to handle it, however he has implied he is not seeking donations for this, as current rate of member upgrades can pay for it. With the increased traffic, Hackforums.net is coming towards being inside the top 1000 websites on the internet.\r\n\nhttp://hackforums.net/showthread.php?tid=1076516 to view the latest project of HF's hosted by [b][color=#4682B4]princessotaku[/color][/b]\r\n\nHackForums member [url=http://hackforums.net/member.php?action=profile&uid=175033][color=#1E90FF]xerotic[/color][/url] made the Valentine's banner that could be seen on February 14th, 2011. Congratulations to [url=http://hackforums.net/member.php?action=profile&uid=175033][color=#1E90FF]xerotic [/color][/url]for making the nice graphic! You can see a compilation of his Valentine's banners HERE\r\n\nFor people who want to learn more about [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#00BFFF]Omniscient[/color][/b][/url] and who he is. There was an Interview about him long back on a different forums, It will be posted here for the users who have not seen it yet!\r\n\n[align=center]\r\n[b][color=#FFA500]>>[/align][/color][/b][align=center][spoiler=INTERVIEW WITH OMNISCIENT]\r\n--\r\n[img]http://i.imgur.com/o86mV.png[/img][/spoiler]\r\n[b][color=#FFA500]\r\n<<[/color][/b]\r\n\n[align=center][img]http://img341.imageshack.us/img341/8763/videootw.png[/img][/align]\r\n\n[align=center][yt]http://www.youtube.com/watch?v=KT1pWo0WZJE[/yt][/align]\r\n\n[align=center][img]http://img257.imageshack.us/img257/1076/interviews.png[/img][/align]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Hi [url=http://hackforums.net/member.php?action=profile&uid=416897]EctoPlasm[/url]. Let begin our interview shall we. My first question is, how did you discover HF?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] : I discovered Hackforums when I was looking to start getting Runescape (all discussion banned on HF) (all discussion banned on HF) (all discussion banned on HF) accounts, at first I wanted to learn how and what tools I needed, but after I looked around HF, I decided I can use this site for alot of other things so Instead I stopped playing Runescape (all discussion banned on HF) (all discussion banned on HF) (all discussion banned on HF) and hacking Runescape (all discussion banned on HF) (all discussion banned on HF) (all discussion banned on HF) accounts.[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : What did you think about HF when you first saw it? What was your first impression?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :At first I thought I could help promote the site and get it to become a huge forum. The forum was just perfect, as there was a variety of things to do. If you were tired of learning how to hack you can have a debate with someone or even watch trolls entertain us. [/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Do you think that HackForums changed for the best or the worst? What do you think about the current HF?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :Honest truth is that HackForums is starting to depend only on the lounge. People are starting to stop focusing on their talents to just mass make threads and post in lounges. I am not saying I was not one of them, but I can say that I know lots of ways that HackForums can improve. [/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : What is the worst thing about HackForums at the moment? And how do you think we can go through that?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :The worst thing is Reputation. It is controlling everyone and causing many conflicts with everyone. Most people use their rep number to show people that they are \"trustworthy\" and \"Legit\". Omniscient was smart on implementing the vouch system, although he isnt putting enough time to finish the project. I know that once this comes through, alot of people will stop the conflicts with rep, and rep will not mean much but peoples opinons.[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Who do you think is the most contributing member on HF excluding Staffs and Admins of course?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :This is hard to answer as its really general, this is because I can choose someone like nokia2mon who is the most contributing member financially or I could choose Tate as most informative member and helpful member in Hacking sections. This is a too general question, but If I had to choose content wise, It would be Tate, even though were not best of friends ;).[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Do you have any projects in mind for HF?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :The last project I made for Red Lions got me banned for 2 weeks and the assumption of me having a \"Staff Attitude\", for people who wanted to understand what happend I basically made a project where every member of RL could make 20 legit reports in a specific section so we can clean it up, but a \"Staff\" got really upset and complained to Omniscient, which then led to my ban. Seeing as the Projects I make can get me in \"Trouble\" I wont be doing any more projects on HF with groups rather individuals around 2-3 members.[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Do you have any future goals on HF? Or anywhere else for this matter.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :My future goals on HF, is to create \"Jobs\" around the place where I can make members and even myself lots of money. (Money wise), Another future goal is to try to make Red Lions a really HQ Group, with not more then 20 people. Those are two goals I can state publically.[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Who is your favourite Staff member? \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :I would say it would be a tie between Kr4z1 and TRRS. The reason I say this is because they are dedicated to HF and they know whats good for HF. They also are the staff members that connect with members via skype and msn, as to other staffs and when I know that they are wrong in some situations we have a great time debating about it via skype. But if it ends up on HF, then there are consequences, but although they hate my guts and I hate theirs, they are damn good staffs.[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : Hmm, ok now, what is your favourite section? \r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :My Favorite section would probably be the Science Religion Philosophy and Politics it develops strong communication skills and this is how Im making 20k+ from having a different type of thinking then the other people out there.[/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=542851][b][color=#1E90FF]Ωмεɢα[/color][/b][/url] : I think this concludes our interview. Do you have any last words to say to the members before we're done?\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :Yes, couple things actually. One is, good job on taking on the part of making HF News, another is Omniscient should keep striving and doing his already amazing job on managing the servers and site. And last is, no one gives a shit about you but your parents, so dont treat anyone online as a true legit person. [/list]\r\n\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=416897][b][color=#FFD700]EctoPlasm[/color][/b][/url] :And Id like to give a shoutout to Verdande for an amazing song he has made. http://hackforums.net/showthread.php?tid=1047058[/list]\r\n\n[align=left][IMG]http://i.imgur.com/pdloC.png[/IMG][/align]\r\n",
      "subject": "[2/18/2011] - HF News"
    }
  ]
}