{
  "posts": [
    {
      "pid": "18795714",
      "uid": "515249",
      "dateline": "1325743818",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]74th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[b]Minor Changes[/b]\nOmni has been doing some maintenance around HF, which resulted in HF being on and off throughout Monday. Also he decided to remove the ‘Limited’ group and all users that belonged to this group were moved into the ‘Closed’ group. Another small, but noticeable change was the new text when junking a thread, it now reads “[i]Are you sure? Please be aware we consider the mass junking of your threads to be abuse of this feature. We ask that you selectively junk threads and only when you have a valid reason. Please respect that others have posts and that your thread might contain valuable content.[/i]” The reason behind this was to lower the rate of junk abuse, as Omni has been very strict about enforcing this rule.\n\n[b]Festive Banner[/b]\nTo celebrate the start of a new year, Omni temporarily changed the banner to a new colorful banner showing fireworks bursting in the background. However after New Years past he reverted back to the original HF banner that we all know and love.\n\n[b]Ad infections[/b]\nThere have been many recent reports of the advertisements on HF infecting members. Although it may seem that HF may be responsible for these infections it is still unconfirmed as there has yet to be any liable evidence provided to confirm the reports. As said by Omni “[i]I have no clear evidence or confirmation that indeed ads displayed at HF caused anyone to be infected.[/i]” There is still no proof that HackForums is responsible for these infections.\n\n[b]Booter-down Censored[/b]\nDue to unknown reasons the word booter-down (without the hyphen) has been censored on Hack Forums. There is no official reason for this however many members believe it is linked to the ban of one of its main contributors, Orgy. Who was also repfucked, and stripped from his ub3r, hinting that he was not very well liked by the Admins in the first place.\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=361543][b][color=#0066FF]Scooter[/color][/url][/b] - reached 1500 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=176753][b][color=#0066FF].Nielz[/color][/url][/b] - has reached 10,000 posts, this is a great milestone for anyone.\n[url=http://hackforums.net/member.php?action=profile&uid=71764][b][color=#0066FF]flamingw0rm[/color][/url][/b] - the well known member was banned for \"Selling HF Database\", but recently after he was unbanned.\n[url=http://hackforums.net/member.php?action=profile&uid=182754][b][color=white]Orgy[/color][/url][/b] - was banned and repfucked for the reason \"Enough of your nonsense.\"\" He was unbanned early but suffered the loss of his Businessman award and subscription of UB3R.\n[url=http://hackforums.net/member.php?action=profile&uid=40895][b][color=white]BV1 ツ[/color][/url][/b] was repfucked for [censored] related reasons.\n[url=http://hackforums.net/member.php?action=profile&uid=570186][b][color=white]TheHackersLove[/color][/url][/b] - was also repfucked for unknown reasons.\n[url=http://hackforums.net/member.php?action=profile&uid=538574][b][color=black]-Thomas-[/color][/url][/b] - took a vacation ban this week.\n[url=http://hackforums.net/member.php?action=profile&uid=355307][b][color=black]chocothunda[/color][/url][/b] - was banned and repfucked for BHP Spamming.\n[url=http://hackforums.net/member.php?action=profile&uid=521076][b][color=black]Futuristic[/color][/url][/b] - Owner of one of HF's most sold Worms, has taken a lengthy vacation ban, he is set to unbanned just before April.\n[url=http://hackforums.net/member.php?action=profile&uid=629321][b][color=black]African Hat[/color][/url][/b] - has requested a ban for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=752389][b][color=black]eiqhtworks[/color][/url][/b] - has requested to be banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=994516][b][color=black]Gravee[/color][/url][/b] - another member that has requested to be banned for vacation this week.\n[url=http://hackforums.net/member.php?action=profile&uid=762186][b][color=black]Cymraeg[/color][/url][/b] - an Ub3r member has been banned for not following the rule posting in the Marketplace.\n[url=http://hackforums.net/member.php?action=profile&uid=86680][b][color=black]Calcium[/color][/url][/b] - was banned for Ub3r Junk Abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=1057515][b][color=black]Evil-Wish[/color][/url][/b] - was banned and repfucked for Advertising and spamming via PM's.\n[url=http://hackforums.net/member.php?action=profile&uid=498184][b][color=black]Banksy[/color][/url][/b] - was banned for \"Constant Sales Trashing\".\n[url=http://hackforums.net/member.php?action=profile&uid=496906][b][color=black]Amp™[/color][/url][/b] - the leader of the Black Knights was banned for DOX/Swat threats via PM.\n[url=http://hackforums.net/member.php?action=profile&uid=672987][b][color=black]Abuser™[/color][/url][/b] - received a ban for using the same avatar of Administrator Judge Dredd.\n[url=http://hackforums.net/member.php?action=profile&uid=444249][b][color=black]-paradox-[/color][/url][/b] - quite a frequently banned member was banned for Constantly Flaming.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Blackshades Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2061236]Blackshades - Information Regarding the Hacking/Accusations[/url] - [url=http://hackforums.net/member.php?action=profile&uid=40895][color=white][b]BV1 ツ[/b][/color][/url] - To all of you who may have heard about the rumor involving Blackshades getting hacked, it is true. This thread will explain more.\n\n[i][b]Dredd Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2024936]All DREDD Resources, Crack-Me's, and Tutorials - Compilation![/url] - [url=http://hackforums.net/member.php?action=profile&uid=174257][color=#0066FF][b]Coach Dredd[/b][/color][/url] - This thread is now a sticky and it contains links to all threads and locations that may be needed in the Dredd section. Hopefully this one is kept up to date.\n\n[i][b]Announcement Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2038090]Propitious | COMING SOON | Announcement![/url] - [url=http://hackforums.net/member.php?action=profile&uid=330676][color=white][b]Diabolic[/b][/color][/url] - Even though the thread is closed you should definitely give it a look. It announces the coming of Propitious.\n\n[i][b]Rap Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1436482]The HackForums Rap...[/url] - [url=http://hackforums.net/member.php?action=profile&uid=402384][color=white][b]Riggs[/b][/color][/url] - Riggs wrote an impressive rap for Hack Forums and had it stickied in the Lounge. Go read it for a good laugh.\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - The MammoTh[/font][/size][/color][spoiler=]\n[b][color=white]Innocence.[/color][/b]: Hey MammoTh! I'm glad you could take the time to have this interview with me! How are you today?\n[b][color=#1466FF]The MammoTh[/color][/b]: I am doing fine, thanks for asking.\n\n[b][color=white]Innocence.[/color][/b]: Now, before we start.. I'd like to ask; Are there any members you want to give a shout-out to?\n[b][color=#1466FF]The MammoTh[/color][/b]: Yes, iDeVeLoPeR, Ups., Ignite., Kyle FYI, ŜĦõÇķẀẩvẺ™ and all the other people that are active in the marketplace section.\n\n[b][color=white]Innocence.[/color][/b]: When did you join Hack Forums, and why did you join? How were you introduced to Hack Forums?\n[b][color=#1466FF]The MammoTh[/color][/b]: I've always been into coding & networking, my friend introduced me to Hackforums and that I should join it. Here I am :).\n\n[b][color=white]Innocence.[/color][/b]: How did you come up with your username, \"The MammoTh\"? Has this been your online alias for a long time now?\n[b][color=#1466FF]The MammoTh[/color][/b]: Well, I use to always say \"That guy is a mammoth\". Meaning would be the guy is cool/good something positive. Of course I am The MammoTh which makes me even better.\n\n[b][color=white]Innocence.[/color][/b]: So, let's talk about the two possible new groups, Brotherhood and Propitious.. What's your thoughts on these? Do you think they will have a good or bad affect on Hack Forums?\n[b][color=#1466FF]The MammoTh[/color][/b]: I haven't really seen much from Brotherhood, although Propitious looks very cool to me. We will see how it turns out.\n\n[b][color=white]Innocence.[/color][/b]: Now, how does Hack Forums look in the future to you based on what's happening now? Do you think Hack Forums will get better, or worse?\n[b][color=#1466FF]The MammoTh[/color][/b]: Hackforums is growing which is good, but the amount of scammers/spammers (People that want to do HF/Users harm) are growing to. My opinion is neutral at this point.\n\n[b][color=white]Innocence.[/color][/b]: The Vouch System. How do you think this will turn out? A complete revamp for the Marketplace, or a complete disaster? \n[b][color=#1466FF]The MammoTh[/color][/b]: I think it's going to change the market in a positive way. I am looking forward to it.\n\n[b][color=white]Innocence.[/color][/b]: I hear that you, Ignite & iDeVeLoPeR. will be releasing a stresser to the Marketplace soon from Crystal Products? How is that coming along?\n[b][color=#1466FF]The MammoTh[/color][/b]: The time I am making this interview is it released on the market, first we will be in a BETA fase. Where we have a 50% discount. You should look it up.\n\n[b][color=white]Innocence.[/color][/b]: Well, I think that raps us up for this interview. Is there anything else you'd like to talk about or discuss? If not, feel free to rap up the interview with anything!\n[b][color=#1466FF]The MammoTh[/color][/b]: Heavy must stay together \\M/\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Riggs and iNviZ[/font][/size][/color]\n[align=center][video=youtube]http://www.youtube.com/watch?v=7-BeerXNfO4[/video][/align]\n",
      "subject": "[1/4/12] - HF News"
    },
    {
      "pid": "18795724",
      "uid": "515249",
      "dateline": "1325743876",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[b][color=white]The Taliban ready to talk[/color][/b]\nThe Afghan Taliban are prepared to open an \"office outside the country for talks with foreigners,\" a purported spokesman for the movement said in a statement released Tuesday. The statement could signal the Taliban's public willingness to talk to the United States for the first time. Calling himself \"Islamic Emirate of Afghanistan spokesman,\" Zabiullah Mujaheed said the Taliban have a \"preliminary agreement with Qatar and other respective sides.\" The Taliban are asking for the release of prisoners from the U.S. detention center at Guantanamo Bay, Cuba, in exchange for opening the office, he said. He said the group is also \"ready for talks and negotiation inside the country.\" It appears to be the first time the Taliban -- who ruled Afghanistan from 1996 until 2001, when they were ousted in a U.S.-led invasion -- have offered talks without the condition of an American withdrawal from the country.\n\n[b][color=white]10th birthday to the euro[/color][/b]\nThere's a big birthday to note today taking place on the other side of the pond. The celebrant is 10 years old. But sadly the youngster doesn't seem to be in much of a mood for a party today. Ten years ago, the euro bank note was born. And to mark the occasion, the embattled European Central Bank spent some of its precious euros to make a video.  You can see an excerpt in the video above, where the narrator says, \"Europe builds bridges and inspires hope. It enables its people to look to the future with confidence.\" Really? Hope, confidence? Has the ECB been reading the same news I have? The video goes on to tout the bills themselves. The narrator says, \"... placed end to end, the 14.9 billion bank notes produced for the changeover could have stretched to the moon and back five times over.\" Quite impressive. But have you ever looked at any of those 14.9 billion euro notes? They are the epitome of the problem of design by committee. In order to come up with the designs that were sure not to offend any member countries, the bills depict no statesman and no landmarks - no identifiable anything. The bridges on the back of the bills don't exist anywhere, nor do the architectural fragments on the front. Anyway, happy birthday, euro; may you have a long and healthy life so that you stop causing global economic panics.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[color=white][b]CES[/b][/color]\nThe International CES is back in Vegas. CES is the International Consumer Electronics Show where all tech companies come together and show off products, and new ideas. Sadly this is not open to the public. Amazing things have been introduced in CES, like the Xbox, Blue-ray Disc, Compact Disc, Tetris, and even the camcorder. You could say CES is a place to introduce new technology and products.\n\n[color=white][b]TjRus iPhone Project[/b][/color]\nA developer that goes by the name TjRus built a iPhone Internet model out of pure CSS3, no images were used whatsoever. The project was a amazing 3,395 lines of CSS code and 355 Java code to display. The iPhone is interactive and really works like a real iPhone except calling and launching apps. The project is really amazing because TjRus did not use one image to create this at all!! That’s something many cant even do. You can check out the iPhone here http://tjrus.com/iphone\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[i][u][b]Justin Bieber Quizzed By School Kids About Selena[/b][/u][/i]\nJB admits to kissing Gomez when they go to the movies together...\nJustin Bieber was enlisted by Ellen DeGeneres to help give back to Whitney Elementary, a Las Vegas school that helps underprivileged children. And in addition to donating $100,000 and $100,000 worth of toys, the always-charitable singer performed for the room full of Beliebers.\nBieber even answered some burning questions about his hair, his favourite colour and his rise to fame but, perhaps it was his response about his girlfriend, Selena Gomez, that had the room most giggly.\n[hr]\n[u][i][b]Pro Green Slams BBC's The Voice For Will Young Snub[/b][/i][/u]\nThe Monster MC is outraged The Script's Danny got the job over Will...\nProfessor Green has slammed the BBC for picking The Script's Danny O'Donoghue over Will Young to be a judge on new talent show, The Voice.\nAs we previously reported, O'Donoghue was selected to be on the panel instead of Will, joining the likes of Jessie J, Will.I.Am and Tom Jones.\nGreen - who is thought to have bonded with the Jealousy singer after they both appeared on The Jo Whiley Music Show - has now attacked Beeb bosses for overlooking the Pop Idol champion.\n[hr]\n[u][i][b]Kanye West Launches DONDA Design Company[/b][/i][/u]\nYeezy has spent a whopping 3 hours discussing his new venture on Twitter...\nKanye West took over Twitter earlier today (5th January) to tell his followers all about his new design company DONDA - which aims to help \"amazing thinkers.\"\nYeezy ranted for three hours on the social-networking site all about his plans for the venture, which is named after his late mother, Dr. Donda West - who died in 2007.\nDuring his Twitter tirade, the All The Lights hitmaker vowed to pick up where Apple founder Steve Jobs - who passed away last year - left off, telling fans he also wants to give us a helping hand by designing the MTV VMAs.\n[hr]\n[hr]\n[u][i][b]Music Video of The Week[/b][/i][/u]\n[video=youtube]http://www.youtube.com/watch?v=tg00YEETFzg[/video]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nMost human beings have no capacity to accept other for who they are and/or what they believe. Like politics. Why must we always fight over who we believe in? Who we have put our faith in. There have been instances with me personally, where my political standing has gotten in the way of a discussion or friendship. Are we just that close-minded that we can't put our differences aside? Even such a tiny one. This also goes for those who follow a different path of sexuality, or especially religion. There are so many that hate--yes, hate--anyone who is gay or \"different.\" Yet there are also those who can't stand other religions. They're so set on their own religion or ideas that they can't understand anyone else's. I mean sure, there are a [u]few[/u] who are actually open-minded and have no problems with anyone unless it is a part of character that they clash with. You may not think it's that big of a deal, but the human race can't even accept another of its kind.",
      "subject": "*"
    },
    {
      "pid": "18795734",
      "uid": "515249",
      "dateline": "1325743957",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"Do you think that new usergroups are good for the site? In what way do that affect HF?\" \n\n[i]\"I believe that new usergroups are good for the site as long as they are well\n kept. There are plenty of group whores out there that just want in for the userbar.\n As long as the leaders of the group can keep up with the group and kick inactive\n non contributing members, I think it's great. Official usergroups usually contribute\n a lot so I think they're nice to have around.\"[/i]\n[url=http://goo.gl/f1yJs][i]-Purple Haze[/i][/url]\n\n[align=right][i]\"I feel that usergroups are a great edition to Hack Forums! They allow\n more connectivity between members, and can learn many things throughout groups.\n I am currently only a part of L33T but i hope to soon be in another group or 2 i have\n my eyes set on. I feel that usergroups are also good for the marketplace, considering\n many groups you can't have scam reports to join, which makes trades or sales a lot\n safer.\"[/i]\n[url=http://goo.gl/J6It4][i]-iHaX™[/i][/url][/align]\n\n[i]\"I think it's good to have more official usergroups on HF, but of course, not anyone\n can afford the price. I think it's a bit stupid, and sorry for my expression, to appear\n usergroups that have the same objectives. There are already Official Usergroups that\n their obective is to have hacking experience, Giving Away threads, knowledge of\n Graphic Designing, Marketing knowledge... New usergroups, that will be Official, should\n have different objetives. Lately, i have been seeing \"Un-official usergroups\" that have\n the same requirements & objectives. To members that want to create a new usergroup,\n and can afford it to be official, have fresh ideas for the new group. Groups like: Knowledge\n of Android, Apple Devices, Webmasters, Playstation 3 Experts...\"[/i]\n[url=http://goo.gl/r2Vs5][i]Dяea[/i][/url]\n\n[align=right][i]\"As I will be leading the group Brotherhood and to me I think that having more\n user groups is a very great thing. Each user group brings in a different opinion and set of goals.\n To be honest, one day when HackForums is bigger than it already is, I would like to see thirty\n user groups. It sounds outrageous but think about the possibilities. If you had each user group\n set to specific things then you could have members in each one of the groups their expertise\n was in. This could mean that great coders could be in the coding group, webmasters in a web\n group, and so on. It gives a web of connections through the whole forum, and it would keep\n order on many different levels.\"[/i]\n[url=http://goo.gl/fnzSz][i]AlbinoShadow[/i][/url][/align]\n\nThe topic for next week is \"Are you happy with the recent changes on Hack Forums? Do you have any problems with them?\" Examples: Stafflist.php, Modlist.php, Premium Ebook Sections, etc.\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.minus.com/ifqpRwU0p0UN7.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Rob/backintheday.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Rob/gamesatwork2.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=HYj6UbyS8Io[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n\n[url=http://hackforums.net/member.php?action=profile&uid=62795][b][color=white]Tasemu[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=63]Sticky Man[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=115612][b][color=white]-BoodyE-[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=5]Drunk[/url] award.\n\n[b]Leadership Changes[/b]\n\n[url=http://hackforums.net/member.php?action=profile&uid=687297][b][color=white]Barneyyz™[/color][/url][/b] has been promoted to leader of the Minecrafters.\n[url=http://hackforums.net/member.php?action=profile&uid=182754][b][color=white]Orgy[/color][/url][/b] has been promoted to leader of the Marketers.\n[url=http://hackforums.net/member.php?action=profile&uid=40895][b][color=white]BV1 ツ[/color][/url][/b] has been promoted to leader of the Marketers.\n[/spoiler]\n\n[hr]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]0OTF[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/jZvPh]TheHackersLove[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/aJS0l]Diabolic[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Kottonmouth.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}