{
    "posts": [
        {
            "pid": "15880135",
            "uid": "515249",
            "dateline": "1316612823",
            "message": "[align=center][img]http://goo.gl/4sQ99[/img][/align]\n\n[align=center][img]http://goo.gl/9wMJo[/img][/align]\n\n[url=http://goo.gl/AQaUP][color=#0066FF][b]phire_nuk3r[/b][/color][/url] - Phire Nuk3r has returned from his long sleep. Many members will welcome him back with open arms, yet others will close their doors to him.\n\n[url=http://goo.gl/7g1HW][color=#0066FF][b]SeaNanners™[/b][/color][/url] - After the release of cracked programs, rep abuse, and leeching videos, SeaNanners still stands today, with a repfuck and now -80 reputation.\n\n[url=http://goo.gl/veb4E][color=white][b]Time[/b][/color][/url] - Omniscient kicked his shins and stole all his green apples.\n\n[url=http://goo.gl/9khfu][color=black][b]-paradox-[/b][/color][/url] - He has received his ban after 95% warning level, and multiple flamings.\n\n[url=http://goo.gl/Hfglo][color=black][b]Taylor Gang™[/b][/color][/url] - Taylor Gang is the latest addition to the HF News team as an interviewer, literally seconds after he sent the interview in, he was banned for a comment on the rep reset thread.\n\n[url=http://goo.gl/y5hrG][color=black][b]Rockstar[/b][/color][/url] - Omni is tired of pointless posts, and meaningless words. This user was banned for wasting his time.\n\n[url=http://goo.gl/9Knrx][color=black][b]VeNoMz[/b][/color][/url] and [url=http://goo.gl/VMZce][color=black][b]The Bawss[/b][/color][/url] are the very first in what will likely be a long line of those who have decided to go all out on reputation abuse since they will be repfucked anyways.\n\nThere has been a multitude of bans for \"Non-Marketplace Post\", they are really cracking down on the new rule.\n\n[align=center][img]http://goo.gl/6bjLl[/img][/align]\n\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Heart-Warming Thread[/b][/i] - [url=http://goo.gl/HPzXk]I found my dog ![/url] - [url=http://goo.gl/3fcaX][color=#0066FF][b]Genuine[/b][/color][/url] - This member was reunited with his dog after seven months of pain. Read this story if you want an uplift in mood.\n[i][b]Most Helpful Topic[/b][/i] - [url=http://goo.gl/2WJPX]ϟ!RespectIsEarned!ϟ Find Buying Low Competition Relevant Searched Domains[/url] - [url=http://goo.gl/fNbMy][color=#0066FF][b]ϟ!RespectIsEarned!ϟ[/b][/color][/url] - This thread is on how to target and buy relevant domains effectively.\n[i][b]Funniest Troll[/b][/i] - [url=http://goo.gl/7WO3k]Tumor on my dick?[/url] - [url=http://goo.gl/gkIya][color=white][b]Frida[/b][/color][/url] - While Frida is not the original poster, he is the one to be looking at. Good luck bruce, with your lizard.\n\n[color=#FFFFE0][size=large][b]SRPP Thread(s)[/b][/size][/color]\n[i][b]Most Replied Debate[/b][/i] - [url=http://goo.gl/AtgjD]Obama is a terrible president? How?[/url] - [url=http://goo.gl/h47LP][color=#0066FF][b]Itachi Uchiha[/b][/color][/url] - Another usual topic among debaters and philosophers, but this one has seemed to capture the attention of many.\n[i][b]Most Helpful Topic[/b][/i] - [url=http://goo.gl/MTQIG]Cannabis Q&A[/url] - [url=http://goo.gl/0G5YZ][color=#0066FF][b]Reported[/b][/color][/url] - This user has provided an open area for anyone to ask or discuss marijuana related topics.\n\n[color=#FFFFE0][size=large][b]Members Contest Thread(s)[/b][/size][/color]\n[i][b]Most Generous Thread[/b][/i] - [url=http://goo.gl/hvQcH]Win a WoW account with all expansions + 4k gold.[/url] - [url=http://goo.gl/Y7xRK][color=#0066FF][b]bckc[/b][/color][/url] -  The author is giving away his WoW account with 4k gold and all of the expansions. Anyone would be lucky to receive this account.\n\n[color=#FFFFE0][size=large][b]Suggestion Thread(s)[/b][/size][/color]\n[b][i]Thoughtful Suggestion[/i][/b] - [url=http://goo.gl/wZO9k]Allow members to make good use of avatar restrictions.[/url] - [url=http://goo.gl/WtTLD][color=white][b]Tasemu[/b][/color][/url] - Graphics are an important piece of the hack forums society, and this user suggests that we give a larger role to the avatar, yes, a simple thing, but an important thing. Read and support to your heart's content.\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - Disciple[/font][/size][/color][spoiler=]\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nOKay then, shall we begin. Hello DescipLe, thanks for participating in HF news interview.\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nHello Valik, I'm glad I could be apart of the HF news.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nHaha, so, do you have any shout outs to any of your friends on HF or anywhere else?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nFor sure, shout outs to Sir, Frida, Mewtwo and Wolves, that's about it.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nIm sure these people will be reading the news, so thats great. Since you have the gamer award, we are going to speak about gaming today. What is your favourite console/game? \n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nWell, I'm mostly and xbox gamer, I own an xbox 360, and mainly play Call of Duty, and Halo. I enjoy FPS games, and normally play them daily.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nSounds good, any particular games you are waiting for?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nDefinitely, I'm really anxious to see how MW3 (Modern Warfare 3) turns out, as I'm hearing good and bad things about it. I've seen multiple videos leading me to believe it's going to be great.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nTheir multiplayer trailer was great, aint it. Well, tell us a little about how you started gaming, what was your first game you played and the console you played on.\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nHonestly, it wasn't xbox, playstaion, or any console... The first gaming \"system\" I've ever played was a gameboy color, and believe it or not, pokemon yellow was the game that got me into gaming. The classics were always great, and I could go back and play them today and have just as much fun.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nHaha, i remember rocking on Pokemon Blue. What additions do you like to your gaming? Tell us about your setup and the music you listen while you playing, if you do.\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nGladly, I currently use a 42\" LG LED TV, with my Turtle Beach X41 surround sound headphones for sound. I have an HD PVR which I use to record and upload videos to youtube with. But when I'm playing any game, I need to be playing some music to keep me pumped and into the game. I normally listen to some dub-step or Wiz Khalifa.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nWow, sounds like you are a hardcore gamer ;). What type of player you are? Do you prefer Individual or Team Games? Do you do any competitive gaming, like GameBattles?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nTo be honest, I prefer individual games, alike free for all, and other \"lone wolf\" types of games, so I only have myself to blame if I mess up. And I do play GameBattles, in fact, I played another member's team from HF in a two versus two match. Unfortunately we lost but it was really fun. I like playing competitive games, they keep me excited.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nSounds good, but don't you think you are being selfish? What if someone asked you to play competitive with him, would you decline?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nNot at all, I like playing team as well, as long as I know I can rely on them. I would definitely accept a team invite, or something of that sort if I knew we were going to do good. As long as I can have fun, I'm down.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nVery true. Which one of us would like to be in a bad team? What do you think about mentoring players? Have you had any experience in actually teaching people how to play?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nNot really, I've played a lot with friends in real life, and helped them get better by telling them where to go...etc. But other than that, I don't think I've really \"taught\" anyone how to play, although I wouldn't mind starting mentoring players, it could be fun.\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nAlrighty, well we are about to finish. Last question. If you had one wish, what would it be and why?\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nThat's actually a really hard question to answer, I can't really think of one thing I would want over anything else atm. I guess all I could really want would be to keep my family and friends safe, that's about it...\n\n[b][color=#FFFFE0]Valik ϟ[/color][/b] says: \nThats really nice of you. Well you guys had a nice portion of 'gamers' talk and maybe some of you learned something new today. Thanks for your time, DescipLe and have a nice evening :).\n\n[b][color=#E0FFFF]DiscipLe[/color][/b] says: \nThank you Valik, the same to you. Bye!\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 2 - Fireren[/font][/size][/color][spoiler=]\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nHello Fireren, thank you for allowing me to interview you. Would you like to make any opening statements?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nShoutout to my bro's in the Minecrafters. <3\n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nMany members recognize you from the 'Minecraft' section. Would you care to explain what 'Minecraft' is, and share a few events you've experienced while playing 'Minecraft'?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nMinecraft is a unique sandbox game where people's imaginations can run free and where friends are made, exploding green penises are killed, and magical things are built. Through my time on minecraft I've built various things, but truly what I valued most were the freindships that I gained therein. I've played on 8 HF servers to date and many more off forum. I've met a lot of people, and I would recommend this game to any and all who want to take a breather from the traditional fps or rpg and let your creativity take over.\n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nBesides 'Minecraft', what other games do you enjoy playing? What is your favorite console to play games on?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nI enjoy playing a multitude of games in a variety of genres. They range from MW2 to Starcraft 2. I used to be a dedicated MLG Gamebattles Player, until I simply did not have the time. Though I still enjoy many of these games. Having only owned an Xbox and Wii my favorite console is the Xbox 360. I find the argument of PS3 vs Xbox 360 overrated tbh, and find that there both good, and just by preference (mainly to the controller) do I choose the Xbox.\n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nRecently, Omniscient has re-opened the 'RuneScape' section. What is your opinion on this decision?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nIf I recall correctly, the section was originally closed because Jagex contacted Omni regarding the high volume of account hacking discussion and distribution on the site. The result was the total removal of the section. I think that it is great that the section was reinstated and that as long as the rules stated before are followed there should be no more issues. \n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nWhat is your favorite recent update made on Hack Forums?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nProbably the addition of the Minecrafers Group :)\n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nWhat is your opinion on 'Reputation'? Do you think it has a positive or negative effect on Hack Forums, why?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nReputation is a game. Most everyone, including myself, has at one point or another placed reputation as a priority and tried their hardest to get there's up. Whether it has a positive or negative effect on the site imo is irrelevant. In my opinion its a game; that entertains the majority of the users. Members play \"the game\" they get rep from a variety of methods but in the end it really comes down to the fact of whether you are a quality honest member or not. If you are you shouldn't even worry about rep, you will get it naturally. \n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nOut of all staff members, whom do you think is the most respectable, hard working, and overall great staff member? (Not including Admins)\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nI remember when iBF was Admin, KHR, VipVince, N2H were staff and Yin was mod. Those days I could give you a definitive answer in a heartbeat. Now, I find that the staff do there jobs and do them well, but they lay back and I really cannot give you an answer.\n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nI see you were once a 'HF Writer'. Would you care to offer some advice for current members of the HF News Team? \n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nMy experience as an HFN Writer was both enjoyable and memorable. And there is only one piece of advice that you really need, and that is to NOT procrastinate. I remember how hectic those nights were the day before the issues were released :) But if you keep track of the news daily and write drafts beforehand you won't have to deal with any of that chaos. I wish the current team the best of luck in running the news.\n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nWhat memories of 9/11 do you have? Do you think the United States handled it correctly? Please elaborate.\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nI was quite young when 9/11 happened. Old enough to realize the impact, but young enough to be naive enough to think that it would pass over. Years later I realize that the U.S. as a whole made so many mistakes. Americans collectively were already high off the belief that we had the right to \"police\" the world. I use the term \"we\" quite loosely so do not think I am being hypocritical. But back on topic with that belief came Vietnam, Kuwait (which was justified somewhat), and then Iraq/Afghanistan. I truly think that if we had instead of gone to war and gotten 14 trillion in debt, instead focused on our own country we would still be the world superpower we were 25 years ago. Had we spent more money on infrastructure, stabilizing and preventing the housing bubble, and developing more defensive strategies for dealing with Al Qaeda we would be in much better shape. Not to mention many lives, not just American, but also civilians in the Middle East would still be with us. So that is my outlook on things. Just my opinions, and everyone is welcome to there own.  \n\n[color=#E0FFFF][b]Taylor Gang[/b][/color] says: \nHave you made any close friends on Hack Forums? If so, please share their names and briefly describe your friendship.\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nGod there are so many I'll just name a few, if I miss one, don't worry I still remember you so here goes: Pink Floyd, Nade, Sir, Qwazz, Malware Boss, AuToGrApHzZz, and many many more. Ill rush through a few of them, Pink I had been good friends ever since I joined a forum that I think either he was moderating for or was starting up. Later on once I joined Minecrafters our friendship took off where it had left off back then. Nade and I had been good friends since well jeez I don't even remember anymore. Qwazz and Sir I met after being recuited into HFN :D Shout at to them. Malware Boss was a good friend I met in the White Hat Section, and I later worked with him on a start up company owned by a friend of Omni's. Lastly, AuToGrApHzZz man its been years. He was the reason I joined, I'll bet everyone reading this doesn't know him, but he's a good guy, isn't really active here anymore sadly. I now there are so many more, but if I keep going I'll make this one question longer than the whole edition :D\n\n[color=#E0FFFF]T[b]aylor Gang[/b][/color] says: \nWhat is your favorite holiday?\n\n[color=#FFFFE0][b]Fireren[/b][/color] says: \nThanksgiving, was born on it, and I have much to give thanks for.\n[/spoiler]\n\n[align=center][img]http://goo.gl/zEtV9[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=wj1Ix8yU9eE[/video][/align]\n\n[spoiler=[i]Written topics[/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Ron Paul\n--Leadership\n---Diabolic - Reverence Leader\n---Viral Dragon - Demoted Reverence Leader\n---Aero - Mod Minecraft - (http://goo.gl/F9GlK)\n---Mentors - Super Mods, a lot more power\n---Ron Paul - Runescape Mod - (http://goo.gl/hKVAQ)\n--Awards\n---Sticky Man x2 - ϟ!RespectIsEarned!ϟ (http://goo.gl/fNbMy) - http://goo.gl/2WJPX\n---Sticky Man - B3cnoc (http://goo.gl/uqTf0) - http://goo.gl/RFIh9\n---Sticky Man - Delicious (http://goo.gl/WTJjQ) - http://goo.gl/vBy28\n---Sticky Man - Cyber-Security (http://goo.gl/mqwu2) - http://goo.gl/3s0Fg\n---The Alien - Revoke (http://goo.gl/09bCt)\n---Master Donator - Revoke (http://goo.gl/09bCt)\n--Misc.\n---Welcome back Stoner - http://hackforums.net/member.php?action=profile&uid=132817\n\n[b]Shout Out Profile:[/b] [url=http://goo.gl/GtqNg]Infested Terran[/url]\n[/spoiler]",
            "subject": "[9/21/11] - HF News Misc."
        }
    ]
}