{
  "posts": [
    {
      "pid": "21201117",
      "uid": "515249",
      "dateline": "1332994271",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#98FB98][b]85th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\r\n[color=white][b]Minimum username length[/b][/color]\r\nEarlier this week [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] changed the minimum username length from three to four characters. He also deemed all 3 character usernames to be rare as members are unable to obtain them now. To see [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient's[/b][/color][/url] tweet about this update click the following link: http://goo.gl/O5G3o\r\n\n[color=white][b]Removal of Wraith[/b][/color]\r\nAfter a long run on HackForums the formerly official group \"Wraith\" has been retired as an official group due to the fact that they did not want to pay to stay on HackForums. They are however, continuing to survive on WizardForums owned by the retired admin Crow. To see the groups goodbye thread click the following link: http://goo.gl/xcyoI\r\n\n[color=white][b]Official groups confirmed[/b][/color]\r\nAfter about a week or two all free groups either paid to stay on HackForums or packed their bags and left. As mentioned above Wraith was the only group to leave HackForums which left [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] to deal with what some might consider an overflow of groups. To bring down the number of groups on HackForums [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to change the group price to $2500 and for each new group bought he will raise the price by $500. He has also stated that leadership changes now cost $250, implying that he is looking for a steady leadership within the groups. To read [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient's[/b][/color][/url] announcement thread click the following link: http://goo.gl/1a06J\r\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=63387][b][color=white]Black Shadow[/color][/b][/url] has reached 2,000 reputation points.\r\n[url=http://hackforums.net/member.php?action=profile&uid=68378][b][color=#0066FF]Canon[/color][/b][/url] was rep fucked for giving a ban evader positive reputation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=572367][b][color=#0066FF]The MammoTh[/color][/b][/url] was rep fucked.\r\n[url=http://hackforums.net/member.php?action=profile&uid=245853][b][color=#0066FF]MountainDew[/color][/b][/url] was rep fucked.\r\n[url=http://hackforums.net/member.php?action=profile&uid=535046][b][color=black]Emily[/color][/b][/url] was banned for LQP.\r\n[url=http://hackforums.net/member.php?action=profile&uid=1025169][b][color=black]Amnesia Haze[/color][/b][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=442514][b][color=black]zombiehacker[/color][/b][/url] was banned for UB3R junk abuse.\r\n[url=http://hackforums.net/member.php?action=profile&uid=492095][b][color=black]Levi[/color][/b][/url] was banned.\r\n[url=http://hackforums.net/member.php?action=profile&uid=454666][b][color=black]adampelletgun[/color][/b][/url] was banned for cross posting.\r\n[url=http://hackforums.net/member.php?action=profile&uid=940728][b][color=black]Manitar[/color][/b][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=1169208][b][color=black]King Messias[/color][/b][/url] was banned for being annoying.\r\n[url=http://hackforums.net/member.php?action=profile&uid=903914][b][color=black]ρяιη¢є[/color][/b][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=526511][b][color=black][M][/color][/b][/url] was banned for UB3R junk abuse.\r\n[url=http://hackforums.net/member.php?action=profile&uid=453509][b][color=black]Blunt[/color][/b][/url] was banned for advertising a social engineering site.\r\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=black]Diabolic[/color][/b][/url] requested to be banned while on vacation.\r\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\r\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\r\n[i][b]Hacking Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2334347]My proxy exploit invisible server coming to HF soon[/url] - [url=http://hackforums.net/member.php?action=profile&uid=63387][color=white][b]Black Shadow[/b][/color][/url] - Black Shadow has been on Hack Forums since close to the beginning, and has finally finished his longest project. He has created an exploit that will likely create mischief around the world, but it's quite an amazing accomplishment.\r\n\n[i][b]Award Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2340970]Support Feather award finally dropped.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1133490][color=#FFCC00][b]Alphonse[/b][/color][/url] - It was announced on Support Forums, one of Omniscient's other forums, that he will no longer be giving out the \"Support Feather\" on Hack Forums. \r\n\n[i][b]Kewl Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2333064]Get to know Mr Kewl [Edition 1][/url] - [url=http://hackforums.net/member.php?action=profile&uid=183072][color=#0066FF][b]Mr Kewl[/b][/color][/url] - It seems that the member \"Mr Kewl,\" is going to be explaining his entire story through several threads. It's a good read.\r\n\n[i][b]Smoking Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2341931]I'm 14 and am thinking of taking up smoking, can anyone recommend some good brands?[/url] - [url=http://hackforums.net/member.php?action=profile&uid=92059][color=white][b]Relapse™[/b][/color][/url] - This thread was originally started to see the general reactions of Hack Forums members in regards to cigarettes. It was found that generally, members disapprove of smoking cigarettes, however, many of them offered up marijuana as an alternative. \r\n \r\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Sai[/font][/size][/color][spoiler=]\r\n[b][color=#1466ff]Rhythm[/color][/b]: Hey Sai, how are you this fine evening?\r\n[b][color=#1466ff]Sai[/color][/b]: Good and yourself?\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: I'm spectacular. Care to answer a couple questions for me?\r\n[b][color=#1466ff]Sai[/color][/b]: Sure, go for it.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Alright. So obviously you're the new primary leader of the Graphic Masters, can you enlighten the community on what the situation is here?\r\n[b][color=#1466ff]Sai[/color][/b]: Well as many of you have noticed, the Graphic Masters were quite inactive and about to get shut down. I care for GM quite a lot so I decided to take ownership and kick it into high gear. My plan is to bring Graphic Master back to it's prime.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Awesome! Did you have any specific ideas in mind for this that the community can expect in the coming weeks?\r\n[b][color=#1466ff]Sai[/color][/b]: Lots and lots of activity from our members as well as tourneys. We will be hosting various different events such as the reboot of SOTW.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Great to know that the group will be getting back in touch with the rest of the forums. The tournaments I believe would be a great addition, would there be any interesting prizes attached to those?\r\n[b][color=#1466ff]Sai[/color][/b]: Mainly cash prizes but we will also be offering lessons via TeamViewer and a spot into the Graphi Masters on some tourneys.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Sounds like you've got some attractive prizes going on. So Sai, tell us a little bit about you personally. What got you interested in the Graphic Masters? What got you interested in Graphics in general?\r\n[b][color=#1466ff]Sai[/color][/b]: Well you could say I am in a family of artists, everyone in my family is proffecient in the arts. Ever since I was a child I have loved drawing everything from anime to graffiti so getting into graphics was pretty much a given.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Anime and grafitti, doesn't get more OG than that. So I see your passion has extended beyond the physical realm to the more computer oriented aspects of graphics?\r\n[b][color=#1466ff]Sai[/color][/b]: That is correct. Computer oriented graphics allows me to have more control over my work and can express my ideas much easier.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Absolutely; and hey, a little diversity never hurt anyone! So what exactly brought you to HF, of all places?\r\n[b][color=#1466ff]Sai[/color][/b]: Hmm a friend who goes by Sasori forced me to join not too long ago.\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Ah Sasori, wonderful chap. So in under a year you've joined HF, improved your graphical design abilities, and now gone to lead HF's premier graphics group. Spectacular. Is there anything you'd like to say to the community, or any shoutouts you'd like to make?\r\n[b][color=#1466ff]Sai[/color][/b]: I would like to give a shout out to my brother Kenja who makes some dope hip-hop beats, check him out.  http://soundcloud.com/kenja\r\n\n[b][color=#1466ff]Rhythm[/color][/b]: Haha word. Alright Sai, thanks for your time! I'll have to hit up ya boy Kenja for some ill beats sometime\r\n[b][color=#1466ff]Sai[/color][/b]: G yea\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Inspector Gadget[/font][/size][/color][spoiler=]\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Inspector! Thanks for taking the time out for this interview. Before we begin, would you like to give any shout outs to special members?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: Yes, I’d like to give a shout out to bugga, always have our random chats and VipShaggy who I’ve known for years even before I joined Hack Forums.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fantastic! To start us off, what were you looking to accomplish by joining Hack Forums?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: Honestly I joined Hack Forums to leech a program, I’m not sure what it was now but it was probably for a game of some sort.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I see, I must admit that the plethora of seemingly free, clean, programs caught my eye as well. I see you're active in the monetizing section, how much have you made online alone?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: I have made around $10,000 online since joining Hack Forums using private and public methods.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That’s incredible! Makes my $500 look pretty measly. If you could change one thing about Hack Forums, what would it be, and why?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: I wouldn't change anything as Omniscient knows what he is doing, Newton’s 3rd law of motion states every action has an equal and opposite reaction, any change could be a big disaster, I like Hack Forums as it is and I wouldn't change it for the world.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: You’re the first person who wouldn’t change anything at all, very interesting! When you're not on Hack Forums, what are you doing?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: When I’m not on Hack Forums I’m usually riding my motorbike or gaming on steam.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I’d love to get a motorbike, but I do frequent Steam. Mainly Garry’s Mod and GTA IV – PM me if you play either! What's one thing you hope to accomplish before you die?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: One thing I’d like to accomplish before I die is to visit America and see how different it is from the United Kingdom.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I imagine that the UK is very different, I too hope to find out one day. Who would you consider your closest friends on Hack Forums?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: I would have to say bugga is my closest friend on Hack Forums as I know I can trust her.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I think bugga is the only member I would trust with personal information. She’s been through that stuff and knows what it’s like. What's one meaningful thing you've learned from HF in your time here?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: One of the biggest things I learnt since I joined Hack Forums is that no matter how much you think you know there is always more to be learnt.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Our forum is endless! That about wraps it up for me, do you have any advice for the readers?\r\n[b][color=#1466ff]Inspector Gadget[/color][/b]: The only advice I can give to other members is accept all criticism, help others as much as you can and enjoy your stay.\r\n[/spoiler]\r\n",
      "subject": "[3/28/12] - HF News"
    },
    {
      "pid": "21201170",
      "uid": "515249",
      "dateline": "1332994429",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Magic Johnson leads group as next owners of Dodgers[/b][/color]\nBasketball pro who guided the Lakers  to 5 NBA championships recently migrated over to baseball as a leader of a group who just  agreed to pay $2 billion for the team.\n\n[color=white][b]10 Million Downloads in 3 Days[/b][/color]\nWe've all been big fans of Angry Birds and are no guests to the multiple addicting levels of joy the game brings us.  On Monday, Rovio studios released their new game, Angry Birds Space, which reached over 10 million downloads in only 3 days.  \"The closest success story I can think of is OMGPOP's Draw Something, which racked up 20 million total downloads in five weeks.\" said Peter Farago, vice president of marketing  at the mobile analytics firm Flurry.  Angry birds was introduced to the market n 2009  and since then has reached over 600 million downloads.\n\n[color=white][b]Harry Potter Novels now sold as eBooks[/b][/color]\nAfter years of holding out on the ebook market, J.K. Rowling has recently released her Harry Potter novels on the Pottermore website on Tuesday.   It has been reported that the books are available in English in U.S. and U.K. editions with the first three books priced at $7.99 and audio versions of them for only $29.99.  At the moment, the books are only available through the website but are known to be compatible with leading electronic readers such as the popular Kindle, Sony Reader, and Barnes & Noble's Nook.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[b][color=white]HeatGate[/color][/b]\n“HeatGate” is a term used by many to explain the heating of technology.  Recently, many products have been victims to “HeatGate” and are over-heating fast. The recent one is the new iPad. Unlike its predecessor the iPad 2, the new iPad heats up a lot faster and needs more power to provide energy for the new battery.  New technology now uses a lot of power, this could mean products over-heating or maybe explodes (not a huge bang) and the components fry. This also has happened to Apple 2 times with their iPhone 4.\n\n[b][color=white]Google[/color][/b]\nIt seems like every big company now is being sued for privacy matters. Google’s autocomplete search could be an invasion of privacy.  It’s not a huge ordeal in the States more than international where there are many restrictions.  A man in Tokyo is complaining that Google’s autocomplete feature is an invasion of privacy. The autocomplete feature could be a great tool implemented by Google. For me it helps with getting things quickly written. Some are also worried that Google might know too much and they are invading your privacy. \n\n[b][color=white]Facebook[/color][/b]\nOn some job applications, employers demand Facebook Emails and Passwords. Facebook is threating to take any employer to court if they keep asking for this private information. No one wants to give his or her Facebook accounts to anyone else because that is a private matter. Employers demand these because they can see if the employee is trash talking their company or making remarks towards someone or something.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]Bieber Fever[/b][/color]\nJustin Bieber's \"Boyfriend\" single was released midnight EST March 26th, 2012\n\n[color=white][b]Part of Me[/b][/color]\nSix days ago the official music video for Katy Perry's \"Part of Me\" was released.\n\n[color=white][b]Jet Breaks Up[/b][/color]\nThe Australian band Jet, best known for their 2003 anthem \"Are You Gonne Be My Girl,\" have called it quits. \n\n[color=white][b]Busy Man[/b][/color]\nMark Tremonti has projects coming up with both of his bands -- Creed and Alter Bridge -- as well as a solo album. He promises he's not getting confused. \n\n[color=white][b]Music Videos of the Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=uuwfgXD8qV8[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nWe are all afraid of the unknown. Some say \"Ignorance is bliss,\" however, in most cases, this is not true. It is time for the people of the world to become educated, and stop eating out of the palm of our leaders. It's time for us to understand the world as it really is, and find the truth. So many of us are ignorant, but it is not blissful. I mean, we always talk about the Holocaust, and how horrible genocide it. Yet you never hear about when the Americans came to the new world. Do they ever tell you how many millions of native Americans were slaughtered when we took over this land? No. Information is power, power is influence, and influence is change. Just think about that next time you willingly swallow the words in your textbooks as the real truth.",
      "subject": "*"
    },
    {
      "pid": "21201268",
      "uid": "515249",
      "dateline": "1332994742",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"What is your favorite section of the forum? Explain it please.\"\n\n[i]\"As HF has grown over time, many new sections have come out in the \nmidst of a growing community. My favorite section of all would be none, \nI have a dead tie between music, lounge and philosophy. Hacking was a \ntopic I had liked in the beginning, as I was new and all I did was want to \nlearn, but have slowly dragged out, The Lounge has many great features, \nsuch as videos to watch and learn from and be inspired. The Lounge has \nmany humorous videos, some of which can make someones day a lot brighter! \nThe philosophy is the section where I would go for a nice debate. Going up \nagainst the user Malichi is where a lot of heat comes from. A great debater \nand has raised through the ranks rather quickly. Finally, the music category. \nI always find new artists in this section including Atmosphere, Rise Against, \nPREF1X, etc. There are so many diverse regions of music on this forum now. \nThis is what makes HF so great to me, the diversity.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=839420][i]-Angel Of Ɖeath[/i][/url]\n\nThe topic for next week is \"How do you feel about custom groups?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/Glagx.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][b]Sad but true.[/b]\n[img]http://i.imgur.com/zFrTB.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3604313_460s.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=yLJa25Rx99Q[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=89623][b][color=white]Mark Webber[/color][/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=275104][b][color=white]Delicious[/color][/b][/url] have recently been promoted to leader of Techsperts.\n[url=http://hackforums.net/member.php?action=profile&uid=942724][b][color=white]Legacy.[/color][/b][/url] was promoted to leader of Respawn.\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=920387][b][color=white]Hades[/color][/b][/url] received the Cat Lover award.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/rMHjl]Rhythm[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}