{
  "posts": [
    {
      "pid": "15615492",
      "uid": "0",
      "dateline": "1315797228",
      "message": "[align=center][img]http://goo.gl/RfeSM[/img][/align]\n\nThe edition you are currently reading is the [color=#bad235][b]58th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\n[url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to post his full story about 9/11 which took him 4 hours to write at his blog [b][url=http://goo.gl/YsxgP]Vbum[/url][/b]. He said in it, \n[size=small][i]\"The Twin Towers. The World Trade Centers. They represented a great deal to me. They represented New York, a memory with my grandfather, and a deep desire to achieve. In a way the WTC inspired me to be more.\"[/i][/size].\nYou can read more of his story and share your own story and comments about it [url=http://goo.gl/pPYAr][b]here[/b][/url].\n\nThe official 9/11 memorial thread has been created. It can viewed [b][url=http://goo.gl/XD6zU]here[/url][/b]. This thread is for those who wish to share their stories or experiences of the day or for those that want to provide support or condolences.\n\nThe [b][url=http://goo.gl/y7k11]Premium Ebook Bazaar[/url][/b] section is now ready for submissions. Please read the [url=http://goo.gl/uSwNe][b]Premium Ebook Bazaar Procedures and Policies[/b][/url] help doc for complete information about the new section. The section will be moderated by [url=http://goo.gl/dTWpe][b][color=#aaaaff]Cam G[/color][/b][/url] and [url=http://goo.gl/bm9lH][b][color=#aaaaff]-BoodyE-[/color][/b][/url]. \n\nIn a continued effort to raise the quality of the marketplace and to minimize scammers, sales trashers, and ban evaders, a member must now have a reputation greater than 0 to post in the Marketplace. This does not include the Marketplace Discussions forum or its sub-forums. You can read the official announcement [url=http://goo.gl/lnGwZ][b]here[/b][/url].\n\nNow only l33ts and ub3rs can now post threads in [url=http://goo.gl/rhjZA][b]Gamertags[/b][/url] section of the Marketplace. It is also to be noted that you can't offer Gamertags in any other section of the forum including the auctions, premium, or secondary sections. This decision was taken in order to reduce the number of scammers and ban evaders. You can read the official announcement [url=http://goo.gl/GBt64][b]here[/b][/url].\n\nThe private group [color=white][b]Minecrafters[/color][/b] was created on 5th September, 2011. It is a group of HackForums' Minecraft players and enthusiasts. The group is led by [url=http://goo.gl/o6uCk][b]Dylan[/b][/url] and [url=http://goo.gl/pzHo3][b]๖ۣۜPink ๖ۣۜFloyd[/b][/url].\n\nEgypt is now country blocked from HackForums.\n\nThe option [b]Double Posting[/b] is now removed from the list of report options.\n\nThe group named [b]Dead[/b] has now been changed to [b]Closed[/b].\n\n[align=center][img]http://goo.gl/0zRhM[/img][/align]\n\nYet another member has joined those with over a thousand reputation, welcome to the top [url=http://hackforums.net/member.php?action=profile&uid=682150][color=#0066FF][b]Sтяιdєя[/b][/color][/url].\n\nIt's no joke to change your name to \"Omniscient\" for  the member [url=http://goo.gl/rMHjl][color=white][b]Rhythm[/b][/color][/url] did so, and shortly after, was repfucked. Just a word to the wise, if you're even going to try to change your name to Omniscient for a laughs, you'd best not send private messages inviting people to staff too.\n\nTo many it seems that [url=http://goo.gl/PHefi][color=#00BFFF][b]Judge Dredd[/b][/color][/url] has been repfucking everyone who neg-reps him, and revenge repping as well. As of recent, it seems he has stopped. If you look on his given reps, almost all of his negative reps are on people who have recently been repfucked. On other news, he did just pass one thousand reputation multiple time with many attempts to keep it under this milestone.\n\n[url=http://goo.gl/WtTLD][color=white][b]Tasemu[/b][/color][/url], the anime fanatic has developed the \"Otaku Handbook\" a guide for anyone wishing to learn more about anime or find a new series to follow. Be sure to check this [url=http://goo.gl/yuwpy]out[/url].\n\nWe wish to send out a special thanks today to the member [url=http://goo.gl/W9XzJ][color=white][b]Deltron[/b][/color][/url] for spending much of his time to reach undergraduate status so he can help the members of HF, and he will also be continuing his training offsite. See his congratulations thread [url=http://hackforums.net/showthread.php?tid=1698427]here[/url].\n\n[url=http://goo.gl/s6gga][color=#0066FF][b]Thoth[/b][/color][/url] has been repfucked for the fourth time. How many times this will happen is unknown, he seems to have a knack for losing all of his green apples.\n\nAnyone looking for a good laugh can just see [url=http://goo.gl/2EZHo]this thread[/url], [url=http://goo.gl/TxoJ4][color=white][b]alabama[/b][/color][/url] accidentally added everyone online to his ignore list. It seems that the staff don't care, as [url=http://goo.gl/me3ry][color=lime][b]Rusty_V[/b][/color][/url] told him it was [url=http://goo.gl/zeBlO]his problem[/url] and he needs to deal with it.\n\nNot much is known yet involving the Writers usergroup, members are still anticipating [url=http://goo.gl/q9Qcg][color=#00BFFF][b]Omniscient[/b][/color][/url]'s announcement. Just a notice to all members, please stop bothering itylernallen and Omniscient with your questions, they will all be answered in due time. (This includes threads asking about the group.)\n\n[align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nThousands gathered on Sunday Morning at New York's Ground Zero. Some stood silently while others cried, each mourning the loss of the victims of the September 11, 2001 attacks as their names were read aloud.\n\n[size=small][i]\"They were our neighbors, our friends, our wives, children and parents.\"[/i][/size], New York Mayor Michael Bloomberg said, as he led the commemoration along with President Barack Obama. The ceremony was at the site of the World Trade Center and was bustling with security personnel around the area as they continued to search for the alleged plotters of another terror strike. \nAt the ceremony, Obama and the first lady stood behind bullet-proof protection barriers. Former President George W. Bush, who was president at the time of the 9/11 attacks, read a letter by Abraham Lincoln sent to a woman who lost five sons in the Civil War.\n\n[size=small][i]\"I feel how weak and fruitless must be any word of mine which should attempt to beguile you from the grief of a loss so overwhelming. But I cannot refrain from tendering you the consolation that may be found in the thanks of the republic they died to save.\"[/i][/size]\n\nThose who lost loved ones in the attacks stepped forward to read their names. In all, 2,753 people died on two airplanes and on the ground when the planes crashed into the World Trade Center towers, causing their collapse. That total does not include the 10 hijackers on board the planes. The total number of dead in New York, Washington and Pennsylvania was 2,977 people, not including 19 hijackers.\nThe mourners at various sites observed moments of silence at specific timings.[list]\n[*][b]8:46 a.m.[/b], the time when American Airlines Flight 11 crashed into the North Tower of the World Trade Center.\n[*][b]9:03 a.m.[/b], the time when United Airlines Flight 175 struck the South Tower.\n[*][b]9:37 a.m.[/b], the moment American Airlines Flight 77 struck the Pentagon, killing 184 people.\n[*][b]9:59 a.m.[/b], the time the South Tower collapsed.\n[*][b]10:03 a.m.[/b], silence will fall on Shanksville, Pennsylvania, where passengers aboard United Airlines Flight 93 thwarted a hijacking plot and crashed the plane into the ground.[/list]\n\nThis report was possible thanks to various media websites and television news coverage. The condolences of many of our members goes out to the families affected by the 9/11 attacks. \n\nHere are a few of the stories the members of HF decided to share:\n[spoiler=]\n[b][i]Correct[/i][/b]\n[size=small][i]That day I was at school, typical day, when my mom came to pick me up early. She was worried! We went home and watched the news like usual. At this time I did live in NY. My father and 2 uncles were all NYC Firefighters so they were called. My father was on the 2nd truck there so he had to go to the top of the south tower. My two uncles were on a different truck so they went in the north tower. As we were watching the news, we heard the South Tower collapsed. At the time, we knew they were there, but not in which tower. Later that night, we got a call from his officer and my mother was crying. I asked her whats wrong and she said \"Your father is gone\" and I started crying. My father was the biggest role model to me. Then later that night we found out my uncles were in the north tower when it collapsed. About 2 weeks later we got a call from someone who worked in the south tower and they asked if we were the family of my father and we said yes and they said thank you so much. Your father saved my life and many others. I was very proud of him, and still am.[/i][/size]\n\n[b][i] O1d_2_H@Ck1n™[/i][/b]\n[size=small][i]My heart is with all the people who lost friends and family members who sadly lost there lives to the horrible and devastating events that took place on the 11th of September 2001. I myself had a friend who I used to speak to on the phone all the time etc and I used to meet him when I went to America and sadly he was working on the day that it took place. He lost his live, he was uncovered from the rubble and he was of believed to be one of the first jumpers, my heart stopped when I heard the news and this is why every single year I show my respect to the 9/11 survivors and those who died and the family's.[/i][/size]\n\n[b][i] ๖ۣۜDragScope[/i][/b]\n[size=small][i]I think I was around 6-7 years old when this occurred and all I can remember is that I was on Fifth Avenue when it happened. My only guardian who was with me at the time was my Mom. I heard an explosion and looked back towards where it came from and all I could see was swarms of people running towards it and a mist of red and green smoke. My father did work 2 blocks from the trade centers at a local tax business, which was right in the middle of the whole thing. My mother then noticed it was the trade center, and called my grandparents to meet at her house. After I was dropped by my house I looked out the window to watch the tops of the building collapse. In the building my uncle, 3 cousins, and niece were present. My uncle was a sales representative for a major company inside the trade center. My cousins were there working for a convention that was taking place for long amounts of time, and my niece worked as a Bondsman. As my mother went to find my father, she did, and they came to the house, both crying and filthy, with black smoke all over them. My mother found my father trying to look for family through the chaos of the rubble. Then I don't really know what happened next but when I woke up or last remembered, the house was quiet and silent to the touch. I walked into the living room and saw my aunt, grandparents, mother, father, and my other set of grandparents with a grim look all upon there face. I knew in my heart that something was wrong, besides the 9/11 attack. Then I can barely remember who told me but all 5 of my family members died. My uncle was in the first tower at the 4th floor if I remember correctly, my cousins were all in like the 27th floor where the the building collapsed, and my niece was in the 2nd building on the 16th floor.\nWe were all devastated, or they were, I didn't really get it at the time. Now I do, and wish I could have spent more time with them.[/i][/size]\n[/spoiler]\n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n\n[align=center][img]http://gfxf.net/di-KJR5.png[/img][/align]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - alabama[/font][/size][/color][spoiler=]\n [b][color=white]Cobalt+: [/color][/b]Hey, alabama. How are you doing today?\n[b][color=white]alabama: [/color][/b]Hey, I'm doing pretty good. Watching the Cowboy's and Jet's game. \n\n[b][color=white]Cobalt+: [/color][/b] So, you're into sports? Do you play any?\n[b][color=white]alabama: [/color][/b] Nope, I don't play any currently. I used to play football but then I switched to a school that didn't offer any sports.\n\n[b][color=white]Cobalt+: [/color][/b] That doesn't seem like a very fun school. Do you do good in school?\n[b][color=white]alabama: [/color][/b] Well, last year I was going through some personal problems, and I dropped out. I just started back this year going to an alternative school. It copes with me very well.\n\n[b][color=white]Cobalt+: [/color][/b]Well, I hope those problems are resolved. Do you think your time on HF effects your school work?\n[b][color=white]alabama: [/color][/b]Definitely not. I put real life responsibilities before any online activity. And yes, everything is getting better. =)\n\n[b][color=white]Cobalt+: [/color][/b]Seems like you know your common sense. When you joined HF, what kept you here?\n[b][color=white]alabama: [/color][/b]When I first joined, I believe I found it through googling msn spammer or something. I didn't actually start becoming an active poster until about May or so. I registered on January 1st. \nAt first, I was confused, the forum was huge, there were many members, and overall I was lost. I started making a few friends and eventually found my way around. \n\n[b][color=white]Cobalt+: [/color][/b]My journey was the same way. It seems you've kept your name as alabama for the most part. Any reason behind this?\n[b][color=white]alabama: [/color][/b]Hmm, I've thought about it, and I can't come down to the origin of where I got my name. I started using it as an online alias in about 2009.\n\n[b][color=white]Cobalt+: [/color][/b]Hmm, I see. Well, I have to wrap this interview up. Any shoutouts or comments you would like to make?\n[b][color=white]alabama: [/color][/b] I'd like to make a shoutout to ScripT, Sync, and Rhythm. They've been good friends for awhile now. Is it alright if I say a joke?\n\n[b][color=white]Cobalt+: [/color][/b] Sure, go ahead.\n[b][color=white]alabama: [/color][/b]I was going to tell you a gay joke, butt fuck it.\n\n[b][color=white]Cobalt+: [/color][/b]Haha, that was a good one. Well, you have a good day.\n[b][color=white]alabama: [/color][/b]Take care.\n\n[/spoiler]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n\n[url=http://goo.gl/7M6h9][img]http://goo.gl/bT3g8[/img][/url]\n\n[align=right][url=http://goo.gl/3cDOZ][img]http://goo.gl/8r0pM[/img][/url][/align]\n\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]",
      "subject": "[9/11/11] - HF News"
    }
  ]
}