{
  "posts": [
    {
      "pid": "16017753",
      "uid": "0",
      "dateline": "1317009034",
      "message": "[align=center][img]http://i.imgur.com/iMFrx.png[/img][/align]\n\nThe edition you are currently reading is the [color=#00ffba][b]60th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\nFirst and for most, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] has announced that the new Vouch system is finally going to be activated, coupled with the fact all reputation will be completely reset and that the administrators reputation can no longer be seen. This is a big step in the improvement of Hack Forums. If you are worried about your current reputations, then you might be interested to know that he is considering a backup of all of the old reputations that you currently have, so that they can be seen after reputation is reset.. Due to this though, there will be a lot more scammers roaming about in the market place, so watch your back out there. If you think you can get way with posting low quality content or abusing reputation,  you will be banned [i]and[/i] repfucked.  You can read about this [url=http://hackforums.net/showthread.php?tid=1746031]here[/url].\n\nThe [color=white][b]Mentors [/b][/color]usergroup now moderates more subforums. So expect much more tidy subforums in the future. You can read more about this [url=http://hackforums.net/showthread.php?tid=1749008]here[/url].\n\nYou can no longer stalk [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] or see what he is doing, as he has set it such that you can no longer see what any of the administrators are doing. If you visit any of the administrators profiles, you will only see \"Unknown location\" as their current activity. \n\nNon-upgraded members can no longer use images in their signatures! You will need to upgrade to Leet or Ub3r if you want to be able to use them in your signature.  You can read about this [url=http://hackforums.net/showthread.php?tid=1739748]here[/url].\n\nTiny-Pic, the image host that deletes all images that are linked from here, has finally been censored. This comes after [url=http://hackforums.net/member.php?action=profile&uid=126704][b][color=white]Rhythm[/color][/b][/url] [url=http://hackforums.net/showthread.php?tid=1751367&pid=15945573]pointed out[/url] that uppit was censored, but the notorious image host was not.   \n\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] has warned members that if you try to get your thread more attention in the Suggestions and Idea's section by sending him a Private message you will account will be repfucked, banned and  \"ripped open like a can of tuna\". You can read the thread [url=http://hackforums.net/showthread.php?tid=1738954]here[/url].\n\n[align=center][img]http://goo.gl/0zRhM[/img][/align]\n\nUser News is being moved to Misc. editions. However in order to keep the amount of sections equal, we are adding a new section—Opinion. This new section will be where users can send in their thoughts on the topic of the particular week. This section will help make HF News more interactive.\n\nFor example, if the topic was \"Are smartphones taking over over technologies? With their ability to access the internet, process documents, and listen to music, could they make computers unneeded?\", then the responses would be somewhat like this:\n\n[i]\"I think that there are some things that mobile computing just can't do. For example, \nhard core video editing cannot be done on a phone, or even a tablet. Unless processing\npower advances exponentially within the next few years, smartphones are definitely not\ngoing to make other computer sources obsolete.\"\n[url=http://goo.gl/kQNfV]-Cobalt+[/url][/i]\n\n[align=right][i]\"I personally have a Droid Incredible 2, and am partially agreeing with this\ntopic. I find myself using the computer more sparingly, and only when I need a solid keyboard\nfor typing. With the latest smartphones, you really can do just about anything, facebook,\ninternet, twitter, even access your computer, we're really losing the need for laptops and\ndesktops more and more each day.\"\n[url=http://goo.gl/4W9dI]-Sir[/url][/i][/align]\n\nThe topic for next week is \"Should the world focus on alternative energy and preserving life, or exploring space and colonizing planets?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/AepVS]Sir[/url].\n\n[align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nIran and the U.S. have long since had conflicts, in a variety of different incidents. Remember the incident in 1979, in which fifty two American hostages were held for more than a year? More information can be found about this incident by clicking [url=http://en.wikipedia.org/wiki/Iran_hostage_crisis][color=#FEE5AC]here[/color][/url]. Aside from working at a American Embassy in a country so unstable (Iran), hiking too, can become a danger. As proof of this, two American citizens have been serving a sentence of eight years for alleged espionage and illegal entry. Shane Bauer and Joshua Fattal have been detained in a prison located in Iran for more than two years now. Despite the lack of proof and pleas from celebrities in the United States as well as President Obama, the hikers were detained for quite some time. Swiss Officials have helped by representing United States interests in Iran as well. \n\nA group of Muslim American's and Christian leaders returned to Washington on September 19, 2011, after being invited by President Mahmoud Ahmadineajad to visit Iran.\n\n\"Our goal has been to foster interfaith ties, build a system of understanding and ask the Iranian leadership to show compassion and mercy for the American hikers by allowing them to come home,\" said Nihad Awad, a national executive director of the Council on American Islamic Relations (CAIR). You can read more about the 'Council on American Islamic Relations' [url=http://en.wikipedia.org/wiki/Council_on_American-Islamic_Relations][color=#FEE5AC]here[/color][/url]. The American delegation has appealed for the release of Shane Bauer and Josh Fattal with a series of personal letters addressed to Ahmadinejad, the President of Iran. Top government clerical officials have indicated that the hikers will be released, however tensions are still mounting. \n\nThe past relationship between the United States and Iran has put a strain on the appeal process and there is little that the American Government can do at this point. To shine some light on the relationship between the U.S. and Iran, you can read this short article on the past U.S. Iran relations by clicking [url=http://usforeignpolicy.about.com/od/countryprofi3/p/usiranprofile.htm][color=#FEE5AC]here[/color][/url]. Time will only tell if these two alleged spies will be released, after being detained for more than two years. It's safe to say that their release from prison is widely anticipated. The change of events regarding these two Americans case has captured national attention, perhaps even worldwide attention. Many thanks to the Swiss Government who has aided in resolving this issue. \n\nThe two hikers who were captured in Iran more than two years ago, and have finally been released as of September 21, 2011. One million dollars bail was paid in order to release these hikers, although Iranian Officials still maintain that these men are guilty of the charges stated above. The Arabian State of Oman can be credited for paying their bail. This isn't the first time that the state of Oman (who has good relations with the U.S.) got America out of a bind. They also paid bail for Sarah Shourd last year, another American who was being charged for the very same crimes. You can read more about Oman's involvement in this ordeal [url=http://www.naharnet.com/stories/en/15511-oman-pays-ransom-to-iran-to-free-u-s-hikers][color=#FEE5AC]here[/color][/url]. A convoy of Swiss Embassy vehicles arrived at the jail and gathered the men who were then taken to an airport for a flight headed to Oman. Whether these men were indeed spies or not is debatable, and has been denied repeatedly by the United States government. More details concerning their release can be found [url=http://online.wsj.com/article/APf98b543a6e384902a7718fa82f48eb21.html][color=#FEE5AC]here[/color][/url]. \n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n[align=center][img]http://img856.imageshack.us/img856/5931/tagwalln.png[/img][/align]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[align=center][youtube]http://www.youtube.com/watch?v=0YEzpOntomA[/youtube][/align]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n\n[url=http://goo.gl/7M6h9][img]http://goo.gl/bT3g8[/img][/url]\n\n[align=right][url=http://goo.gl/XNOmD][img]http://goo.gl/2frWD[/img][/url][/align]\n\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]",
      "subject": "[9/25/11] - HF News"
    }
  ]
}