{
  "posts": [
    {
      "pid": "23366362",
      "uid": "515249",
      "dateline": "1339294303",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]95th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Ub3r Junk disabled[/b][/color]\nDue to an increase in junk abuse [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided to take action and create a plugin that will allow ub3rs only one thread to be junked per 24 hours. While the plugin is being developed ub3rs will not have the ability to junk threads in any section. To read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread click the following link: http://goo.gl/EgUhn\n\n[color=white][b]Good Will Monday[/b][/color]\nGood Will Monday is an official HF holiday invented by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] in 2010 intended to start off the summer with a positive attitude. The holiday comes once per year on the first Monday of June, on that day members are asked to give out 5 positive reputations to deserving members and not to give out any negatives unless related to a scam report. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s holiday thread click the following link: http://goo.gl/42Dsi\n\n[color=white][b]Minor downtime[/b][/color]\nEarlier this week [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] gave us the heads up that he will be doing some SQL maintenance for the next few days which might result in minimal downtime. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet on this click the following link: http://goo.gl/eNQOh\n\n[color=white][b]Section name change[/b][/color]\nAlthough it is a small change many members have been noticing that the \"Tinychat and other chat invites\" section has been renamed to \"Tinychat, Join.me, Skype and Other Chat Invites\". This was most likely due to a user request however that cannot be confirmed. To view the Tinychat, Join.me, Skype and Other Chat Invites section click the following link: http://goo.gl/SLe4U\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[b]User News[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=111287][b]xvisceral[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=651051][b]Wolves[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=183072][b]Mr Kewl[/b][/url], and [url=http://hackforums.net/reputation.php?uid=323740][b]Positive[/b][/url] reached 1000 reputation points! Congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=33279][b]iBruteforce[/b][/url], an ex-administrator, returned today and actually made a few posts. You can welcome him back [url=http://hackforums.net/showthread.php?tid=2550572]here[/url].\n\n[b]Repfucks[/b]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=989666][color=black][b]Gpizzle[/b][/color][/url] was repfucked.\n[/list]\n[b]Bans[/b]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][color=black][b]Chief.[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=274985][color=black][b]Black Mesa[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=194707][color=black][b]Draggin[/b][/color][/url] for complaining about a repfuck.\n[*][url=http://hackforums.net/member.php?action=profile&uid=304295][color=black][b]Spreads Like Herpes[/b][/color][/url] was banned after his account was stolen... again.\n[*][url=http://hackforums.net/member.php?action=profile&uid=679685][color=black][b]Elf‌[/b][/color][/url] took a vacation so that he could watch more MLP.\n[*][url=http://hackforums.net/member.php?action=profile&uid=989666][color=black][b]Gpizzle[/b][/color][/url] was banned for helping ban evaders.\n[*][url=http://hackforums.net/member.php?action=profile&uid=878768][color=black][b]SomeWhiteGuy[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1059931][color=black][b]Pepsi[/b][/color][/url] had his account closed for reversing a payment.\n[*][url=http://hackforums.net/member.php?action=profile&uid=817877][color=black][b]Guess Who Is Back[/b][/color][/url] had his account closed.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1236861][color=black][b]Askaa[/b][/color][/url] was banned for threatening other members.\n[*][url=http://hackforums.net/member.php?action=profile&uid=507529][color=black][b]Green Bay[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=646916][color=black][b]Genuine[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=869826][color=black][b]Suhinder[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=260570][color=black][b]Fetus Flipper[/b][/color][/url] was banned for trying to steal from McDonald's.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=298746][color=#0066FF][b]Grammar Rays[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2557010][b]Nothing Actually Exists[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2555644][b]Some Junk food ingredients should be banned.[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=246178][color=#FFD700][b]67-bit[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2493556][b]Who are you voting for in the up-coming elections?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][b]malichi[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2550388][b]We are made of the Big Bang![/b][/url]\n \n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=646916]Geninue[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Thanks for participating in the 95th edition of HF News, any shout outs to other members before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: Thanks for the interview. Shout outs to [url=http://hackforums.net/member.php?action=profile&uid=434812]Bay[/url], [url=http://hackforums.net/member.php?action=profile&uid=588904]Conception[/url], and of course all of my group members.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: I'm sure they will love the shout outs man. So a little question here, You've been apart of HackForums for awhile now right ?  \n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: Yep, I've been a member for over a year now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Oh, I really thought it would of been longer. So what did you first plan when you joined HackForums ? Did you think you would ever join Staff ?\n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: When I first joined, I was more into booters & spreading my server everywhere. I stuck with doing that for the first few months on HF. Then took a break for about 2-3 months. Once I logged in from my inactivity I realized that spreading servers and infecting other systems just wasn't my thing anymore. I prefer to help people instead of betraying them so I decided to move myself from a black hat to more of a white hat. Ever since then I've been committing my time to another forum to learn more about malware removal.\n\nMy intentions were never pointed for Staff. Hackforums was just a hobby that I became addicted to. Throughout the months I was active, I started reviewing the rules and stopped ignoring threads asking for help. I decided to spend 15minutes of my time helping each member individuality until they were satisfied.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Very interesting to read man, I intended doing that but then turned into a white hat myself. Helping people out is the best way to go and not trying to infect people, it's fun to start with but then get's boring. So are you enjoying the Staff Probation ? \n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: It does get boring in the long run, one of the many reasons I stopped spreading my server throughout the internet. Being Staff has its ups and downs, but with the help of other Staff members, I think it turned out quite well. I enjoy having no restrictions on a forum I've been apart of for so long.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: I agree that's why I stopped doing it too. So do you think people have changed their opinion on you since you've been Staff ? \n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: That's a good question. Before I was made Mentor, I'm pretty sure I was respected but not well-known like I'm today. I get PMs daily from members that I've never seen before, telling me I'm doing a good. I appreciate the feedback because if it wasn't for them, I would probably be making mistakes here and there. Overall, I don't think opinions changed about me and if they did, I didn't notice. ;)\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well I think I spoke to you way back before you was in Mentor and Staff :). Now I have a question from Bay, he asked me this: What were your worst and best experiences on HF?\n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: I remember PMing you about Techsperts. It was when TRRS owned it because I asked you when the new members are being added. Damn, that was so long ago.\n\nThe worst experience was when the Black Knights were dismantled. I remember when Amp™ put a notice in our sub forum that the group was going to be removed in 48 hours. Although I didn't believe him until Omni created a new thread and stuck it for us to see. I PMed Omni about 10 times trying to revive the group, but it just didn't work. Within those two days, myself and a few friends revived old threads, created new ones, and even updated the handbook with new information in hopes for Omni to change his mind, but it still didn't work out. The day BK was officially removed, I posted a thread which can be read [url=http://hackforums.net/showthread.php?tid=2118305]here.[/url] I still have no regrets of what I did, I felt it was the right thing to do.\n\nThe best time on HF was probably joining the Red Lions. That is what kept me active. Without them, I wouldn't be to where I stand at today. So I want to personally thank them for helping me. RL had changed my experience on HF since I was first recruited into the group. I remember applying about 2-3 times before I was accepted. Once I laid my eyes on the sub forum, I was amazed at how good the communication was, and how organized it is. I believe I joined the group in October of 2011 & was promoted co-Leader February 24th of 2012. I also want to thank Glassy for giving me the opportunity of being co-leader.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Yeah we pm'd quite a lot back then lol.\n\nDamn I have to admit people reading this are going to be amazed because I surely was man, I loved it, wonderful answer. So before we finish up here because I don't want to keep you too long since you're a busy guy ;) Where do you see HackForums in about 3 years ? and If you got made admin would you accept it or stay Staff ?\n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: I'm sure members will have different opinions about the whole situation, but it's a good read for people who are bored. I enjoy answering question, hence the reason I made my \"Ask Genuine a Question\" thread. ;)\n\nIn 3 years, I see myself on HF still. Hopefully in the same position I'm in now, which is Staff. If I was ever invited to become an administrator, depending on the position, I would accept it. 😉\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Right man, I know your a busy guy... I have to admit was a pleasure interviewing you man. Got anything else you would like to add before we finish up ?\n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url]: Thanks man, I had fun doing this interview. It feels good to get away sometimes. Before I go, I just want to give members advice.\n\nThroughout my time spent on HF, I've been in positions I didn't think were possible to get out of. I just want everyone reading this to know nothing is impossible to accomplish. If you focus on your goals, you'll be sure to succeed in no time. It may seem like it takes forever, but when you do accomplish your goals, you will realize how fast it came to you.\n\n[/spoiler]",
      "subject": "[6/9/12] - HF News"
    },
    {
      "pid": "23366422",
      "uid": "515249",
      "dateline": "1339294433",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=White][b]Battlefield 3 Close Quarters:[/b][/color]\nBattlefield 3 close quarters was released this week. It is the second expansions pack released for the very popular battlefield 3 game. It is only available for PlayStation 3 platinum users. It will be released for the Xbox on June 12th, it will be released for all PlayStation users on June 19th and it will be released for PC on 26th. In this new expansion pack you are mainly battling indoors. Also with this new expansion pack there is a new feature called HD destruction. In HD destruction it you can destruct everything in your environment. In this new expansion pack you can use ten new weapons, four maps and the HD destruction mode. Also in this expansion pack you can play ten new battlefield 3 missions.\n\n[color=White][b]Lego Batman 2 DC Super Heroes:[/b][/color]\nLego Batman 2 DC Super Heroes will be released on June 19th. It is the sequel to Lego Batman and it uses an open world concept. But this game will not just feature Batman it will also feature some of the DC comics super heroes. Like Superman, the green lantern and wonder women and many more superheroes. It will also feature many gadgets from each of the super heroes and the super villains. There will be over 70 characters that you can play in this new Lego Batman game. This game will also feature a new cooperative mode that you play. In cooperative mode you can use a split screen mode also.\n\n[color=White][b]E3 2012 Expo:[/b][/color]\nThe E3 2012 expo was June 5th to June 7th and it was in Los Angeles California. The E3 expo is a very popular expo for video game company's to release previews of their new products. At this years expo there was many very popular upcoming games previewed including halo 4 and call of duty black ops 2. Also at the expo Nintendo released more information on the upcoming Wii U and new games for the Wii U which will be released around the holidays this year. Also the biggest thing released at this years E3 Expo was Microsoft revealed more information on its new smart glass which will be coming out soon. Microsoft's smart glass will be a brand new way to play games on your Xbox with your mobile device.\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=White][b]Transit of Venus:[/b][/color]\nThe transit of Venus occurs when Venus crosses in front of the sun. From earth the transit of Venus appears to look like a small black dot on the face of the sun. It was visible on June 5th and 6th and It was visible in most of Asia, North America and Europe. The last transit of Venus occurred on June 8th 2004 and the next transit of Venus is not set to occur until December 10th and 11th of 2117. Only four transits of Venus occur every 243 years.\n\n[color=White][b]Queens diamond jubilee:[/b][/color]\nThis week was Queen Elizabeth's diamond jubilee. The Queen's jubilee celebration lasted four days including royal air force fly bys, concerts and parades. Over one million people lined the streets at this four day event. Celebrating the Queen's 60th anniversary of being the ruling monarch of the United Kingdom.  She is the second longest ruling monarch of the United Kingdom. Only behind queen Victoria who ruled for over 63 years. They are the only two ruling monarchs of the United Kingdom to make it to their diamond jubilee. A diamond jubilee is usually to celebrate a 75th  anniversary. But with Queen Victoria's rule. But the United Kingdom changed it to 60 years on June 22nd 1897. At Queen Elizabeth's diamond jubilee she had many of the worlds top artists preform. Including Paul McCartney, Elton John, Will.I.Am and Jessie J. She also got a message from President Obama congratulating her on making this great achievement.\n\n[color=White][b]Whitewater-Baldy wildfire:[/b][/color]\nThis wildfire in burning in wildfire was started by lighting and is in the southwest region of New Mexico and started on may seventh. The wildfire is now mostly burning in the Gila national forest and has burned over 243,000 acres just in that national forest. This is currently largest wildfire in New Mexico history. The firefighters currently only have about 20 percent of the wildfire contained. The fire has already burned at least 260,000 acres and is continuing to grow at a fast pace. The Firefighters are now using a technique called a burnout. To try and stop the advance of this wildfire.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]LinkedIn passwords leaked:[/b][/color]\nThis week about 6.5 million LinkedIn passwords were dumped. Most of the 6.5 million passwords were still hashed. The passwords were encrypted in SHA-1. About half of the 6.5 million passwords have already been un hashed. LinkedIn only had the passwords encrypted with SHA-1 with no salt. So un hashing the passwords are pretty easy. LinkedIn also disabled the passwords of the users they believe at a large risk. And have sent them details on recovering their account. These passwords were stolen by a team of hackers and were posted on a Russian forum June 6th. LinkedIn has confirmed that the breach is real and is recommending all LinkedIn members to change their passwords as soon as possible. LinkedIn also believes that the hackers have a list of all the emails to the 6.5 million accounts. LinkedIn is working on adding additional security to prevent a large breach like this form happening again.\n\n[color=white][b]Prepaid iPhones:[/b][/color]\nThis week Leap Wireless announced that it will start selling a prepaid iPhone in June 22nd.The iPhone 4 will cost 399$ and the iPhone 4s will cost 499$. An unlimited plan at leap wireless will cost 55$ And it is the first wireless provider to offer the iPhone as a prepaid phone. This week it has also been announced that the iPhone 4 and the iPhone 4s are coming to virgin mobile. The iPhone 4 will cost 549$ and the iPhone 4s will cost 649$. This will be the second. IPhone available to prepaid customers. Although the iPhones are more expansive on virgin mobile then leap wireless the plans are cheaper. The virgin mobile plans start at 30$ a month and the unlimited plan for the iPhone is 50$ a month. You can also use your iPhone as a mobile hotspot for 15$ extra a month. The virgin mobile iPhones will be on sale starting June 29th.\n\n[color=white][b]Facebook app center:[/b][/color]\nThis week Facebook has added a new feature called the app center. The app center gives each user a personalized experience. The app center recommends different games for you based on what you and your friends have played in the passed. The app center currently has about 600 apps including Pinterest, words with friends and Nike + gps and draw something. The app center sends you to the place to download the app like iTunes or the android market.The app center is available on the Facebook website, android devices and apple devices. You can send apps to your mobile device from your computer. Using a new feature called send to mobile Currently only about six to eight percent of American users have access to the app center. All the American Facebook users will have access to the app center in the next few weeks.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Lil Phat Shot Dead in Atlanta[/b][/color]\nLil Phat, a 19-year-old rapper from Louisiana plus a member of the Trill Entertainment crew, was shot and killed outside a hospital in Atlanta. Lil Phat was found in a vehicle parked on the second floor of the parking center at Northside Hospital in Sandy Springs with multiple gunshot wounds. After being rushed to the emergency room, he was pronounced dead shortly. The police are currently looking for two suspects, black males, who were seen fleeing the scene of the crime. There is no known motive for the shooting.\n\n[color=white][b]Rihanna Addresses Reports About Canceled UK Appearance[/b][/color]\nAfter she canceled a planned trip to the UK this week, the British press assumed that Rihanna is burning herself out partying. [i]The Sun[/i] reported that Rihanna pulled out of a scheduled appearance on the show [i]Sky Living[/i] at the last minute because of a \"sickness.\" Responding to the article on Twitter, however, Rihanna said she was not sick and had decided to delay the UK trip in order to spend time with family.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=5FlQSQuv_mg&feature=g-music[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=-ieJtn73e1w[/video]\n[size=xx-small]Song made by users: [url=http://hackforums.net/member.php?action=profile&uid=406243]WiFi.[/url], [url=http://hackforums.net/member.php?action=profile&uid=1186951]Germans[/url], and [url=http://hackforums.net/member.php?action=profile&uid=181208]Darkwin[/url][/size]\n\n[video=youtube]http://www.youtube.com/watch?v=2kWZvbRPscI[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=EMQLJ9vypB8&feature=plcp[/video]\n[size=xx-small]Mix made by the user: [url=http://hackforums.net/member.php?action=profile&uid=589027]Stay Plural[/url][/size]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nAhh, here is the time of year where things change. It's the beginning of true summer, people are graduating or getting out of school, vacations start to pop up around the clock. While it is a time of relaxation and peaceful change, don't be fooled into thinking it's a time to let your guard down. Shit still happens in the calm of a storm. Far too often, people just decide to drop their responsibilities during this time, thinking \"Ehh, it's summer, time to relax.\" Yet we should all continue to focus on doing good for those around us and helping everyone out, including ourselves. Try to accomplish some things over this break, do something that is worth your time.\n\n[color=White][b]FYI:[/b][/color]\nI will be on the lookout for people to take over Tech News and Gaming News.\nDo not message me about it.\n-If you are interested in writing Tech News, put a line and then \"☒\"\n-If you are interested in writing Gaming News, put a line and then \"✇\"\n-If you are interested in being an interviewer, put a line and then \"؟\"\n--Or all\n\nDo not message me, I will be looking through the posts to find people I think would do good.\nYou must be Ub3r. Omni's rule, not mine. I apologize.",
      "subject": "*"
    },
    {
      "pid": "23366460",
      "uid": "515249",
      "dateline": "1339294537",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"Which award do you think is the most important one? Why?\"\n\n[i]\"I think that the \"Member of the Month\" award is the most important award. It \nsymbolizes that the user has contributed a lot to the forums and is well respected \nby other members. It really proves that they are an important member of the \ncommunity as well.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=931610][i]-Hello Friends[/i][/url]\n\n[align=right][i]\"Well from day 1 I wanted to have a load of awards, the awards I \nhave all mean something to me, as in the is a good reason why I got them, but I \nwould say the Judges new award looks nice, if you bought that, I don't think you \nwould ever get a rep fuck lol, but thats just my opinion.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=63387][i]-Black Shadow[/i][/url][/align]\n\n[i]\"Well, due to the fact most of the protector awards are given for reporting \nvulnerabilities in HF, when people get the award, it shows that there are people \nhelping HF stay secure. With HF secure, it creates a better experience. So the \naward is important as it shows HF has people that care about it and are helping \nprotect it.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=790289][i]-Phayzon[/i][/url]\n\n[align=right][i]\"My opinion is, Business man. It show's that you are a respected \nmember, and you know how to pretty much sell anything, It show's leadership.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=651474][i]-Cyan[/i][/url][/align]\n\n[i]\"I am sure many people will agree with me on this, but the most important award \nis definitely the \"Diamond\" award. Why this? Well because it is given to the most \nvalued individuals in our community who have contributed the most to our members. \nWhether it deals with currency, computer programs, or simply knowledge in general, \nbeing chosen to receive this award is one hell of an honor.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1235445][i]-Кristian[/i][/url]\n\n[align=right][i]\"The most important award is Cat Lover, hands down. Cats are majestic \ncreatures, and need to be nurtured as such. To be a cat lover is equivilant to being a \nGod, and cats lovers rule these forums. You can argue and say whatever you want, \nbut your point is irrelevant unless you mention cats.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][i]-Phytrix[/i][/url](Redditor)[/align]\n\nThe topic for next week is \"What do you think of the new automated Ub3r system?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ibtXo7Gsz1Fwxa.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://b4c0n.com/i/70ceb.png[/img][/spoiler]\n[spoiler=][img]http://b4c0n.com/i/b841b.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=EiE-5NJvyF0[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#0066FF][b]630[/b][/color][/url] got the pizza award for making a [url=http://hackforums.net/showthread.php?tid=2544989]thread[/url] on how to make pizza.\n[url=http://hackforums.net/member.php?action=profile&uid=797403][color=#0066FF][b]630[/b][/color][/url] also got the Master Donator award and the Brony award right after, setting the record straight on his sexuality once and for all.\n[url=http://hackforums.net/member.php?action=profile&uid=725160][b]McFlurry[/b][/url] got the Master Donator and Ninja awards. Even Omni didn't see that one coming.\n[url=http://hackforums.net/member.php?action=profile&uid=1125749][b]Walking Paradox[/b][/url] got the Gamer award.\n[url=http://hackforums.net/member.php?action=profile&uid=805825][b]- Sam -[/b][/url] is the first member to receive the Gavel of Dredd award. Strangely, its for League of Legends rather than abiding by the law.\n[url=http://hackforums.net/member.php?action=profile&uid=600771][b]Αnonymous[/b][/url] got the Frog award. A related ancestor perhaps?\n\n[b]Group Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=731778][b]Lemonade[/b][/url] is now a group leader of the Reviewers.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[*][url=http://goo.gl/eswtU]SoulZeh[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}