{
  "posts": [
    {
      "pid": "7195925",
      "uid": "136025",
      "dateline": "1287805036",
      "message": "[align=center][IMG]http://i52.tinypic.com/28r1ux.jpg[/IMG][/align]\r\n\r\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 20th FULL edition. It is for the dates of 10/15/2010 to 10/22/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\r\n[align=center][IMG]http://i54.tinypic.com/qstieq.png[/IMG][/align]\r\nThis week on Hack Forums has been quite a long week. There's been quite a bit of confusion, debate and speculation on things coming up in the near future.\r\n\r\n[url=http://hackforums.net/member.php?action=profile&uid=176679]Solidify[/url] was recently promoted to Moderator of The Lounge. Although, with some issues and some strings attached. Omniscient has claimed that this would be a punishment rather than a desired promotion. It has come to our attention in under 24 hours that this is true. Solidify receives all reported posts in The Lounge in his private message box. It is estimated that he receives over 400 private messages on a daily basis. We wish luck to Solidify in managing The Lounge, it must be an extremely tough position.\r\n\r\n[color=#1E90FF][b]You can read the post of Solidify's promotion [url=http://hackforums.net/showthread.php?tid=734566&pid=7176904#pid7176904]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nThere has been an update to the Help Documents with a new one being added, titled \"When to Contact Staff\". Accompanying it is a list of members that are currently on the Forum Team as well as as past Staff members of Hack Forums.\r\n\r\nWhen to Contact Staff - [color=#1E90FF][b]You can read this [url=http://hackforums.net/misc.php?action=help&hid=27]here[/url].[/b][/color]\r\nWho is on staff - [color=#1E90FF][b]You can read this [url=http://hackforums.net/misc.php?action=help&hid=26]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nOver the past few days, it has become apparent that Staff members and Administrators have been 'cracking' down on low quality posting in The Lounge. Many members have been limited and banned due to trolling, spamming and flaming in their Lounge posts. \r\n\r\nWe would to recommend you to take the time to read the [url=http://hackforums.net/misc.php?action=help]HF Help Documents[/url] section, it could possibly save you from a punishment.\r\n\r\n[align=center][IMG]http://i54.tinypic.com/30rmg0j.png[/IMG][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=42221]tester[/url], Omniscient's test account has been added as a moderator of The Lounge. Most likely Omniscient is testing a new plug in or modification to suit the needs of The Lounge and it's Moderators.\r\n\r\n[align=center][IMG]http://i51.tinypic.com/1zd6eja.png[/IMG][/align]\r\nThere has been quite a lot of active discussion happening on the new Moderator Solidify. Many members have conflicting opinion and are freely stating what they believe. We would like to remind members to keep their opinions to themselves if they are offensive or break any Hack Forums rules.\r\n\r\n[color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=759241]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nOmniscient recently has verified that Mentors will be implemented into Hack Forums. The implementation of mentors will relieve some stress from Staff and allow them to have some free time of their own on Hack Forums.\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nHF News is becoming more interactive for the members and is allowing peoples contributions to be featured in HF Misc. Edition. \r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=752356]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i51.tinypic.com/2w4f95h.png[/IMG][/align]\r\nThis week, we got an interview with Mute!\r\n\r\n[color=#1E90FF][b]1.[/b][/color] When did you join Hack Forums and what were your intentions?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]October 2009, Sparky sent me some thread about DDosing on xbox live and I couldn't read it unless I was a member, so I signed up. I wanted to cheat in halo basically. [/i]\r\n\r\n[color=#1E90FF][b]2.[/b][/color] When you joined Hack Forums what were your initial thoughts? \r\n[color=#1E90FF][b]Mute:[/b][/color] [i]That everyone here was on the most wanted list on the FBI for hacking. [/i]\r\n\r\n[color=#1E90FF][b]3.[/b][/color] When you joined, where were you most active and why?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]Can't really remember anywhere specific.. Just the beginner hacking section, asking questions and stuff. [/i]\r\n\r\n[color=#1E90FF][b]4.[/b][/color] Did the Marketplace ever entice you to participate in trades or no?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]Yes, actually I did a lot of business with trading RSauths and things like that. (Actually, I think you were one of the first members I ever spoke with on MSN here. You were selling auths.) [/i]\r\n\r\n[color=#1E90FF][b]5.[/b][/color] When did you upgrade to L33T? Did you buy it or did someone else buy it for you?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]I can't remember when.. probably January. I earned the money myself, but my paypal wasn't verified so I had the money sent to Sparky and he bought it from there. [/i]\r\n\r\n[color=#1E90FF][b]6.[/b][/color] When you were L33T, what were your main goals on Hack Forums?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]I wanted to be known amongst members. [/i]\r\n\r\n[color=#1E90FF][b]7.[/b][/color] Do you have any comment on the quality of Hack Forums and it's members?\r\n[color=#1E90FF][b]Mute:[/b][/color]  [i]Not really. It's just the same old same old with these guys. [/i]\r\n\r\n[color=#1E90FF][b]8.[/b][/color] When you got accepted in to the Reviewers, how did you feel and react?\r\n[color=#1E90FF][b]Mute:[/b][/color]  [i]Actually, I was a bit surprised. I thought everyone else would get in because they had all these fancy reviews with stars and such. I was on skype playing Osu with Happeh, and saw the thread and we both applied at the same time. So it was pretty cool when I found out we were both accepted. [/i]\r\n\r\n[color=#1E90FF][b]9.[/b][/color] What is your opinion on the current situation with Solidify?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]I think it'd be a whole lot easier for him if the reports weren't sent to his PM box, lol. [/i]\r\n\r\n[color=#1E90FF][b]10.[/b][/color] Do you feel that your activity on Hack Forums will continue, and if so, for how long?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]Yeah, for as long as possible. I want to be one of those guys who is like, \"Oh I remember when __ happened back in 2010\" to the 2015 members.  [/i]\r\n\r\n[color=#1E90FF][b]11.[/b][/color] What is your current goal on Hack Forums?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]Nothing specific, I'd like to graduate from the HJT training program and become a teacher. Helping other members and trainees and such. [/i]\r\n\r\n[color=#1E90FF][b]12.[/b][/color] A bit off topic, but what do you enjoy doing in your free time?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]I watch anime, skateboard, go to the movies, and play xbox. :P [/i]\r\n\r\n[color=#1E90FF][b]13.[/b][/color] To finish off, is there anything you would like to tell Hack Forums members?\r\n[color=#1E90FF][b]Mute:[/b][/color] [i]Keep on trolling. [/i]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nTune in next week for another great edition of HF News.",
      "subject": "[10/15/2010] - HF News"
    }
  ]
}