{
  "posts": [
    {
      "pid": "12334303",
      "uid": "295848",
      "dateline": "1306982459",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNMain.png[/IMG][/align]\n\n[color=#FF69B4][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\n\nThe edition you are currently reading is the [b]44th full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNHeadlines.png[/IMG][/align]\n\n[align=justify]Happy Memorial Weekend and welcome to another issue of Hack Forums News! This week [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to get together a Wiki-team to develop a Hack Forums Wiki. He is currently looking for members with \"strong wiki syntax knowledge, leadership skills, dedication, and maturity.\" To find out more and post if you want to join click [url=http://hackforums.net/showthread.php?tid=1327070]here[/url]. \n\nFor all of you who have not yet noticed, all member's reported post count has been reset. It is not clear as to the exact reason of this reset but one can assume that some excess of abuse could be a factor. In any case we can simply hope for the best and continue reporting rule breakers as we see them. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] himself stated simply in a word that it was \"necessary\".\n\nThis week we also had some minor LAN Issues and MySQL errors. The problems were resolved however, and everything is back to normal. To read more about the problem visit [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s thread [url=http://hackforums.net/showthread.php?tid=1335474]here[/url].\n\nRemember those games we used to play in The Lounge such as The Person Above You...? Well now thanks to [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] all LQ forum games like that are banned! To find out more about this new rule check out the thread [url=http://hackforums.net/showthread.php?tid=1327117]here[/url].\n\nThe member upgrade prices for L33T and Ub3r have been raised. The abrupt changes occurred last Thursday. Don't worry though, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has given us a coupon to take $2.00 off one upgrade per person for the next week. To find the exact price changes and more info visit the thread [url=http://hackforums.net/showthread.php?tid=1323663]here[/url].\n\nGuess what! [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] our webmaster has recently purchased and created a brand new forum! Troll Forums! To read more about this momentous achievement click [url=http://hackforums.net/showthread.php?tid=360157]here[/url] and to visit the new site click [url=http://www.trollforums.com/]here[/url].\n\nThis week a long list of members were all banned by [url=http://hackforums.net/member.php?action=profile&uid=143654][color=lime][b]Kr4z1[/b][/color][/url] for 24 hours. His very words for the bane was, \"Take time to find your wallet.\" This is due to the ridiculous amount of threads created in The Lounge on said topic over the course of a few hours.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNUsernews.png[/IMG][/align]\n\n[align=justify][url=http://hackforums.net/member.php?action=profile&uid=621421][color=white][b]Dordelicious[/b][/color][/url] has released a new great monetizing e-book which has reached 200+ replies and 5,000 views in under four days. You can see & read more about it [url=http://hackforums.net/showthread.php?tid=1330277]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=white][b]Paradoxum[/b][/color][/url] won the Member of the Month award. Congratulations Paradoxum! To see the past MOTM winners click [url=http://hackforums.net/myawards.php?awid=4]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=234024][color=white][b]Deities[/b][/color][/url] the creator of the new Red Lions user bar has released the past images they were considering using to represent the groups as a whole. If you would like to see them click [url=http://min.us/mbgfK3pOAqfGQC]here[/url]. \n\n[url=http://hackforums.net/member.php?action=profile&uid=431105][color=#0066FF][b]Tɦɛ Gʀiɱ[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=317364][color=#0066FF][b]Nightmare[/b][/color][/url], and [url=http://hackforums.net/member.php?action=profile&uid=151894][color=white][b]Vanadium[/b][/color][/url] were all permanently banned from MOTM, the exact reasons are unknown, however we can get the implication that it was because of \"cheating\", in the context of the contest's rules.\n\n[url=http://hackforums.net/member.php?action=profile&uid=54441][color=#0066FF][b][H]ell[/b][/color][/url] found out an \"exploit\" that could mess with Hack Forums quite badly.\n\n[url=http://hackforums.net/member.php?action=profile&uid=109828][color=#0066FF][b]ConfusedHatter[/b][/color][/url] has created a tutorial on how to delete someone's Media Fire account simply by sending them a link. He has also claimed discovery of that said method, stating many others have attempted to take credit for it. More on this exploit can be read [url=http://hackforums.net/showthread.php?tid=1332653]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=82921][color=#0066FF][b]christiano[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=80618][color=white][b]nokia2mon2[/b][/color][/url] have both surpassed 1,000 reputation points this week. This is quite a milestone being that less than twenty members on the whole site have done such a thing.\n\n[url=http://hackforums.net/member.php?action=profile&uid=78585][color=#0066FF][b]Fr4g.[/b][/color][/url] is currently writing a Hack Forums application for Android phones. See more of it [url=http://hackforums.net/showthread.php?tid=1319570]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=717382][color=#0066FF][b]John*[/b][/color][/url] is the new owner of Youtube.com/hackforums after striking a bargain with its previous owner. More on this topic can be found [url=http://hackforums.net/showthread.php?tid=1328222]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=317364][color=#0066FF][b]Nightmare[/b][/color][/url] paid for a thread in the Innuendo forum to be stuck, namely \"Safe Sex\". See it [url=http://hackforums.net/showthread.php?tid=1318547]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=616850][color=#FFCC00][b]atthackers[/b][/color][/url] is now first HF L33T member to receive the Master Donator award. These donations are part of what keeps Hack Forums alive, and if you would like to see the full list of Master Donators click [url=http://hackforums.net/myawards.php?awid=50]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=258902][color=#FFCC00][b]xb0y[/b][/color][/url] was put in to Google's Security Hall of Fame for finding an exploit; this is the third HF member to be put in the GHF. Read about it [url=http://hackforums.net/showthread.php?tid=1327817]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=168826][b]Tyler777[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=319972][b][color=black]Mermaid[/color][/b][/url], and [url=http://hackforums.net/member.php?action=profile&uid=514693][b][color=black]cOld fus1on[/color][/b][/url], were all compromised this week. \n\n[url=http://hackforums.net/member.php?action=profile&uid=798343][color=black][b]xSkid[/b][/color][/url] or [url=http://hackforums.net/member.php?action=profile&uid=285157][b][color=black]Cod3ing[/color][/b][/url], made a thread for a ban appeal to Omniscient. He was originally banned for trying to attack HF with TwBooter. See his thread [url=http://hackforums.net/showthread.php?tid=1325110&pid=12182551]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=37251][color=black][b]Baked[/b][/color][/url] was banned because of a 100% warning level. 90% of it was all issued in one day, by xerotic.\n\n[url=http://hackforums.net/member.php?action=profile&uid=32451][color=black][b]ᵀᴴᴱ ᴱˣᵀᴿᴱᴹᴱ ᴺᴵᴳᴴᵀ ᴴᴬᶜᴷᴱᴿ[/b][/color][/url] was banned for stealing HF accounts. Some think he was something to do with an offsite hacking group.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNOther.png[/IMG][/align]\n\n[align=justify]Thirty years since its discovery, HIV might be one step closer to being curable. Timothy Ray Brown, an American with HIV, was cured with a unique bone marrow transplant. The donor has a rare genetic mutation which is known as CCR5-Delta32. A person with this mutation is resistant to HIV. While this seems like a huge step in curing the virus, the treatment was expensive, complex, and extremely risky. The treatment isn’t practical and could kill people, but it is a huge step in the search for a cure for HIV.\n\nFighting in Yemen has left at least 39 people dead. With this bad news, worse is speculated to come. Some analysts say that this recent fighting might pull Yemen into a civil war. The most recent fighting between supporters of Sheikh Ahmar and Yemen’s presidential security forces began at the country’s capital on Tuesday. \n\nShaquille O’Neal, who is 39 making him the NBA’s oldest player, announced that he is retiring on his Twitter on Wednesday. While this isn’t an official statement, he did post a video link stating, “We did it. Nineteen years, baby. I want to thank you very much. That’s why I’m telling you first that I’m about to retire. Love ya. Talk to you soon.”[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNInterviews.png[/IMG][/align]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - Judge Dredd[/color][/font][/size]\n[spoiler][align=justify][color=white][b]Security™:[/b][/color] Hello Judge Dredd, thank you for joining me on the 44th full edition of the Hack Forums News! Would you like to make any opening statements?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Thank you for having me and it’s definitely an honor. \n\n[color=white][b]Security™:[/b][/color] Do you enjoy being in charge of 'Reputation Abuse Support', or would you rather not have to moderate it? \n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Well, I was brought back in to strictly clean up reputation abuse and I feel that I’ve made a huge impact thus far. Things we’re a bit frustrating in the beginning, but now I find myself enjoying every moment of it. \n\n[color=white][b]Security™:[/b][/color] When not dealing with reputation abuse, what do you do like to do at Hack Forums?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] I usually just browse around to make sure everything else is in order. \n\n[color=white][b]Security™:[/b][/color] Since Crow is less and less active lately, will you take over 'Member of the Month'?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Looks like I already have and I’ll continue to do so.\n\n[color=white][b]Security™:[/b][/color] If you had to vote to unban phire nuk3r, or keep him banned, which option would you choose? Why?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] No comment.\n\n[color=white][b]Security™:[/b][/color] Do you actually do any hacking? If so, please specify.\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] White hat, but I’m mostly an electronics guru for sure.\n\n[color=white][b]Security™:[/b][/color] Do you support the re-opening of the 'Suggestions and Ideas' section? Please explain.\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Of course, it’s always great to get everyone’s feedback, so we know how to improve or better things on the site.\n\n[color=white][b]Security™:[/b][/color] When not on Hack Forums, what do you enjoy doing?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Spending time with my family, friends, and pretty much enjoy any physical outdoor activities.\n\n[color=white][b]Security™:[/b][/color] What are some pieces of advice for new members of Hack Forums?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Read the Help Documents!\n\n[color=white][b]Security™:[/b][/color] I heard you started a rumor that I'm the sexiest person on Hack Forums, can you verify this?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Lies, all lies, I tell ya! 🙂\n\n[color=white][b]Security™:[/b][/color] If you could punch one member of Hack Forums, who would you punch, and why?\n[color=#4DD0FC][b]Judge Dredd:[/b][/color] Most likely VipVince, since he reminds me of me when I was his age and I never found myself thinking twice back then with the ladies. I was just a straight up douche bag, but I grew out of that eventually. ;)[/align][/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - Tha Sneak[/color][/font][/size]\n[spoiler][align=justify][color=white][b]Boxing:[/b][/color] Thanks for participating in the 44th edition of HF News 🙂 Any shout outs to other members before we start? \n[color=white][b]Tha Sneak: [/b][/color]You're welcome, no problem. I would like to shout out to Infallible, Paradoxum, cobija, xerotic, AsSaSs@iN, Peter Chao and Judge Dredd. They are some of my favorite members on Hack Forums in no particular order.\n\n[color=white][b]Boxing:[/b][/color] How much time do you dedicate of your time to help keep members virus-free? Is it a lot of work? Do you enjoy doing it? With all the members interested in the group, I'm sure they are curious. \n[color=white][b]Tha Sneak:[/b][/color] I don't really dedicate a certain amount of time, but I normally spend around 2 hours a day helping members on Hack Forums. In the summer, I spend quite a bit more time helping members. It can be a lot of work, but I have gotten used to it, plus I like to work anyway so it is fine for me. \n\nI also enjoy helping members with their malware issues, it can be quite fun at times. I like challenge and new malware as it is fun testing new ways to remove the new malware safely. I don't see hardly any new malware here though, mostly easy to spot RATs and keyloggers.\n\n[color=white][b]Boxing:[/b][/color] From what I've seen, there are a lot of members who would like to get in the HJT Team. Do you have anything to say to others who would like to get in the group one day? When was the last time you had a challenge cleaning up someone's computer? \n[color=white][b]Tha Sneak:[/b][/color] To get into malware removal, you must be patient, and research. Those are the two most important parts of training. Training takes around 6 months to a year. Never give up and you will complete training before you know it.\n\nThe last time on Hack Forums I had a challenge cleaning someone's computer was probably when I removed Stuxnet or TDL4, I removed TDL4 from someone's computer here not too long ago, less than 2 weeks ago. I removed Stuxnet from someone's computer around 4-6 months ago.\n\n[color=white][b]Boxing: [/b][/color]Very good information to know. What other hobbies do you have outside of Hack Forums? \n[color=white][b]Tha Sneak: [/b][/color]I like to hunt, fish, work on just about anything, play Xbox, I like to learn new things, ride dirtbikes, hang out with friends, etc.\n\n[color=white][b]Boxing: [/b][/color]How did you discover HF? How did you pick your username? \n[color=white][b]Tha Sneak: [/b][/color]I discovered Hack Forums while I was researching a log I was doing for another forum. I clicked the link because I was curious and I looked through Hack Forums and to my amazement it had an HJT Team. I was instantly interested. I also liked the community and that it was a very active forum. \n\nI really don't know how I picked my username to be honest. I always have 'Sneak' or 'Sneaky' in my online aliases. I will admit, this isn't my normal online alias and it is unique to this forum as I don't want my true online identity exposed.\n\nI don't have anything to hide, but for the sake of the other forums I work at it would be better to keep my real alias hidden. The other forums I work at are aware I work here as an HJT Team member and they don't mind. I can change my username to it at any time, but I choose not to.\n\n[color=white][b]Boxing:[/b][/color] If you were Staff for a day and could make any changes you wanted, what would be some of the things you would do to improve the site in your eyes? \n[color=white][b]Tha Sneak:[/b][/color] I can't think of anything I would change if I had the chance. Omniscient does a great job running the site and the Staff do a wonderful job doing their duties. I would just be very active and do what I am told to do. \n\n[color=white][b]Boxing: [/b][/color]I agree the site is doing pretty well ^.^ Let's say you won the lottery, what would be some of the things you would spend the money on? \n[color=white][b]Tha Sneak: [/b][/color]I would probably heavily upgrade my laptop, buy a Mac Pro, iPad, iPod Touch 4G, a bunch of parts for my truck, a new Desktop, and I would donate around $1000 to Hack Forums and the other sites I work at depending on how much I won.\n\n[color=white][b]Boxing: [/b][/color]Do you look at the role you play in the HJT as a job or an activity? Do you enjoy it? Do you plan on majoring in the computer industry? \n[color=white][b]Tha Sneak:[/b][/color] I don't really consider it as a job since I enjoy it doing it. It is more of an activity/hobby more than anything. I do plan on getting a degree in Computer Science and work at Marshall's Space Flight Center (NASA) in Huntsville, Alabama as a computer security specialist. I already pretty much have that job locked in place and I am excited about it.\n\n[color=white][b]Boxing:[/b][/color] Very cool. How do you feel about the direction Hack Forums is going in? Better or worse? More or less quality? \n[color=white][b]Tha Sneak:[/b][/color] The quality seems to have gone down a bit, but I am hoping that it will pick back up. It is up to the members whether or not they want to actively contribute and post in a higher quality. It would be great to see a lot more tutorials and helpful posts. I encourage members to be as helpful as possible when browsing around Hack Forums. \n\n[color=white][b]Boxing:[/b][/color] Agreed, let's wrap this interview up with a final question; if you could give a member of the year award out to one member (not yourself), who would it be?\n[color=white][b]Tha Sneak: [/b][/color]I would give it to Paradoxum. Very high quality member, very nice, contributes a lot, and much more. \n\n[color=white][b]Boxing:[/b][/color] This concludes the interview, I'd like to thank the HF News team for all the hard work they do.[/align][/spoiler]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNClassifieds.png[/IMG][/align]\n\n[align=left][url=http://hackforums.net/showthread.php?tid=1158830][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/Attbooter.png[/IMG][/url][/align]\n[align=right][url=http://hackforums.net/showthread.php?tid=1277828][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/P4RCrypter.png[/IMG][/url][/align]\n[align=left][url=http://hackforums.net/showthread.php?tid=1234293][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/Cobaltebook.png[/IMG][/url][/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HF%20News/HFNTeam.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\n[/list]\n[color=white][b]Publishers Assistant[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\n[/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url] - Other News\n[*][url=http://hackforums.net/member.php?action=profile&uid=153686]Fireren[/url] - Headlines\n[*][url=http://hackforums.net/member.php?action=profile&uid=515249]Sir[/url] - User News\n[/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=129444]3x0r_$c0rPi0n[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=114470]F4T4L 3RR0R[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=629674]Waldo[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url]\n[/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=137080]Boxing[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=92059]Security™[/url]\n[/list]\n[color=white][b]Editor[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[/list]\n[color=white][b]Graphic Designer[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]",
      "subject": "[6/1/2011] - HF News"
    }
  ]
}