{
  "posts": [
    {
      "pid": "24046388",
      "uid": "515249",
      "dateline": "1341123145",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]98th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Skype Mycode[/b][/color]\nSometime this week [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided it'd be a good idea to add a Skype Mycode for users. This new feature allows members to display their skype online status in their signature or posts, the image also acts as a link so when clicked it opens the skype chat and members are able to chat with the selected user. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread click the following link: http://goo.gl/bBojq\n\n[color=white][b]FBI and other events[/b][/color]\nAs many of you know there was quite a bit of drama and accusations earlier this week regarding the arrest of xviseral, a well-known leader of the Blackshades group. The story is entirely too lengthy to put into one paragraph however [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has kindly explained in great detail the events that occurred this week in his announcement thread which can be found by clicking the following link: http://goo.gl/pUyrO\n\n[color=white][b]Notable scam report[/b][/color]\nCяιмιηαℓ, a notorious scammer here on Hack Forums has been yet again caught red handed in the HF marketplace. In an effort to keep members safe [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has stickied a scam report posted by samirdip which gives more than enough proof to confirm that Cяιмιηαℓ has not left HF just yet. To view the scam report click the following link: http://goo.gl/4yN5S\n\n[color=white][b]New feature[/b][/color]\nAfter being suggested several times in the past [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally decided to add a new feature allowing members to view their referred members via their profile page. Although this is not a major change it is still nice to see that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] is still taking suggestions after all this time on HF.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=111287][color=#0066FF][b]xvisceral[/b][/color][/url], founder and leader of Blackshades, was arrested for carding and fraud. Read [url=http://hackforums.net/showthread.php?tid=2623715]Omniscient's announcement[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b]xerotic[/b][/url] [url=http://hackforums.net/showthread.php?tid=2399978]announced[/url] that his unofficial Hack Forums scammer database is back up and running. \n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=605969][b]Top[/b][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=150074][color=black][b]Problem?[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=891435][color=black][b]CyberProdigy[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=372386][color=black][b]Se4nH4x[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=119160][color=black][b]~NaDe[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=170785][color=black][b]Infallible[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=713594][color=#0066FF][b]Goo[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=524451][color=black][b]Heir[/b][/color][/url] was banned for trolling, which is forbidden.\n[*][url=http://hackforums.net/member.php?action=profile&uid=150074][color=black][b]Problem?[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=891435][color=black][b]CyberProdigy[/b][/color][/url] was banned for making up facts about [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url].\n[*][url=http://hackforums.net/member.php?action=profile&uid=789677][color=#0066FF][b]Grin[/b][/color][/url] was temporarily banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=442514][color=black][b]zombiehacker[/b][/color][/url] was banned for posting marketplace threads outside of the marketplace.\n[*][url=http://hackforums.net/member.php?action=profile&uid=372386][color=black][b]Se4nH4x[/b][/color][/url] was banned for scamming.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1049481][color=black][b]Gone With The Wind[/b][/color][/url] was banned. Turns out he was actually...\n[*][url=http://hackforums.net/member.php?action=profile&uid=793351][color=black][b]Enterprise[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711][color=black][b]D3xus[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1201566][color=black][b]Abalam[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=170785][color=black][b]Infallible[/b][/color][/url] was banned for abusing his power.\n[*][url=http://hackforums.net/member.php?action=profile&uid=119160][color=black][b]~NaDe[/b][/color][/url] was banned for scamming.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=#FFD700][b]Apathy[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2626382][b]A Chilling Rape Story[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2620912][b]Money... Or Friends?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=865083][color=#FFD700][b]Bangarang[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2629091][b]Is it illegal to murder someone on the moon or other planets in space?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1160000][b]nigrin[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2628619][b]Obamacare approved![/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1222901][๖ۣۜNoxx]The_Master[/url][/font][/size][/color]\n[spoiler=][url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Hello [๖ۣۜNoxx]The_Master, Thanks for participating in the 98th edition of HF News, any shout outs to other members before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Glad to be apart i'd like to shout out at Magic known him for a while and id like to shout out to ๖ۣۜFrvwfr3 for being about the nicest ub3r when i joined.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Okay well I'm sure they will appreciate the shout out bro. Now is this true that you're making a group for HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Yes it is. It's been something ive admired those who make the groups and how they run them. Once i knew i had the money to make it it was all ready for me. But i was gonna pay the 1k startup fee this month but since im a intern and my 3 co workers all went to summer break at the same time i need to take a 1 week vacation and i dont know if i have all the money i need then.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Oh right, that sucks to hear about the Co workers man, so do you think you will soon have the group up and running or are you not quite sure any more? \n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: This is somewhat of a goal i am gonna make. I have someone ready thats willing to exchange my 1,2k pp to 1k lr so thats all setup the only problem would be that it falls back 1 month. But i might get the extra cash i would need for that 1,2k on July 14th who knows :P\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well I hope too see it come along nicely, What do you intend to make the group based around? I'm sure many people have been asking about it, so here is the chance to tell everyone.\n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Yes alot of people have been asking me what it's gonna be based around.\n\nWell first off i was thinking of making it Gaming Gfx and Coding but i have no knowledge in coding so i've decided it's gonna be Gaming Gfx and Debate but that may flux after i start the group. The userbar is made so that its easy to switch with out remaking the userbar cause who would ever find a img that represents Gaming Gfx and Debate ?\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Sounds like it's going to be good, but don't you think it might get a little hated on because of all the other groups, Like Respawn for example, that's based around gaming, So don't you think it might be stealing a little thunder? Well there is a lot of graphics members out on HF that do really good jobs, I think I've seen the userbar, Looks pretty nice.\n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: I know it looks like im stealing a little of the thunder from Respawn but i respect respawn to the max and i love being a member of Respawn. But i just think alot of times in the gfx section that alot of members there deserve to be in gfx masters well not alot but from time to time.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Yeah Graphics Masters are really strict on acceptance man, I totally respect that they are what they put out \"Graphic Masters\". So what did you intend to do when you first joined HackForums?\n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Well i can gladly say it was not hacking :P\nBut when i started playing tf2 i heard some guys talking about hackforums and that it had some great info and games and hacks. Not really a great way to find Hackforums. But that was ages ago i made a old account was never active posted like 2 times was always sneaking around and just reading never anything i found i knew enough to post on. That account got deleted for inactivity later. But i didint mind. I came back here when i made my minecraft server cause i wanted to see how other people ran theirs and planetminecraft is just full of kids who know nothing. And that server actually got pretty good. But account got hacked i made a new one told omni it had been and this is the account ive had since.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Good reason but yeah I agree not the best way to hear about HF over a game lol but at least they directed you in this direction :). Never got into minecraft that much to be honest but I mean other people have opinions on the game :). If you got Staff for 24 hours on hackforums, I know this has been in loads of my interviews but it's good to see other peoples things, So if you had it for 24 hours what would you change/do? \n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Honestly i would not change anything i love this forum as it is i might talk to omni about adding a Blizzard as a lounge for blizz games cause there are more then just Diablo, Starcraft and World of Warcraft. But i would probably just do my thing and keep rolling. I might +5 someone even though thats not even the biggest rep ive given.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: I agree this is a really good hobby for me, I enjoy it. So if you don't mind me asking, what do you do around HackForums to try and help out? \n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Well i used to do alot of gfx and people seemed to like them. But since ive had so many issues with Photoshop i took a break. But now i just do my own thing. If i have knowledge in the thing someone needs help ofc im gonna help him/her.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well man, I wish you all the best with the new group and I'll probably see you around HF, Would you like to say anything before we finish?\n[url=http://hackforums.net/member.php?action=profile&uid=1222901][color=white][b][๖ۣۜNoxx]The_Master[/b][/color][/url]: Of course we are gonna meet again your a rhythm lounger.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=451192]Existence[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Hello, and welcome to the 98th edition of the HF News, [url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]. Are there any shout outs you want to give before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: I'd like to give a shoutout to BV1, marjinz, Xbox Live, Rhett, Tippy, T3h Hack3r, and Genuine. And who ever else I forgot.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: I am sure they will be thankful. So a huge topic right now is the whole dubious stance of BlackShades, and the respective HF group. How do you feel about the whole situation?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: I think this creates a new start for the group. We've decided to remove all members except the people who paid. We're planning on creating a new group soon as Omni has allowed us to keep the group. The arrest was not an attack on Blackshades, xvisceral only is charged because he was a member of a carding forum so Blackshades product owners have nothing to be scared about.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: It is true that BlackShades isn't in any immediate danger, but doesn't this raise a red flag as to the FBI's interactions with products like BlackShades. Are you going to be changing any of your advertising techniques, wording - phrasing, ToS, or any other legally binded contract to BS. Also, are there any public ideas about what the new BlackShades group is going to be about, I am sure this is going to be a heavy topic, since a lot of people got into BS (group), becuase they owned products. Is this still going to apply?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: There is no danger to our products, the support team, admins, or the customers. We have had multiple legal teams look over our ToS and phrasing, the CEO lives in the Netherlands and our servers are all offshore so the FBI has no chance of getting our database. There is nothing to be afraid of, like I said the only reason xvisceral was sent to prison because he was an active member on a carding forum.\n\nNo, members cannot get in by paying or owning 3 product. For the recruitment, we are going to be sending our 1 round of invites then those members can nominate other members.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Though I am going to be moving the subject in a different way, I would firstly like to wish XVisceral good luck, and hope he comes out with the charges being dropped. So, you still haven't said what the group might be about, so I am assuming you are deciding that, I am sure you guys will make a good decision. What are some of the ideas being bounces around.\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: Due to Omni's request it will not be about anything blackhat. We have decided on a name but we won't be publicly releasing it yet.  We are not going to be focusing on one specific subject, but more about multiple subjects, networking, webmasters, and whitehat.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Can we perhaps get a hint of to the name? Can you blame us for wanting to know? Though you are more than just t he groups you are in, so what are your future plans for HF. Do you plan on selling any new products, or trying to get in any special groups?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: Naw, everyone will see in a couple days. I personally won't be selling any products nor trying to get into any special groups, I plan on devoting most of my time on HF to the group that we're creating.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Dedication is key then. So besides HF, what do you do, are you in school? What is your dream job when you get older do you think?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: I'm currently going to school, I decided not to take any summer courses so I could relax. I'm not sure what my \"dream job\" is. I'd like to go into medicine though.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Being a doctor is a truely noble profession, though don't you ever fear things like HF and BlackShades might catch up to you? Do you take a lot of precations when it comes to your personal info and security?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: Not at all. I never did anything bad, I only manage the support team and do support my self. I never commited fraud or anything of that nature. I do attempt to keep my identity as hidden as possible.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: So we are coming to an end of this Interview, if you could do one thing with your life, what would you do?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: Be a great member, father, and have a loving family.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: So this ends the 98th interview segment of the HF News with [url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]. [url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url], do you have any closing final questions, comments, or concerns?\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url]: Nope. Just... before you PM me any questions read my damn threads. >.<\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1115097]TheVortex[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, TheVortex. Thanks for joining us on the 98th edition of the HF News. Before we get the conversation rolling, is there anyone you'd like to give a shout-out to? \n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Thanks for having me for a interview. And I would like to give a shout-out to [url=http://hackforums.net/member.php?action=profile&uid=646916]Genuine[/url], [url=http://hackforums.net/member.php?action=profile&uid=640835]BTB™[/url], [url=http://hackforums.net/member.php?action=profile&uid=323740]Positive[/url], [url=http://hackforums.net/member.php?action=profile&uid=656453]Chris[/url], and all of the other members I know on HF.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: No problem. I'm sure they will be ecstatic about seeing a shout-out. So TheVortex, you are currently in 9 usergroups (including HF Ub3r). How do you manage to stay active in all of these, and what emotions do you express towards those that call you a 'group whore'?\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Well sometimes it can be very tough to stay active in all of my groups, but I devote a lot of my time on HF to my groups. I get called a ‘group whore’ a lot, but I don't really care about it. Everyone is entitled to their opinions, but I always do a lot for my groups and enjoy all of my groups, so I don't care much what other people think about it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's always a good attitude, and it's great to see a contributing member. Recently, you became one of the leaders of the group Rhythm. How did this come about, and what do you think of the transition from TechSperts to Rhythm?\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Well me and Positive have been friends for a while, and TechSperts was the first group I was in, only a week after I joined HF! Positive was thinking about changes to the group for a while, so a few weeks ago I PM'd Positive saying that I would be fine with paying the $250 change fee for the group. Positive then made a poll on what the group should be changed to, and once he decided to change it to Rhythm, I paid the $250 for the group to be changed. He then promoted me to leader. I think the change of the group is a great thing. I have always wanted there to be a music group on HF, and the group has been going great so far.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I agree, Rhythm is going great, and a music group was well needed. You have been a member for only half a year, and you have already became a group leader, joined 9 prestigious usergroups, donated $500+ to HF, and have hosted a lot of giveaways, the most recent being around 15 member upgrades. What makes you such an ambitious member, and what keeps you coming back?\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Yes I have been a member for a pretty short amount of time, but HF is different than any other online community I have been on. Most of the members I know are very help to the community. I guess I am an ambitious member because I want to help this community out the best that I can. I do giveaways for fun, and it makes me happy when other people are happy. I've donated a lot of money to HF because I know it helps [url=http://hackforums.net/member.php?action=profile&uid=1]Omni[/url] run the forum. What keeps me coming back are my friends and my groups. My friends are always a lot of fun to be around. My groups are always active. They are great to be in, and to talk with the other members is a privilege. Another reason I keep coming back is because I genuinely enjoy HF, and most of what it has to offer. It's always a fun place to hang out!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Great to see members that love, rather than hate, the community. So I suppose, based on your response, you are planning to continue being a contributing HF member. What are your future plans for HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Well I have lots of future plans for HF. One of which is hopefully buying an official group in the next few months. Another one of my plans is to be a lot more active in more sections on HF: not just in my groups. Also I plan to do a lot more contests and upgrades in the next few months.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Ah, seems like some great goals. Good luck with them! Some people are saying HF needs some more updates, to keep members more excited and active. What changes/updates would you look forward to seeing over the coming months?\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Well I am really hoping to see the P0W3R usergroup released soon. I could really use the extra PM space. I also hope to see the vouch system and the new scammer database be released. I think both the vouch system and the scammer database will cut down on a lot of the new members of HF getting scammed. I'm also excited to see whatever else [url=http://hackforums.net/member.php?action=profile&uid=1]Omni[/url] has in store for us the next few months.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, I'm sure you're not the only one looking forward to those things being implemented (if they are still). Are you aware of [url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]'s userscript/database for scammers? What do you think of it? For all of you that are unaware, this userscript allows members to submit scam reports, and when using HF, scammers are labelled. It can be found [url=http://hackforums.net/showthread.php?tid=2399978]here[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Yes I am aware of [url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]'s scam database, and I think it is one of the most useful userscripts so far. I use that userscript a lot and it really helps me. I don't think nearly enough people know about it though. Hopefully a lot more people will use both [url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]'s scam database, and the upcoming deal disputes database being made by [url=http://hackforums.net/member.php?action=profile&uid=1]Omni[/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Great, it really is one of the more useful userscripts, I agree with that :). So I suppose I should ask you what your favourite group is, and why?\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][color=white][b]TheVortex[/b][/color][/url]: Well I can't pick just one favorite group, but here are some of my favorites. Techsperts/Rhythm: it was the first group I was in and have always loved its members. Red Lions was the second group I was in, and have always thought of it as one of the most HQ group on HF. Writers is also one of my favorites to be in. It’s a great group, and I love helping to make the HF News edition. And lastly, Propitious. Propitious was the first invite only group on HF, and I have always been impressed with everything the group does.\n[/spoiler]",
      "subject": "[6/30/12] - HF News"
    },
    {
      "pid": "24046400",
      "uid": "515249",
      "dateline": "1341123175",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][img]http://i.imgur.com/i4CWt.png[/img]\n[video=youtube]http://www.youtube.com/watch?v=RgC3csPP2-4[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[b][color=white]Mohamed Morsi:[/b][/color]\nThis week, the Egyptian electoral commission announced that Mohamed Morsi has won the Egyptian presidential election over his opponent, Ahmed Shafik. He is also Egypt's first democratically elected president. He took a symbolic oath on Friday in Tahrir Square and was sworn in on Sunday June 30th, 2012 by the Egyptian electoral commission. Mohamed Morsi is a member of the Freedom and Justice [Political] Party. Morsi was also a member of the Egyptian Parliament from 2000 to 2005.\n\n[b][color=white]Wildfire:[/b][/color]\nThis week, a large wildfire started in Colorado, and is still ongoing. It is currently the largest wildfire in Colorado history, having burned at least 347 houses, with over 20,000 more still at risk of the same fate. At least 35,000 people have been evacuated because of the wildfire. It is at a 25% containment level right now. It is called the Waldo Canyon Fire, and has been visited by President Barack Obama on Friday, June 29th, 2012. President Obama also promised financial aid for the state of Colorado after this large wildfire. In a related scope, this year seems to host a large number of wildfires, with 40 large ones being fought across the USA.\n\n[b][color=white]UEFA Euro 2012:[/b][/color]\nThis week, there are two major sporting events going on, one of them being the UEFA 2012 Euro Cup. On Sunday, the final of the Euro Cup was held between Spain and Italy at 11:45 A.M. Eastern Time in the capital of the Ukraine, Kyiv. This could be the first time that a nation has won 3 major soccer tournaments in a row, because Spain has already won the 2008 Euro cup and the 2010 World Cup. Like the World Cup, the UEFA 2012 Euro Cup is held every four years. This year's Cup was hosted by Poland and the Ukraine.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nThe ModbookPro, the first Max tablet that has been modified by Modbook, is set to return to the market later in 2012. It was one of the \"best of show\" winners at Macworld 2007.\nA Modbook is basically made up of a 13-inch Macbook Pro, without its enclosure, display, keyboard, and trackpad assembly. The ModbookPro's specs are a 2.5 GHz dual-core Intel (NASDAQ: INTC) Core i5 processor or a 2.9 GHz dual-core Intel Core i7 processor with 16 GB RAM, a 2.5-inch SATA drive (1 TB capacity), an Intel HD Graphics 4000 chipset, a 8x SuperDrive DVD Burner, a 64.5 WH lithium-polymer battery and a 60 W power adapter. It supports Wi-Fi and Bluetooth.\n\n[color=white][b]Google[/b][/color]\nGoogle released its Nexus 7 tablet in San Francisco. The tablet is made by Asus, with a 1280 X 800 display and Nvidia Tegra 3 quad-core CPU and 12-core GPU. It supports Wi-Fi, Bluetooth and NFC (Near-Field Communications). It has a gyroscope and a front-facing camera, too. It runs Android 4.1 Jelly Bean. It weighs around 340 g, offering up to 9 hours of HD video playback and 300 hours of standby on a single charge. It costs $200.\n\n[color=white][b]Microsoft[/b][/color]\nRumours say that Microsoft's announced XBOX Music service is going to overpower iTunes, Spotify and iCloud and many other services. Microsoft has simply stated that \"Xbox Music will bring you a world-class music library and great new ways to enjoy, share and discover new music on the XBOX console, Windows Phones and Windows 8 PCs and tablets. [They] will have more to tell you soon about [their] specific plans.\"\n\n[color=white][b]Google Chrome[/b][/color]\nGoogle has released a brand-new version of its Google Chrome browser for Apple's iPad and iPhone. The long-awaited application aims to enlighten the browsing across various desktop computers, laptops, smartphones and tablets. Sundar Pichai, Senior Vice President of Chrome and Apps at Google has said “our goal is to offer you a consistent, personalized web experience across all devices.” This is something that iOS device lovers are definitely going to enjoy, because, who doesn't want to quickly surf on the Internet?\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]50 Cent Involved in Car Accident[/b][/color]\n50 Cent and his SUV were both damaged after an early morning collision with a big rig on a New York City thruway. According to thisis50.com, 50 Cent's SUV was rear-ended and the collision almost made the SUV flip over. Even though it appeared that no one was seriously injured, 50 Cent was taken to a nearby hospital due to neck and back pain. His bodyguard also had his minor injuries taken care of.\n\n[color=white][b]Officers Who Leaked Rihanna Beating Photo Won't Be Charged[/b][/color]\nThe two L.A. Police Officers that leaked the picture of Rihanna's face after a fight with Chris Brown, will not be charged. After an investigation that lasted two years, there seems to not have been enough evidence to bring the officers to a trial. The picture displayed Rihanna's badly bruised face and busted lip after Chris Brown hit her repeatedly during a fight they had while in a car together. Even though the officers will not be charged with a crime, they still might lose their jobs. \n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=ofoIMg76Sng&feature=player_embedded[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=KPMKbzafX7o[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=C4IPE_4FUy4[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=itvJybdcYbI&feature=related[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nOur world is fucked up. It really is. We all try to make due with the cards that have been handed to us, and hide a few stolen ones up our sleeve's, but we're all just fucked in the end. There is no longer trust in this world. With the age of technology comes the age of ignorance and a lack of communication. Ironic, right? These same things that connect us with the world, disconnect us with those around us. We rarely work one on one with people, and jobs are spent in front of a computer screen. All of this has led to a social handicap on many children and even adults. This has led to a lack of trust among others, and amongst ourselves. Communication between people is now transferred through zeroes and ones instead of oxygen and inflection. There's no where good that this could go.",
      "subject": "*"
    },
    {
      "pid": "24046425",
      "uid": "515249",
      "dateline": "1341123233",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"How do you feel about Prestige?\"\n\n[i]\"I think the prestige system is a nearly useless addition to HF. You can post \nwhore all day and get that raised, whilst being the most low quality member on \nthe forum. In my opinion it is a flawed system, and it doesn't benefit the members \nin any way, because prestige doesn't directly relate the the quality of the user. \nSame could be said for reputation due to the amount of members who rep4rep and \nthings like that, but it actually requires input from other members and an opinion on \nyou as a member.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1330641][i]-PeanutButterSmack[/i][/url]\n\n[align=right][i]\"I believe once we are through with the proper implementation of the \nPrestige system, it would definitely weigh more than Reputation points. As Omniscient \ndescribed Prestige in the “What is Prestige?” thread; the concept looks really cool. \nAccording to me, in future it would act as a contribution meter of a member. The Prestige \nsystem should be tweaked like, you will only get the access/profits/services directly \nproportional to what you have contributed to the community HF! Obviously, this needs \nan extensive brain-storming; but the outcome can make wonders.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=640835][i]-BTB™[/i][/url][/align]\n\n[i]\"Prestige is something that at first many people thought was complete and utter \nrubbish but when Omniscient started to say that \"Prestige\" would be used for all kinds \nof things once it was fully implemented everyone started to embrace it. People have less \nthan 100 prestige and they think it's something to be proud of and then people have 700+ \nPrestige which is huge and they also are proud of it. I guess we'll have to wait and see to \nfind out what it shall be put to use for.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=330676][i]-Diabolic[/i][/url]\n\n[align=right][i]\"I feel that the prestige system is pointless to most members, compared to \npost count and reputation, but necessary to Omni. It truly does show the quality of \nmembers, yet it doesn't get as much recognition as it deserves. Nobody is sure of the exact \nalgorithm or purpose, but it wouldn't be there if it was pointless. Some things are better to \nkeep secret, I suppose.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][i]-Phytrix[/i][/url][/align]\n\n[i]\"Prestige is retarded and useless. Until Omniscient changes something up, it will stay that \nway as well. Why release a feature if it has no purpose? You don't. \"Here, you can have this \ntime machine. Oh, no no no, take it! ...Oh, I almost forgot to tell you: I wont be telling you \nhow to use it, and it isn't possible for you to figure it out.\" It's dumb. Screw you Prestige.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][i]-Heir[/i][/url]\n\nThe topic for next week is \"What's your favorite thing about Hack Forums? Explain?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ibp2rMbsXoG0FI.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ib0OtwCfdQTN4z.jpg[/img][/spoiler]\n[spoiler=][img]http://i.minus.com/ibqDnY7BzOAoEf.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=xQ-Tp5WYs3I[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[color=white][b]Awards[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=600771][b]Αnonymous[/b][/url] got the Sticky man award for creating a [url=http://hackforums.net/showthread.php?tid=2609029]thread[/url] on networking.\n[url=http://hackforums.net/member.php?action=profile&uid=765374][color=#0066FF][b]Crash™[/b][/color][/url] got the Jokester award for eating cat food and hot sauce.\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=111287][color=#0066FF][b]xvisceral[/b][/color][/url] is no longer a leader of BlackShades.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://goo.gl/nN5aK]RDCA[/url]\n[*][url=http://goo.gl/eswtU]SoulZeh[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/iIaDf]PyroStorm[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}