{
  "posts": [
    {
      "pid": "25865017",
      "uid": "515249",
      "dateline": "1345955404",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#9f2dc5][b]106th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\r\n[color=white][b]New Section[/b][/color]\r\nEarlier this week, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] created a new section under the recently introduced Money tab named \"Survey Says\". The section was created for the discussion of making money with surveys. To view the new section, click the following link: http://goo.gl/tGCqY\r\n\n[color=white][b]Gaming Tab Reorganized[/b][/color]\r\nIntroduced on Wednesday, was the DayZ Mod forum. This forum, persuaded after various popular suggestions, contains nearly 500 fresh threads already! In addition to that, the FPS and Military Style Gaming section was added. This newly introduced section contains four active subsections, and was created for organisation purposes. To view the FPS and Military Style Gaming section, click the following link: http://goo.gl/TlzdB\r\n\n[color=white][b]Auction For Respawn Leader Slots[/b][/color]\r\nEx-Mentor Astonish has decided to step down as head of Respawn. As such, he is now auctioning off two leader positions for the group (one of which is the head position), starting at $110 each. Astonish will still remain the owner of Respawn, although due to unknown reasons, it seems that he no longer wants the added responsibility of sole leadership. To view the auction thread, click the following link: http://goo.gl/iBb3F\r\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\r\n[color=white][b]User News[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=661940][color=#00FF00][b]bugga[/b][/color][/url] was promoted to Staff! She also had her reputation reset.\r\n[url=http://hackforums.net/member.php?action=profile&uid=285755][color=#0066FF][b]Cody8295[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=879431][b]Pali[/b][/url] reached 10,000 posts. Congratulations!\r\n\n[color=white][b]Repfucks[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=723185][color=black][b]KoolDude87[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=946680][color=black][b]Ignite.[/b][/color][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1269097][b]σмgιтzσявz[/b][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=706994][color=black][b]Blic[/b][/color][/url] was repfucked... twice.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1232764][b]Adversary[/b][/url] was repfucked.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1336368][color=black][b]HappySmile[/b][/color][/url] was repfucked.\r\n[/list]\r\n\n[color=white][b]Bans[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1007343][color=black][b]BELLAGIO[/b][/color][/url] was vacation banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=723185][color=black][b]KoolDude87[/b][/color][/url] was banned for advertising a rival forum.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=946680][color=black][b]Ignite.[/b][/color][/url] was banned.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=706994][color=black][b]Blic[/b][/color][/url] was banned for reputation hinting.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1336368][color=black][b]HappySmile[/b][/color][/url] was banned for flaming.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=507599][color=black][b]Bєηєνolєη¢є™[/b][/color][/url] was banned for harassing members.\r\n[/list]\r\n\n[color=white][b]Awards[/b][/color]\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=600771][b]Αnonymous[/b][/url] received the Gavel of Dredd award for being \"100% blackhatter in my eyes\" (JD), even though he isn't blackhat.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=1011113][b]Dan.[/b][/url] received the Gavel of Dredd Award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=451192][b]Existence[/b][/url] received the Da Bomb award.\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=330676][color=#0066FF][b]Diabolic[/b][/color][/url] received the 24k award.\r\n[/list]\r\n\n[color=white][b]Group Leadership Changes[/b][/color]\r\n[url=http://hackforums.net/member.php?action=profile&uid=657392][b]Astonish[/b][/url] is now selling two leadership positions for Respawn. Read more about it [url=http://hackforums.net/showthread.php?tid=2793507]here[/url].\r\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2803589][b]Rapists get visitation rights to there child in 31 states.[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=962852][color=#FFD700][b]thought+inquiry=truth[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2808553][b]Proof that there is no God.[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=962852][color=#FFD700][b]thought+inquiry=truth[/b][/color][/url] - [url=http://hackforums.net/forumdisplay.php?fid=128][b]Is There a Fundamental Difference Between Men and Women?[/b][/url]\r\n[url=http://hackforums.net/member.php?action=profile&uid=571039][b]131[/b][/url] -[url=http://hackforums.net/showthread.php?tid=2791811][b] Why do you pray for someone when they're having a hard time?[/b][/url]\r\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1044864]malichi[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome malichi to the 106th edition of the HF News. This week, we have SRPP-themed interviews. I'm sure the SRPP fans will be happy to see the 2 interviews this week, and I'm more than aware that this has been highly anticipated. Any shoutouts before we get into it?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: Thanks for having me Phytrix, and thanks for the interview. I usually try to decline these, but I'll just apologize to anyone I missed who knows I am a friend right off the bat; thanks to Poppins and Zerg who got me started and encouraged me to post more, and to my friends Mr. Anderson, Yellows, malichi, Grin, Damn., thought+inquiry=truth, Wind, Moralitas, Wretched Messiah, Symbiotic, and at least a dozen more I am doing a great disservice to right now by forgetting.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure all of those members will appreciate that. Religion is a major sector of the SRPP section, and is a huge topic around the world. Which religion do you follow, if any, and why?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: I am actually somewhat well known for being a very strident and outspoken atheist. Some even consider me an anti-theist (which I don't mind). Not to make this interview a soapbox, but I think that religion, and specifically organized religion, is a threat to civilization. So I regularly try to educate people about some of the things I find most disturbing about it.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's quite true, and I'm glad you have logic behind your beliefs. The next question was suggested by malichi. What are your views on ObamaCare, and why?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: I think it is interesting that everyone now calls it ObamaCare when the term was invented as a pejorative. ObamaCare is a perfect example of how Republicans can convince their base of anything regardless of the facts.\r\nAs someone who lives in one of the many many nations which has universal healthcare I find it insane how half of Americans have been duped into hating something that will only drive down costs and increase access. Most people do not understand, especially those ranting about not wanting to “pay for the lazy”, that you are already paying for all those uninsured Americans. Currently America pays roughly twice per citizen what the next nation in the world pays because the uninsured simply wait to seek medical care till it is an emergency room issue, which is more expensive and ends up being absorbed by the hospital and then the government.\r\nThe thing that most people misunderstand (mostly because Fox “News” lied to them) is that it would simply be taking the money the government is already taking from you, and showing you what you are paying. It is not a new cost, except to convert from the currently failing system to a slightly better one (which is still not universal health care, just less shitty than what you are doing.\r\nI think if more Americans were spoken truthfully to about the plan then the original plan would have passed and Americans would have more freedom, more choice, and better quality insurance service today… things I constantly hear Americans demanding from every other industry. Instead you have a crippled plan trying to improve a crumbling infrastructure that was already 37th in the world 12 years ago.\r\nPeople don’t even know what they are fighting against: http://img29.imageshack.us/img29/5520/ss20120820173640.jpg\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: The media certainly does have a way of portraying different topics in different lights. You stated towards the end that \"people don't know what they're fighting for\". I suppose this directly relates to a lot of wars around the world. Mostly first-world countries send in their troops for reasons other than peace or management. They send them in because their allies did, for oil, for money, or even to destroy an upcoming financial giant. What are your views on this?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: Actually I said “fighting against”, and I meant exclusively with regards to those adamantly against a public option for healthcare, especially like those in my image (if you end up using it), who already have federal healthcare.\r\nWell the wars are a tricky subject. On the one hand I know that Saddam Hussein had done at least 4 of the things that the UN rules say can have a country lose it’s sovereignty and be invaded over, but no one can say that it was right to have lied about WMD’s to get in there.\r\nYou’re the one asking questions here, but do you really think all these wars have been over oil and money? I think it is far more transparent than that: Bush was a cowboy defending daddy’s honor and Obama was walking the fine line between helping a nation free itself while not appearing to be a bully.\r\nSo I do not support killing people, but I think the international community is right to get involved in stopping genocides and injustices.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I don't think all wars are over oil and money, no, but I'm positive that thousands of death has occurred as a result, and that various countries have travelled into diferent countries to do such. Anyhow, moving on. As you are an athiest, I presume you believe you have your own theories of how the world was created. What are they?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: A common misconception is that atheists must have, or share, some creation idea just because we call agree that creation happened. Unfortunately I do not yet side with any one explanation of what came before the Big Bang because no one has enough conclusive evidence for me to be convinced. I'm waiting to be impressed by a theory.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, that's definitely one way of seeing things. Another controversial topic over the last few years is equal gender rights. There have been discussions on HF of where the line is drawn between the morality of various topics, such as the controversial topic of hitting women. What are your views on gender equality?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: Once a week someone will post that women have gone too far, and once or twice a month a thread will inspire three, all ranting about how women should expect to get punched in the face just like a man if they really want equality. It is simply bullshit misogyny mascaraing as caring rights supporters who just want women on equal footing.\r\nSociety is portrayed in these discussions as though we lived in the wild west and fist-fights were a common occurrence and that women were exempt from retaliation in this lawless world.\r\nI acknowledge that women's rights have catapulted ahead of what they were 100 or ever 50 years ago, but I think there are still some areas that need some work, and this can be proven by turning on any news channel at 6pm this week and watching for the pro-rape comments that some people let slip out. (I could go on, but I’ll just be clear: I don’t think they are all gentle flowers in need of saving by suited knights, but not enough people in the world see them or treat them as even close to equal, till they are, I support standing with them in solidarity.)\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I completely agree. One of the featured threads on the last HF News edition was \"When should parents hit their kids?\", created by the user Maroon 5. I suppose the definition between violence and discipline is quite close, and it's quite a touchy topic. So, should parents hit their kids? If yes, when and under what circumstances?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: Unless you have to dive-tackle your kid to save him from an oncoming car or swat his hand from moving towards a flame (or some other non-disciplinary unique situation), then there is no instance or context where violence is an acceptable tool to educate children.\r\nI have been in countless debates here and in life with parents who justify spanking because it is \"gentle\" or that it \"worked for them\" or even that \"and I turned out just fine\"; never once has anyone ever presented even one study that showed spanking or similar child-violence to be in any way better than non-violence. In fact, every modern study says the opposite, that spanking has damaging and harmful, while non-violence is just as effective as spanking (usually more so) without those dangers.\r\nEducating people by making fear painful repercussions is not done in any other place in society, why continue allowing it on our innocent children, the ones we pledge to defend and protect the most.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Some things in the world are pretty messed up, and will continue to be with different levels of morality, and different definitions of right and wrong. What's the biggest issues, in your opinion, that corrode the world in our modern day of life?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: Religion.\r\nThere are other issues like poverty, and war, and intolerance, but I am confident that without religion, all of these things would be lessened or gone.\r\nI'll take the most extreme point I made; poverty. If the Church were handing out seed kits and condoms in Africa instead of supporting the spread of AIDS, if women were empowered instead of oppressed as religion has always encouraged, and if theocratic governments and war mongers did not have a stranglehold on the resources, then poverty would be drastically decreased. And I can do the same for most other major global issues.\r\nJust ask the countries with the largest irreligious populations, who are not coincidentally regularly named the happiest countries in the world and those with the highest life expectancy: Sweden, Denmark, Norway, Finland, Netherlands, etc…\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well malichi, I'd like to thank you for blessing me with the honour of your presence over the course of this interview, and thank you for sharing your knowledge and logic. Any final thoughts/shoutouts before I let you get back to things?\r\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][color=white][b]malichi[/b][/color][/url]: It has been an honor as well and I thank you for the opportunity. With only a couple of interviews done each week and the hundreds of people more well known than I, I never assumed I would see my name up there so soon. Hopefully I have not been overly polarizing to your readers.\r\nI know I probably missed many friends, but I'll also say \"s'up bitches\" to all my fellow Serenity and Logic members. \r\nAlso, for everyone PM'ing me about the secret to getting into Serenity, it's PM'ing Dan. the secret password between noon and midnight on weekdays only. \r\nCode: \"IRJUS2MATURE4U\"\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url][/font][/size][/color]\r\n[spoiler=]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Hello HackForums! Today, we have Apathy here; an active debater, and one of the more well-known members in the SRPP section. I can say with great honour, that I'm pleasured to have Apathy here with us today, and I'm sure all the SRPP fans have similar thoughts. Any shoutouts?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: Thank you for this interview. I do have a few shoutouts. I'd like to give a shoutout to malichi, Mr Kewl, Mr Anderson, Harry Dresden, and Strokes. I may be forgetting some, so I'd like to give an additional shoutout to everyone active in the SRPP section.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Great to see so many quality names up there. So, before we get into the technical stuff, what brought you to HF, and what were your plans between then and now?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: I originally joined HF because I was interested in computers. I wasn't really looking to be a 'hacker', but I did want to learn about programming. I was also interested in Linux distros. I was at first discouraged by the tecnicalities of it, but I am now majoring in Computer Science. In all honesty, I still am not an expert on programming, as I haven't entered into any of my core classes. I have since frequented SRPP more than any other section. There are subject in SRPP that I already have a good amount of knowledge on. My main goals in SRPP is to have contructive debates, teach and learn from other members, and remain active.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds interesting. The SRPP section, and the group subforums focused around SRPP (Serenity and Logic), are highly considered as some of the more intruiging and intelligent areas of HF. How do you think these subforums are managed, what would you change if the opportunity arose, and what's the difference between these subforums in comparison to other sections?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: I have to say that the SRPP section is seemingly the worst managed section out of the three you have listed. I use the word seemingly, because it seems to appear that moderators are not doing their job, but in reality, it is the fact that it is publicly accessible, hence vulnerable to trolls and people who enjoy harrassing others. I also feel that the SRPP section is often flooded with redundant topics, such as those in relation to 'Illuminati Conpiracies'. It's quite disappointing to see the same topics continually. On the other hand, the SRPP section does offer positives; such as many high quality members, and an unbelievable amount of information on computer related topics. As for Serenity and Logic, they are both similar, yet distinct groups. I know there has been controversy concerning the similarities between the two groups, however, they are both two seperate families.\r\nThey may have a similar group description, as with many other groups, but they are very different as far as the atmosphere within them goes. Both groups are managed well. I can contrast that Logic is a group that is still in the process of being shaped, while Serenity seems to be in a state of equalibrium. This is due to the fact that Logic is a new group, while Serenity has been around longer. They both offer a troll-free zone and a generally higher degree of quality in comparison to the SRPP section.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: As both Serenity and Logic are invite-only for the mostpart, despite the strict, hence rare, application process (for Logic), I see as to why they are managed so well, and stay quality. You mentioned your disappointment in relation to redundant topics such as 'Illuminati Conspiracies', and threads alike. What are your views on these far-fetched topics, and how do you think they have an affect on the sections, or even the world as a whole?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: Well, I think these topics definitely deserve dicussion. As an advocate of individual rights, I feel that everyone has their own right to free speech. I think these topics should be discussed, although not to the point where the same information is provided in two new threads - every day! I feel that they have a place, but that the topics should be more in-depth and specialised, rather than a vague statement, such as \"Do you believe in abortions?\" In my personal opinion, conspiracy theories are generally irrational beliefs. Studies show that they are often weapons used to attack political parties or organisations, especially those in a state of extreme power. I believe that the repetitive topics generate a lack of enthusiasm towards the topic. It promotes apathy (no pun intended) to the topics being discussed. When new topics are introduced, it is refreshing and gives more areas to be explored and discussed.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I completely agree. Topics that are constantly revisited become washed-out and pointless over due time. You mentioned that you are an advocate of individual rights. The only fundamental right, as the rest are dependant, and that is a human's right to personal decisions and actions. Of course, a world without law and limits would be havoc, so where exactly does one have a right to draw the line?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: You are certainly correct to state that a world without law and a certain amount of control would be chaotic. I would readily degree with an anarchist on this claim. As stated by Ayn Rand, a famous philosopher and novelist, \"The only proper functions of a government are: the police, to protect you from criminals; the army, to protect you from foreign invaders; and the courts, to protect your property and contracts from breach or fraud by others, to settle disputes by rational rules, according to objective law.\" Many believe that Governments should play a larger role than this. People with these views provide some good arguments, but I assure you that the more power Governments gain, the more individual rights that are trampled upon.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, we've all seen what happens when Governments gain an excess of power. It's usually focused on one, or a small group, of people, which usually leads to some kind of dictatorship or oligarchy. Niccolò Machiavelli sees power as \"a complex strategic situation in a given society social setting\", although not everyone shares this view. Do you think it's possible to change the world without taking power without using revolutional parties? How?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: To answer your question, I do not advocate any use of physical force unless it is in the act of self-defense. If an individual is being harmed, then I believe that they should always defend their lives by whatever means necessary. However, I do not believe that physical force and violence is the most ideal way to counter-act an oppressive Government. It is often the case that violent revolutions promoting freedom overthrows a Government and the revolutionists become no better than their preceders. Therefore, I would advocate fighting an oppressive government peacefully. Peaceful protests, the spreading of literature, and having the message echoed through other forms of media can be suprisingly effective. I'd only say violence is a necessary reliant as a last resort.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Most definitely. While we are on the topic of violence, it quite often leads to wars (perhaps not civil wars, or wars between countries, but wars between organisations, or even individuals). Revenge is sweet, without a doubt, but is it worth it? Does it truly accomplish anything, and is revenge even worth seeking?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: Revenge is absolutely not worth. Revenge seems to be an act of emotion. The person who hopes for revenge has let their thinking be possibly clouted with anger, pain,   embarrasment, and/or other negative emotions. I see an action based off emotion as an irrational action. I believe, as humans, we should allow our reason to override our emotion. I do not leave out the idea that it may give the person immediate satisfaction. However, I think it would be more ideal if the person feeling revengeful try to work on better themselves in a more peaceful manner. There is plenty of therapy a person could recieve if it goes to that level. The reason I say this is that it is ultimately not worth seeking. I will  speak on revenge in a manner where a person is out to physically harm another from here on.  One, I do not see a civilized society as one where people act on their agression, and harm other individuals. This is a practice that is sure to undermine the idea of objective law. It is justifcation based on irrational thought. Another reason I don't think this is beneficial, is that it is not in the person who seeks revenges' ration self-interest. In modern society, this often results in negative consequenes such as imprisonment, restitution, and a form of shunning from society. When I say \"shunning,\" I mean that civilized people tend to avoid agressive, harmful people. This can defintely hurt a person's social life, and their career.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Perhaps it may considered aggressive and uncivilised, although it is human nature to seek revenge. What aspects of human nature do you think need to be altered, and how should people go about altering these aspects?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: I think the three main ascepts of huma nature that need to be altered are intolerance, inability to adapt, and wrecklessness. Intolerance is only regressive. The unadaptability within humans comes at their own expense, and I don't believe anyone considers wrecklessness to be a positive attribute for survival, with exceptions, such as those who make a living off of such acts. I will say that I don't believe anyone is forced into any behavior. I feel that they may be programmed to have predisposition to such behaviors. With that being said, I believe a peron's reason can overcome these negative behaviors. That can and should be done through education. Therefore, I would consider education the key to escaping from these plagues found within human nature.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Knowledge is definitely a powerful weapon, and will continue to be for all time. I can't help but to progress onto the topic of religions. What religion (if any) do you follow, why, and what do you think about all of the threads/posts in relation to religions?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: I could best be defined as an agnostic atheist. In other words, I hold the belief that there is almost certianly no god, but I still leave the slight possibility open that there may indeed be a god(s). I will rightly assert that this position is the only rational position that a man can take. There is absolutely no evidence for a god. A theist can only hang their hat on faith. Theism can not lend any viable support for its conclusion.  I'll give one example of the irrationality found within theism. It is popular for a theist to claim that the world is too beatiful, too complex, too emmerisve to not be created by a creator. It is claimed that the complexity demands a god. This is illogical. Surely, the intelligent creator would need to be superior in complexity compared to the world. therefore, who creates the creator? If the complexity of the world demands such a creator, then the complexity of the creator will also demand its own creator. Here, we run into an infinite regress of Gods. Every creator needs its own creator. It is much more sensless than rationally believing in evolution and the Big Bang Theory. As for the threads about religion, I enjoy them more than any other topic. People argue that it is unproductive to have religious debates, but that is not so if the people debating are well-educated on the subject. One negative though is the same, vague discussions being posted. Instead just dicussing \"Does God exist?\" I'd rather discuss a much more specific topics such as Saint Thomas Aquinas' proofs for the existence of of God.\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's definitely a decent take on a popular topic. I'd like to thank you for joining us all today Apathy, and spreading your wisdom with the wider HF community. Any final thoughts/comments/statements before I let you go?\r\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=white][b]Apathy[/b][/color][/url]: I'd like to say thank you for this unique oppurtunity to be interviewed. I'd also like to note that the HF News is an undeniable positive for the HF community. It helps members have a sense of involvement and familiarity with other members in the community. With that being said, I hope the HF News continues to better Hackforums. I hope that Hackforums continues to grow, along with the HF News.\r\n[/spoiler]",
      "subject": "[8/25/12] - HF News"
    },
    {
      "pid": "25865033",
      "uid": "515249",
      "dateline": "1345955431",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][img]http://i.imgur.com/F2hfZ.png[/img]\n[video=youtube]http://www.youtube.com/watch?v=Z1V7VShsKsQ[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Prince Harry Nude[/b][/color]\nSome may have already heard, but multiple pictures on Prince Harry NUDE are loose on the internet. The Royal Family is furious with about the entire thing and well... it doesn't look good for the prince. Supposedly the prince was at a Veags party with two male friends, they then brought the party back to the hotel room along with a bunch of chicks (no pollo). It escalated from there and.. Well, you got the idea.  \n\n[color=white][b]LL Cool J Kicking Ass![/b][/color]\nSomeone actually made an attempt at breaking into LL Cool J's house. The intruder stepped into Cool J's house and instantly triggered the alarm system. Of course the alarm awoke Mr. J and he 'detained' the masked bandit until police arrived. The intruder will be charged with burglary and suffered bruises along with (reportedly) a broken nose.\n\n[color=white][b]Carl's Jr Anyone?[/b][/color]\nThis may not be the most important thing going on in the world right now, but I thought you all might like it. Carl's Jr. is coming out with a new line of commercials that most of you will find quite intriguing. \n[spoiler=][img]http://puu.sh/YClH[/img][/spoiler]\n[spoiler=][img]http://puu.sh/YClV[/img][/spoiler]\n[spoiler=][img]http://puu.sh/YCmp[/img][/spoiler]\n[spoiler=][img]http://puu.sh/YCmG[/img][/spoiler]\nYay for fast food!\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nAccording to a report from AllThingsD, Apple will be unveiling it's new iPad Mini in October, 2012. With iPhone 5 scheduled for launch in September, Apple has planned to launch iPad Mini the very next month to arouse further interest. Further details on the iPad Mini, such as specifications or design, isn't yet available. Although, Apple has clearly stated that fans are going to be treated with two brand new products later this year. Some would say that's a subtle way to tell fans to start saving...\n\n[color=white][b]Amazon [/b][/color] \nAmazon has announced that it's going to release the newer version of the Kindle Fire this September. This long awaited upgrade has been anticipated for months, and since the release of the original Kindle Fire last year, the Amazon team has been working around the clock to create this masterpiece. Rumors says that the newer version will have a bigger screen, include a built-in camera, have a higher resolution display and also be thinner than the previous version. Regarding the price, it's expected that Amazon will reduce the current version to around $150 USD and the new one priced at around $200 USD for the 8 GB version, and $250 USD for 16 GB version. Apparantly, Amazon will also increase its security against social-engineers in the coming months.\n\n[color=white][b]Facebook[/b][/color]\nFacebook had two major updates this past week. One of which is in relations to the Facebook app for iOS. The previous version has been scrapped, and a newer version has been designed. The reason behind this change is that the old app contained HTML5, which had issues running smoothly. So, they developed a newer one which contains iOS as native, which results in the app running smoothly. Some speculate that this change may create an issue for developing a multi-platform app. The second update was Facebook's design message. The new design appears to be similar to e-mail clients. \n\n[color=white][b]Twitter[/b][/color]\nTwitter has implemented severe rules with its 'find-friends' function with it's affiliates over the past few weeks. After the removal of Instagram, Twitter has removed the blogging service Tumblr from it's find-friends service too. In regard to this change, an analyst Rob Enderle stated \"These different services want to make sure that other companies can't come in and cherry-pick things that are generating revenue, so you're seeing a higher degree of restriction on third parties that build apps on top of theirs.\"\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Lil Wayne Laughs at Chris Brown/Drake Brawl[/b][/color]\nAfter the recent disputes between Chris Brown and Drake, Lil Wayne, a modern day rap sensation, has finally commented on the matter.\n\"Honestly, I laughed at them\" said Lil Wayne. \"I can't front, I just laughed at them... like, it's funny to me. I thank God I ain't going through it though, I've already been through too much.\"\nPossibly based on Lil Wayne's past, his thoughts on the incident are a little more reposed than others.\n\n[color=white][b]Music Video of the Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=DcJFdCmN98s[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI'm tired. You should be tired. Go get some sleep.",
      "subject": "*"
    },
    {
      "pid": "25865217",
      "uid": "515249",
      "dateline": "1345955884",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you think of \"Curiosity\" and our exploits on Mars?\"\n\n[i]\"I think it's great and an amazing achievement that we finally got a mars rover working on \nmars. We will soon be able to see the landscape of mars from a first person perspective, who \nknows what waits ahead of us on the surface on mars.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1058305][i]-Ida[/i][/url]\n\nThe topic for next week is \"What do you look forward to in the future?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iTtHHybkkVwXt.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ipVL6nIF9xcdk.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/iLeBw3pTJJqDG.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=xOZLIZHY9wY[/video][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=570186]TheHackersLove[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}