{
  "posts": [
    {
      "pid": "19800282",
      "uid": "515249",
      "dateline": "1328763780",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]78th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n---\n\nGotcha again! You thought it'd be another trick :)\n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]Major changes in reverence[/b][/color]\nOnce again Reverence has removed all of its members, except this time with an interesting twist. The leaders of the group, Astonish is NJ and King, decided to rename the group \"Respawn\". They have also decided to convert the group into an all gaming group, which is a nice change for HF considering this will be our first group dedicated fully to gaming. To read Astonish's announcement thread click the following link: [url=http://goo.gl/o9xUr]http://goo.gl/o9xUr[/url]\n\n[color=white][b]Pow3r group and rep reset updates[/b][/color]\nMany members have been asking about the rep reset and when the pow3r group will be released. Unfortunately there has been minimal information given, so as of right now there is no set date for the release of the power group. However Omniscient did post in regards to the release of the Pow3r group saying \"Soon. No other info at this time.\"\n\n[color=white][b]Member of the month voting[/b][/color]\nIt's that time of the month again, Judge dredd has posted the voting thread in the MOTM section. There have been a few reports of votes no being counted, however this issue will be fixed shortly. To view the Member of the month voting thread click the following link: [url=http://goo.gl/t97vY]http://goo.gl/t97vY[/url]\n\n[color=white][b]MyBB update[/b][/color]\nAfter a few minutes of downtime Omniscient posted an announcement thread stating that HackForums has just updated to version 1.6.5. There have been a few bugs reported, however it seems they have all been fixed. To read the announcement or to report a newly found bug click the following link: [url=http://goo.gl/hK0E7]http://goo.gl/hK0E7[/url]\n\n[color=white][b]Account closure[/b][/color]\nOmniscient recently tweeted that he closed 12 thousand regular accounts due to inactivity. Although this isn’t anything unusual he said that this was to prevent stolen aged accounts. To view Omniscient’s tweet, click the following link: [url=http://goo.gl/KGZjs]http://goo.gl/KGZjs[/url]\n\n[color=white][b]Introduction section removed[/b][/color]\nOn the 8th Omniscient decided to finally remove the introductions section. The reason being that there were too many low quality posts in the section and as said by Omniscient “I think we can all live without the \"welcome to HF pm me if you need help\" posts.”  The MOTM subforum has also been moved to the Site News section. To view Omniscient’s announcement thread click the following link: [url=http://goo.gl/bRhsf]http://goo.gl/bRhsf[/url]\n\n[color=white][b]Rats Crew removed[/b][/color]\n“RATs Crew is deleted. I'm not going to put up with any BS from it's leaders.” said Omniscient after removing the well-known black hat group RATs Crew. It has been known for some time that HF’s admins weren’t very fond of the RATs Crew so that may be what Omni was referring to in his tweet. Click the following link to read Omni’s tweet about the removal of the group: [url=http://goo.gl/RT5Go]http://goo.gl/RT5Go[/url]\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b][color=white]xerotic[/color][/url][/b] - the well known member and mentor has reached 1000 reputation!\n[url=http://hackforums.net/member.php?action=profile&uid=6307][b][color=white]Zammyslave[/color][/url][/b] - Wraith leader recently had his account stolen causing him to be banned for a couple of days he seems to have regained ownership now though.\n[url=http://hackforums.net/member.php?action=profile&uid=426299][b][color=white]Oldskool.[/color][/url][/b] - has reached the milestone of 1000 reputation!\n[url=http://hackforums.net/member.php?action=profile&uid=376588][b][color=white]Selena Gomez™[/color][/url][/b] -  was repfucked for requesting a vouch copy.\n[url=http://hackforums.net/member.php?action=profile&uid=272608][b][color=white]ShadowCloud[/color][/url][/b] - Eminence leader formerly known as Finarfin Palantir as changed his username.\n[url=http://hackforums.net/member.php?action=profile&uid=725160][b][color=white]King[/color][/url][/b] - Leader of Reverence has changed his username from McFlurry.\n[url=http://hackforums.net/member.php?action=profile&uid=187420][b][color=white]iDuL[/color][/url][/b] - reached the great milestone of 10,000 posts!\n[url=http://hackforums.net/member.php?action=profile&uid=1025222][b][color=white]Wre©ked[/color][/url][/b] - celebrated his birthday earlier this week!\n[url=http://hackforums.net/member.php?action=profile&uid=738154][b][color=black]MLD[/color][/url][/b] - was banned and repfucked for harassing a member. \n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=black]Raptured[/color][/url][/b] - was banned and repfucked right after MLD for the same reason.\n[url=http://hackforums.net/member.php?action=profile&uid=537927][b][color=black]χтяємє™[/color][/url][/b] - has taken a vacation ban.\n[url=http://hackforums.net/member.php?action=profile&uid=573368][b][color=black]bckc[/color][/url][/b] - was repfucked then banned for complaining about his repfuck.\n[url=http://hackforums.net/member.php?action=profile&uid=169783][b][color=black]Godly[/color][/url][/b] - was repfucked and banned for evading a ban.\n[url=http://hackforums.net/member.php?action=profile&uid=279242][b][color=black]Chronic[/color][/url][/b] - was banned and repfucked for abusing the Ub3r junk feature.\n[url=http://hackforums.net/member.php?action=profile&uid=731778][b][color=black]Lemonade[/color][/url][/b] - requested a vacation ban.\n[url=http://hackforums.net/member.php?action=profile&uid=927361][b][color=black]iFaTaLiTy[/color][/url][/b] - was banned for the reason \"HF Cloning\" by Omniscient.\n[url=http://hackforums.net/member.php?action=profile&uid=406243][b][color=black]WiFi.[/color][/url][/b] - Leader of Eminence was banned for \"Staff Problems\".\n[url=http://hackforums.net/member.php?action=profile&uid=883074][b][color=black]Wayne Rooney[/color][/url][/b] - was banned for complaining about being repfucked.\n[url=http://hackforums.net/member.php?action=profile&uid=320970][b][color=black]HakkuR[/color][/url][/b] - well known member and a well known seller has been permanently banned from HF.\n[url=http://hackforums.net/member.php?action=profile&uid=384998][b][color=black]Virtual-ization[/color][/url][/b] - was banned for posting adult content.\n[url=http://hackforums.net/member.php?action=profile&uid=520579][b][color=black]biasa199[/color][/url][/b] - was banned and repfucked for Impersonating members of HF.\n[url=http://hackforums.net/member.php?action=profile&uid=766442][b][color=black]Charizard ★[/color][/url][/b] - formerly known as \"SeaNanners\" was banned for the reason \"Tired of your random neg repping abuse.\"\n[url=http://hackforums.net/member.php?action=profile&uid=388560][b][color=black]Øueen[/color][/url][/b] - has been banned for vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=905109][b][color=black]Dashy[/color][/url][/b] - has requested a vacation ban.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]DDoS Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1357182][FREE] ♦ xDDoSeR 7.3 ♦[/url] - [url=http://hackforums.net/member.php?action=profile&uid=323740][color=white][b]Positive[/b][/color][/url] - The long awaited xDDoSeR has finally been released and is now up for grabs on the market. They are also offering a cool deal where you can take a survey and pay one dollar for access.\n\n[i][b]MOTM Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2176699]Some glaring MOTM problems. [JUDGE DREDD][/url] - [url=http://hackforums.net/member.php?action=profile&uid=361543][color=#0066FF][b]Scooter[/b][/color][/url] - Scooter has pointed out quite a few errors in the MOTM system and thread. Most of these errors have been taken in to account and are being worked on.\n\n[i][b]Coding/Propitious Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2173735]Propitious | Where to start Programming | | Language Information | | Resources.[/url] - [url=urlhttp://hackforums.net/member.php?action=profile&uid=356861][color=white][b]¤ Nick™ ¤[/b][/color][/url] - This is the first thing we've seen come from the depths of the latest group, Propitious. If you're new to programming or coding in general, read this thread.\n\n[i][b]Graphics Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2180218]Free Thread Design l Week #7 l FREE l More To Come l EARLY RELEASE![/url] - [url=http://hackforums.net/member.php?action=profile&uid=795825][color=#0066FF][b]Dr.Quickmodz[/b][/color][/url] - Dr. Quickmodz is giving away free thread designs, come quick and get the one you need!\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Suhinder[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Suhinder! Thanks for taking the time out for the interview!\n[b][color=#1466ff]Suhinder[/color][/b]: No problem, anytime.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Before we begin, are there any special users you would like to give a shoutout too?\n[b][color=#1466ff]Suhinder[/color][/b]: Yes, as a matter of fact.  While being an HF user I have encountered many users, now friends, that are very important, helpful, and kind.\n\nAs many interviewees, I will definitely forget some people, but they know who they are.\n\nTo start off, i'd like to give shoutouts to: bugga, modify ( JL ), Sir, You, Asylum, maniac ( now banned ), Mastermind, WiFi, iNviZ, THL, desugrace, JustinH, Orgy, Luke, Mark, LowKey.Gov, KyleFYI, Mr. QuickModz, Infinity, Okazaki, Phismatic, Rolls Royce, Raptured, Teruko, Tsgh Mike, Daring, Positive, Morchid, xerotic, Diabolic, and anyone on this list - http://screensnapr.com/v/cuAQou.png\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Now I understand you've made quite the splash in the MarketPlace lately, as I remember when you tended to stay away from that area - Do you have any advice who would like to start making profit on Hack Forums?\n[b][color=#1466ff]Suhinder[/color][/b]: Well, i'll talk about the topic of booters.  Due to the fact booters are easy to make and don't take much effort to maintain, nor knowledge, they're \"in\" right now.  Me being a coder, networker, developer, and manager, seeing all the booters with public, exploitable code, and booters that still use shells makes me furious.  I see these threads and products and I am baffled at the low-quality of the products.  It seems as if the owner is trying to just make some quick cash.  I, along with many intelligent HF users ( mostly developers or knowledgeable people ), do not tolerate it.  It's very frustrating.\nAs for the advice to start making profit, if you're not a developer, hire one.  If you are a developer, develop a unique project that you think will be an attraction to users in the forum.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That's great advice - The quality of the product is the most important thing if you want to have customers coming back for more. One bad product could ruin your chances in our competitive marketplace here on Hack Forums. Being original is also important. On the topic of originality - How did you come up with your online handle, Suhinder?\n[b][color=#1466ff]Suhinder[/color][/b]: I came up with my username awhile back.  I'd say about a year or more.  Many people on HF should know the YouTuber OwnagePranks.  He had a funny prank awhile back, one of his originals actually, and the Indian man that he prank called had a name \"Suhinder.\"  I thought it was funny, and started using it has a username and it has now become an online alias.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I understand you were a proud member of the new group, Propitious. I'm not very familiar with it - Would you like to describe the new group and what tasks you are expected to accomplish?\n[b][color=#1466ff]Suhinder[/color][/b]: Currently because it's a new group it's still branching out.  They are just starting something called \"Contribution Projects.\"   I have been kicked ( I still do not know why ), and hope to return to the group.  I enjoyed my time whilst in it, but for some reason assume I deserve to be kicked.  I followed the rules and guidelines, along with doing my portion of what is required, and got kicked.  Maybe it's just a tough group to keep a position in, I guess.  As for it's expected tasks to be accomplished, we'll just have to wait and see.  I think the group is lead by high-quality leaders that know what they're doing and will devote their time and effort into the group and it's quality.  It has many loyal members that are smart, and dedicated.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I just read your thread titled \"How to test the Input / Output of DDoS Attacks,\" and found it very imfortative, so I expect nothing less than that from other members of Propitious. If you given the privelege of administrator on Hack Forums for 24 hours, what would you do, and why?\n[b][color=#1466ff]Suhinder[/color][/b]: Yes. Thanks for the compliment on my tutorial.  I received countless private messages on how to test the speed so decided to make a thread clearly demonstrating how to, and I utilized it as a contribution thread for propitious.  If I was given the priveledge as an administrator of HackForums for 24 hours, and didn't have to pay for or maintain the website whilst the time was being spent, i'd lift all limits, and try to be a cool admin.  I'd probably also add a couple sections being networking and maybe take away some rules that I don't like. :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I think I would institute the P0W3R group that was talked about a while ago to give added benefits to members and more revenue for HF. I've gotten a few complaints that the interviews are too formal, and don't let the reader get to know the user very well so I'll try to personalize this a little bit. Do you have any pets?\n[b][color=#1466ff]Suhinder[/color][/b]: I agree with what you said about POW3R, I had forgotten about that while being asked the question on the spot.  I have two pets.  Both being dogs.  Well, my brother has a bird, but I never even interact with it.  One of my dogs is a golden-retriever and chao mix, the other is a german shepherd.  The golden is Jack, and the shepherd is CoCo.  Jack is 11, and CoCo is 8.  They're great dogs and I am with them for a portion of everyday.  I will post a thread encompassing pictures of them when I get the time.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Can't wait to see the pictures! I should post some sometime, as well as pictures of my  new rig. What's your favorite activity outside of Hack Forums?\n[b][color=#1466ff]Suhinder[/color][/b]: Yeah that'd be great.  I currently just finished a rig and posted pictures along with the specifications of all of my components.  I have many favorite activities outside of HackForums, but i'd say the couple main activities that I partake in outside of HF are playing Basketball, watching Basketball, and building or modifying computers.  I am from LA, and a die-hard Laker fan.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:\n[b][color=#1466ff]Suhinder[/color][/b]: No words for the readers besides enjoy reading this interview and thanks for picking me.  Hey, Celtics aren't that bad, but you should watch out for the Clippers and Heat.  Ironicly, I think those are the next two competitors in the 2012 NBA championship.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Thanks Suhinder!\n[/spoiler]\n",
      "subject": "[2/8/12] - HF News (Real)"
    },
    {
      "pid": "19800300",
      "uid": "515249",
      "dateline": "1328763816",
      "message": "[align=center][img]http://goo.gl/C6j11[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - iNviZ[/font][/size][/color][spoiler=]\r\n[b][color=white]Paradise.[/color][/b]: Alright! Hey iNviZ! How are you today? I'm glad you could take the time to have this interview with me!\r\n[b][color=#1466FF]iNviZ[/color][/b]: Good and thank you sir.\r\n\n[b][color=white]Paradise.[/color][/b]: Yeah, no problem. Before we start, would you like to make any shout-outs?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Oh yeah must give it out to Qwazz, Codevade, Bugga, Riggs and THL.\r\n\n[b][color=white]Paradise.[/color][/b]: Alright, cool! I like those members as well. Now, how did you get your name, \"iNviZ\"?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Back in Halo 2 around 2004 i had used the name but let it die. Shortly after i joined HF i chose to dig it back up.\r\n\n[b][color=white]Paradise.[/color][/b]: Oh, I see. So, what brang you to HF or how did you find it?\r\n[b][color=#1466FF]iNviZ[/color][/b]: A friend had showed me the site. I instantly  fell for the community as it just grabbed me. When your married hobbies are great. lol\r\n\n[b][color=white]Paradise.[/color][/b]: Haha, a HUGE majority of HF fell just as you did. So, tell me about being Mentor? Do you enjoy being a Mentor for Hack Forums?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Yes i do as it is an honor. Never gets old to me either.\r\n\n[b][color=white]Paradise.[/color][/b]: I couldn't imagine. Were you suprised when you were added to the Mentor group?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Yes it was very exciting i will say to be chosen.\r\n\n[b][color=white]Paradise.[/color][/b]: I'd be very excited as well. What do you think about the recent addition to Hack Forums; Propitious?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Well i am the leader with TheHackerslove and so far were doing are best with many tricks up are sleeve. I believe the group will go far and keeping its own style.\r\n\n[b][color=white]Paradise.[/color][/b]: Yes, it's a fantastic group. It's Hack Forum's new \"hot group\". Are you happy that you finally opened it with THL, and a question towards the group; What's the \"objective\" of Propitious? For example, Reverence is a coding / tutorial group, etc.\r\n[b][color=#1466FF]iNviZ[/color][/b]: Yes were happy it has been made. Objective's, there are a few but for now it's still in formation as we believe not to focus on just one or two for the group. To be honest why limit the group to members knowledge.\r\n\n[b][color=white]Paradise.[/color][/b]: Oh, I see. I think the group will go very far, and I'm sure everyone agrees. How about something funny; what do you think about Rihanna's \"Thug Life\" tattoo on her fingers?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Gave me a smile. I have many tatoos i wish i could remove from the past.\r\n\n[b][color=white]Paradise.[/color][/b]: That's what everyone says... I don't mean any offense to that. When you're young, you want a tattoo because it's totally hip. When you're older you wish you could get it removed, haha. Anyways, not to jump to topics.. Where do you see yourself in the future in relation to Hack Forums?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Honestly i see myself here. As i m married and have my career set as well. I wont be going off to colledge as i am set. Hf is my hobby.\r\n\n[b][color=white]Paradise.[/color][/b]: Oh, I understand. Very cool! Now, what do you think of some of the future updates to come to Hack Forums? Such as the long-waited, Vouch System and P0W3R?\r\n[b][color=#1466FF]iNviZ[/color][/b]: Omni always make a good choice, otherwise the forum wouldnt be as successful as it is today. I think it will be good and be nice to see a big change. So i am in for both.\r\n\n[b][color=white]Paradise.[/color][/b]: Do you think you would change, remove, or add anything to Hack Forums to make it better?\r\n[b][color=#1466FF]iNviZ[/color][/b]: If i could remove one thing it would be the useless threads made from upgraded members asking stupid questions that can be simply answered in the help docs. :)\r\n\n[b][color=white]Paradise.[/color][/b]: Don't we all.... Haha. Well, I think I've talked about everything I've wanted to tonight.. Do you have anything else you wanna talk about? If not, feel free to leave some concluding words?\r\n[b][color=#1466FF]iNviZ[/color][/b]: No and thanks.\r\n[b][color=#1466FF]iNviZ[/color][/b]: Rawdog a random\r\n[/spoiler]\r\n\n[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\r\n[color=white][b]Super Bowl XLVI (46)[/b][/color]\r\nSuper Bowl 46 will be on February 5, 2012 at the Lucas Oil Stadium in Indianapolis, Indiana.  The two teams making it to this event are the New York Giants and the New England Patriots.  The national anthem will be sung by Kelly Clarkson with Madonna as the half time show.  Who do you think will win?\r\nHere are some interesting statistics provided by Yahoo News about the Super Bowl:\r\n\"111 million. The record-breaking number of viewers last year, according to Nielsen.\r\n$11 billion. That's how much Americans are expected to shell out for Super Bowl goodies, ranging from football-shaped cakes to beer to personalized player jerseys. That's up from last year's total of around $10 billion, according to the Retail Advertising and Marketing Association.\r\n2 million. The number of pizzas Pizza Hut expects to serve up to hungry football fans Sunday. That amounts to 1,200 tons of dough and about 90,000 gallons of marinara sauce. Yum.\r\n100 million. The number, in pounds, of chicken wings Americans will scarf down while watching the game, according to the National Chicken Council's 2012 Wing Report. That equates to 1.25 billion--yes, billion--wings, which if laid end-to-end, would circle the Earth more than twice. Pepto-Bismol, anyone?\r\n1,200. The average number of calories the average armchair quarterback will consume, according to the Calorie Control Council, while wolfing down 11.2 million pounds of potato chips, 3.8 million pounds of popcorn, and 2.5 million pounds of nuts.\r\n12th. Where Indianapolis--the host city of Super Bowl XLVI--ranked on the list of the nation's most populous cities, according to the Census Bureau. The population of Indianapolis in 2010 was about 820,445.\r\n$103,000. The average amount companies dole out per second for 30-second advertising spots during the Super Bowl, according to Nielsen. Last year's biggest advertisers were auto companies, followed by beer companies, motion pictures, soft drinks, and tortilla chips.\"\r\n\n[color=white][b]iPhone Lottery[/b][/color]\r\nDue to the recent incredibly amount of scalpers for the iPhone 4S launch in mainland China; Apple stores in Hong Kong now require you to sign up for the lottery during the 3 hours applications are accepted daily, and win before you can even get in line.  These strict efforts to prevent chaos require you to sign up, then if you are a winner, you will get an email before 9PM allowing you to get in line to claim your iPhone 4S provided you have a government-issued photo ID with accurate information as the information submitted on the lottery.\r\n\n[color=white][b]Sean Penn[/b][/color]\r\nRecently, actor Sean Penn has been named ambassador of Haiti due to his humanitarian efforts of cleaning up Haiti after the last earth quake.  The ceremony was held on Tuesday, where the president said that the only downside was that every one couldn't call him by his first name, instead; Ambassador Sean Penn.\r\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\r\n[b][size=large]Apple[/size][/b]\r\n[color=white][b]TweetBot[/b][/color]\r\nTweetbot which is a leading Twitter client for iOS has released version 2.0. In this version, iPad support finally was released. If you have ever used twitter for iPad you know how bad the original Twitter client is. The sad part is that you will still need to buy it for iPad. 2.0 brings out some new features but a lot was left behind.\r\n\n[color=white][b]Apple TV[/b][/color]\r\nThe new Apple TV (TV set not the little box) is rumored to be in the hands of IPS’s in Canada. The TV is said to only be controlled by Voice and Gestures. Does that mean it will have Siri like capabilities and a camera? This could be a huge move in the TV industry and for Apple also. It was also rumored that the retail chain BestBuy had sent out a survey for the Apple TV.\r\n\n[color=white][b]iPad 3[/b][/color]\r\nThe iPad 3 rumors are now really heating. A new release of the latest iOS hints of a “iPad3,1” which indicates a iPad3. Its also rumored to have a better screen and LTE capability. Its also said its going to be released next month or maybe showcased next month. The date of the release has been rocky so there is not set date until Apple itself says.\r\n\n[color=white][b]iTV[/b][/color]\r\nThe infamous Apple TV. No, not the little small box they have now; but a full on TV set. Many blogs and websites have said that it will have “Siri” capability. Others are saying there is already a prototype that is hidden and only a certain some have seen it. Could it be the next revolution TV? It could be, but in time we will know.\r\n\n[color=white][b]iPhone 5[/b][/color]\r\nWell, that’s something just like the iPad3. Rumors cannot be trusted 100% of the time. The release date has been spectacle and really roughs for Apple rumor “releasers” to say for certain. People are waiting for another “Lets Talk iPhone” banner from Apple.\r\n\n[b][size=large]General[/size][/b]\r\n[color=white][b]BtJunkie[/b][/color]\r\nThe big P2P sharing website has closed down. Everyone knows how much shit P2P sites get; remember what happened to LimeWire? This could be a start of many sites shutting down. Megaupl0d was one of the biggest to shut down causing a big up roar. Keep on the lookout!\r\n\n[color=white][b][removed].com[/b][/color]\r\nThe Feds have done it. They have taken down [removed].com and arrested the owner Kim Dotcome, yes just like .com, for hosting illegal file and distribution of the files. Kim Dotcome was the #1 player on MW3 so it’s like taking off his kingdom. Anon or Anonymous was very angry at the taking down of MU and started to issue threats of bringing it back up or else. Anon also started to take down and attack Gov’t sites. There has been a lawsuit against the taken down of MU because it did host legal/legit files that people will never get back.\r\n\n[color=white][b]307 Domains Seized by ICE (Homeland Security Investigation)[/b][/color]\r\nThe feds seized 307 domains before the Super Bowl. There has been a lot of action by the Feds to stop these illegal domains. Could it because of SOPA not passing? Maybe a new bill is being proposed and they want to see whats happening.\r\n\nHere is what ICE had to say about it\r\n\n[quote=ICE]\r\nWhile most people are focusing on whether the Patriots or Giants will win on Sunday, we at ICE have our sights on a different type of victory: defeating the international counterfeiting rings that illegally profit off of this event, the NFL, its players and sports fans. In sports, players must abide by rules of the game, and in life, individuals must follow the laws of the land. Our message is simple: abiding by intellectual property rights laws is not optional. It's the law.[/quote]\r\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\r\n[color=white][b]Rihanna & Chris Brown[/b][/color]\r\nChris Brown will be performing at the Grammy Awards for the first time since the beating of Rihanna in '09. He has received three nominations.\r\n\n[color=white][b]Grammy choice practically predicted[/b][/color]\r\nAdele released the album [u]21[/u], which has put forth massive hits that have topped the charts for 19 weeks. She has received six Grammy nominations, second only to Kanye West (7.)\r\n\n[color=white][b]Lady Gaga's Upcoming Tour[/b][/color]\r\nLady Gaga recently revealed that the dates for her upcoming tour will be released later today or tomorrow. Fans are raving and she has even been partaking in conversation with them. [url=http://twitter.com/ladygaga]See her twitter![/url]\r\n\n[color=white][b]Xfm New Music Award[/b][/color]\r\n\"The Vaccines\" have received the [u]Xfm New Music Award[/u] for their album [u]What Do You Expect From The Vaccines?[/u]\r\n\n[color=white][b]Music Videos of the Week[/b][/color]\r\n[spoiler=]\r\n[video=youtube]http://www.youtube.com/watch?v=6yCIDkFI7ew[/video]\r\n[video=youtube]http://www.youtube.com/watch?v=UhC7M8KF7AE[/video]\r\n[video=youtube]http://www.youtube.com/watch?v=MejbOFk7H6c[/video]\r\n[/spoiler]\r\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\r\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\r\n---\r\nSome days, we are all just overwhelmed with responsibilities and activities, and some know how they cope best, while others do not. Whether this means they snap at their friends for simple things, or they hide in the basement with a gram of ganja. The thing to remember is that you have those days too, just try to sympathize and give them some space. More often than not, things will cool down and they will be fine again, but just try not to judge them for their actions during their time of pressure. Forgive and forget. \"Let bygones be bygones.\" - A famous sponge.",
      "subject": "*"
    },
    {
      "pid": "19800322",
      "uid": "515249",
      "dateline": "1328763847",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"Which sections are you most active it? Why?\"\n\n[i]\"I think I am the most active in the Marketplace section, because much\npeople are giving away handful eBooks, I can buy eBooks and can make \nmoney with them. I can sel my own stuff, and give away nice packages. \nI can learn how to monetize the best, and people can ask questions about \nprizing and appraisals.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=857518][i]-Verspil[/i][/url]\n\n[align=right][i]\"I am most active in the Marketplace as i am constantly buying \nand selling items. This website has introduced me to many different things i \nhave purchased which made many things a lot easier. I have made a little money \nbecause of the Marketplace too, selling my unwanted/unneeded items.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=822426][i]-iHaX™[/i][/url][/align]\n\n[i]\"I am mostly active in the \"HijackThis Log Analyzer and Tutorials\" and the \"HJT \nTeam\" sections. I spend most of my time completing and continuing my training \nlogs as an undergraduate for the HJT Team, so the \"HJT Team\" section is where \nI monitor my logs. The HJT Team is not just a \"team,\" but one of the most closest \nfamily on this website. We use the forum section to communicate and we like to \nbum around in the section. I also use that section in order to monitor all the current \ntrainees. I read their responses to the teacher to see what progress they are making\nin between logs. It's very entertaining to read the logs of the people who I, was once \nin their situation. It reminds me of the good ol' days. The \"HijackThis Log Analyzer and \nTutorials\" sections is where I spend most of my time helping individual members with \ntheir computer problems. I carefully take a look at a thread with 0 replies and read thei\n\nproblem and then their logs that need to be checked. Then I post my steps to help the \nuser. I think every user deserves to not be infected, because I once was infected and\n had Paradoxum clean my computer. That's why I joined the HJT Team. Other than that, \nI just log off HF.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=847499][i]-Brandenx781[/i][/url]\n\nThe topic for next week is \"How do you feel about the current state of Hack Forums? Compared to your join date.\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/IVdVH.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/2470778_460s.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/2457102_460s.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/2442954_460s.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=6htTcVxLqJI[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=946680]Ignite.[/url] got the [url=http://hackforums.net/myawards.php?uid=946680]Sticky Man[/url] award. (http://hackforums.net/showthread.php?tid=1980510)\n[url=http://hackforums.net/member.php?action=profile&uid=170785]Infallible[/url] got the [url=http://hackforums.net/myawards.php?uid=170785]MOTM[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=420630]Cute[/url] got the [url=http://hackforums.net/myawards.php?uid=420630]Sticky Man[/url] award. (http://hackforums.net/showthread.php?tid=2150734)\n[url=http://hackforums.net/member.php?action=profile&uid=656453]ReactionZ[/url] got the [url=http://hackforums.net/myawards.php?uid=656453]Protector[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=1011113]Dan.[/url] got the [url=http://hackforums.net/myawards.php?uid=1011113]Master Donator[/url] award.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]User News\n[*]Opinions[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/ltuzI]Morchid[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/piymJ]Innocence.[/url]\n[/list]\n[*][color=white][b]Web Show Co-Host[/b][/color]\n[list]\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/89giM]Ignite.[/url]\n[/list]\n[/list]\n",
      "subject": "*"
    }
  ]
}