{
  "posts": [
    {
      "pid": "8563860",
      "uid": "0",
      "dateline": "1293258070",
      "message": "[align=center][img]http://i.min.us/id67Tw.jpg[/img][/align]\r\n\nHello, and welcome to this week's very special HOLIDAY EDITION of HF News! I am Virtual Reality, and I will be filling in this week as Omniscient has yet to name a full-time reporter. It has been quite the hectic week, so let's not waste any time by getting right into the ever-important news that you as readers look forward to week in and week out. Without further ado, here are your HF headlines from the week of December 18 - 25, 2010!\r\n\n[align=center][img]http://i.min.us/id5Rq4.jpg[/img][/align]\r\n\nThis week, HF has gone through various changes. Early on, our administrator took it upon himself to upgrade our forum to MyBB 1.6x. Doing this allows for many new features to be enabled, and many glitches and bugs to be fixed. If you would like to read more on the implementation of this new update, please click [url=http://hackforums.net/showthread.php?tid=915715]HERE[/url] for more information. After the forum was upgraded, we experienced several hours of downtime due to ongoing errors and glitches. This is quite common as we are a large forum making massive changes to our system. If you would like to read more into the downtime we experienced, click [url=http://hackforums.net/showthread.php?tid=916346]HERE[/url].\r\n\n[b][color=#FFD700]--[/color][/b]\r\n\nAnother large decision made by Omniscient was the execution of a new procedure, called The Vacation Policy. Because of the overwhelming requests for temporary account closure in recent weeks, Omni felt this was needed. Many users are constantly asking staff for temporary bans when they go on leave/vacation for simple security reasons, and this new system will allow efficiency and security in the event that a member is in need of an account closure. It is important to note that members are only able to request account closures in increments of up to three months at a time. If you would like to read more, please refer to the official thread by clicking [url=http://hackforums.net/showthread.php?tid=907436]HERE[/url].\r\n\n[b][color=#FFD700]--[/color][/b]\r\n\nIn other news, after being in high demand for quite some time now, the [url=http://hackforums.net/forumdisplay.php?fid=122]Member Of The Month[/url] award has finally been re-instated. This award is distributed on a monthly basis to a user who represents quality posting, a positive attitude, and polite behavior. Since iBruteForce has stepped down, it seems Crow will be running this contest from this point forward. To read more into this or to learn how you can qualify, please refer to [url=http://hackforums.net/showthread.php?tid=920442]THIS[/url] thread.\r\n\n[align=center][img]http://i.min.us/id5ZNa.jpg[/img][/align]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=245853]Gabber[/url] posted quite the interesting thread this week, in regards to his personal forum feedback. This was a well-written thread with a nice layout, and it surely needed an honorable mention. Although the thread has now been closed and discussion has since been disallowed, you can still view it by clicking [url=http://hackforums.net/showthread.php?tid=919706]here[/url].\r\n\n[b][color=#FFD700]--[/color][/b]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=81182]\r\nz†cĸα[/url] and [url=http://hackforums.net/member.php?action=profile&uid=316020]Orgasmic[/url] received one-month bans earlier this week. The reason for these bans are said to be due to the fact that both users were misbehaving and undermining the authority of staff members through rule-breaking and utter disrespect. We wish the two users well and hope to see them return next month with a better attitude and altered ego's.\r\n\n[b][color=#FFD700]--[/color][/b]\r\n\nHF News would live to give an honorable mention to one of it's own writers, Ectoplasm. This user has generously upgraded over 30 members this week, in order to assist in spreading holiday cheer around the forum. Good job, Ectoplasm! We ask that everybody show their appreciation to this kind-hearted member. Supporting HackForums by upgrading users certainly is a good cause, and we here at HF News are happy to recognize his positive attributions.\r\n\n[b][color=#FFD700]--[/color][/b]\r\n\nHF News would like to extend a huge congratulatory mention to a widely respected and reputable user by the name of [url=http://hackforums.net/member.php?action=profile&uid=170785]Infallible[/url]. After much hard work and dedication, he has finally graduated as a now full-time member of the HJT Team! This is definitely not an easy task, and this wonderful user deserved much recognition for contributing in such an immensely appreciated manner. Thanks Infallible!\r\n\n[b][color=#FFD700]--[/color][/b]\r\n\nIf you have been online within the last few days, you have already noticed the awesome holiday banner created by [url=http://hackforums.net/member.php?action=profile&uid=93419]Minnesota Nice[/url]. He's a great guy and a friend of the HF News team, so make sure to thank him for keeping us all in the Christmas spirit!\r\n\n[align=center][img]http://i.min.us/id6bVi.jpg[/img][/align]\r\n\n[align=center][yt]http://www.youtube.com/watch?v=lQlIhraqL7o[/yt][/align]\r\n\n[align=center][img]http://i.min.us/id1Ba4.jpg[/img][/align]\r\n\n[i]Hey guys! I would just like to quickly address you all, while I have the chance. As the Christmas holiday is upon us, it is one of the select days of the year that I take the time to look back and acknowledge my appreciation towards differing aspects of my life. Because of this, I would just like to take the time to thank you all for supporting HF News over the past 7 months or so. Through many different editorials, writers, and transitions, you, our valued readers, have stuck with us through thick and thin. As 2011 approaches, there is no doubt in my mind that HF News will continue to remain as a strong and valued part of this forum. I am currently unaware of the moderator situation and who the user Omniscient will choose to be the full-time writer will be, but I wish everybody in contention good luck. Although things like consistency with writers and different creative articles are ever-changing, one thing I can always be sure of is the support and dedication of our fans. That is all. Please enjoy the rest of the edition, and be sure to have a safe and happy holidays! - Virtual Reality[/i]\r\n\n[align=center][img]http://i.min.us/id2aAc.jpg[/img][/align]\r\n\nSince this is the very last interview of 2010, I thought I would make this a good one. Today, we are in for a HUGE treat as we welcome Elektrisk into the HF News family. [url=http://hackforums.net/member.php?action=profile&uid=58608]Elektrisk[/url] is a widely-popular member here, and the informational yet controversial topics covered are sure to make this a great interview. Enjoy!\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] What were your favorite forum areas when you first joined? Have those selections changed since registering, and if so, what are your current favorites?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] When I first started, it was probably the HF L33T OT section, because people (especially prettykitty) would always post dumps which usually contained valuable logins like RapidShare, Xbox Live, Hotfile, ect. Now, though, it's The Lounge & Innuendo. I only really use the Innuendo section to post about my sexual experiences, seeing as how a lot of members enjoy reading them. The Lounge is a nice place to simply leisurely post without feeling like you're being tested on how good the content you're posting is.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] As many users are already aware, you are an openly gay individual. When was it that you knew you were interested in males, and how did it affect your life?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] When I was 11, I began to realize I was attracted to guys instead of girls like my peers. It made me feel like my life would never be successful, but around the age of 15, I began to realize that I had much more to live for than who I ended up choosing as my partner. In fact, I began to realize that I could make it on my own if I wanted. I also realized that peoples' opinions didn't have any effect on my life.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] Do your family/friends outside of HF know of your sexuality? If so, how and when did you come out to them?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] Yes. I simply told them outright that I was gay. I was 12 or 13 when I first told my mom.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] Before announcing your sexual orientation to the forum, did you feel any hesitation considering that there are many homophobic members?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] I had no hesitation at all, because it's just the Internet. What are they gonna do? Call me a fag? I've heard worse.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] You must obviously receive a lot of hate due to the always-eminent discrimination towards homosexuals. How do you deal with all of the animosity?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] I've built an emotional barrier against any and all harrassment. I have learned to give focus to the poisitive points in life.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] Do you have any words for members who might not be exposed to homosexuals in their everyday life, and who may feel any sort of disgust or hatred towards individuals interested in same-sex relationships?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] Yes. I'd like to tell them to keep to themselves, as what happens behind closed doors has no impact on what happens in their life.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] There are evidently many users on the forum who are closeted homosexuals. What advice do you have for these certain members?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] Be who you are, because those who mind don't matter, and those who matter don't mind.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] What can we do as individuals to help shine a light on homophobia? Is there any method you suggest to help participate in eliminating homosexual hate crimes and discrimination around the world?\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] I've already tried a movement like that here on HF via [url=http://hackforums.net/showthread.php?tid=523181]this[/url] thread. I think a step forward would be to encourage the education about homosexuals in the school systems. I mean, we learn about how jews were mass murdered, how blacks were enslaved, yet reports about how gays are singled out because of their orientation on a daily basis never makes it through.\r\n\n[b][color=#FF1493]Virtual Reality:[/color][/b] Thanks for your time, Elektrisk! You surely are a brave member and we wish you the best in all future endeavors.\r\n[b][color=#00BFFF]Elektrisk:[/color][/b] I am honored that you chose me as the participant.\r\n\n",
      "subject": "[12/18/2010] - HF NEWS - HOLIDAY EDITION"
    }
  ]
}