{
  "posts": [
    {
      "pid": "9744613",
      "uid": "175033",
      "dateline": "1297387846",
      "message": "[align=center]\r\n\n[img]http://i.min.us/ie5CQo.png[/img]\r\n\nThis edition of HF News was written by [url=http://goo.gl/VIJ7W][b]xerotic[/b][/url]. Enjoy!\r\n[img]http://i.min.us/ie1lVA.png[/img]\r\nRecently, scam reports were opened against [url=http://goo.gl/mlRsA][color=black]`P R O D I G Y™[/color][/url] and [url=http://goo.gl/95NFv][color=black]xhtmlphp™[/color][/url] regarding RuneScape Gold. It was believed that it was a joint effort to scam between the two members, but recent events have led many to believe that [url=http://goo.gl/mlRsA][color=black]`P R O D I G Y™[/color][/url] was hacked. You can find the original scam report [url=http://goo.gl/N9pSs][b]here[/b][/url]. You can find additional scam reports at the following these two threads. [url=http://goo.gl/iKvlS][b]Thread One[/b][/url] and [url=http://goo.gl/qcTiZ][b]Thread Two[/b][/url]\r\n\nIn the midst of these scam reports, [url=http://goo.gl/mlRsA][color=black]`P R O D I G Y™[/color][/url] began to remove all members from the Red Lions Offical Group, leaving only himself and [url=http://goo.gl/95NFv][color=black]xhtmlphp™[/color][/url]. Admin [url=http://goo.gl/PHefi][color=#4DD0FC][b]Hanzo[/b][/color][/url] banned both members as a result; [url=http://goo.gl/95NFv][color=black]xhtmlphp™[/color][/url] for account theft and [url=http://goo.gl/mlRsA][color=black]`P R O D I G Y™[/color][/url] for a safety measure. However, all members were restored when HackForums owner [url=http://goo.gl/q9Qcg][color=#4DD0FC][b]Omniscient[/b][/color][/url] came online and re-added the leaders to the group. You can read more of the Red Lions being removed [url=http://goo.gl/kyMb1][b]here[/b][/url].\r\n\n[color=#00BFFF]----[/color]\r\n\nPopular website [url=http://www.onlinecrypter.com/]OnlineCrypter[/url] was recently compromised due to a lack in security, causing the release of account information. This caused huge problems for HackForums as it is believed that many people use the same password for the above websites. Admin [url=http://goo.gl/q9Qcg][color=#4DD0FC][b]Omniscient[/b][/color][/url] discusses the security issue in this [url=http://goo.gl/pr6ZN][b]thread[/b][/url]. He advises everyone to change their email and HackForums account passwords.\r\n\nAs a direct result of the security hole, HackForums member [url=http://goo.gl/VIJ7W][b]xerotic[/b][/url] made a utility package dubbed 'PassWordSafe' to give a slightly added protection to your passwords. You can find the thread [url=http://goo.gl/HxbvH][b]HERE[/b][/url].\r\n\n[img]http://i.min.us/ie1DDq.png[/img]\r\n\nSection Edited\r\n\nhttp://hackforums.net/showthread.php?tid=1052316\r\n\nAll you need to know, the subject is now banned.\r\n\n[img]http://i.min.us/ie1B5i.png[/img]\r\n\nWill another country be blocked? Admin [url=http://goo.gl/q9Qcg][color=#4DD0FC][b]Omniscient[/b][/color][/url] dances on the idea of country banning Albania in this [url=http://goo.gl/LqBaA][b]thread[/b][/url].\r\n\n[quote=Omniscient]Pretty damn close to country banning Albania. For now his entire ISP is blocked.[/quote]\r\n\n[color=#00BFFF]----[/color]\r\n\nHF Coders, former HackForums Official Group, was recently dismantled by admin . He made this [url=http://goo.gl/FTQDl][b]thread[/b][/url] and allowed no comments.\r\n\n[quote=Omniscient]The HF Coders groups is now officially dismantled. It lacked active leadership and hence it's now dead and removed. \r\n\nDo not PM me about the matter. I consider this issue resolved.[/quote]\r\n\n[color=#00BFFF]----[/color]\r\n\nHackForums member [url=http://goo.gl/JKpHq][color=#0066FF][b]Verdande[/b][/color][/url] has released another song! He has gotten excellent feedback with his music-- with reason! You can read the thread [url=http://goo.gl/lys7d][b]HERE[/b][/url] and watch the video below. Good job [url=http://goo.gl/JKpHq][color=#0066FF][b]Verdande[/b][/color][/url], you will go far with your music!\r\n\n[yt]http://www.youtube.com/watch?v=iwC9V_4ILNA[/yt]\r\n\n[color=#00BFFF]----[/color]\r\n\n[url=http://goo.gl/weM98][color=#FFCC00][b]EctoPlasm[/b][/color][/url] has recently returned from a 2 week ban. He was told to come back 'without the wannabe staff attitude'. Also, during the duration of his ban, two accounts were closed as multiple accounts of [url=http://goo.gl/weM98][color=#FFCC00][b]EctoPlasm[/b][/color][/url]. Despite this, I would like to welcome him back to HackForums. Since his return, he has made a thread announcing that he will no longer be creating HF News. He feels he no longer has anything else to contribute towards HF News. You can read the full story [url=http://hackforums.net/showthread.php?tid=1046837][B]HERE[/B][/URL]\r\n\n[color=#00BFFF]----[/color]\r\n\nThere was recently a large removal of staff members from HF. We can only assume this was due to inactivity. I would like to thank ex-staff members for their hard work and dedication to HackForums. To see current staff, visit this [url=http://hackforums.net/misc.php?action=help&hid=26][b]Help Document Page[/b][/url].\r\n\n[color=#00BFFF]----[/color]\r\n\n[url=http://hackforums.net/member.php?action=profile&uid=141530][b]Malware Boss[/b][/url] recently came back from a month month ban. His account was compromised, but everything is back to normal now. He will continue with his HJT efforts and remain a High Quality member at HackForums.net. You can read all about it in his thread [url=http://hackforums.net/showthread.php?tid=1045194][B]HERE[/B][/url]\r\n\n[img]http://i.min.us/ie1odI.png[/img]\r\n\n[img]http://goo.gl/EfHVO[/img]\r\n\nCongratulations to [url=http://hackforums.net/showthread.php?tid=1026270][b]NaDe[/b][/url] for winning Member of the Month - January! At the beginning of the voting session, [url=http://hackforums.net/member.php?action=profile&uid=46373][color=#0066FF][b]phire nuk3r[/b][/color][/url] and [url=http://goo.gl/mlRsA][color=black]`P R O D I G Y™[/color][/url] were neck to neck, but [url=http://hackforums.net/member.php?action=profile&uid=191245][b]NaDe[/b][/url] pulled ahead to scoop up the award with a whopping 98 votes out of 311. You can see the voting thread [url=http://hackforums.net/showthread.php?tid=1026270][b]HERE[/b][/url]. Congratulations to [url=http://goo.gl/wZyss][b]NaDe[/b][/url], you deserve it!\r\n\n[color=#00BFFF]----[/color]\r\n\n[img]http://goo.gl/qcyt4[/img]\r\n\nCongratulations [url=http://goo.gl/ghMfm][color=#0066FF][b]Nightmarе[/b][/color][/url] for obtaining the Master Donator Award for your large Amazon donation!\r\n\n[color=#00BFFF]----[/color]\r\n\n[img]http://i.min.us/iesWyQ.jpg[/img]\r\n\n\"Super Bowl XLV was an American football game between the American Football Conference (AFC) champion Pittsburgh Steelers and the National Football Conference (NFC) champion Green Bay Packers to decide the National Football League (NFL) champion for the 2010 season. The game was held at Cowboys Stadium in Arlington, Texas on February 6, 2011. The Packers defeated the Steelers by the score of 31–25. Packers quarterback Aaron Rodgers was named Super Bowl MVP, completing 24 of 39 passes for 304 yards and three touchdowns.\" - [wikipedia]\r\n\n[img]http://i.min.us/ie5AIg.png[/img]\r\n\nThis week I interviewed [url=http://hackforums.net/member.php?action=profile&uid=320970][color=#FF0000][b]HakkuR:[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=588781][b]Hуѕтєяιa X™[/b][/url].\r\n[/align]\r\n\n[b]xerotic:[/b]  Hello Hakkur, thanks for allowing this interview. To start, why did you join HackForums?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]About 2.5 years ago, I was playing PS2 talking shit to somebody, he threatend to kick my internet and i tried him. He did it and im like how did you do it  Hes like botnet and i googled it, then i could not find how to make one. Then I googled \"Hacking Forums\" and found HF\r\n\n[b]xerotic:[/b]  When you first joined the site, what did you think of it?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]I thought it would be very nice, to the point in my introduction thread, I added my number -_-\r\n\n[b]xerotic:[/b]  Well, that was months ago, has your opinion on the site changed?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]When I became known yes because new doors open for you, but then you meet blockades like the staff who abuse powers so yes it has changed since 2 days ago.\r\n\n[b]xerotic:[/b]  You recently became limited. Have you ever been limited and/or banned before this?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]I was banned about 8 or 9 months ago for advertising, warned for LQ posting. This right here was too mad of a punishment for what i did.\r\n\n[b]xerotic:[/b]  What were you limited for?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]Spreading a Tinychat link on the superbowl night, I posted it in 2 threads and 2 days later i get hit for it, what got me mad i saw someone with a 20% warning level for infecting members and now I am making a stand against it when im unlimited.\r\n\n[b]xerotic:[/b]  So would you consider this your main goal, speaking out to the HackForums members?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]Yes, there is corruption and other members fear getting repfucked or banned. I dont care if I have to bomb omni or crow with PM to show and fight for WHATS RIGHT I will at least i will be known for something. \r\n\n[b]xerotic:[/b]  Despite this, do you plan on contributing as you have been on HackForums?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]I still will, just have to know that staff make big deals out of light things. So I just have to watch what I post.\r\n\n[b]xerotic:[/b]  You seem to participate in a number of TinyChat's, do you think this is where most members know you from?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]Yes, I dance and make people have smiles on their faces, but i am best known for being one of the best RATS Crew members and a nice friendly user.\r\n\n[b]xerotic:[/b]  To finish up, do you have any words of advice for the members of HackForums?\r\n[color=#FF0000][b]HakkuR:[/b]  [/color]\"Live, Love and HACK\" Also speak your minds because next week, I will speak mine on the staff you may not see me for a while after that, but it will be a reason of my falling. I plan to make it better with this so be prepared next week, I am comming back and im a hit hard, what happend to me 2 days ago just wrong and sparked a little battle.\r\n\n[b]xerotic:[/b]  Thank you Hakkur for this interview! Good luck!\r\n\n[color=#00BFFF]----[/color]\r\n\n[b]xerotic:[/b]  Hello Hуѕтєяιa X™, thanks for allowing me this time to interview you. WHy did you first join HackForums?\r\n[color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color]Hello, thanks for having me. (: I joined Hack Forums because I wanted to be apart of an active forum and learn how to hack, the title caught my eye right there and then.\r\n\n[b]xerotic:[/b]  Did you have anything specific in mind when joining the site?\r\n[color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color]Well, I was always interested in RATs, they seemed to be the best. (: Thought this site would have everything I needed on them. Followed by meeting new people and fill my overcoming urge to post. Lol\r\n\n[b]xerotic:[/b]  You joined only 2 months ago, do you feel as if you are a respected/well known member?\r\n[color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color]No, I do not. In 2 months, one could not achieve that, in my opinion. (: There are way too many members on site, I consider myself a newbie and I just happy to be on the site, well liked with no enemies, that I know off. Haha\r\n\n[b]xerotic:[/b]  You were accepted as a Red Lion. What do you think of this group and their objectives?\r\n[color=#0066FF][color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color][/color]The group is doing very well. The members within are a close bunch and in my eyes, respected members. I believe the objectives that are set, are both handled and going to be handled well. I love it, personally. ^_^\r\n\n[b]xerotic:[/b]  You have been posting a lot for a newer member, how long to you plan to stay at HackForums?\r\n[color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color]I plan on being on Hack Forums for a very long time, as long as the site is up and running, I'll be apart of it. It has become a second home for me and will treat it as such. (: \r\n\n[b]xerotic:[/b]  You are also a member of the Black Knights, which group do you feel more 'loyalty' towards?\r\n[color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color]That there is a very interesting question. I actually can't decide, they are both great groups with awesome sauce members. I couldn't pick, that would be like picking who is your favorite child. (:\r\n\n[b]xerotic:[/b]  Well, thank you for the interview. Do have any words or a message that you would like to say to the community?\r\n[color=#0066FF][b]Hуѕтєяιa X™:  [/b][/color]You are very welcome, I am honored you took your time with me as well. I guess I would like to tell everyone that you should never take your life for granted, be yourself and my favorite quote. \"Respect is earned, not given\" Some thoughts to ponder. (: Have a nice day.\r\n\n[b]xerotic:[/b]  Thank you, have a nice day ^_^\r\n[align=center]\r\n\n[color=#FF1493][size=large]For the upcoming holidays... Happy Valentines![/size][/color]\r\n\n[img]http://goo.gl/fRXNc[/img]\r\n\n[color=#32CD32]Thanks for reading![/color]\r\n[spoiler]Staff, if you want to edit this thread at all, please contact me first, but I would rather you left original content here.[/spoiler][/align]\r\n\n",
      "subject": "[2/10/2011] - HF News"
    }
  ]
}