{
  "posts": [
    {
      "pid": "27268593",
      "uid": "515249",
      "dateline": "1350249043",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#9f2dc5][b]113th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]HackerCraft[/b][/color]\nThe last week has undoubtedly been a busy one for our Administrator [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] as he has propelled himself into a new business venture that is closely tied to HackForums. Specifically, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has invested into a Minecraft \"Faction\" server dubbed \"HackerCraft\". The server, although it will not be attached in a business manner to HackForums, will be primarily vacated by members of the HackForums community along with an allotted subforum and award designated for users of the new server. The server is currently in an Open-Beta phase where anyone is wholeheartedly welcomed to participate in. As of right now, entry to the server is free of charge and according to [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], the only things that will be paid will be donations and factions. On that note, factions are increasingly becoming hot commodity in the HackerCraft section which will surely lead to some good business possibilities once they are available for purchase! The server is planned to go into it's full version within the next week which surely many anticipate.\n\n[color=white][b]The Empire Fully Paid Off[/b][/color]\nOne of the final official usergroups of HackForums has been fully paid off by [url=http://hackforums.net/member.php?action=profile&uid=651337]Tibit [/url] yesterday. The statement was official when [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] tweeted \"[i]The Empire group is now fully paid for with a $0 balance due. Thanks to Tibit for making on-time payments.[/i]\" With official custom groups no longer being created, this occurrence will surely become more and more rare. Congratulations on [url=http://hackforums.net/member.php?action=profile&uid=651337]Tibit[/url] for his group staying here for good. \n\n[color=white][b]HJT Recruitment Approaching[/b][/color]\nThe highly anticipated event of the HiJackThis crew opening its doors to its training course and subforum is coming increasingly near. T3h Hack3r, the head leader of the HJT Team, created the \"[url=http://hackforums.net/showthread.php?tid=2925581]Hackforums HJT Training Program: Applications Thread[/url]\" which will be used for the application process. This along with official statements from HJT Teachers stating that nearly everything is ready to go is leading to many twiddling their fingers and preparing themselves in anyway possible. All questions, concerns, or updates can currently be found [url=http://hackforums.net/showthread.php?tid=2631046]here[/url]  \n\n[color=white][b]New Award[/b][/color]\nAs previously mentioned, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has implemented a new award that correlates with the new \"HackerCraft\" server that Omniscient has invested and spearheaded. Very little is currently known on how one would receive the award as the current description states \"You cannot obtain this award yet. You can only drool at its beauty and elegance.\" Currently, only one member of Hack Forums has received this intriguing award whom goes by [url=http://hackforums.net/member.php?action=profile&uid=1371671]Third[/url]. The reason for him receiving the award was for creating the official logo of HackerCraft which can be found [url=http://hackforums.net/showthread.php?tid=2914416&pid=27140772#pid27140772]here[/url]. The award will surely become the center of speculation and talk as the server goes from Open-Beta to open.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1043300][color=#0066FF][b]Fresh Prince[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=1007343][b]BELLAGIO[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=187420][b]iDuL[/b][/url] reached 1000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=656453][color=#0066FF][b]Chris[/b][/color][/url] resigned from Staff.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=127956][color=black][b]Plutonium[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=245853][color=black][b]Gabber[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=915044][color=#0066FF][b]Chum![/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=828184][color=black][b]Airon[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=127956][color=black][b]Plutonium[/b][/color][/url] was banned for reputation abuse.\n[*][url=http://hackforums.net/member.php?action=profile&uid=298746][color=black][b]Grammar Rays[/b][/color][/url] was banned for LQP.\n[*][url=http://hackforums.net/member.php?action=profile&uid=530032][color=black][b]Curt.[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=847499][color=black][b]Brandenx781[/b][/color][/url] was banned for cross posting in the HJT section.\n[*][url=http://hackforums.net/member.php?action=profile&uid=559058][color=black][b]Shekhar[/b][/color][/url] was banned for leaking.\n[*][url=http://hackforums.net/member.php?action=profile&uid=333869][color=black][b]Fanatic[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=245853][color=black][b]Gabber[/b][/color][/url] was banned for scamming.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=93419][b]Minnesota Nice[/b][/url] received the 24k award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1371671][color=#0066FF][b]Third[/b][/color][/url] received the Hackercraft award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1290620][color=#0066FF][b]Designer[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=1371671][color=#0066FF][b]Third[/b][/color][/url] received the Graphics Guru award.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\nNone.\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] -  [url=http://hackforums.net/showthread.php?tid=2915681][b]How Romney Failed the Entire Presidential Debate[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2931847][b]Mitt Romney Leads Us Into An Age Of Stupidity[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1011487][b]The Merovingian[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2931468][b]Julian Assange running for senator[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][b]malichi[/b][/url] -  [url=http://hackforums.net/showthread.php?tid=2936996][b]Fact-checking the U.S. vice presidential debate[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=458069]Ethereal[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 113th edition of the HF News Ethereal! As always, any shoutouts?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: Just to all my buddies in TA who have helped me to be who I am today. Special thanks to Paradoxum who gave me the opportunity when I was lurking, despite the controversy and hate he received for it. Thanks to Viral Dragon and kudos to him for his dedication and hard work, and of course to his lovely wife, iceybunneh. Thanks to Coding.Smith who worked with me when I was new. Thanks to those who have worked hard in the Wiki Team and TA. Also, shoutout to my friend \"CtrlAltxNinjax\" who's recently come back to HackForums and is doing good graphic-based work for members.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, they're definitely some in-depth shoutouts! You're a relatively highly regarded member on HF currently. How were you introduced to the site, and what did you hope to accomplish?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: As far as I remember, I was gaming with my friends a couple of years back, and we were getting screwed by a team far better than ours, but that also used hostbooters. I had a chat with one of them after, and he was telling me about HackForums and how I should sign up for free perks like his booter. I signed up and had a look around, but didn't do anything for the first month or so. Then I started looking into programming(my father made a career out of it) and began learning C#. For the first few months, I focused on C#, relevant mathematics and cryptography, and spent time working to help people in relevant sections. I hoped to learn and make a few friends to work with.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Looking at your post activity and threads, you look like quite the programmer. What languages do you know, what issues did you face learning them, and where do you think your programming will take you?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: The majority of my knowledge is centered around C# and relevant technologies, for example XAML and ASP .NET. However, I delved into a number of other languages such as MASM, C++, Python, Java and even Haskell for a time. I don't use them often, but I usually have a few pet projects to tinker with. Learning programming takes a certain mindset, and the difficulty is in finding that. I had no trouble learning to program in terms of logic, but I have several friends who find it increasingly difficult. All I can say is stick with it at regular intervals; I spent several months learning for a couple of hours a day to get into a decent position, but you never stop learning. I don't think I'll go further with it, but it has made some money on the side that I hope will continue. At the moment, I'm working on utilities for my Android phone.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What are your future plans (both on HF, and IRL if you feel like sharing)? Do you see yourself staying on the site for much longer, or do you plan to move on?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: I intend to remain on the site for the foreseeable future to continue working in my two groups; I hope that I will make a positive difference within them. If I were to leave, I certainly wouldn't leave behind the friends I have made here. I am not sure what I wish to do IRL, although I intend to study at college and university.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: While we are on the topic of groups, you are a contributing member in Writers (Wiki team) and The Alliance (from what I've heard). How do you feel you better these groups and are there any other groups you wish to be involved in?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: In The Alliance, I've contributed through projects such as TAFWA for some time, and have been encouraged to help people outside of the structured work. In addition, as with most groups, we help each other out and so much of it is difficult to quantify. Currently, I hold the position of Head Mentor and have plenty of work to do during and after the current recruitment. In the Wiki Team, I'm Head Publisher and have been working closely with Viral Dragon for some time. I've done the job required, but also managed the group for a time and encouraged our team to work and improve both their skills and the Wiki itself. I hope that in both, I have done well to improve the workings and ethos. Currently, I have no interest in joining any of the other groups; this is not borne of prejudice, but from time. I have plenty of work online and in my private life, and have no anchors to the other groups currently that would encourage me to join.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: If you were to have a few things on the site change or be implemented, what would they be and why? There are a lot of suggestions that aren't passed although that are controversial, so I suppose it comes down to logical thinking on Omni's part, as well as a balance of opinions.\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: I think that Omniscient is doing a great job with the site thus far, and I'm not much of a web developer, but I think that there are a few alterations that could be made. I think the warning system should affect prestige(if it doesn't already) and past warnings should be publicly archived(if they aren't). I think that prestige should have rewards and incentives to increase contributions, but be managed closely so it doesn't become akin to Rep. Really though, I think it is good and I look forward to further innovation from Omni.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I most definitely agree. While we are on the topic of warnings, how many have you received prior and for what reasons? Have you ever been banned? What advice do you have towards members to not receive warnings or be banned?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: That I remember, I've received several for Flame/Threat/Harassment, as I used to argue a little more coarsely than I do now. I may have had one for Off-Topic Posting, but I haven't had many for a while so I don't remember. I was banned once for a short time due to a misunderstanding; Omniscient confused me with another member and repfucked/banned me before another Staff member realized and pointed it out. To those of you who remember, that was when Omniscient gave himself the 'Asswipe' award. My advice to other members is be friendly and do not act badly; it rarely helps the situation and being positive towards people tends to have a reciprocating effect. In addition, if you decide to leave, don't have a silly 'blaze of glory' or go scamming people, because it is completely the wrong thing to do.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Oh wow, the repfuck part sucks. Good to see you recovered though. Where does your HF username branch from?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: My original username originated from my Xbox clan. My current one hasn't a great history behind it; I decided to pick a new name, and made a shortlist, before picking 'Ethereal'. There's no real reasoning I can think of behind it, although there may have been at the the time. I've wanted to change it to several different things meanwhile, but the name has a history behind it and I'm not sure I want to forfeit that.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What is your view of reincarnation? Do you believe humans are reincarnated after death, and in what sense if so? Why?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: I do not believe in any form reincarnation or existence post-mortem because I have no reason to. I think that with our current understanding of reality and the universe, there is no reason to believe there is anything beyond death. Some people would find this terrifying, I think it is better to see it has liberating - you're encouraged to make the most and do good acts for the sake of them, not for any hope of an existence after death.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for the great interview today Ethereal. Any final thoughts/comments?\n[url=http://hackforums.net/member.php?action=profile&uid=458069][color=white][b]Ethereal[/b][/color][/url]: Just thanks for your own work for the forum and to any who contribute in a positive way day in/day out without any real recognition. You make a difference, keep it up, and there's always a door open in The Alliance/Wiki Team for those dedicated and willing to help out.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=660659]-Analog-[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 113rd issue of the HF News, we have [url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]:  as our guest. Any shout outs you want to make to your friends?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: Hello and thank you for having me! I'd like to say hi to Paradoxum, AlbinoShadow, Apathy, TheHackersLove, and everyone in The Alliance and Reviewers.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: You're very privileged to be in those groups. How did you come to be on Hack Forums, participating in this interview?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: Well, back in 2010 I was an administrator on a decently popular gaming forum. Naturally, we brought in crowds from all over the internet which included what some may consider to be \"hackers\". I befriended a couple of them and so eventually they got me to join HackForums to become the l33t hax0r I was born to be. I quickly realized the blackhat life was not for me and turned my attention to groups and improving my knowledge in computing and various other aspects.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Is that how you got into graphic art and computer hardware, or does that come later?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: It came from that basically. I did a bit of graphics on my gaming forum but for the most part I refined my knowledge enough to be accepted into the Graphic Masters. As for PC hardware, I wanted to build my own PC and start gaming on it so I just thought I'd read up and learn the ins and outs of a computers.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: The sticky by Glassy has a lot of content written by you... you must have read a lot. How long did that take to make?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: Oh gosh, I think about 1.5 weeks or so. Originally it was a solo project taken on by myself, but I ended up recruiting Glassy to help and he posted it. I took the knowledge from that sort of writing and applied it to my DayZ guide which earned me the sticky man award.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Might as well have two sticky awards. How did you get involved in The Alliance and The Reviewers, and what are they like?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: Well I applied to The Alliance around this time last year. People were telling me that the group was very prestigious and I shouldn't of bothered applying as I am not \"known\" enough. I had no idea why or how The Alliance was so popular I just thought it was a couple group and would apply. To my surprise, I was accepted and I quickly understood why this group was considered so special to many. The group quickly became my home on HackForums where I reside with my fellow cats such as you. As for Reviewers, there wasn't all that much to it. TheHackersLove notified me that they were recruiting and I applied. To my surprise I was one of only 3 that were accepted which was a humbling experience.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: What are your opinions on some of the groups on HF? \n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: It's a touchy subject to talk about considering the large spectrum of opinions on the matter but overall I see them as a positive influence on HF. If my memory serves me correctly, I've been in 16 groups since I joined in January of 2011. Yes I know that's a lot but I'm quite picky with the ones I stick in. Every single of those groups had a great member base that made for an enjoyable experience. I have yet to figure out why everyone has convicted groups to needing a purpose to serve or else they should be disbanded but I doubt that will ever get figured out. I really enjoy the groups I'm in now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Have you applied for all your groups, or have you bought into one or two of them?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: I have never bought into a group. The only one I'll pay for is probably HijackThis team as I will be paying for a course rather than a simple userbar. I see no reason to pay to enter a group.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I'm hoping to apply myself... me and everyone else on the forum. Why did you change your name from Raptured to Analog? \n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: Well around May 2012 I decided I needed a long break so I went AWOL for about 2 months. When I came back, I decided I was due so a fresh start so I changed names and went from there \n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Fresh starts are always good. I've had several myself; pretty rejuvenating. To wrap this up, do you have any parting words for our audience?\n[url=http://hackforums.net/member.php?action=profile&uid=660659][b][color=white]-Analog-[/color][/b][/url]: Get your priorities right people, you shouldn't take HF too seriously. Enjoy yourself, and in the words of Walter White \"apply yourself\".\n[/spoiler]",
      "subject": "[10/14/12] - HF News"
    },
    {
      "pid": "27268611",
      "uid": "515249",
      "dateline": "1350249084",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=white][b]Halo 4 Leaked[/b][/color]\nThe much awaited first person shooter, Halo 4, has been widely leaked onto the internet. The illegitimate copies were uploaded onto various sites this week and have already been downloaded thousands of times! Gameplay videos, cut-scenes and play-throughs have been uploaded to YouTube, so you may want to stay away from those if you don't want any spoilers. It's not recommended that you download these illegal copies for obvious reasons (legal issues) and wait until the official launch. Halo 4 is dated to be released on November 6.\n\n[color=white][b]Forza Horizon Demo[/b][/color]\nAre you a keen driver? Well, the Forza Horizon Demo hit the Xbox LIVE Marketplace earlier in the week. You can download it now and enjoy racing around in some very fine cars. \n\n[color=white][b]Xbox LIVE Country Migration[/b][/color]\nMicrosoft is now allowing users to migrate their Xbox LIVE accounts between regions, which was officially announced on the Xbox forums earlier this week. However, you may want to read the details about the migration because it may not be best for some people. \"Some of the services and content that you are currently benefiting from in the country originally registered may not also be available in the country you are willing to migrate to. All of your current subscriptions, except for Xbox Live Gold if you had any, will be cancelled. You may lose the ability to re-download some, if not all, of the content in your download history. Any content that you will subsequently download after the account is migrated will be subject to any applicable geofencing rules of your new location.\" The process can take up to six weeks to complete, so don't fret if it's not done overnight. \n\n[color=white][b]Australian THQ Office Closes[/b][/color]\nThe THQ office located in Melbourne, Australia is officially closed. THQ wrote the following statement about the closure: “THQ confirms it has made changes to its publishing organization in Australia. In line with THQ’s corporate strategy to focus on wholly-owned IP and move away from affiliate label programs, we have evaluated how best to take our more-focused product lineup to market in the territory. After a thorough analysis, a decision has been made to move from a direct sales model to a distributor model, which means that our Melbourne publishing office will be closing. Approximately 18 employees were impacted by this action.” THQ is set to release WWE 13 on October 13.\n\n[color=white][b]Forward Unto Dawn[/b][/color]\nThe second episode of Forward Unto Dawn was released on Friday. The series is set to release each week until the Halo 4 launch, where limited edition buyers will receive a copy of Forward Unto Dawn. You can view the latest episode below.\n\n[align=center][spoiler=Here][video=youtube]http://www.youtube.com/watch?v=K56gSEJ6IGc[/video][/spoiler][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Drone Over Israel Was Confirmed To Be Hezbollah's[/b][/color]\nLast week, the HF News featured an article titled “Possible Hezbollah Drone Struck Down”, where it explained that the Israeli Air Force picked off a drone that was suspected to have been launched by Hezbollah. It turns out the Israeli Government's assumption was indeed correct. Sayyed Hassan Nasrallah, the Lebanese Hezbollah leader, confirmed that Hezbollah did send in the drone. Nasrallah boldly stated “[t]he resistance in Lebanon sent a sophisticated reconnaissance aircraft from Lebanon... it penetrated the enemy's iron procedures and entered occupied southern Palestine” while giving a televised speech. If you are unaware, Hezbollah and Iran have mutual interests and also carry a friendship. As of lately, the Israeli government has made threats to bomb Iran's nuclear development sites, which are suspected by the Western world to be a means to create a nuclear arsenal. Iran has countered the threats with promises to launch an attack on Israel and the U.S. military bases that are situated in the Middle East. The Iranian Government proclaimed that the drone incident illustrates that Israel's Iron Dome “does not work and lacks necessary capacity,” however the Iron Dome is a system meant to defend against short-range rockets, not drones. \n\n[color=white][b]Chinese Compulsory Evictions On The Rise[/b][/color]\nLocal bureaucrats in China have been pressed to meet economic goals and other special interests. This has led to such officials selling off land to entrepreneurs while inhumanly sacrificing the original holders of the land. This is entirely legal, as the state claims to control all of the nation's land. The entire ordeal has led to an increase in social unrest and more citizens speaking out. Amnesty has made claims that the evictions leave the former inhabitants with little forewarning and minuscule compensation. As a result of the evictions, Amnesty has constructed an 85-page report titled “Standing Their Ground.” After the study was conducted, Amnesty asserted that “[t]he forced eviction of people from their homes and farmland without appropriate legal protections and safeguards has become a routine occurrence in China, and represents a gross violation of human rights obligations on an enormous scale.” It was even shown that some situations had resulted in death. There has been a backlash towards the Chinese government by citizens demanding more rights, but Premier Wen Jiabao stated that the problems “are still very serious and the people are still very concerned about them.”\n\n[color=white][b]Blasts In Kenya Injures Officers[/b][/color]\nAs a form of revenge for the deployment of Kenyan soldiers in Somali, Somali terrorists and those extending support to them are suspected of lighting off bombs in the area of Mombasa and Nairobi. The most recent explosion occurred in Eastleigh. Eric Kiraithe, a Kenyan Police spokesman, stated, “[w]e believe the first blast was intended to lure onlookers, members of the public, and that second blast was meant to harm them...one police officer was wounded, but his injuries are not life threatening.” The bombing occurred on Friday night, and civilians were left unscathed. Spokesman Kiraithe would not make any hints as to who was responsible, as instigation of the bomb site is still ongoing. It was reported by television channels that a total of 3 police men had been injured altogether. There has been ongoing tension between the Somalis and the Kenyan government, which ultimately has acted as the catalyst for these explosive events. \n\n[color=white][b]Anonymous and WikiLeaks: A Broken Alliance[/b][/color]\nIt seems to be that Julian Assange and his controversial website WikiLeaks will no longer have the support of the infamous hacker community Anonymous. High-profile Anonymous Twitter profiles have tweeted things such as describing WikiLeaks as a \"One Man Julian Show...[that] was an awesome idea, ruined by egos.\" Anonymous has remarked that \"[w]e have been worried about the direction WikiLeaks is going for a while.\" They continue to explain, \"[i]n the recent month the focus moved away from actual leaks and the fight for freedom of information further and further while it concentrated more and more on Julian Assange...But WikiLeaks is not--or should not be--about Julian Assange alone.\" Julian Assange's time spent with Lady Gaga seems to have acted as the straw that broke the camel's back, as Anonymous declares \"that's great for him but not much for our interest.\" They continue to say that they are more worried about bringing about transparency in government.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Samsung[/b][/color]\nSamsung's S3 Mini was released earlier this week. Being a smaller size than the original Samsung Galaxy S3, this phone is targeted towards users who need something small and compact. The phone runs Android 4.1 Jelly Bean OS. The price and availability for the S3 Mini hasn't yet been officially announced by the company. Just like the original S3, the S3 Mini also incorporates S Voice that is a response to Apple's Siri Eye tracking feature, TouchWiz user, a 4-inch Super Amoled screen, direct call, and Smart Alert, along with various other minor features. The S3 Mini supports 3G, WiFi and Bluetooth. However, it lags using the LTE feature. With a reduced price, this new release from Samsung is expected to sell in the millions. \n\n[color=white][b]Blackberry[/b][/color]\nResearch In Motion's (RIM) newest L-Series phone was supposed to be a secret, although a rep demonstrated the mobile along with its new BlackBerry 10 OS to a Mexican site named [color=white]Hola Telcel[/color]. The site also posted a video online about this. This isn't the first leak of pictures/videos in regards to the mobile. The video shows the ability of the new BlackBerry's OS to virtually rewind the photos taken in order to set the best expression that you prefer. BlackBerry users are counting on the device to compete better against Apple and Android Smartphones: particularly Samsung. The company hasn't released any other specifications about the handset yet.\n\n[color=white][b]Amazon[/b][/color]\nAmazon, as a result of antitrust settlements reached in April between the Justice Department and the publishers Hachette, Harper Collins, and Simon & Schuster, posted a FAQ about a credit that may become available to certain e-book buyers. If the settlement deals are approved by law, then they will start to credit the eligible users' account(s) with money. Users can also request a check payout. Amazon said that they will start to email the users who are eligible for the credit once approved by court. Amazon said that the credit will range from 30 cents to $1.32 based on the type of ebook purchased. The ebook should be purchased only from the publishers Hachette, Harper Collins, Simon & Schuster, Penguin, or Macmillan and should've been purchased in between April 1, 2012 and May 21, 2012.\n\n[color=white][b]Apple[/b][/color]\nAfter all the lawsuits and legal declarations against Samsung, which in result further soured their relationship, Apple has finally realised its dependency on Samsung for chips. Currently, Apple is working with a Taiwan semiconductor manufacturing company. The company is working on a 20-nm chip manufacturing process. An Asia-based news report said that Apple will turn to TSMC for quad-core chips. The changes brought by the chip can efficiently increase a device's performance and will enable a longer battery life for the device. At present, Apple nor Samsung have changed after their shift from 45-nm chip to 32-nm chip. Reports predict that this chipping process will be complete by the end of next year.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b][color=white]Pussy Riot Member Freed From Moscow Prison[/color][/b]\nAn appeals court unexpectedly freed one member of the Russian punk band Pussy Riot, but upheld the 2-year sentences of her two bandmates. All three band members were imprisoned for their protest-performance of Russian president Vladimir Putin inside a cathedral this past August. The musician, Yekaterina Samutsevich, was freed because guards stopped her before she was able to perform. The case has caused international condemnation from countries in Europe and the Americas, including a statement of “disappointment” from the White House. \n\n[b][color=white]The Black Keys Release New Live EP[/color][/b]\nThe Black Keys released their new live EP, Tour Rehearsal Tapes, earlier this week. All of the material was produced last winter in the studio by the band, composed of guitarist/vocalist Dan Auerbach and drummer Patrick Carney. All 6 tracks were taken from last year’s El Camino and 2010’s Brothers. It is currently available for purchase on iTunes. The band has also announced that they will begin recording their 8th studio album early next year. \n\n[b][color=white]Music Video Of The Week[/color][/b]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=V5tGThVDR7o [/video][/spoiler]\n\n[b][color=white]Member Submitted Videos[/color][/b]\n[spoiler=]\n[video=youtube]http://www.youtube.com/watch?v=Xn6IZDlJNtc [/video]\n[video=youtube]http://www.youtube.com/watch?v=zYwCmcB0XMw [/video]\n[video=youtube]http://www.youtube.com/watch?v=peclQi67KS8 [/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThere's something in us that always makes us want to be the best in some category. Our very genetic foundation pushes us forward, to thrive and succeed in what calls us. However, there are those out there that choose to ignore their \"calling\" and do only what will make others happy, or make no one happy at all. It's important not to fall under this same mindset, as we need to do what makes us happy, and do what we're good at. The quote \"If you like what you do, you'll never work a day in your life\" comes to mind. Just try to understand yourself and follow your dreams, is all I can impart with you today.",
      "subject": "*"
    },
    {
      "pid": "27268619",
      "uid": "515249",
      "dateline": "1350249095",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What will you do on the new HackerCraft server?\"\n\n[i]\"I think Omni put a lot of effort and planning into the server, \nbut I still doubt it will last, considering the attention it is gaining \n- many griefing communities have promised to ruin the server. I \nwill wait for the server to be fully released, I will stay on the server \nand be a dedicated player if all turns out well.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=875998][i]-The Dark Knight[/i][/url]\n\n[align=right][i]\"What I always do on Minecraft. Punch trees and kill \nthings. Perhaps hit Omni with a Potion of Poison or Weakness?\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=966853][i]-name[/i][/url][/align]\n\nThe topic for next week is \"How useful is the Marketplace on Hack Forums to you? Explain?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ibbJRl5ky7cZQL.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/i7tIk2f3FCQdH.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibft5YAKNIuFgm.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Special Interview This Edition[/i]\n[video=youtube]http://www.youtube.com/watch?v=2JqzRdS1mDM[/video][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]Phytrix[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]Sir[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}