{
  "posts": [
    {
      "pid": "18000826",
      "uid": "515249",
      "dateline": "1323325575",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FF69B4][b]70th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[b]A couple of notices:[/b]\n[list][*]The webshow is up! Yes, it is short.[/list]\n\n[align=center][img]http://goo.gl/jXMHO[/img][/align]\n[b]Junk Section Purged and Posts Recounted[/b]\nHack Forums has recently lost over five-hundred thousand posts in the emptying of the junked section. All of the member's post counts were also recounted, dropping nearly all active members’ post counts. This is a required activity and happens every once in a while. \"These purges help keep the database trim and tight.\" As said by Omniscient. This purge has affected many members but also the current staff of HF. One of the staff members, Factor8, or more commonly known as ‘F8’ lost a massive total of 26,000 posts during the purge.\n\n[b]New MyCode[/b]\nDue to the constant problems and sightings of the \"Post here, PM me\" threads, a new MyCode was put in to place. After several suggestion threads for those types of giveaways should be banned altogether, this compromise was put in to place. However Omni did say “These are wasteful to resources and are just an annoyance to most users”, he also posted later in the thread that these types of threads will be disallowed in the future. The reasoning behind this is clear and most members on HF seem to agree with this update.\n\n[b]Sales by Proxy - Disallowed[/b]\nMembers are now no longer allowed to sell for other members. This was often done for members who were in the negative, fairly new to HackForums, or even those who had been banned in the past. Omni stated that any user caught doing this will be repfucked and no longer allowed to post in the marketplace. It is clear that this will be strictly enforced by the staff members, and by Omni himself.\n\n[b]Reverence Reformation[/b]\nThe current reverence leaders,  Astonish is NJ and McFlurry, have decided to remove every member of the Reverence group and start over. They have stated in the announcement thread that “new things are going to happen” but all other information has not been set public. Members will be invited back to the group of December 12th 2011, but it is still unconfirmed whether or not all members will be invited back. Many members are angered by this change due to the fact that a decent percentage of the group paid to enter. Read more about this topic [url=http://hackforums.net/showthread.php?tid=1982348]here[/url].\n\n[b]Mass account closing[/b]\nAs Omni posted on twitter, an immensely large number of 32,700 accounts have been closed in the past week. All regular accounts that have been inactive for over 6 months have been deleted. Read more about this on HF’s twitter: http://twitter.com/hackforumsnet\n\n[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about the banning of Kindle sales in the Marketplace?\"\n\n[i]\"I think it's a great rule put in place. I support Amazon 100% and think all\n those fraudulent Kindles that have been shipped out should be returned and\n the recipient be fined. Social Engineering is not cool, everyone should make\n money on their own. Life is not easy. Maybe it seems that way for now, but\n when you grow older things definitely change and you'll realize the damage. If\n you owned a company would you like people taking advantage and getting your\n products for free, causing a loss of profits? No, you wouldn't. No one would.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=622763][i]-alabama[/i][/url]\n\n[align=right][i]\"I feel that this was a good, preemptive \"strike\" against possible scam\n reports which were bound to come up due to people not getting their kindle, or not\n getting their method, or getting caught trying to SE them or something. It seems like\n Omniscient saw this as a possible 'Apple' scenario and decided to take a course of action\n that will result in people not loosing their money.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url][/align]\n\n[i]\"It was for the better. Social engineering is a concept of deceiving which may often\n require fraudulent techniques. Acquiring Kindles mustn't be distant from the method to \nSE Apple products - of which included fraud. It was but only the right decision to forbid \nKindle sales just to protect the state of HackForums.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=485066][i]-Pulse[/i][/url]\n\n[align=right][i]\"I feel that this was right. Alot of kindles were S.E which is illegal. Hackforums doesnt \nneed that kind of attention, thats why apple products where banned to. I had a friend who was buying \na kindle, and got scammed. Thats a good chunk of money scammed. I personaly think omni shouldnt let \nany actual item sold due to people could easily scam or ship it to the wrong house.Thats just my opinion.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=874827][i]-EpicXXCrushor1[/i][/url][/align]\n\nThe topic for next week is \"How do you feel about the 'Post here, PM me' threads? Should they be banned, or is the new pmme code a good fix?\" \n([url=http://hackforums.net/showthread.php?tid=1975837]PM Code[/url])\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[align=center][img]http://i432.photobucket.com/albums/qq50/tasemu/Hf%20News/worldnews2.png[/img][/align]\n[color=white][b]Anniversary of Pearl Harbor [/b][/color]\nDecember 7, 1941 was a tragic day in America. The attack on Pearl Harbor started with the Japanese invading naval base at Pearl Harbor. The base was attacked by 353 Japanese fighters, bombers and torpedo planes in two waves, launched from six aircraft carriers. All eight U.S. Navy battleships were damaged, with four being sunk. Of the eight damaged, six were raised, repaired and returned to service later in the war. The Japanese also sank or damaged three cruisers, three destroyers, an anti-aircraft training ship, and one minelayer. 188 U.S. aircraft were destroyed; 2,402 Americans were killed and 1,282 wounded. The power station, shipyard, maintenance, and fuel and torpedo storage facilities, as well as the submarine piers and headquarters building (also home of the intelligence section) were not attacked. Japanese losses were light: 29 aircraft and five midget submarines lost, and 65 servicemen killed or wounded. One Japanese sailor was captured. This of course led the Americans to enter WWII. This day will be remembered by many Americans today and we remember those who were lost.\n\n[color=white][b]Russian Protest's [/b][/color]\nThe show of force by Russian police didn't deter anti-fraud protesters on Tuesday, as demonstrators again took to the streets in Moscow and elsewhere for their second day in a row following the nation's increasingly disputed parliamentary elections. The Associated Press reports that nearly 500 people were detained during Tuesday's action, including at least 250 in downtown Moscow, where city police claimed, in the words of the news wire, that \"flare-type fireworks were thrown at a group of pro-Kremlin youth.\"Russian media reported that another 200 or so protesters were arrested at a similarly unsanctioned rally in St. Petersburg and another 25 protesters were detained in the southern city of Rostov-on-Don. These incidents bring the total number of arrests since Sunday's parliamentary elections to nearly 800. This carries out throughout the week with multiple situations similar to this one. Hopefully everything settles and moves through this peacefully.\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i432.photobucket.com/albums/qq50/tasemu/8-12-2011.png[/img][/align]",
      "subject": "[12/7/11] - HF News"
    },
    {
      "pid": "18000834",
      "uid": "515249",
      "dateline": "1323325608",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=132817][color=white][b]S70N3R[/b][/color][/url] - Stoner was repfucked, he stated that it was because he reported all of his green reputations as reputation abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=905279][color=#0066FF][b]Yellow Skull[/b][/color][/url] - Yellow Skull got repfucked for posting a fake scam report. Omniscient himself -10ed him, with the reason being that you shouldn't deal with this user.\n[url=http://hackforums.net/member.php?action=profile&uid=111804][color=#0066FF][b]SaNk™[/b][/color][/url] - He was also repfucked for unknown reasons.\n[url=http://hackforums.net/member.php?action=profile&uid=83317][color=#0066FF][b]Automatic Coding[/b][/color][/url] - There was a lot of drama involved in this repfuck, most of it needs to be left unsaid. \n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=white][b]Genuine[/b][/color][/url] - Genuine was repfucked for unknown reasons.\n[url=http://hackforums.net/member.php?action=profile&uid=395968][color=black][b]Hot Chocolate[/b][/color][/url] - He got repfucked and banned for the reason \"LQP and Member Harassing\"\n[url=http://hackforums.net/member.php?action=profile&uid=290599][color=black][b]Fag[/b][/color][/url] - He was banned and repfucked for being a site nuisance.\n[url=http://hackforums.net/member.php?action=profile&uid=766442][color=black][b]Dre Beats™[/b][/color][/url] - Formerly known as SeaNanners, he was banned for multiple accounts.\n[url=http://hackforums.net/member.php?action=profile&uid=389731][color=black][b]Consequenc3[/b][/color][/url] - He was banned for creating another account.\n[url=http://hackforums.net/member.php?action=profile&uid=182754][color=black][b]Orgy[/b][/color][/url] - Banned for constant sales thread trashing.\n[url=http://hackforums.net/member.php?action=profile&uid=788901][color=red][b]Zyzz[/b][/color] [/url] - Zyzz was repfucked and banned by Judge Dredd for being a site nuisance, he was recently unbanned and is now limited.\n[url=http://hackforums.net/member.php?action=profile&uid=622283][color=grey][b]Kiss♥[/b][/color] [/url] - This member had his account repfucked and permanently closed, some speculate that it may be due to the mass amount of scam reports opened against him.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Graphics Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1991018][TUT] \"Light\" Signature Tutorial [PHOTOSHOP][/url] - [url=http://hackforums.net/member.php?action=profile&uid=1080477][color=#0066FF][b]Lat[/b][/color][/url] - This was a great tutorial thread on how to do some amazing graphical effects.\n[i][b]Hacked Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1985539]TheHackersLove - Hacked[/url] - [url=http://hackforums.net/member.php?action=profile&uid=570186][color=#0066FF][b]TheHackersLove[/b][/color][/url] - Our very own writer for the World News was hacked recently. He has now regained full access to his account and is secure. Let's hope TheHackedLove never happens again.\n[i][b]Informative Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1991547]MythBusters Cannonball Experiment Gone Wrong, Hits Houses and Car in Dublin - [VIDEO][/url] - [url=http://hackforums.net/member.php?action=profile&uid=263345][color=#0066FF][b]Prince of Persia[/b][/color][/url] - Anyone who isn't up to date on the latest myths and their busts wouldn't know that a recent myth has gone wrong. Watch the video to find out more.\n[i][b]Helpful Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1982540]Guide On Partnerships, Hiring, and Personnel | Tips | Choices | Success[/url] - [url=http://hackforums.net/member.php?action=profile&uid=734805][color=white][b]Glassy[/b][/color][/url] - If you are going in to the marketplace and need a partner, you should read this guide to understand who you should be looking for.\n[i][b]Eye-Opening Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1985124]Genuine takes credit for other's work![/url] - [url=http://hackforums.net/member.php?action=profile&uid=735315][color=white][b]Michael Westen[/b][/color][/url] - Some believe that this thread is what led to Genuine's repfuck. You can read the thread to understand more, but what is known is that Genuine removed his thread after seeing this.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Glassy[/font][/size][/color][spoiler=]\n[b][color=#0066ff]Michael Westen[/color][/b]: Hey Glassy! Thanks for taking the time out for this interview! Before we begin, do you have anyone you would like to give a shoutout too?\n[b][color=#0066ff]Glassy[/color][/b]: I would like to give a shoutout to my mate Infallible, a great friend and has helped me with countless things. \n\n[b][color=#0066ff]Michael Westen[/color][/b]: To start us off, what's your opinion of Hack Forums? How has it changed since your registration date?\n[b][color=#0066ff]Glassy[/color][/b]: My opinion towards Hackforums is most definitively positive as I am still along in this forum. I really enjoy the fact that there are many active members and you can always get a quick response when needed. It is a great community with many dedicated helpers that strive to answer any unanswered questions. I feel extremely comfortable being part of this community in general. Well, I've joined Hackforums on March 2011 and notice to see only minor changes. I have seen many screenshot of Hackforums in the past and have to admit there were much more changes before my registration. At the time I am now, there are some minor changes that I believe was needed. The themes and the buttons was a great decision.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: I agree with a lot of that. We joined around the same time and you have certainly excelled. I am a huge fan of the new buttons! I see you are very dedicated by your plethora of awards, why are you so dedicated?\n[b][color=#0066ff]Glassy[/color][/b]: I believe awards are congruent to achievements and recognition. If you deserve it, you get it. \n\n[b][color=#0066ff]Michael Westen[/color][/b]: For sure, but I’ve definitely seen a lot of pet threads lately. You are a member of some great groups, why did you choose to join them?\n[b][color=#0066ff]Glassy[/color][/b]: I have been a member of the Red Lions approximately a month after I've joined Hackforums, and it cease to never disappoint me. I feel the members in the Red Lions are extremely devoted to the group and have excellent support, so I decided to put my head in there. The Writ3rs is one of my specialties as I enjoy managing the Wiki and believe it best suite my position. \n\n[b][color=#0066ff]Michael Westen[/color][/b]: You’re certainly a huge contribution to both. Do you have any changes you would like to see made to Hack Forums?\n[b][color=#0066ff]Glassy[/color][/b]: I would like to see less scam reports and scam attempts in the forum. As Omni has already mentioned that he is implementing the vouch system along with other ideas to prevent this. \n\n[b][color=#0066ff]Michael Westen[/color][/b]: As a participant of 2 sketchy transactions, both that ended up getting reversed, I’m with you on that one! You've released some great guides and compilations - What inspires these?[b][color=#0066ff]Glassy[/color][/b]: My goal in Hackforums is to always teach. So I decided I would create guides that are in my specialties. \n\n[b][color=#0066ff]Michael Westen[/color][/b]: I love your motto “I don’t teach, I make you learn.” Getting away from Hack Forums, what do you like to do when you’re not on?\n[b][color=#0066ff]Glassy[/color][/b]: I enjoy playing sports with my friends and of course my family. Like to catch a movie sometimes here and there. I like to have family dinners and take my girlfriend out when I have the chance. Basically just having a great time.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: I see – I’m sure it’s hard to balance all of those but you do a great job. What advice do you have for brand new members to Hack Forums?\n[b][color=#0066ff]Glassy[/color][/b]: Read the rules carefully and make sure you understand them clearly. Strive to be high quality as much as possible and just don't complain about anything by making threads, PM Staff instead. Also don't troll or flame.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: I’d follow all of that advice, it’ll get you far. Do you have any final words you would like to say?\n[b][color=#0066ff]Glassy[/color][/b]: Do whatever you can to make this community smile. \n\n[b][color=#0066ff]Michael Westen[/color][/b]: Thanks for taking the time to do this interview Glassy! \n[b][color=#0066ff]Glassy[/color][/b]: It has always been an honor.[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Ignite.[/font][/size][/color][spoiler=]\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Thanks for taking the time to do this interview. Is there anything you would like to start with?\n[color=white][b]Ignite.: [/b][/color]Thanks for taking the time out to interview me. I'd also like to give a shout out to Genuine, Ariana Grande, bugga, Astonish, Sir, Mark Webber and anyone else who has been nice to me during my stay on HF.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]I take it HF is treating you well, then?\n[color=white][b]Ignite.: [/b][/color]Yeah. Apart from some of my haters I can't expect everyone to treat me well because if you think about it I'm still quite new to HF and have a lot to learn but I'd like to say I have a good stand with members at the moment. \n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]What do you think of your relationship with the prominent members? \n[color=white][b]Ignite.: [/b][/color]I have never spoke to any of the staff in a real conversation, I'd think I'm looked upon as a good member to certain staff members, I'm quite down with my group leaders and I have done some good deeds for Omniscient in the past.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Do you have any specific goals for your time on HF?\n[color=white][b]Ignite.: [/b][/color]Well, I have met most of my goals already, gaining some new friends people asking me for help must be something. I guess a goal for me would be able to become a Mentor or possibly rank up within a group. I've met my main goal and that was just being able to make friends on a forum I was completely new to.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]So you're content with what you have so far?\n[color=white][b]Ignite.: [/b][/color]Yeah. Some goals would be to set things straight with some people who I dislike or people who dislike me, I feel I have gained a lot due to only being here for 4 months.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Well, I see you got the RAT award. Did you expect to get that award, or were you hoping you would shine in another field?\n[color=white][b]Ignite.: [/b][/color]I most certainly did not, I didn't expect to gain an award that is actually earned due to quality around the forum, one award I would love would be Millitant not that I deserve it just the fact it looks like a nice award to have, I do like to voice my opinion though.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]You see yourself as an outspoken and defensive person?\n[color=white][b]Ignite.: [/b][/color]Not really. I only speak out when theres something I disagree with, or just come out with what's on my mind. I wouldn't say I''m defensive either I take everything on the chin.\n\n[color=#1466ff][b]Daniel Faraday: [/b][/color]Thanks again for taking the time to do this interview. I hope I see you around HF.\n[/spoiler]\n\n[align=center][img]http://goo.gl/G1F5k[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=CyQdJNaJAl8[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\nWebshow-Answer QnA-Talk about the Topics sent in-Guest Speaker ^ Interview ^ No One--Leadership---Existence (http://goo.gl/3w1Dn) - <Leader - Rats Crew - Taking Bribes---kindavidd (http://goo.gl/BIQVi) - >Leader - Minecrafters---Diabolic (http://goo.gl/aJS0l) - <Leader - Reverence--Awards---Tsgh Mike (http://goo.gl/CAkBR) - Cat Lover - Happy Birthday from alabam‍a!---Diabolic (http://goo.gl/aJS0l) - Master Donator - Thank you for reaching for this award. Donations always help HF.---Diabolic (http://goo.gl/aJS0l) - Businessman - You've shown an entrepreneurial spirit.--Misc.--Questions---[/spoiler]",
      "subject": "*"
    },
    {
      "pid": "18000855",
      "uid": "515249",
      "dateline": "1323325668",
      "message": "[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aquarius:[/font][/size][/color][spoiler=]\r\nThis week you'll feel warm and loving to a friend or perhaps a group or a member of your group. You feel you can identify with them. They embody values you admire. This might even involve an old friend you haven't seen for a while. Whatever the case, be careful because arguments later in the week, about shared property, inheritances, debt, taxes or how a certain amount is spent, could suddenly turn nasty. In fact, because you are so hopeful and passionately identifying with someone, your disappointment might be even greater. You might feel let down or betrayed. (Always forgive your enemies, nothing could annoy them more.) [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Pisces:[/font][/size][/color][spoiler=]\r\nThis will be a memorable week. No question. Your relations with powerbrokers, authority figures, parents, teachers, VIPs and the police are very intense - and very meaningful to you. In one way, everything is wonderful and going swimmingly. But don't count your chickens before they're barbecued. Late in the week, arguments with partners and close friends might erupt. It's almost like too much of a good thing is tough to handle. But you can avoid this nastiness. Try for a middle-way approach to everything. Don't be happy nuts and don't be angry nuts. You're very emotional and sensitive. Keep your cool or others will think you are silly nuts. Which, of course, you aren't - but highly emotional behaviour about things that others don't feel emotional about is always questionable.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aries:[/font][/size][/color][spoiler=]\r\nThis week, most of you can stay out of trouble if you avoid arguments about politics, religion and racial issues. Actually, avoid arguments about publishing, legal matters, medicine, the media and anything to do with travelling or higher education. Hey, let's forget specifics - why not just avoid arguments? The name of the game is to be happy, right? You are definitely a passionate sign. You live your life with passion because anything else would be stale. Meanwhile, travel and philosophical issues are important right now and you're revved up about health issues or something at work. Oy vey. You're ready to go off with the slightest provocation. Remain calm. [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Taurus:[/font][/size][/color][spoiler=]\r\nYou have enormous financial savvy. No matter what you do for a living, you know how to parlay a little amount of money into something substantial. And even though you love your creature comforts and the good life, you are ever watchful about your cash and possessions. Perhaps this is why inheritances, shared property, taxes and debt are touchy subjects this week. It certainly looks like you can expect squabbles about sports, social expenses, child-related costs, vacations and wanting your fair share of something. But will fighting get you what you want? Probably not. Be patient but be smart. Think of your objective. (\"I want it all!\") [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Gemini:[/font][/size][/color][spoiler=]\r\nOh dear. This is the classic week for arguments with partners and friends. For starters, do yourself a favour and refrain from telling others how to improve their lives or how to do things, even though you can see you're right. (This will go over like a lead balloon.) Ex-partners, back on the scene, might also trigger arguments directly or indirectly. Furthermore, you are sensitized because domestic stress due to chaos and increased activity (renovations? family conflicts?) has you on edge. Calm down. Don't say anything you will later regret. Partnerships can be sexy! (Just remember: A woman's place is in the house - and the Senate.) [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Cancer:[/font][/size][/color][spoiler=]\r\nYou're luckier than some this week because where you feel aggravated is related to job, earnings and possessions. So for the most part, your private life, home and family will be buffered from this angst. (That's a relief.) Nevertheless, relationships with co-workers will be testy because of errors, mix-ups, delays and cancellations. (Of course, this is frustrating.) Nevertheless, resist the urge to introduce reforms or suggest better ways of doing things. Not good! (Also not smart.) Be low-key. Right now Mars is making you come on like gangbusters. You're more pushy than usual. This is one reason others react so strongly to you. Remember: You catch more flies with honey than vinegar. Sweeten thy tongue. [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Leo:[/font][/size][/color][spoiler=]\r\nA tricky week ahead. The areas you'll feel most passionately about are the areas you always feel passionately about, namely: romance, your kids, social events, the arts and your creativity. Fortunately, passion about these areas can be positive and thrilling or extreme agitation. Passion can always go both ways. Friction with finances related to these areas (like how much your kids cost) will be classic. You easily spend money on romantic partners, kids and entertaining. Just don't go overboard. Tighten your purse strings. And don't tell your kids how to live. (You know who you are, hopefully. It's tough being nostalgic with a bad memory.) [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Virgo:[/font][/size][/color][spoiler=]\r\nWow! You've got energy to burn. (That's because fiery Mars is in your sign now and it's gonna stay there for the next eight months.) This is energizing for you, but do be careful while you're struttin' your stuff because your cocky, confident attitude might trigger domestic disputes or arguments with family members. Of course, this doesn't have to happen, it's just a possibility. Many of you will throw yourselves with delighted abandon into redecorating and renovating projects or home repairs. You want to see improvements where you live, especially to plumbing, bathrooms and even garbage areas. (\"Let's do this recycling right.\") I think you have an excellent opportunity to use this passionate influence this week in a very positive way. You can improve your life! [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Libra:[/font][/size][/color][spoiler=]\r\nI mention in All Signs above that there's a particularly strong \"passionate\" influence this week. Some will more easily use it to their advantage, while others might be more challenged by all this emotion. Regretfully, you are in the latter category. The good news is it will make your writing, speech and communications with others very bold and passionate. If you're in law, sales, marketing, or you write, teach, act -you can really use this to be dramatically effective. However, this same influence can blind your logic and make you argue for the sake of arguing. You have to be right. Try to catch yourself if you fall into this because how silly you will look! And you're not silly. \"Let the Wookie win.\" [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Scorpio:[/font][/size][/color][spoiler=]\r\nThis week, there's a good chance your feelings will be all stirred up about finances, cash flow, earnings or how to get a job, or something to do with how you currently earn your money. Naturally, none of this is casual stuff - not right now. This could be why you're at odds, later in the week, with a friend or a member of a group. (Ouch.) Try not to avoid this because, essentially, (just ask yourself) how can it work in your favour? Quarrels with others, and especially burning bridges, cannot help you in the future. Meanwhile, you do have a chance to boost your income (and spend it). Do this by embracing something you really enjoy. This could be related to the arts or making things look better. Get in touch with previous employers for surprise opportunities. [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Sagittarius:[/font][/size][/color][spoiler=]\r\nYou will really relate to my comments in All Signs above about feeling passionate this week. You will feel passionate about romance and relationships. In fact, you'll feel passionate about life in general. However, guard against your passion mushrooming to the point where you end up arguing with authority figures - bosses, parents, teachers, VIPs or even the police. It's wonderful to feel bigger than life. But you still have to deal with everyone \"out there in the dark\"- remember Sunset Boulevard? Count on your good fortune with health, employment and your job scene. Don't alienate others this week, especially those in authority who might affect your future. (\"These are not the droids you're looking for.\") [/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Capricorn:[/font][/size][/color][spoiler=]\r\nThere appears to be something that you want very much to happen, and yet you're being silent about it. (Or you're just playing your cards very close to your heaving bosom.) You're working behind the scenes or alone on something that matters enormously to you. (In addition, some of you are dabbling in a secret love affair. Although I think dabbling is not the operative word - you're plunging in!) Well, whatever happens might affect travel plans or something to do with publishing, the law, medicine and higher education. Adverse possibilities could precipitate conflict - especially legal - in these areas. Tread carefully. Do not wake the sleeping giant. [/spoiler]\r\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/news.png[/img][/align]\r\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list]\r\n[*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions\r\n[*]Headlines[/list][/list]\r\n[list][*][url=http://goo.gl/jZvPh]TheHackersLove[/url]\r\n[list][*]World News[/list][/list][/list]\r\n[list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*][url=http://goo.gl/JJuWm]Daniel Faraday[/url]\r\n[/list]\r\n[*][color=white][b]Web Show Co-Host[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/gGUxd]Astonish is NJ[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}