{
  "posts": [
    {
      "pid": "5359443",
      "uid": "74244",
      "dateline": "1280005694",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 10 [/align]\r\n\r\n[size=large][color=#FF4500]Headlines[/color][/size]\r\n[color=#FF1493]\r\nThis week Omniscient has introduced a new staff member to the family;[/COLOR] [url=http://hackforums.net/member.php?action=profile&uid=103669][b][color=#32CD32]Factor8™[/color][/b][/url] [color=#FF1493]became staff and with that came controversy. He was going around looking for things to report when oops! He repfucked someone with a problem over a year ago! This user, [url=http://hackforums.net/member.php?action=profile&uid=28373]TylerDurdenr[/url], was outraged until he had said sorry. He then said, \"We all make mistakes and I forgive him\". Many users were outraged with this and immediately requested a ban or demotion of Factor.  Many threads were closed and users were outraged..\r\n\r\n In reality people overreacted IMO. They really took a problem that could have been forgave and forgotten, and blew it up to max proportions and made a big deal out of this. Remember people, although he may have been nicer before staff or not, he still has a job to do and regardless of who you are he can not give you any special benefits. He is doing his job, and if you think he's going to fast, you're wrong. He is getting used to the job quite quick, but we're all humans and we all make mistakes, so forgive the poor guy and get over it!\r\n\r\nOmniscient also added a secret word for us users so then even if someone has hacked into your account they can't actually take the account where you can't get on. This means to change a password you have to also give the secret word! You had to create a question and an answer! Later this week he found a bug in it and had to reset them. Now it seems to be working fine and hopefully will keep members safe in the future! \r\n\r\nSomething Omniscient added late this week was the green msn-like Icon name next to your name. I like it because it's more noticeable to tell the difference between green and blue. Get ready to see about 100 threads on it for the next few weeks. This is going to be beneficial though for people with bad eyes. The hint of blue was not enough for some. Others may not like the change because the liked the hint of blue, but it doesn't make a big enough difference to worry about. Hopefully he keeps it! \r\n\r\nAnother thing that happened on Thursday was when Omniscient informed  members that they could no longer change their birth date and it will stay the same forever. You can still hide the full date, you can also hide the date and just show your age or show the full date and age. Why did he do this? Too many trolls on their birthday was being made and it was flooding the lounge with \"It's my birthday\" posts. Now everyone who did that as a joke is stuck with that birth date on here! Trolls about users birth dates with proof of the date in their profile is physically impossible now, unless your birth date is already false! Nice one Omni!\r\n\r\nLate Wednesday and early Thursday there was a big report build up.No staff was on for about 3 hours and there were many users reporting. N2H then came online and stated in a thread \"I have 17 pages of reported posts who ever is lqping is fucked\". After that statement him and Omni took down many reported posts. Before staff had came online users were posting many rule breaking threads and sales which resulted in a lot of bans last night. They had it taken care of and is in control now. Good work staff!\r\n\r\nFinally, Today Omni also changed the report reason of signature limit to profile violation. This is so then if staff see a report as this, the staff will check the users profile for anything regarding the user that could be breaking a rule. Omni stated \"Basically it's going to tell staff to view profile for a problem. Should be easy enough to spot.\" Seems to me that this report option is better than the one before! If you want to read more about it you can find the thread [url=http://hackforums.net/showthread.php?tid=561622]here.[/url][/color]\r\n\r\n--\r\n[size=large][color=#32CD32]User News[/color][/size]\r\n[color=#FF4500]\r\nThis week Omniscient had a great find on the internet! The video is called Sex donkey. You can find the video [url=http://www.youtube.com/watch?v=G7Pdlk_Go5k&feature=player_embedded]here[/url]. Omni stated that he was surprised that it isn't a 4chan hit yet! This has over 10k views and it's possible that it will go viral. \"We now know what Omni does on his alone time\" states -Nightmare jokingly. Pink Floyd also said that it's possible that this becomes the new rick roll! I could see that happening, but truthfully; What has internet videos come to? What will people have to do in 5 years to be famous? Who knows.. [/color]\r\n[color=#FF1493]\r\nThis week the user [url=http://hackforums.net/member.php?action=profile&uid=112139]Carbon[/url] had found an interesting video in the web. He found a video about a UFO over china. Do you think it was another life form? Yes? no? I personally am shocked when the white light blast forward across the sky most likely going extremely fast. Whatever that really was out there it did not look human built. Would you like to join the debate about it? You can find the thread and watch the mouth gaping video [url=http://hackforums.net/showthread.php?tid=559374]here.[/url]\r\n[/color]\r\n\r\n[color=#32CD32]Another very interesting post has been discovered this week in the  [url=http://hackforums.net/forumdisplay.php?fid=82]360 Section[/url]. There is a new theme for the xbox slim; Halo reach. The main color is a Grey xbox with a very cool design around it! If you are interested in buying a new xbox I would suggest getting this one for the good quality along with a great style for $399! If you would like to see the images and reply to the thread you can go here: [url=http://hackforums.net/showthread.php?tid=559703]Thread. (With Pics)[/url], [url=http://sphotos.ak.fbcdn.net/hphotos-ak-snc4/hs044.snc4/34585_1538002376596_1430986846_31410865_6906245_n.jpg]Picture of xbox![/url], and finally [url=http://www.haloreachtips.net/wp-content/uploads/2010/07/controller1.jpg]Picture of controller![/url]\r\n[/color]\r\n[color=#00BFFF]Our buddy Kr4z1 has made a suggestion today to HF that we stop giving out stolen xbox live accounts. Not only did he give some good reasoning, he also quoted the HF help docs and talked about them compared to this rule that he thinks should be made. He is right about the fact that these can contain CC's and then it would be breaking the rule of CC fraud. \r\n\r\nThe problem that even kr4z1 knows about is that the user would have to state it. His quote said \"The only problem with this idea is that OP would need to state that the accounts are stolen, other than that the only way to prove that they are, is to buy them from OP. \" This would mean that not only would we not know, but we would have to do potential illegal activity to find out! That's not a good sign! Omniscient stated \"At this time I have no official comment on the matter. Rules are being considered and evaluated against current policy. \" \r\n\r\nHopefully Omniscient finds a solution to this problem soon so that the most illegal activity possible in this situation can be terminated for good, or at least slowed down by his decision. [/color]\r\n\r\n[color=#FFA500]Happy hacker day everyone! Our random friend [url=http://hackforums.net/member.php?action=profile&uid=371623]venkya[/url] has recently made the thread saying \"There is no hackers festivals or day for hackers... So guys lets celebrate today!\" To many this was a complete fail, and maybe it was, but we should at least say thanks for him giving us a good laugh 🙂 You can find the thread that he announced this day in; [url=http://hackforums.net/showthread.php?tid=561099&page=1]here[/url]. [/color] \r\n\r\n--\r\n[size=large][color=#0000CD]Ban of the week[/color][/size]\r\n\r\n[color=#32CD32]This week [url=http://hackforums.net/member.php?action=profile&uid=78860]prone[/url] was finally banned this week! He was banned by N2H for flaming. He'll be back on the 29th and hopefully he learned something! [/color]\r\n\r\n--\r\n[size=large][color=#FF1493]Other News[/color][/size]\r\n[color=#32CD32]\r\nLetter from publisher- This is my second HF news made by me and I really enjoy doing it. This now will probably be my last one for a little because Yin is taking over next week. I hope wish him the best with that. I hope you guys enjoy this one and it seems a lot better than the last one I made in my honest opinion.\r\n\r\nIn other news: We seem to be getting more activity in users and that people are starting to post more frequently giving the forums the spice that we need to keep users interested. Keep up the High quality guys. You know I love you all! 🙂\r\n\r\nQuestions, comments, or concerns can be addressed in here and I do like criticism so then if I ever do it again I can fix things! Thanks for reading once again!\r\n\r\nRobi\r\n[/color]\r\n\r\nNote from Yin -\r\n\r\nI'll start doing them next week, Rob seemed VERY VERY excited to do it again, so I let him.",
      "subject": "HF News [7/17-7/24] [COMMENT]"
    }
  ]
}