{
  "posts": [
    {
      "pid": "5235674",
      "uid": "74244",
      "dateline": "1279498601",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 9 [/align]\r\n\r\n[size=large][color=#FF4500]Headlines[/color][/size]\r\n[color=#FF1493]\r\nThis week Hackforums had received a new easter egg that Omniscient made. He informed us about the easter egg on his twitter found [url=http://twitter.com/HackForumsNet]here[/url]. What the easter egg was is a middle finger that would be in the spot of the \"home\" icon. This resulted in [b][u]many[/u][/b] new threads that were asking what it was and also telling what it was.  If you still have yet to see it, keep an eye on the home icon sometimes because it's still there!\r\n\r\nOmniscient's direct quote about the easter egg - \"Added an Easter Egg to HF today. Let's see who finds it.\"\r\n\r\nOmniscient also added a new button this week! It was added to everybody's reputation page. What it the button says is \"report rep\". When you click it it redirects you to the reputation segment in the help docs. My guess is Omniscient was tired of the constant suggestion for that item. Good one Omniscient! The most informational thread I could find about it can be found [url=http://hackforums.net/showthread.php?tid=548856]here[/url] made by Mike. \r\n\r\nTwo new interesting sections were made this week that gave a place for some people that wanted to request a specific item in privacy of their own vip-like lounge and another for people to give away items. Hopefully that will weed those type of threads out of the lounge and give more room for other important/playful matters. \r\n\r\nYou can find the giveaways section [url=http://hackforums.net/forumdisplay.php?fid=174]here[/url] and the requests [ub3r only!] [url=http://hackforums.net/forumdisplay.php?fid=173]here[/url].\r\n\r\nFinally, the program spyeye has now been banned from discussion on this forum. This is because Omni has found out the truth behind another program that was being talked about lightly, but still appearing on occasion on the forum. It is a lot like Zeus which is a program that also steals bank account info. This is not something we would ever want on the site! You can locate the thread to the ban of spyeye [url=http://hackforums.net/showthread.php?tid=548760]here[/url]. Good find Omni![/color]\r\n\r\n--\r\n[size=large][color=#32CD32]User News[/color][/size]\r\n[color=#FF4500]\r\nThe new user [url=http://hackforums.net/member.php?action=profile&uid=396933]juneskii[/url] signed up last night telling everyone she is [b]not[/b] boxxy. She had a live cam making drawn sigs  saying things and many skids thought that possibly she was boxxy. She recognized hackforums was a reoccurring name in requests for sigs, so she signed up to see what's the commotion and she also proved it was her by commenting on [url=http://hackforums.net/member.php?action=profile&uid=230404]Logan[/url]'s YouTube with her account. She seems to not be too interested in much that we hold here so hopefully we don't get someone just begging for attention! The thread for that incident can be found [url=http://hackforums.net/showthread.php?tid=549651&page=1]here[/url]. [/color]\r\n[color=#FF1493]\r\nAnother very sad thing happened this week. The user [url=http://hackforums.net/member.php?action=profile&uid=372441]32.exe[/url] had impregnated his girlfriend on accident. I had a big argument in there with the guy, but I do understand that really it's both of the guy's and girls fault that a child is coming in to a what seems unsupported life. \r\n\r\nHe is/was considering leaving the girl which would/ will make matters worse for the girl and child. So much controversy was thrown around that thread. It was quick to realize he was not financially-able to support a child. Either way, regardless if a troll or not that should all teach a lesson to all users. When it comes to sex; put to on. (I love college)  You can find that deep thread [url=http://hackforums.net/showthread.php?tid=548510]here[/url].\r\n[/color]\r\n\r\n[color=#32CD32]This week our very triumphant member to hackforums, [url=http://hackforums.net/member.php?action=profile&uid=74244]Yin[/url] had posted his whole life story as a user[url=http://hackforums.net/showthread.php?tid=548552] here[/url]. He started it off by saying \"Well, I just noticed I got 500 reputations, thanks XCH4NG3 for that by the way. For a year and 3-4 months, I've come a long way. Get prepared for a long read.\"\r\n\r\nThis member has been through many positive and negative experiences here. He is a diamond in many people's eyes. His long speech about his life ended in a list of his closest people he could think of and his opinion on them. He has always worked hardest at what he does and I wish the best for him forever to come. \r\n[/color]\r\n\r\n[color=#00BFFF]Our good friend [url=http://hackforums.net/member.php?action=profile&uid=57913]killerpop89[/url] was banned this week for being drunk and didn't even know until the next day! He said he woke up witha a hangover then realized iBF had banned him stating \"drink alone\" He now has learned his lesson, but got the award \"drunk\" funny stuff killerpop! You can find killer's thread about the ban [url=http://hackforums.net/showthread.php?tid=547245]here[/url] [/color]\r\n\r\n--\r\n[size=large][color=#FF1493]Other News[/color][/size]\r\n[color=#32CD32]\r\nLetter from publisher- This is late because Yin was uninspired and with 8 good news I think he earned at least one break out of those many great threads. He is a great worker and I am very glad I got to help him with something that interests me in such a inspirational way. Thank you all who gave me small ideas to feed off of in my thread!\r\n\r\nIn other news; I have noticed many users getting to 1k posts congrats to you all and I cant wait to see more quality posts out of all of you!\r\n\r\nI hope you guys enjoyed the one and probably last HFN (HackForums news) by me until Yin needs me. Thanks for reading and I appreciate all comments, questions, support, and constructive criticism.\r\n\r\nNote from Yin:\r\n\r\nRobbieava did this edition. All credits go to him. I did not touch one bit of this news article other than this sentence right here. As for the Reviewers team and all that, that'll be soon. Just wait for it. I'll try to get it done this week. Maybe not.[/color]",
      "subject": "HF News [7/10-7/17] [COMMENT] [edition made by Robbieava, thanks]"
    }
  ]
}