{
  "posts": [
    {
      "pid": "26682405",
      "uid": "515249",
      "dateline": "1348460269",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#9f2dc5][b]110th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Vouch Begging Additions[/b][/color]\nIt's been a slow week in regards to updates and site changes, although Omni still managed to pull a few public updates out of his sock. One of these is the reinstatement of the vouch begging rule. It is thought that this rule will be heavily enforced, and will help keep the Marketplace beggar free. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has added a 10% warning level for anyone who violates this rule, as well as a new report option labelled '[i]Vouch Begging[/i]. The rule has been added to the Help Docs. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet on the matter, click on the following link: http://goo.gl/azmIK\n\n[color=white][b]Game Invites like OMGPOP[/b][/color]\nBy constant request, spamming and further destruction of the Lounge, a new subsection under Gamers Lounge was added. This new subsection is called 'Game Invites like OMGPOP', and is as the title suggests, for game invites, such as the highly popular OMGPOP games (especially OMGPOP Pool). On top of this, the Console Gamers Haven was merged into the Gamers Lounge to cut down on semi-inactive sections. Hopefully this new section will help OMGPOP lovers unite, and removes a lot of invite threads from the Lounge, where they were posted since they require almost instant attention. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet on the matter, click on the following link: http://goo.gl/GYyHw\n\n[color=white][b]Miscellaneous[/b][/color]\nAs it has been a relatively slow week, there were an array of minor updates/changes which were introduced. In major news, AOL emails are finally back up, after various attempts made by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] to get the email issue sorted out. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] also joined HF members earlier in the week in a Tinychat. He posted the link on his Twitter, and the opening attracted [b]many[/b] members to his unnamed Tinychat. Also, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] gave us a sneak peek at what exactly he has to deal with on a day-to-day basis. \"110 PMs sent by me and it's not even 3pm. Just an idea of how active and busy I am.\" I'm sure there has been a lot going on behind the scenes, as there always is, and apologies for the late edition this week, on behalf of the team.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=285508][b]Pocky[/b][/url] reached 2000 reputation points! Congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=759904][b]Vexna[/b][/url] is no longer moderator of the Hacking Tools section.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1160330][color=black][b]WarrioR™[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1316890][b]Oats‌‌‌‌‌‌[/b][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][color=black][b]Chief.[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=195737][color=black][b]Blue Username[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1451900][color=#FFD700][b]FZero91[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=752389][color=black][b]based‌[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=542911][color=#FFD700][b]Robin Van Persie™[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=619030][color=black][b]iNviZ[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1160330][color=black][b]WarrioR™[/b][/color][/url] was banned after allegedly having his account stolen, which also went on a scamming spree.\n[*][url=http://hackforums.net/member.php?action=profile&uid=130384][color=black][b]Note[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1316890][b]Oats‌‌‌‌‌‌[/b][/url] was banned for ban evasion.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1125749][color=black][b]Kray[/b][/color][/url] was banned for disrespecting Staff.\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][color=black][b]Chief.[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=195737][color=black][b]Blue Username[/b][/color][/url] was banned for racism.\n[*][url=http://hackforums.net/member.php?action=profile&uid=412925][color=black][b]Indomitable[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=48886][color=black][b]stdio.h[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=752389][color=black][b]based‌[/b][/color][/url] was banned.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=716331][b]Cryptic™[/b][/url] received the Sticky Man award for making a thread on Habbo.\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453][color=#00FF00][b]Chris[/b][/color][/url] received the FPS Gawd award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=992333][b]Accident[/b][/url] received the Sticky Man award.\n[/list]\n\n[color=white][b]Group Leadership changes[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=942724][b]Legacy.[/b][/url] is no longer a group leader of Respawn\n[*][url=http://hackforums.net/member.php?action=profile&uid=1115097][color=#0066FF][b]TheVortex[/b][/color][/url] is no longer a group leader of Rhythm.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1018876][b]Phytrix[/b][/url] is now a group leader of Rhythm.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=1326923][color=#0066FF][b]Strokes[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2884878][b]Why Do Women Still Take The Man's Last Name?[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=485087][b]ChRoNiC™[/b][/url] - [url=http://hackforums.net/forumdisplay.php?fid=128&page=3][b]what is so honorable about joining the army? i don't see it...[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=183072][b]Mr Kewl[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2860584][b]General Comparison between iPhone 5, Galaxy S3[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2870849][b]The Galaxy S3 beat's the iPhone 5 A6[updated TRUE benchmarks added][/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1044864][b]malichi[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2872273][b]Secret Video: Romney To Millionaire Donors[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=818706]Gwamp[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: G'day Gwamp. Thanks for joining us for this interview, on the 110th edition of the HF News. Any shoutouts?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: Thank you for letting me be interviewed on this wonderful day. I would like to give a shoutout to all my closest friends that has been supporting me from day one. Can't write all their names down since there is to many and if I only write one down and it wouldn't be fair.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Not a problem, it's an honour. Why don't you enlighten the readers on how you were introduced to HF and what activities you originally partook in?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: To be honest, I barely remember how I got into Hackforums. I remember having an account on it and I just started from 0, 'till becoming L33t and now Ub3r. I started with nothing and barely knew anyone, I began to join upgrade contests and I won for the first time in my life. I was really happy that day but something was missing. Being :33t isn't that easy since you get reputation abused by Ub3rs that likes to negative L33ts/non-upgraded members.I became a marketer in the year of 2012 and still are from this date. I do enjoy gaming, and I do alot of marketing as I love making products and being into the sale/buying community.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds good. I too can't remember exactly how I was introduced either, although I suppose that's part of the journey. You said you 'love making products'. What products have you made, and what skillsets do you need to produce these products?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: I don't make the products. Basically, when you open a booter or something related, what you will need is materials such as Servers/API's, hosting, and a source, among other things. When all that is set, you can go ahead and sell the product. I have been selling Skype resolvers, booters, middle-man services (if you can call that a product), and Steam accounts (not my products but my accounts). \n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds good. What is it that attracts you to marketing? Is it simply the income, or is there more to it?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: What really attracts me is what is being sold and what's not being sold. I really have a lot of interest in booters. A lot of new ones are being opened and don't go well. Whenever something new is released in the Marketplace, I usually check it out. I rarely post on these threads, but I do check them out to see what it is and what they offer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: While we are on the topic of sections, what other sections do you frequent on HF and why?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: I don't like The ounge that much, since most threads are filled with nonsense stuff that I don't like. I do hangout in the Marketplace and the group subforums mostly. Whenever something interests me in group subforums, I usually post in them. If it's something I find LQ or something that doesn't fit my interests, I usually don't post on them. I do like the Graphic section as well since I've always been inspired about how GFX works and how to make graphics. I once downloaded Photoshop and tried myself, but that didn't really go well. The Graphic/Group subforums/Marketplace are the primary sections that I visit.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: You mentioned that you hang out in group forums a fair bit. You are a member of both Respawn and Illuminati, as well as Eminence, which are relatively renowned groups for their level of expertise in certain sectors (Gaming for Respawn, Marketing for Illuminati). How do these groups contribute to your HF life, and which groups have you been in previously?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: I only just got into Respawn and I really love to be in the group as I love gaming and do enjoy it. The forum of Respawn has a lot of member contributions which I enjoy using. Eminence is a group that I barely look into as the group is falling apart. The Illuminati is definitely a group that I enjoy being in as it has a lot of opportunities to share what you have on your mind, and plenty of great things you can learn from and share with other members as well. It's a great group and definitely something that will be beneficial in my HF journey. I am in/have been in the following groups: Rhythm, Root, Eminence, Illuminati, Respawn, Logic, The Creed and The Empire.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: As an avid gamer, which console do you prefer? Also, which games are your favourite, and why?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: I'm a PS3 gamer as I enjoy using it. Also, most of my friends play on PS3. I do enjoy playing Call of Duty games as they are pretty fun. I also play GTA games. At the moment, I'm waiting for the new GTA 5 to be released as it's something I've been waiting for since its announcement. The game has some great new additions.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds good. What kind of music do you listen to (genre, bands, songs)?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: I have been a Hip-Hop fan since I was born. I do enjoy Hip-Hop and I listen to it every day. My favorite rappers are: Tupac/Notorious/Warren G/Nate Dogg and plenty more. I've been a Tupac fan since I started listening to his music. All of his songs makes sense and he speaks from experience. My favorite Tupac songs are: Dear Mama, Life Goes On and Ghetto Gospel.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: You definitely listed some legends in that list. What is your view on the legalization of marijuana?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: For me I think any kind of drugs should be illegal as it hurts you without you knowing it. Marijuana or not, drugs should not be sold or taken. It hurts you every time you take/smoke it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I see your reasoning behind that, although what about medical marijuana?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: If the doctors or whoever who has knowledge about the human body gives you a medical card, and you really are in a lot of pain, sure. There are plenty of other things you can be healed of or medicine if you aren't seriously injured, though. No matter what, drugs aren't healthy for you. Drug users have a much lower life expectancy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for joining us for this interview of the HF News. Any final thoughts/comments before you leave?\n[url=http://hackforums.net/member.php?action=profile&uid=818706][color=white][b]Gwamp[/b][/color][/url]: Thank you for letting me being interviewed. Once again, it was a pleasure.\n[/spoiler]",
      "subject": "[9/22/12] - HF News"
    },
    {
      "pid": "26682413",
      "uid": "515249",
      "dateline": "1348460294",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=white][b]Medal of Honor Warfighter Beta[/b][/color]\nXbox Players, ready for another Xbox exclusive beta? EA announced that the Medal of Honor Warfighter Beta will start in early October. Xbox players will be able to try a new multiplayer mode called HotSpot. If you are keen on getting the full game, you will receive an hour of double exp when the game fully launches. Medal of Honor Warfighter is set to be released on October 23rd.\n\n[color=white][b]Influx of Halo 4 news[/b][/color]\nCompanies such as IGN and Machinima went to an exclusive event where they could gather massive amounts of Halo 4 gameplay and information. Earlier this week, they were finally allowed to reveal what they saw at this event. You may have already been spammed in your YouTube news feed, however if you haven't, you should check out Bravo's [url=www.youtube.com/bravomlg]YouTube channel[/url] as he discusses and links everything that was announced.\n\n[color=white][b]Mass Effect 3 Omega DLC[/b][/color]\nEven with BioWare founders retiring, the company has announced new DLC for ME3, debuting this fall. It centers around a space station called Omega, after which the DLC is named, which has been captured by the Illusive Man. This mission was planned to be in the original release of the game, but could not be put in due to time constraints. For spoilers on the DLC's plot and more information, see [url=http://beefjack.com/news/upcoming-omega-dlc-already-hinted-at-in-mass-effect-3-script-files/]here.[/url]\n\n[color=white][b]NHL 13 beats Franchise Sales Records[/b][/color]\nThe developer of NHL 13, EA, has announced that the game sold 491,590 copies during its launch week, better than any other launch in the series of the game. To date, over 3.7 million games have been logged, in part due to an enhanced physics engine that the game sports, smart (sometimes too smart) AI players and a challenging gameplay. For a full review, see [url=http://www.gamespot.com/nhl-13/reviews/nhl-13-review-6396299/]here.[/url]\n\n[color=white][b]New PlayStation 3 Model Released[/b][/color]\nThe much rumored PS3 model made its debut earlier this week at Tokyo Game Show. The new model comes fitted with similar specs, and comes in both 250GB and 500GB. The new model is sleek and slimmer, yet still pertains the trademark look of the PlayStation. The smooth charcoal black color, accompanied by its weight (25% less weight), should maintain Sony's success in the console gaming industry. Japanese buyers are able to buy a \"classic white\" version of the PS3, differing from other regions globally which are only offered charcoal black. System versions and prices will vary across regions, although prices range from as low as $US269 for the 250GB version in North America and $US299 for the 500GB version in North America, to over $USD400 in New Zealand (500GB). This new model will be released over the coming month; some as soon as September 25th and some as late as October 12th.\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Dispute Between China And Japan[/b][/color]\nA small collaboration of islands in the waters between China and Japan is resulting in a large dispute between China and Japan. Shintaro Ishihara, the Governor of Tokyo, announced that he planned to purchase the islands in question, called Diaoyu Islands (Senkaku Islands) from the private owners for 2.05 billion yen (US$26.2 million). The People's Republic of China shot down the offer, stating that \"The Diaoyu Islands are China's territory since ancient times\". This means that China refuses to sell the islands to Ishihara, despite the offer. The Japanese Government has responded by saying that the islands are in their territory, which sparked further dispute. China dispersed 6 patrol ships into the waters around the islands, before leaving shortly after. The fighting between the two countries' governments resulted in their people fighting, showing pride in their country's decisions and protesting their opinions. Of course, the question arises; why are these islands [b]such[/b] a big deal? Surveys conducter by the U.N. Economic Commission for Asia and the Far East (ECAFE) state that there [i]may[/i] be large oil and natural gas reserves underground, although it is still unknown.\n\n[color=white][b]Russia Sitting On A Diamond Mine[/b][/color]\nA woman's best friend for decades has been the diamond that she hopes to get on her wedding day. If only Russia was the groom... Russia has announced that many years ago (~40) they discovered a \"35-million-year-old, 62-mile diameter asteroid crater\", which was absolutely flooded with diamonds. It is said that this field contains trillions of carats of diamonds and can supply the diamond market for \"3000 years\", the head of the Novosibirsk Institute of Geology and Mineralogy, Nikolai Pokhilenko, bragged. Russian news sources also claim that these diamonds are twice as hard as normal diamonds. These can only be used for scientific/industrial purposes and not jewelry, as they are not \"jewelry quality\" a spokesperson for Alrosa said. It is thought that the cost of harvesting and importing this diamond for industrial purposes isn't cost-efficient either, making them relatively useless. Despite, this release shocked the world, and even extracted a \"Holy s---\" response from Dustin Chalchinsky, a geological specialist for Eurostar Belgium.\n\n[color=white][b]Death Of US Ambassador Fuels More Protesting In Libya[/b][/color]\nChristopher Stevens, the US Ambassador to Libya, was widely respected and known for his partaking in the take-down of Muammer el-Qaddafi (the \"Brother Leader\" of the Libyan Arab Jamahiriya for decades). Although, Stevens and three other embassy staff were killed in a militant attack against the consulate. US intelligence suspects that one of the leaders of an Islamist group linked to al-Qaeda, Sufyan Bin Qumu (leader of Ansar al-Sharia), is behind the murders and infiltration. Libyan civilians attacked Qumu's militia in outrage and revenge. Thousands of people marched down Benghazi holding signs demanding justice. Several people were wounded from the protesting and attacks on the militia headquarters. Although, the killing of the US Ambassador is not the only reason behind what has happened. Ansar al-Sharia, holding weapons, walked through Benghazi, protesting for an Islamic-based government.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nEarlier this week, Apple was put to shame over their defective mapping system included with iOS 6. Apple was the first company to use their own mapping technology rather than Google's, although it is now known that Apple knew the system was defective, yet still released the OS. Critics watching for a slip after Steve Jobs' death have finally noticed a major error on Apple's behalf, and are now rumouring that without Jobs' attention-to-detail, the company may lower their standards further. The mapping system is missing many street names, landmarks and failed directions just to list a few. Apple claims that moving into their own technology and binning Google's technology is a step they needed to take, for both monetizing reasons and for the standing of Apple as a self-reliant company. This failure has many purchasers of the new iPhone 5 in protest and has ridiculed Apple's reputation.\n\n[color=white][b]Facebook[/b][/color]\nA Dutch girl only wanted to have an innocent party, although after posting the party invitation of Facebook and forgetting to set it to private, it only caused a riot. A 16 year-old girl posted an invitation to her party a few days ago, and based on her lack of knowledge with settings, there was a turnout of over 4,000. Even after cancelling the invitation, of which 30K were already sent, the massive turnout was enough to attract riot police and make headlines. This Project-X replication caused the girl to leave her home in fear before guests arrived, riots broke out and 600 riot police officers rocked up to settle the mess. A clean up project has been started for the small town of Harem.\n\n[color=white][b]Short?[/b][/color]\nYes, sorry for the short Tech News today. The usual writer was out as his ISP blocked his internet access for unknown reasons, and I, Phytrix, was on time constraints.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Rhianna Disgusted By Brown's New Tat[/b][/color]\nAfter Chris Brown received a tattoo on his neck earlier this week, Rhianna has stated that she finds it a \"painful reminder\" of past issues. Rhianna claims that the tattoo resembles a picture of her that was taken after Brown attacked her in '09. The 24 year-old is both shocked, angry and upset by Brown's new ink, and was only done to hype up the incident once again. Critics are siding with Rhianna on this one, saying it does majorly resemble the image and wasn't just coincidence. Rhianna's close friends state that she was \"on the verge of reconciliation\". The two were also seen kissing at the recent MTV Music Awards. It is doubtful that this rekindling romance will last after this incident, though.\n\n[color=white][b]Ou Est Lest We Forget[/b][/color]\nThe heartbreaking story of an upcoming band, Ou Est Le Swimming Pool, was rekindled this week. It seems that many are still unaware of the tragic story which occured 2 years ago. The lead singer of the music group, Charles Haddon, commited suicide at the ripe age of 22 in August '10 after a concert. \"He reportedly killed himself by climbing to the top of a satellite mast in a backstage parking area and jumping off\", which has since been confirmed. Now, some of you may be thinking, great; another suicide, although the passion that this man showed for his music and morality is far beyond the average person. After a failed stage dive at a concert, he landed on a girl, and feared that he had paralysed her. The girl suffered major injuries, although has recovered. It is still unsure whether the suicide was linked solely to this issue, but it'd be logical to assume that it played some role. Our music video of the week is in remembrance this week.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=c_M3Txktt8w[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n\n[video=youtube]http://www.youtube.com/watch?v=nVjsGKrE6E8[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=hl3VS7Vn97I[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=VHazMwEerq8[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThank you Phytrix for covering many of the positions while people were MIA.\nA little explanation:\n[b]OnTheFly[/b] - Headlines - Account Hacked\n[b]Prince(tm)[/b] - Tech News - ISP Blocked Internet Access\n[b]MarkMare[/b] - Gaming News - Low Internet Bandwidth, Only Mobile Access\n[b]Bay[/b] - Music News - Unknown Circumstances\n[b]Barneyyz[/b] - GFX - School Work and New Job Orientation\n---\nIf I don't get a better amount of articles, on time, this upcoming week, I will be making some changes.\nThe reasons seemed valid for this week's problems.",
      "subject": "*"
    },
    {
      "pid": "26682416",
      "uid": "515249",
      "dateline": "1348460306",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"How do you feel about the ability to purchase a custom usergroup coming to a close?\"\n\n[i]\"In my opinion, I think it's great that Omniscient isn't allowing people to buy groups anymore, \nnot only is their to many groups already, but nearly every member is apart of a group, which \nshoots out the popularity of the Group feature. If I was a new member here, I wouldn't think \nthat Groups are valued at high amounts and are a rare content to the site. Even with the amount \nof groups their are now, theirs still to many of them. If I were Omnicient, I would consider \ncharging group owners a fee each month or year to keep their group alive. That'll surley prove \nthe Group owners loyalty to keeping their group alive, and how dedicated they are.\nBut, that's just my opinion.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1446447][i]-Democracy[/i][/url]\n\n[align=right][i]\"I agree, and disagree. Omni should either raise the price, or just give it a little \npause. I do agree with him that Usergroups are becoming less rare, but many people use usergroups \nto help a specific group of people. Sometimes, usergroups can show a sign of High-quality if you're \nin one (That you didn't buy your way into).\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=822426][i]-iHaX™[/i][/url][/align]\n\nThe topic for next week is \"What do you want to talk about?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][i]Missing Until Barneyyz Returns[/i][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/la9nk.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/E9VaP.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=1OiHaqtyn-o[/video][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[list][*]World News\n[*]Tech News\n[*]Music News\n[*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}