{
  "posts": [
    {
      "pid": "7534184",
      "uid": "136025",
      "dateline": "1289093594",
      "message": "Hello everybody. Unfortunately, The Elite was unable to write this edition due to a family emergency. If you would like to read more about this occurrence, please [url=http://hackforums.net/showthread.php?tid=798392&page=1]CLICK HERE[/url] for the full story. Please make sure to give The Elite your best wishes, as he goes through a tough time. My name is [url=http://hackforums.net/member.php?action=profile&uid=311070]Virtual Reality[/url], as some of you may already know me. I will be writing this weeks edition of HF News, as The Elite is preoccupied with important personal matters. I have done my best to write most preeminent issue possible, and feedback is appreciated. So with out further ado, here are our HF Headlines for October 31, 2010 - November 06, 2010!\n\n[hr]\n\n[align=center][IMG]http://min.us/icFot8.png[/IMG][/align]\n\nLast week, it was reported that two highly-respected and trusted staff members were demoted, and than shortly after promoted. It has come to our attention that these two staff members have once again been demoted. Of course, we are referring to [url=http://hackforums.net/member.php?action=profile&uid=7807]VipVince[/url] and [url=http://hackforums.net/member.php?action=profile&uid=82773]KewlHotRod[/url]. Stay tuned, as we will have an exclusive interview with VipVince regarding this occurrence at the bottom of this thread.\n\n[align=center][color=#FF4500]--[/color][/align]\n\nIn other news, it was found that [url=http://hackforums.net/member.php?action=profile&uid=139769]mKn1ght[/url] had been infecting members via binding infected files with a copy of OpenVPN. It has become apparent that [url=http://hackforums.net/member.php?action=profile&uid=139769]mKn1ght[/url] had distrubuted this infected file to many users. Recently, [url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url] released a well-detailed guide on how to remove this infection. After this entire fiasco was revealed, the once respected user and the threads containing possibly harmful download links were quickly removed. If you would like to read more, or feel as if you may of downloaded this malicious infection, we encourage you to read and follow the directions stated within [url=http://hackforums.net/showthread.php?tid=789958]THIS[/url] thread.\n\n[align=center][color=#FF4500]--[/color][/align]\n\nIn recent weeks, it has come to the attention of the community that there have been many errors and/or glitches occurring around the site. When Omniscient was asked about some of these quirky mishaps, he released the following statement: [i]\"Database problems, anomalies, and irregularities probably won't be fixed until I get a new server.\"[/i]. If you are experiencing any technical difficulties, we urge you to use the [url=http://hackforums.net/search.php]HF Search Module[/url] in order to confirm whether or not other users are experiencing or have experienced the same issues. If you find no evidence that this has been reported before, administrators would appreciate it if you posted a detailed chronicle by posting [url=http://hackforums.net/forumdisplay.php?fid=2]HERE[/url]. Please keep in mind that all reports with any sort of personal information regarding both yourself or another member, are to be privately messaged to a moderator or administrator.\n\n[hr]\n\n[align=center][img]http://min.us/icAP7c.png[/img][/align]\n\nIn regards to news that has become quite a shocking revelation to many users, [url=http://hackforums.net/member.php?action=profile&uid=117387]Verdande[/url] was rep-fucked and banned for 1 month, due to being accused of scamming. According to popular sources, a user Private Messaged an administrator in regards to being scammed by Verdande. Omniscient apparently found on-site proof of this exiguous transaction, and Verdande was banned for one month. In an act of complete defiance and retaliation, [url=http://hackforums.net/member.php?action=profile&uid=416897]Ectoplasm[/url] bravely yet what some would refer to as \"immaturely\" stood up for his good friend in an audacious way, to say the least. In the end, Ectoplasm was also rep-fucked for his deviance. If you would like to read more on this subject, [url=http://hackforums.net/showthread.php?tid=788737]CLICK HERE[/url] to view the thread Ectoplasm created pertaining to this matter.\n\n[align=center][color=#FF4500]--[/color][/align]\n\nIt has come to our attention that [url=http://hackforums.net/member.php?action=profile&uid=59160]OG iFuck[/url] has been banned due to the fact that there have been multiple scam reports filed against him. This infamous \"lounge whore\" will troll no more, as his account has been closed. We wish OG iFuck all the best in his future endeavors, yet we urge all users to avoid making any sort of business transaction with him, in the event that you come into contact with this member around the net.\n\n[align=center][color=#FF4500]--[/color][/align]\n\nIn more positive news, HF has been given a nice breath of fresh air, as new member [url=http://hackforums.net/member.php?action=profile&uid=496620]Marik™[/url] has published many HQ guides and tutorials around the forum; His most popular being [url=http://hackforums.net/showthread.php?tid=784767]\"HackForums - Fully Explained\"[/url]. It is safe to assume that this member has the potential to make a positive impact on the community in the future! If you would like to view the rest of his recent tutorials, you may do so by clicking [url=http://hackforums.net/search.php?action=results&sid=76b351d4d0dcbec1fcf8b159832cacff]HERE[/url].\n\n[align=center][color=#FF4500]--[/color][/align]\n\nIn relation to the last story, [url=http://hackforums.net/member.php?action=profile&uid=141530]Malware Boss[/url] has published a greatly detailed guide on how the [url=http://hackforums.net/myawards.php]HF Awards System[/url] truly works. We highly urge all members who are not completely familiar to this procedure to read his tutorial. You can view it at any time by clicking [url=http://hackforums.net/showthread.php?tid=795033]HERE[/url]. Alternatively, you may nominate yourself for an award by posting in [url=http://hackforums.net/showthread.php?tid=514639]THIS[/url] thread!\n\n[hr]\n\n[align=center][IMG]http://min.us/icBmY2.png[/IMG][/align]\n\nAs you all know, [url=http://hackforums.net/member.php?action=profile&uid=136025]The Elite[/url] chooses one user to interview each week, in a segment he calls \"User Interviews\". Just because he is away, doesn't mean we can not continue with this segment. In face, I have decided to interview TWO members this week. Our two interviewee's this week are highly respected staff member; [url=http://hackforums.net/member.php?action=profile&uid=30595]The Rated R Superstar[/url], and former staff member; [url=http://hackforums.net/member.php?action=profile&uid=7807]VipVince[/url]! Let's not waste any time here, and get to our first interview!\n\n[align=center][color=#FF4500]--[/color][/align]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] Hello TRRS! Thanks for taking time out of your hectic schedule to answer our questions. First off; When did you join HackForums, and how did you find it?\n[color=lime][b]The Rated R Superstar:[/b][/color] [i]I first visited HF late October 08. I signed up in early November 08 and I found it because of a friend of mine that hacked my school.[/i]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] When you joined, was there anything about the website that really kept you hooked?\n[color=lime][b]The Rated R Superstar:[/b][/color] [i]At first it was just skidy stuff like phishers and .bat files. But then I found a home in the early days of the 360 section. I was the guru back then, Everyone waited for my replies.[/i]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] When were you first promoted to staff, and how did it make you feel?\n[color=lime][b]The Rated R Superstar:[/b][/color] [i]I was promoted on the 24th September, 2009. I didn't know how to feel. I was like \"OMG OMG OMG OMG\" and then I had to dial it down to reply to Omni about the position lol.[/i]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] How many hours a week would you say you spend on HF?\n[color=lime][b]The Rated R Superstar:[/b][/color] [i]A week? Hmmmm, Probably 24 max. I do have a life outside of HF.[/i]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] What is your favorite section of the site, and why?\n[color=lime][b]The Rated R Superstar:[/b][/color] [i]I don't have 1 favourite section. The Lounge, R&A, Anime Adventures, News and Happenings, 360 section and the Staff section. Just because they all hold my interest and have the most interesting topics from my point of view.[/i]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] Who are some of your favorite members on the site?\n[color=lime][b]The Rated R Superstar:[/b][/color] [i]Kn1ght, Krazi, N2H, and Omni.[/i]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] To end the interview, is there anything you would like to say while you have the opportunity to address the community?\n[color=lime][b]The Rated R Superstar:[/b][/color] I would have thought Omni's new plugin to stop people from reporting posts older than 30 days would have generated less reports. Not double them, WTF guys lol. \n\n[align=center][color=#FF4500]--[/color][/align]\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] Hello VipVince! Thanks for accepting this interview. Many users are talking about the controversy geared towards your recent demotion, so it truly is an honor to get the opportunity to interview you!\n[color=#FFD700][b]VipVince:[/b][/color] Thanks. I've always wanted to be on HF News, so it is my pleasure!\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] To start this one off; When did you first visit HackForums, and what motivated you to register?\n[color=#FFD700][b]VipVince:[/b][/color] Not many people know this, but about 3 years ago, when I was abit more niave about hacking, a online 'companion' of mine, ended up infecting me with a trojan, telling me it was a top of the range Anti Virus, after getting pwned by this dude, my computer hunger grew, I googled hacking etc, and ended up stumbling upon Hackforums. and then registering to make threads etc.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] After registering, was there anything that really surprised you about the community? What made you enjoy this forum enough to stay and contribute as an active member of the forum?\n[color=#FFD700][b]VipVince:[/b][/color] At first, I was like reluctant to get involved, had a misconception that everyone on here had mad computer skills, felt like a puppy kind of, thinking if I stand on anyone's toes I might just get my pc fucked up, then I realized the forum is populated full of 13 year olds, that know more about anime than C drives. I decided to stay, because I quickly became respected, and apart of the community, in the days when I joined, members had more respect, and appreciation towards shares etc, there was none unnecessary remarks being made by troll members in your threads like 'fail' 'lol wut', etc. The forum has changed, but so has life, if it didn't change, it would disappear.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] What is your favorite section on the forum, and why?\n[color=#FFD700][b]VipVince:[/b][/color] Lounge, that sounds so troll, but I do enjoy it, I do laugh at some of the ridiculous statements and threads that are made, I believe the lounge is Hackforums most valuable asset, its like a community within a community, some users are too highly strung regarding the lounge though, there is always going to be trolls populating it, just a shame the quality of the trolls has decreased though, Prone is the only 'troll' that I respect.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] When were you first invited to become a staff member, and how did it make you feel?\n[color=#FFD700][b]VipVince:[/b][/color] Umm around April 2008 I think, I was excited, felt privileged, felt even more apart of the community, its a nice achievement to be 1 of 7 or 8 staff on a forum as big of Hackforums. Speaks highly for a persons character.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] Many users have been wanting me to ask this, so here it goes; Why were you demoted, and how did it make you feel?\n[color=#FFD700][b]VipVince:[/b][/color]Omni has never revealed why he did so, I would have appreciated a PM from hin, as in a job it would be rude to turn up to work one day to find you had no job, and the boss/owner was no were to be found, but anyways, I can only guess, and have been told by good sources, it was because my activity level concerning reported posts wasn't as high as other staff's.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] Because you and KewlHotRod were demoted at the same time, is there any relation? What kind of insight can you give us regarding his demotion?\n[color=#FFD700][b]VipVince:[/b][/color] Yes and no, I feel we both got demoted for the same reason, lack of activity concerning posts, I think Omni just wanted an over all clean up with his team, therefore killed two birds with one stone.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] If you were invited back into the Staff user-group, would you accept? Would you do anything differently this time around?\n[color=#FFD700][b]VipVince:[/b][/color] I honestly would not accept, I have stated, I have enjoyed being staff in the past, but it has just lost its appeal to me, I come on HF to read, share, have a laugh, this is very limited when you have to constantly watch and stop what your doing to deal with reported post after post, removes the fun factor for me, so for that reason, I would say no, I have more fun just as a normal member.\n\n[color=#FF1493][b]Virtual Reality:[/b][/color] This concludes our interview. Thanks for taking the time to answer some of these hard-hitting questions. Is there anything you would like to say to the HF community, while you have the chance to address them within this interview?\n[color=#FFD700][b]VipVince:[/b][/color] Yes, keep it real. VipVince is coming to a neighbourhood near you, lock up your daughters, aunts, moms, grandmothers, nieces etc.\n\n[align=center][color=#FF4500]--[/color][/align]\n\nThat's it! I hope you enjoyed this weeks edition of HF News! It truly was a pleasure to write this. Please let me know whether you enjoyed reading it or not. Feedback is ALWAYS appreciated! I would quickly like to thank The Elite for giving the the opportunity to write this weeks edition, TRRS & VipVince for taking the time to answer my questions, Omniscient for providing such a platform of which I can actually write this on, and ALL OF YOU for taking the time to read this issue. I appreciate it!\n\n[i]- Virtual Reality[/i]",
      "subject": "[10/31/2010] - HF News"
    }
  ]
}