{
  "posts": [
    {
      "pid": "9078894",
      "uid": "0",
      "dateline": "1295117578",
      "message": "[align=center][img]http://img17.imageshack.us/img17/4422/headerni.png[/img]\n[/align]\n\nHello everybody and welcome to HF News [1/12/2011]. I would like to start of by letting everyone know that this is a brand new start for HF News as this weeks and hopefully from now on, HF News will be written as a team and not a one man show. \n\nI would like to Inform you guys who takes charge of what and how things are being written. Its only fair if their names are being credited so you can thank them for their hard work and contribution.\n\n[spoiler=The HF News Crew]\n[align=center][list]\n[*][color=#98FB98]Headlines: Mystic Guru[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]User News:Zeon[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]Other News:ShadowWyrm[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]HF Hacking: CATMAN[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]Video of the week:Julie[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]Congratulations to the following: Mark Webber [/color]\n[*][color=#98FB98]Congratulations to the following:Jesús[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]Interview:Minnesota Nice[/color]\n[*][color=#98FB98]Interview:Grammar Rays[/color]\n[/list]\n\n[list]\n[*][color=#98FB98]Logo GFX:Minnesota Nice[/color]\n[/list]\n\n[list]\n[*][color=#98FB98] Proof read / Grammar Checks: Dii™[/color]\n[*][color=#98FB98] Proof read / Grammar Checks:Scar[/color]\n[*][color=#98FB98] Proof read / Grammar Checks:Music[/color]  \t \n[/list]\n[/align][/spoiler]\nHave a good read everyone! ENJOY!\n\n[align=center][img]http://img269.imageshack.us/img269/8496/headlinesr.png[/img][/align]\n\nIt's been a busy week for [b][color=#00BFFF]Omniscient[/color][/b] since he has tons of work to do. He has upgraded his MySQL Database to the latest version, which is 5.5. You can also locate his thread [url=http://hackforums.net/showthread.php?tid=975094]Here.[/url]\n\n[b][color=#00BFFF]Omniscient[/color][/b] is also in need of a new HTTP server for HackForums which might help out HF with all the traffic and queries. HF has been having performance problems lately and it is making [b][color=#00BFFF]Omniscient[/color][/b] working hard to get it fixed and back up. You can locate his thread [url=http://hackforums.net/showthread.php?tid=964286]here.[/url]\n\nWe have another news of a staff, [b][color=#32CD32]The Rated R Superstar[/color][/b] that had banned about 20+ users for the same reason. The reason is for LQP/Off Topic Posting In A Scam Report. Some users are unbanned today and some are tomorrow. This might cause problems when they return back to HF.\n\ncongratulations to [b][color=#1E90FF]nokia2mon2[/color][/b] on his special HF group called \"Red Lions\". It is a group for HQ users. It is being operated by 4 members. I wish good luck for users who wish to join the group. [b][color=#1E90FF]Nokia2mon2[/color][/b] is doing very good on this site and that is amazing.\n\nWe would also like to tell you guys [b][color=#00BFFF]Omniscient[/color][/b] is now working on the Mentor group that tons of users wished to have on HF from a while back. It has now returned and [b][color=#00BFFF]Omniscient[/color][/b] is now working on setting it up.\n\nWe would like to congratulate [b][color=#32CD32]Vorfin[/color][/b] on becoming a staff but sadly [b][color=#1E90FF]phire nuk3r[/color][/b] was demoted for users who say he abused his staff powers. I wish both users to do great on the site! I hope [b][color=#1E90FF]phire nuk3r[/color][/b] one day will receive a second chance. \n\n[align=center][img]http://img211.imageshack.us/img211/300/usernews.png[/img][/align]\n\nThe user [b][color=#1E90FF]PhobiiA[/color][/b] has recently discontinued sales of his popular IRC bot, Ganja Bot. Many members believed that Ganja's features did not work as advertised and this was finally proven to be the case. The slowloris attack, one of Ganja Bot's main selling points, was proven to be a simple UDP flood. You can read more about it here: http://hackforums.net/showthread.php?tid=958067\n\n[b][color=#1E90FF]Jesús[/color][/b] recently opened a thread accusing the iPhone 4 seller [b][color=#1E90FF]v P r o x Y[/color][/b] of possessing multiple accounts. He had a lot of proof in this thread, and there was a lot of polemic about the incident. You can read his thread here: http://hackforums.net/showthread.php?tid=958311 As a result [b][color=#1E90FF]v P r o x Y[/color][/b] has been banned from HF.\n\nThe member [b][color=#1E90FF]nokia2mon2[/color][/b] has recently been awarded the MOTM award. There are mixed opinions on this, some state that he should not be liked just because he donates exorbitant amounts of money to HF, while others state that he is the best member HF has ever seen. We at HF News would like to congratulate him on obtaining the award.\n\n[b][color=#1E90FF]Braco[/color][/b] has finally been permanently banned and repfucked. This user was rude and insolent to staff and generally a nuisance to the community. [b][color=#1E90FF]Braco[/color][/b] was notorious for having alternative accounts, committing rep abuse and undermining staff's authority. Anyone awarding him with positive reputation will receive a rep fuck/ban. In addition to this, [b][color=#00BFFF]Omniscient[/color][/b] has banned his country, Macedonia, from accessing HF.\n\n[b][color=#1E90FF]Tate[/color][/b] has been banned from HF after a self-confession of him \"scamming over $8000 using different accounts\". However, staff have strong reasons to believe that his account has been compromised. After an IP check, [b][color=#00BFFF]Omniscient[/color][/b] declared that his account has probably been hacked. You can read more about it here: http://hackforums.net/showthread.php?tid=972381 We hope that [b][color=#1E90FF]Tate[/color][/b] recovers his account soon if this indeed is the case.\n\n[b][color=#1E90FF]Tate[/color][/b] is not the only member to suffer this fate. [b][color=#1E90FF]Malware Boss[/color][/b]' account has also been compromised, as affirmed my another member of the HJT team. He has received a temporary ban until his system is clean. We hope to have him back soon as he was a good contributor to the forums.\n\nAlso this week in user news, [b][color=#32CD32]The Rated R Superstar[/color][/b] made a thread stating that he and another HQ member of HF, [b][color=#1E90FF]Robbieava[/color][/b], are actually blood brothers. If this is an ingeniously executed troll or actual fact remains to be seen.\n\n[align=center][img]http://img199.imageshack.us/img199/6619/othernews.png[/img][/align]\n\n Earlier this week, the staff member, [b][color=#32CD32]Saged[/color][/b], had introduced a rule disallowing any debates on religion in the SRRP. In this thread it did not state why he chose to implement this rule, but any regular to the SRRP would know religious topics usually end up in moronic flaming and -rep flying about. A thread highlighting this was posted by [b][color=#32CD32]Saged[/color][/b] back in January, http://hackforums.net/showthread.php?tid=901604.\nHowever, after a day of it being implemented, the thread was deleted, and religious threads were unlocked. After contacting [b][color=#32CD32]Saged[/color][/b], he removed the rule because '[b][color=#00BFFF]Omni[/color][/b] said no :('.\n\nTraffic to Hackforums.net has grown by 30% since September 2010, and expectations are that this increased amount of traffic will be standard in a few months. In order to keep Hackforums.net running smoothly, [b][color=#00BFFF]Omni[/color][/b] is arranging a new web server to handle it, however he has implied he is not seeking donations for this, as current rate of member upgrades can pay for it. With the increased traffic, Hackforums.net is coming towards being inside the top 1000 websites on the internet.\n\nThe rating system has been removed from the Lounge as it used up far too many resources for it to justify the simple, not all important rating system.\n\n[align=center][img]http://img200.imageshack.us/img200/2809/hackingnews.png[/img][/align]\n\nWelcome to HF Hacking part of HF News.\nHere are some important news from Hacking section of HackForums!\n\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=42768][b][color=#1E90FF]Endax[/color][/b][/url] released Facebook Spreader/Downloader for free,which he was selling.You can check it out [b][url=http://hackforums.net/showthread.php?tid=970533]here[/url][/b]\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=629212][b][color=white]Prokill[/b][/color][/url] recently hacked [b]Selena Gomez's[/b] Facebook page,but sadly,it got recovered.You can see first part [url=http://hackforums.net/showthread.php?tid=969703][b]here[/b][/url].\n\n[*][b][color=white]Prokill[/b][/color] is preparing Part 2 of hacking Selena Gomez's account.You can see it [b][url=http://hackforums.net/showthread.php?tid=973000]here[/url][/b].\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=273264][b][color=#FFD700]Srblche[/b][/color][/url] released a huge list of SQL injection vulnerable websites.You can check out his thread [b][url=http://hackforums.net/showthread.php?tid=954491]here[/url][/b].\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=578315][b][color=white]Mr 004[/b][/color][/url] discovered a SQL injection vulnerability in Pakistan's network operator WaridTel.You can see it [b][url=http://hackforums.net/showthread.php?tid=976889]here[/url].[/b]\nHe also discovered non-persistent XSS vulnerability in one of NASA's sub domains.You can see that [b][url=http://hackforums.net/showthread.php?tid=975229]here[/url][/b].\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=28705][b][color=white]Join7[/b][/color][/url] discovered a exploit in a specific web hosting company,so almost every site they are hosting is vulnerable to SQL injection.But he is giving it out just to L33Ts and Ub3rs.You can request it [b][url=http://hackforums.net/showthread.php?tid=951459]here[/url][/b].\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=500662][b][color=white]fel1x[/b][/color][/url] is currently developing a PHP/MySQL Remote Administration Tool,coded in Visual Basic .NET.It's called Acerbitas RAT.Best thing is that you don't need to port forward to use it! You can see development status [b][url=http://hackforums.net/showthread.php?tid=954095]here[/url][/b].\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=383787][b][color=#1E90FF]versx[/b][/color][/url] is currently beta testing his new XYZ Logger v2.It's a CodeDOM and semy-poly crypter coded in Visual Basic .NET.If you want to be a beta tester,check out thread [url=http://hackforums.net/showthread.php?tid=969241][b]here[/b][/url].\n\n[*][url=http://hackforums.net/member.php?action=profile&uid=628273][b][color=#FFD700]Yoshi™[/b][/color][/url] is currently developing a new bot,called SyN BoT.It will be released on 25.1.2010.You can see more details [b][url=http://hackforums.net/showthread.php?tid=971474]here[/url][/b].\n\n[align=center][img]http://img341.imageshack.us/img341/8763/videootw.png[/img][/align]\n\n[align=center]This is a prank clip of an Arab on a bored day. Look at the reaction of the other 2 people walking by! [/align]\n\n[align=center][yt]http://www.youtube.com/watch?v=BdGCPsZ2STM&feature=player_embedded[/yt][/align]\n[align=center]\n[img]http://img337.imageshack.us/img337/6136/congrats.png[/img]\n[/align]\n\n[align=center]Congratulations to Vorfin for returning back to the staff crew!\n\nCongratulations to [b][color=#1E90FF]`P R O D I G Y™[/b][/color] for being the fastest gained rep after being repfucked. Enjoy the Militant award as you earned it ;).\n\nHappy Birthday to the following users![/align]\n\n[align=center][list]\n[*][b]2Fail4You[/b]\n[*][b]Levittown[/b]\n[*][b]Jasqui[/b]\n[/list][/align]\n\n[/list]\n[align=center]\nCongratulations to HackForums for having achieved over 1100 members online in the \"Past 5 minutes\" section.[/align]\n\n[align=center][img]http://img257.imageshack.us/img257/1076/interviews.png[/img][/align]\n\n[color=#FFA500]EctoPlasm:[/color] Hello `P R O D I G Y™ and welcome to HF News Interview. To start things off, what made you come to HackForums?\n[color=#00BFFF]`P R O D I G Y™:[/color] How large the community is. Not only is it a forum about security, exploiting, and all of that.. but it has sections for everything basically.\n\n[color=#FFA500]EctoPlasm:[/color] What was your first goal being a new member on HackForums?\n[color=#00BFFF]`P R O D I G Y™:[/color]I had no goals upon first joining. I knew I would eventually set some, which I have - however my main priority was to just be myself.\n\n[color=#FFA500]EctoPlasm:[/color] When Phire Nuk3r repfucked you and your friends for \"Gang Reputation\", what was your reaction and did you want to get revenge on him?\n[color=#00BFFF]`P R O D I G Y™:[/color]My reaction was similar to others. I was indeed very mad, and said some mean things to him. It was just an in the moment thing, never would I deny my actions were wrong. I apologized to phire nuk3r almost minutes after the repfuck, and whole situation. I like him as a staff member, and he's a cool guy. Since then we've became closer, so that's something I'm thankful for.\n\n[color=#FFA500]EctoPlasm:[/color] What do you think about Phire Nuk3r not making an apology thread as he risked his staff permissions by taking a big step and saying \"No\" to the Admin \"Omniscient\"?\n[color=#00BFFF]`P R O D I G Y™:[/color] I think that he was very \"stand up\" about it. He stayed loyal to himself, and who couldn't respect that. He stated in his thread that he felt he could not apologise if he felt he wasn't wrong, which would make him basically lying to himself apologizing when he didn't feel it was right. I think he's a great staff member, so do the other staff members. His choices and reasons are beyond our knowledge, only Omniscient would know.\n\n[color=#FFA500]EctoPlasm:[/color] What do you think about \"Red Lions\" and since you have stated it will be a HQ group, how many people do you think could get in, and what will be different about Red Lions and The Alliance?\n[color=#00BFFF]`P R O D I G Y™:[/color] I would hate to have to say something official on this, as I feel I could potentially offend Nokia2mon2 and his plans for the group. Our plans as of now are to let in members who deserve it, members who don't make others members feel unwelcome, members who have no history of sales trashing, etc. I would like for the group to be something eventually respected for the things we plan to do for HF. Right now we have a scammer database, where Red Lions members will be able to submit a form of information on a scammer. If the information is approved by leaders it will be shown on a page, in table format with details and other things. Nokia2mon2 ultimately wishes for the members of the Red Lions to help clean the marketplace of trashers, and scammers. I feel that if 30 or so HQ members work together we can really make a difference. Only time can tell.\n\n[color=#FFA500]EctoPlasm:[/color]Who is your favorite Member on this site and why?\n[color=#00BFFF]`P R O D I G Y™:[/color] Hmmm.. I think I'll go with Robbieava. He's always in a positive mood, never starts and drama, and I've known him since summer of last year. He was staff on one of my previous websites, and is always a helping hand no matter the situation.\n\n[color=#FFA500]EctoPlasm:[/color] If there is something you could change on the site, what would it be and why? \n[color=#00BFFF]`P R O D I G Y™:[/color] I would change the \"other\" on the report post dropdown to allow some text. Sometimes it really neccesary to include some type of message to the staff. Often when I find an abusive thread I will post on it stating the issue, and report my own post so that staff comprehends the issue. It isn't a big deal, but definately something I would change.\n\n[color=#FFA500]EctoPlasm:[/color] To conclude the Interview, is there any message you would like to give the HackForums community? \n[color=#00BFFF]`P R O D I G Y™:[/color] I would simply like to tell the members that if they feel that they have made a positive impact on HF by any means, they should submit an application for the Red Lions.\n\n",
      "subject": "[1/12/2011] - HF News"
    }
  ]
}