{
  "posts": [
    {
      "pid": "4316110",
      "uid": "74244",
      "dateline": "1275252847",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\n[align=center]Edition 3 [/align]\n\n[size=large][color=#FF4500]Headlines[/color][/size]\n\n[color=#00BFFF]Today, [url=http://hackforums.net/member.php?action=profile&uid=277061]Braco22[/url] was crowned Moderator of the new section, Video Editing. It's a subforum to talk about video editing, and more, with things like Sony Vegas, etc. Braco was the suggester of the forum, and Omni gave him Moderator because of it. Check out the new section [url=http://hackforums.net/forumdisplay.php?fid=160]here\n[/url].[/color]\n\n[color=#32CD32]\nThe Batch coding subforum found [url=http://hackforums.net/forumdisplay.php?fid=49]here[/url] was moved from Hacking to Coding this week.  The suggestion was made by Xypher, and quickly accepted and moved from Omniscient.[/color]\n\n[color=#FF6347]\nThis week, there was big controversy with the user [url=http://hackforums.net/member.php?action=profile&uid=137645]mothered[/url]. [url=http://hackforums.net/member.php?action=profile&uid=269895]Eddan[/url] accused mothered in [url=http://hackforums.net/showthread.php?tid=447404]this[/url] thread of being a robot because of his unlikely structures for a high post member. Some of the accusations were based on him having 0 of a bunch of things (0 awards, 0 posts in The Lounge, 0 reported posts), and his \"robotic\" post structure, with a \"Cheers :)\" at the end of every post. There were valid, and invalid points, but Omni didn't want to listen to it and closed it up with this, and I quote - \n\n\"By attacking a quality member with a lot of posts and good reputation then insisting he must be a bot?\n\nI'm guessing you're a young teen like 14-15 maybe.\n\nI think I know a bot when I see one. I obviously have more data than you do. I can view all his IPs and even his PMs. He isn't a bot.\n\nAnd to say he is 1/2 bot...wtf does that mean? We all use a computer to post. We are all cyborgs in a manner of speaking.\n\nI'm not sure what goals you're trying to reach but you're not gonna call out a quality member as a bot and get him banned. That's insane. If anyone is getting booted it's you.\"\n\nSeems like Omni likes his mother-- so much that he even gave mothered a Member of the Month award! Never the less, this was by far the most popular thing this entire week.[/color]\n\n[color=#FF69B4]This week, there was an iPhone surge! Sellers were selling iPhones everywhere here on HF, for low cheap prices. What did HF have to say about it? \"JOY! CHEAP IPHONES!\", when really, they were scammed. \n\nSellers like Crust, and iPhoneSeller, used fraud techniques to get these phones, and sent to you. The reason why they used dropshipping (most did), is for more safety to the buyer. Regardless, you could still get in trouble, and if you didn't end up purchasing one of these iPhones, well, that's good for you. You saved yourself some trouble in the coming weeks. Some things are just too good to be true.[/color]\n\n--\n[size=large][color=#1E90FF]User News[/color][/size]\n\n[color=#32CD32]s1N got a new car [url=http://hackforums.net/showthread.php?tid=430585]here[/url]. Here is a picture of s1N's new found wife -\n\n[img]http://img10.abload.de/img/imag0087ccaz.jpg[/img]\n\nI think that he needs to CAR-efully take CAR-e of his precious baby, or we have a problem in Arizona (that looks like Arizona).[/color]\n\n--\n[size=large][color=#32CD32]Bans of the Week![/color][/size]\n\nWelcome to the section where we laugh at the lowest of the lowest. The highest of the highest hang in the Yin's club, not over here.\n[color=#FF1493]\n[url=http://hackforums.net/member.php?action=profile&uid=70346]Crust[/url] was banned for a few days for being a troll. I don't think he is a good member at all, just look at this screenshot of Mr. Crust -\n\n[img]http://i48.tinypic.com/o0rqxt.png[/img]\n\nThat loyal guy you thought was loyal, actually is getting some coal for Christmas this year.[/color]\n\n--\n[size=large][color=#FF1493]Just Plain Weird [/color][/size]\n\n[color=#1E90FF]Found [url=http://hackforums.net/showthread.php?tid=449564&page=1]here[/url] is a video that shows Jimmy Jump, the famous \"crazy fan\" who jumps on the fields of things, jumping onto the stage on Spain's 2010 Eurovision Song Performance. He had it going for a nice 20 seconds, but really, they need to stop this guy!\n[/color]\n--\n[size=large][color=#FF0000]Other News[/color][/size]\n[color=#32CD32]\nLuci[D]ream, wants people to fill out his survey in [url=http://hackforums.net/showthread.php?tid=446000]this[/url] thread. It's for his homework, so it's for a good cause. It's about suicide, and just general questions. It takes 5 minutes, and it's for a good cause, so help him out.[/color]\n\n--\nI need some more news for this week, so post some with this format -\n\nThread Link-\n\nMore details (3-4 sentences) -\n\nThanks guys.\n\nPrevious edition - http://hackforums.net/showthread.php?tid=434536\n\nNext edition - (n/a)",
      "subject": "HF News Week 5/23 - 5/30 [THIRD] [COMMENT]"
    }
  ]
}