{
  "posts": [
    {
      "pid": "11703708",
      "uid": "295848",
      "dateline": "1304562780",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFmainbanner.png[/IMG][/align]\n\n[color=#98FB98][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\n\nThe edition you are currently reading is the [b]40th full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFheadlines.png[/IMG][/align]\n\n[align=justify]On May, first Hack Forums hit an outstanding 31,000 posts in just 24 hours. This is remarkable and has only been made possible because of our recent server upgrade. More on this achievement can be found [url=http://hackforums.net/showthread.php?tid=1261841]here[/url].\n\nThe server upgrades are complete as many of us know. Any small bugs or glitches on the new server will be fixed shortly by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]. If you would like to read further on the new server click [url=http://hackforums.net/showthread.php?tid=1250456]here[/url].\n\nEver wondered how many posts you have in a specific section? With the new server, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has had spare time on his hands, and has added this feature to Hack Forums. He even added an awesome dancing image to celebrate the event, as seen below. To check your personal post count per section click [url=http://hackforums.net/postactivity.php]here[/url]. This information was released [url=http://hackforums.net/showthread.php?tid=1251643]here[/url].\n\nTo show just how excited he is about the new server, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has uploaded a new main banner for the website. If you missed it, too bad. It was a sight for sore eyes. Check it out [url=http://hackforums.net/showthread.php?tid=1252812]here[/url].\n\nMany upgraded members have been abusing the Bragging Rights section to increase their post count. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally put his foot down and decided to make this section not count towards one's post count any longer, as well as adding some new rules in place for the section. If you haven't read about this yet or are wondering why your thread may have been closed click [url=http://hackforums.net/showthread.php?tid=1250579]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has added 7 new awards to the ever-growing list of awards obtainable at Hack Forums. Remember that awards are given out at the administrator's discretion, and not by asking for them. If you would like to see a full list of awards available on Hack Forums click [url=http://hackforums.net/myawards.php]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=255981][color=#4DD0FC][b]Guru[/b][/color][/url] our recent system administrator, has been demoted to a Mentor. When asked about this demotion all [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] had to say was, \"he is no longer assisting me\".\n\n[url=http://hackforums.net/member.php?action=profile&uid=70909][color=lime][b]AsSaSs@iN[/b][/color][/url] has been promoted to Staff. This isn't the first time he's been in this position and it's good to have his veteran experience back on the team. If you would like to congratulate him do so [url=http://hackforums.net/showthread.php?tid=1264389]here[/url]. \n\n[url=http://hackforums.net/member.php?action=profile&uid=11953][color=#AAAAFF][b]Nyx-[/b][/color][/url] the moderator of the \"Anime Adventures\" section was banned for 48 hours this week. \n\nThere is now a \"Follow\" button in the Hack Forums quick links, as seen above. This directs members the Hack Forums' official Twitter. If you feel that you're out of the loop click [url=http://twitter.com/#!/hackforumsnet]here[/url] and follow Hack Forums on Twitter today!\n\nA new sub forum has been created in the Hacking section. This new sub forum is named [b]Electronics and Gadgets[/b]. It is for anyone interested in the hacking of off-line electronics like radios, alarms, radar detectors, cameras, remote controls or robots. If that interests you, you can participate in this forum. If you have trouble finding it click [url=http://hackforums.net/forumdisplay.php?fid=193]here[/url].\n\nBoth [b]The Gamers[/b] and [b]The Reviewers[/b] have opened recruiting this week. These are two of Hack Forums official groups, meaning upon acceptance members receive a user bar and access to post in a private sub forum. The Gamers' sub forum however, is out in public. If you think you have what it takes to be a member in either of these groups check out the recruitment sub forum [url=http://hackforums.net/forumdisplay.php?fid=52]here[/url].\n\nThe HJT Team is looking for a new user bar and it has been resolved. They would like to thank all that participated, however it ended up with the creation of a new name thus making the previous request void. The new name they are going to have is \"SA Team\" which means \"Security Analysts (Team)\". You can view the thread by [url=http://hackforums.net/member.php?action=profile&uid=70881][color=#1E90FF][b]Paradoxum[/b][/color][/url] [url=http://hackforums.net/showthread.php?tid=1268469]here[/url], but remember [b]not[/b] to vote. It is HJT Team-exclusive.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFusernews.png[/IMG][/align]\n\n[align=justify][url=http://hackforums.net/member.php?action=profile&uid=284502][color=white][b]Tha Sneak[/b][/color][/url], one of the site's most experienced malware removers, has finally received the \"White Hat Helper\" award. This award is long overdue since he has helped countless members with infections and other various computer issues for quite some time now.\n\nEver had a question about anything white hat? [url=http://hackforums.net/member.php?action=profile&uid=70909][color=lime][b]AsSaSs@iN[/b][/color][/url] is in the process of creating a massive Q&A thread answering all things-white hat. If you have a question for him click [url=http://hackforums.net/showthread.php?tid=965002]here[/url]. Whether it's about computers, security, malware or simply a personal question, he is happy to answer any and every question to the best of his ability. Remember there is no such thing as a stupid question! \n\nThis week [url=http://hackforums.net/member.php?action=profile&uid=407835][color=white][b]Kick Buttowski[/b][/color][/url] purchased the Lost-Door Project from the original owner for just under 4,000 dollars, making him the new owner. The official announcement can be found [url=http://www.lost-door.com/owner/newowner]here[/url]. For those who don't know what Lost-Door is, here are some [url=http://en.wikipedia.org/wiki/Lost_Door_RAT]details about Lost-Door[/url]. If you'd like to post about it or congratulate him on Hack Forums do so [url=http://hackforums.net/showthread.php?tid=1259830]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=200751][color=white][b]Zach[/b][/color][/url], The RAT's Crew owner now owns Sync Hosting as well. This was a very popular hosting service started up by [url=http://hackforums.net/member.php?action=profile&uid=604554][color=white][b]Sync™[/b][/color][/url]. If you're interested in their services click [url=http://hackforums.net/showthread.php?tid=1247677]here[/url].\n\nAnother member joins the ranks of the Master Donators this week, congratulations to [url=http://hackforums.net/member.php?action=profile&uid=699743][color=#0066FF][b]Supporter™[/b][/color][/url] for surpassing $500 donated to Hack Forums. This site wouldn't be where it is today if it weren't for the generosity of members like him. If you're interested in finding out who is on the Master Donators list click [url=http://hackforums.net/myawards.php?awid=50]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=781539][color=white][b]MlND[/b][/color][/url]'s introduction thread has gotten quite a bit of attention from all different types of members. It has shown the true colors of many people on this forum, as well as their opinions on new members. If you'd like to take a look at the thread it can be found [url=http://hackforums.net/showthread.php?tid=1259955]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=385801][color=white][b]Indirect[/b][/color][/url] has spoken with [color=black][b]phire nuk3r[/b][/color] about his ban, allowing him to fully explain what happened according to him. If you would like to find out how everything went down click [url=http://hackforums.net/showthread.php?tid=1245782]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=257988][color=#0066FF][b]Outlaw.[/b][/color][/url] has created a thread about the release of X360 Key. This item will basically allow you to play games from a USB similar to using a flashed Xbox console, without actually having to flash your drive. If you would like to read further click [url=http://hackforums.net/showthread.php?tid=1246774]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=109620][color=white][b]Mike.[/b][/color][/url] has compiled a list of all the \"special links\" on Hack Forums, the list can be seen [url=http://hackforums.net/showthread.php?tid=1252636]here[/url] for those interested.\n\n[url=http://hackforums.net/member.php?action=profile&uid=68704][color=#0066FF][b]sky-[/b][/color][/url] has been repfucked, he was amongst the top 40 members for most reputation on the site so this is quite a hit. \n\n[url=http://hackforums.net/member.php?action=profile&uid=74052][color=black][b]Gold[/b][/color][/url] who was recently unlimited after enduring an 8 month limitation has changed colors yet again ... this time it's black. He's been banned for 2 weeks for constant trolling. \n\n[color=black][b]GR8 modder x[/b][/color] has been banned until 7-29-2011, the reasoning behind it being a \"LQ member\".\n\n[url=http://hackforums.net/member.php?action=profile&uid=388384][color=black][b]Wormag[/b][/color][/url] has been banned for leaking e-books; he is to return on 10-30-2011 if he chooses.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFothernews.png[/IMG][/align]\n\n[align=justify]This week, as you probably have noticed if you watch BBC, a royal marriage has taken place. Prince William and Catherine Middleton is officially a married couple as of Friday, April 29, 2011. While they aren’t first in line to take the throne, the event spread like wildfire on the Internet and on some TV channels. Even if you don’t care about the event, you should wish them a happy marriage.\n\nAlso this week, the southern region of the United States was swept by destructive storms which literally erased landmarks off the Earth. With a death count of at least 342, this storm’s destruction will not pass by as a Sunday sprinkle. Living in Tennessee, I wasn’t even close to the worst part. Many people are now homeless and jobless. President Obama signed disaster declarations for Alabama, Mississippi, and Georgia.\n\nOn Sunday, the 2nd, Osama Bin Laden was found and killed in a mansion in Islamabad. President Barack Obama said that the CIA got intelligence on Bin Laden’s whereabouts in August 2010, and they were verifying and making sure that that is where he was. On Monday, Navy SEALS had a fire fight at his mansion and he was killed. The body was shipped to D.C. for blood verification of his identity via his dead sister’s blood. The blood results came back positive and at 11:30 EST the president announced the death of the terrorist. With anything the government does, people have conspiracy theories about it. With the body already disposed of, the public will never see who was brought back.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFinterviews.png[/IMG][/align]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - Saged[/color][/font][/size][spoiler]\n\n[align=justify][color=white][b]Chick-Fil-A:[/b][/color] Thank you Saged for you time in the 40th edition of The HF News!\n[color=#0066FF][b]Saged:[/b][/color] \n\n[color=white][b]Chick-Fil-A:[/b][/color] How long did it take for you to feel like a true member of Hack Forums?\n[color=#0066FF][b]Saged:[/b][/color] About 2 weeks. I joined in March of 09' and didn't actually start coming until July. It was a different time (I'd like to think) back then. A lot more open.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What part of the forums do you find the most interesting?\n[color=#0066FF][b]Saged:[/b][/color] The Lounge of course. There's so much crap there, and too many stories to not find it interesting. Other than that, I'd have to say a Staff section. Which... I'm not at liberty to discuss. ;)\n\n[color=white][b]Chick-Fil-A:[/b][/color] What member do you respect the most on Hack Forums?\n[color=#0066FF][b]Saged:[/b][/color] Pink Floyd, Paradoxum & Robbie easily. I also like Xypher & Omni too, lol.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What is your favorite quote, and why is this your favorite?\n[color=#0066FF][b]Saged:[/b][/color] \n\n[color=white][b]Chick-Fil-A:[/b][/color] If you could describe your personality in three words, what would they be, and why do you choose them?\n[color=#0066FF][b]Saged:[/b][/color] [i]Reserved[/i], (because I'm actually a quiet person), [i]arrogant[/i] (yes, I'd agree with this assessment, but I do not like it), [i]grateful[/i] (for all things I have).\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you think that your role in Hack Forums has improved, or worsened the community? \n[color=#0066FF][b]Saged:[/b][/color] What kinda question is that? That's like asking an employee at a major company, \"Do you think you did a crappy job & ruined the company, or a fine job and helped it?\" Not even gonna answer, lol.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Which award do you feel most proud of? Why do you take so much pride in it?\n[color=#0066FF][b]Saged:[/b][/color] My Silver Medal - it was my first award & my first sticky. I PMed Omni to tell me his opinion and boom, award and sticky. Was so stoked.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Why did you decide to completely resign as a member of the Hack Forums Staff, couldn't you have taken a break or vacation?\n[color=#0066FF][b]Saged:[/b][/color] \n\n[color=white][b]Chick-Fil-A:[/b][/color] What member did you take the most pleasure in warning, and what did you warn them for?\n[color=#0066FF][b]Saged:[/b][/color] Notorious Mental - speaking their mind. JK. Probably Ectoplasm for all the crap he used to talk.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What is your thoughts on the recent phire nuk3r situation? How may you have handled it differently?\n[color=#0066FF][b]Saged:[/b][/color] phire nuk3r shouldn't worry about rep so much. 'Tis all. And whatever phire nuk3r did, it's what he did. We all have different styles and his got him in trouble. I probably would've done the same thing. Probably would've repfucked and banned and been done with it.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Would you care to give any final thoughts?\n[color=#0066FF][b]Saged:[/b][/color] Stop all these BS conspiracy threads in the SRPP section. Oh yeah: http://hackforums.net/showthread.php?tid=961270\n\n[color=white][b]Chick-Fil-A:[/b][/color] Thank you Saged for your participation in the 40th edition of The Hack Forums News![/align]\n[/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - -BoodyE-[/color][/font][/size][spoiler]\n\n[align=justify][color=white][b]Chick-Fil-A:[/b][/color] What has made you become a great member on Hack Forums?\n[color=#0066FF][b]-BoodyE-:[/b][/color] I am not saying this because I don't want to show that I am arrogant, but seriously I think that I am a very normal member. However, if you think that I am a great one, then that's good to hear. Since I joined HF, I tried to build a good reputation (I am not talking about red and green apples, lol). Becoming an official Reviewer, being honest and not breaking any rules have also helped me to become a trusted member.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Which staff member do you think has done the best job and why?\n[color=#0066FF][b]-BoodyE-:[/b][/color] That's a hard question to answer. I guess all the Staffers have done a great job. Omniscient's choice of Staff is really great as he only chooses the best of the best. phire nuk3r and Factor8™ have done a great job with doing the reports and we really should appreciate their work.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What update was the best in your opinion, and why?\n[color=#0066FF][b]-BoodyE-:[/b][/color] Mentors group. Although this group seems a bit mysterious, I think that it will be a great addition to HF. Omniscient has mentioned that the Mentors have some moderator tools and they are able to help the members with their problems. I can't wait to see Omniscient's thread about it.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What would you change about Hack Forums if you were in Omniscient's position?\n[color=#0066FF][b]-BoodyE-:[/b][/color] In all honesty, I wouldn't change anything. I think Omniscient is doing a great job as an admin/site owner. I want to say something about him, too. His replies and actions might seem a bit strict and might make you angry, but if you really think about them and analyze their consequences, you can conclude that they were wisely taken.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Could you offer any tips on how to gain reputation of Hack Forums?\n[color=#0066FF][b]-BoodyE-:[/b][/color] Of course. The most important things is to be honest and helpful to the members. When you do that, you will eventually gain reputation on HF.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Why do you think you were chosen to be interviewed for the news?\n[color=#0066FF][b]-BoodyE-:[/b][/color] Question 1 explains that, lol. I guess because you think that I am a great member.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What was your reaction to Osama bin-Ladins death?\n[color=#0066FF][b]-BoodyE-:[/b][/color] It was similar to everyone's reaction. It's a good thing but it won't end the terrorism in the world.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you remember 9/11/2001? Share some thoughts?\n[color=#0066FF][b]-BoodyE-:[/b][/color] Of course, a bad thing happened and the responsible guy has been killed, lol.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Which team are you? Team Qwazz or Team Nubby?!\n[color=#0066FF][b]-BoodyE-:[/b][/color] Are you seriously asking this question? Team Qwazz for sure!\n\n[color=white][b]Chick-Fil-A:[/b][/color] If you had $10,000.00 to spend right now, what would you do with your money?\n[color=#0066FF][b]-BoodyE-:[/b][/color] I'd buy some personal things, a gift to my GF and I'd donate to HF.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Thank you for your time, any final comments?\n[color=#0066FF][b]-BoodyE-:[/b][/color] Yes, I'd like to thank you for taking the time to interview me. \n\nI'd also like to see HF without members scamming and flaming because I really hate this kind of members.\n\n[color=white][b]Chick-Fil-A:[/b][/color] This concludes our interview, thank you -BoodyE- for your time![/align][/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 3 - AsSaSs@iN[/color][/font][/size][spoiler]\n\n[align=justify][b]Paradoxum:[/b] Alright, we have Mr. AsSaSs@iN on board.\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] Hi there Paradoxum and HF!\n\n[b]Paradoxum:[/b] I'm sure I'm not the only person to say this (please don't ban me) but your user name is quite hard to type and remember. How did you get it, anyway?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] That is a common question. It was a name that I chose to play with on an online game. Assassin seemed boring and others went by that name so I tried to make it a little fancier. \n\n[b]Paradoxum:[/b] You mean fancier, [i]and[/i] harder. Oops. So, almost everyone recognises you as a previous staff member. And now, you are again one. How did this happen?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] I initially stepped down as I was just starting my senior years of school and everything was very busy between that, sports, work and socialising. Now I have cut back on work a fair bit and have a bit of spare time. I informed the higher powers that I was eligible for Staff if they ever needed a hand and they did! So here I am.\n\n[b]Paradoxum:[/b] You've mentioned sports. What sport do you play? Even better, since everyone here has a mental image of every staff member (readers don't deny), what should we imagine you as? Are you geeky, macho, or just plain sexy?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] I wouldn't say any of those! xD I play soccer and futsal currently, when I was younger I played lots of sports like cricket, touch football, hockey and athletics. I have actually represented my state in soccer so that is a rather big achievement for me. I also traveled to China several years ago to play some of the city youth teams. \n\nI would describe myself as a well-rounded person. I am pretty good at sports, fairly intelligent and have a great group of friends.\n\n[b]Paradoxum:[/b] That's cool, at least someone has a real life. Speaking of that, how do you manage to handle the HijackThis Team and the logs? Superb time management skills, I suppose?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] I timetable a lot of things. I have my afternoon set out with designated time periods for what I should be doing (study, homework, computer related stuff, other IRL stuff like soccer training and study sessions at school). A lot of it comes down to the fact that I can multitask pretty well after doing this for a few years.\n\n[b]Paradoxum:[/b] I should probably learn that. 😉 Since you already are on Staff, is there anything more you desire (besides being an administrator if that's part of it)? Do you have a goals list?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] I am sure you have probably got time management down Para with all your hard work. It would be an honor to be an administrator but only when the time is right and I have enough free time ^_^. I only have a few small goals, like to achieve the Diamond award (and the Mad Scientist because I rock a chemistry! not). Also to eventually discover kutmustakurt's real identity. 🙂\n\n[b]Paradoxum:[/b] Thank you, for the compliment you flatterer. I kid. Oh yes, kutmustakurt really is an interesting [s]subject[/s] person. I suppose we can get into that when the time is right. *Hints at Qwazz* What happens when a person PMs you regarding HJT Training? Will you rage?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] Initially I didn't mind, I would explain or answer the questions which they asked and sent them on their way. I was getting too many PMs of the same thing a day (of things that can be found on the forums) so now I just ignore them. It wastes too much of my time.\n\n[b]Paradoxum:[/b] You heard that, everyone? He's not unfriendly after all. Let's go deeper about your persona and career here. You're a malware expert. What contributed to this current standing?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] I always knew a bit about computers, while on HF this was the only area where I could really participate and contribute knowledge to a discussion. With obtaining a rogue AV infection I decided to learn more from Valiant and other websites. Now here we are.\n\n[b]Paradoxum:[/b] I remember you putting on your signature \"Addicted to the HF Drug\" and lots of other people had it on theirs too. You also popularized the \"<username here>\" gave me a \"<something here>\". Do you find this enjoying? Do you consider Hack Forums as a well-rounded community?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] Haha yes! I can't believe you remember that. Sometimes it is annoying because people don't know where it originated from! But I know deep down I started it (with Vorfin the gold star thing). About the drug thing, it is true. HF is amazing and addictive! I am sure most members would agree.\n\nI believe HF is a very well rounded community, there are so many different people with different skills, knowledge and attributes (whether they are good or bad xD).\n\n[b]Paradoxum:[/b] I'm calling you the fat -- I mean, \"fad guy\" from now on. Truly, Hack Forums is something. Is there anything you'd like to change here? Do you have favorite members, sections and whatnot?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] Haha why?\n\n[b]What I would like to change:[/b] The trolls. xD\n[b]Favorite section:[/b] HJT Analysis and Team forum most definitely!\n[b]Favorite members:[/b] Infallible, kutmustakurt, Valiant, cobija and you (I bet I forgot someone, so sorry anyone I forgot)! You guys are who I converse and work with the most. You are what makes HF so enjoyable.\n\n[b]Paradoxum:[/b] Hurray I'm included in his list of favor -- sorry. Well of course, if you can get other people to mimic you, then you're either a fad guy or a fad whore. Let's stick with \"fad guy\". And now, as I end this interview, is there anything you'd like to tell to the community? Advices? Personal vendettas?\n[color=#00FF00][b]AsSaSs@iN:[/b][/color] Haha ok then. 🙂 Enjoy the forum and all that it has to offer, there certainly isn't another like this on the Internet. Remember to keep; \"Fighting for the greater good!\" (爭取更大的利益！)\n\nThanks for your time Paradoxum.[/align][/spoiler]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFWebshow-1.png[/IMG]\n[yt]http://www.youtube.com/watch?v=28DblTe749k[/yt]\n\n[IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFcredits.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\n[/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=133256]Xypher[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url]\n[/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=114470]F4T4L 3RR0R[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=629674]Waldo[/url]\n[/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=92059]Chick-Fil-A[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[/list]\n[color=white][b]Editors[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\n[/list]\n[color=white][b]Graphic Designer[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]\n[color=white][b]Webshow Host[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=238061]The Doctor[/url]\n[/list]\n[color=white][b]YouTube Channel Owner[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=639914]VanCliffe[/url]\n[/list]",
      "subject": "[5/4/2011] - HF News"
    }
  ]
}