{
  "posts": [
    {
      "pid": "7993618",
      "uid": "136025",
      "dateline": "1291026874",
      "message": "[align=center][img]http://min.us/ie10I.png[/img][/align]\n\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 24th FULL edition. It is for the dates of 11/22/2010 to 11/29/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://min.us/icFot8.png[/IMG][/align]\nHack Forums over this week has witnessed numerous discussion threads regarding many different topics, ranging from Hack Forums up-time to occasions and events.\n\nThis week on Hack Forums, Thanksgiving was celebrated with a new banner that represented the holiday. Many users were enlightened and somewhat excited when the banner was put up and were feeling the cheer on goodness of the holiday.\n\n[color=#1E90FF][b]The chosen banner can be found [url=http://hackforums.net/showthread.php?tid=845534]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nThis week on Hack Forums, the servers suffered a lengthy downtime of several hours. Omniscient had noticed the error and had resolved it quickly, although it has come to the attention of the forum members and Omniscient that a dedicated server is a necessity now to sustain the forums up-time, without it, database lockups will occur regularly.\n\n[color=#1E90FF][b]The issue explained:[/b][/color]\n[i]The database is hosted on a one dedicated server of 8GB RAM, with the continuous growing of the forums traffic and post count/day, the server has been struggling to manage the traffic hitting it continuously. Recently, Hack Forums is at it's peak of the amount of posts it receives. Every time a new post is posted, a query is sent to the server. With Hack Forums size, there are 200 queries every second, which the current server can't handle due to it's insufficient resources. Therefore, Omniscient has stated that the server is now a necessity and has began funding for it's purchase.\n\nThe new server would be used as a 'slave' server, meaning it would be used to manage the queries between both servers. Omniscient has also posted explaining how it works:\n[b]\"Imagine an onramp to the highway. The onramp hold about 20 cars before it backs up the intersection. The onramp is very busy and lately has been causing a traffic jam (gridlock) at the intersection because the highway is very busy so getting on is very slow. To fix the gridlock you must add more lanes. Increasing the speed limit will only worsen the problems.\"[/b][/i]\n\n[color=#1E90FF][b]To donate, please click [url=http://hackforums.net/private.php?action=send&uid=1]here[/url]. Hack Forums has never needed it more.\n\nYou can read the thread [url=http://hackforums.net/showthread.php?tid=852122]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nHack Forums has once again suffered some issues with it's up-time, recently, the forums DNS has had some technical difficulties staying up, therefore removing the ability for thousands of members to connect. Many had to use a proxy to connect.\n\n[color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=854831]here[/url].\n\nYou can also read [url=http://hackforums.net/showthread.php?tid=856197&pid=7991014#pid7991014]here[/url] if you are still suffering from connectivity issues.[/b][/color]\n\n[b][i]Please refrain from posting anymore threads in regards to this issue, there are quite enough already.[/i][/b]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nStaff members have also seen a change in the way their profiles work. Omniscient has decided to hide the reputation quick link from a Staff members profile if Staff is their userbar. It may have been hidden, but not removed, therefore there are still some ways to see their reputation page. \n\n[color=#1E90FF][b]You can see why [url=http://hackforums.net/showthread.php?tid=844472&pid=7897763#pid7897763]here[/url].[/b][/color]\n\n[align=center][IMG]http://min.us/icAP7c.png[/IMG][/align]\nSolidify this week has been continuously banned and limited. He was recently permanently banned, although was revoked due to a remaining length on his sticky. Once it ends, he will be permanently banned. Many members have complained due to the amount he has donated, but it is at the Staff's discretion of what his punishment is.\n\n[color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=852739&pid=7960472#pid7960472]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nMany users of Hack Forums that are known for their regular posting in The Lounge have decided to change their names to forum directories found on 4chan. Quite a few have currently been taken, but there are more left.\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nRecently, N3w_2_H@Ck1n™ has resigned from the Hack Forums Staff team. This is a saddening event but he has served well with his time. He was on the team for over a year which is an amazing achievement. We would like to wish him the best on his future endeavors. \n\n[color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=846935]here[/url].[/b][/color]\n\n[align=center][IMG]http://min.us/ieZ6M.png[/IMG][/align]\nThere was not any HF News that fit in the Other News section, sorry.\n\n[align=center][IMG]http://min.us/icBmY2.png[/IMG][/align]\nThis week, we got an interview with Cobija.\n\n[color=#1E90FF][b]1. [/b][/color]When did you join HF and what was your intent when you were joining?\n[color=white]Cobija:[/color] [i]I joined in mid-late September of 2009. Well, I actually joined because I was infected by a RAT. I was stupid and downloaded a \"Microsoft Points Generator\" off of Youtube and realized that nothing opened and knew I was infected. I asked my older bro what I should do and he introduced me to HF because they had the HJT Team which would help me.  [/i]\n\n[color=#1E90FF][b]2. [/b][/color]A week after joining, what did you think of HF and it's community.\n[color=white]Cobija:[/color] [i]To be honest, I didnt really browse the site that much for the first week. I just concentrated on cleaning my system. But after a few weeks, I realized that there was a decent amount of knowledge on HF that I could use and learn, so I liked it at first. [/i]\n\n[color=#1E90FF][b]3. [/b][/color]Did you ever intend on joining the HJT team a month or so after joining HF?\n[color=white]Cobija:[/color] [i]Well, I was talking to Kutmustakurt after he disinfected me and I have always wanted to help people out, so I asked him how its like, etc and after I donated to Valiant he put me on the trainee list. So I did not first intend to, but after I realized that I would love to help people out like Kut did, I wanted in. [/i]\n\n[color=#1E90FF][b]4. [/b][/color]When did you upgrade your account, and how? Did you win a contest or from your own money. What was the main reason you upgraded also?\n[color=white]Cobija:[/color] [i]I bought leet in early Nov of 2009 because Omni was offering a deal. He said if we paid $20, we would get the donator award and leet. I wanted an award and leet, so why not now? I bought it with my own money and waited (refreshed the page a few times and annoyed Omni). I looked up at the clock and realized I was late for my class 🙂 I got uber as a Christmas present from Factor8. [/i]\n\n[color=#1E90FF][b]5. [/b][/color]Are there any members on HF that you think you owe thanks to for the position you are in now?\n[color=white]Cobija:[/color] [i]Yes, there are quite a few. I would first like to thank Assassain, Paradoxum, N2H and Kutmustakurt for basically being there and always willing to help me out and giving me advice throughout my training. I would also like to thank Valiant for creating the HJT Team. There are also other members that have been nice to me throughout my stay on HF. [/i]\n\n[color=#1E90FF][b]6. [/b][/color]Do you have any future goals on HF or are you happy where you are now?\n[color=white]Cobija:[/color] [i]Well, my future goals are to hopefully one day become a HJT Teacher and help out inside of our mini section. Besides that, I do not really have any other goals besides be the best well-rounded member I can be to members. [/i]\n\n[color=#1E90FF][b]7. [/b][/color]What is your favourite section currently other than the White Hat Section?\n[color=white]Cobija:[/color] [i]Hmm, that is sort of a tough one. Even though I dont like a few of the \"Lounge Whores\", the lounge often has some interesting threads that can make me laugh when I am down. Also, its really weird to read some stories in the Innuendo subforum.[/i]\n\n[color=#1E90FF][b]8. [/b][/color]Are you happy with the way the forum is currently heading or do you feel that the quality has decreased quite a lot?\n[color=white]Cobija:[/color] [i]I personally feel like since Nov 2009, the quality has decreased on HF. I am not sure exactly why, but I think we need more active and HQ members. Also, I feel that we need some more interaction and events (ex: When Omni did trolling one random Saturday night and passed out a few awards, Rep appreciation in June, etc). [/i]\n\n[color=#1E90FF][b]9. [/b][/color]What features about HF do you mainly enjoy and why?\n[color=white]Cobija:[/color] [i]I enjoy the fact that I can be who I wanna be here and be accepted. Some people IRL do not get computers and malware and other techie things, so I feel accepted here (not saying I am like socially akward IRL, just I dont click with everyday people except with my real friends). I also like that there are a few members that know what they are saying and often can give good answers to your questions. [/i]\n\n[color=#1E90FF][b]10. [/b][/color]Do you have a favourite Staff member?\n[color=white]Cobija:[/color] [i]My favorite staff member would probably be Factor8, because we have been friends since the start of both of times at HF (we both registered within a week of each other, and I remember first talking to him, I was trying to sell a MS key, and yeah, I guess we just started from there). [/i]\n\n[color=#1E90FF][b]11. [/b][/color]Before we go, is there anything you would like to tell the members of HF?\n[color=white]Cobija:[/color] [i]Id like to say just be who you are and just stay HQ. Dont care that much about getting staff/getting rep/getting known. They will come overtime if you are not a skid and actually contribute to HF 😝 [/i]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nSorry for the delay, I've been extremely busy.",
      "subject": "[11/22/2010] - HF News"
    }
  ]
}