{
  "posts": [
    {
      "pid": "8289493",
      "uid": "0",
      "dateline": "1292214044",
      "message": "[align=center][img]http://ploader.net/files/020014cca6d4e861bd78fe5967b1e1dc.png[/img][/align]\r\n\r\nHello, and welcome to this week's edition of HF News; the longest-running periodical HF newsletter to date! My name is [url=http://hackforums.net/member.php?action=profile&uid=311070]Virtual Reality[/url], and I will be the interim head-writer this week. As you may already know, The Elite has stepped down from his moderator position. Please stay tuned, as more information on the subject will be disclosed below. It has been quite the hectic week, so let's waste no more time by getting straight into the headlines for December 4, 2010 - December 11, 2010. Enjoy!\r\n\r\n\r\n\r\n[align=center][img]http://ploader.net/files/c97336a9984c622ee178491cbb8fceb5.png[/img][/align]\r\n\r\nWithin the last week or so, feedback and coverage of the ongoing [url=http://en.wikipedia.org/wiki/WikiLeaks]WikiLeaks[/url] scandal has been overwhelmingly publicized both throughout the forum, and internationally. Because of this, many threads on this broad topic have been published. Although stating and arguing your opinion is both supported and encouraged, administration has become quite worried about the possibility of malicious attacks being directed towards members of an opposing party. In order to ensure the safety of both our users and third-party organizations, Omniscient has officially released his very own statement in regards to this matter. Within this announcement, Omni declared that any discussion or acts portrayed in relation to maliciously harm towards opposing parties are prohibited. He also mentioned that there are no more threads allowed on this subject, considering there is already one existing thread for users to express their opinions on this matter. If you would like to read the full statement, you may do so by following this [url=http://hackforums.net/announcements.php?aid=9]link[/url]. \r\n\r\nOn a positive note, we are pleased to officially announce the promotion of a hard-working and dedicated contributor, who has ultimately garnered himself a top position as our newest [color=lime]staff[/color] member. The entire HF News team would like to send our congratulations to [url=http://hackforums.net/member.php?action=profile&uid=46373]phire nuk3r[/url], who will most certainly be a superb addition to the staff team. If you would like to view the entire staff list, you may do so by clicking [url=http://hackforums.net/showteam.php]here[/url]. We encourage all users to show their gratitude to our newest staff member! \r\n\r\nAs previously mentioned briefly in the last issue of HF News, [url=http://hackforums.net/member.php?action=profile&uid=136025]The Elite[/url] has made the decision to step down as moderator and head writer. This user has contributed in an amazing way, by creating informational and entertaining content week-in and week-out whilst delivering editions of this very newsletter. Although The Elite will be missed immensely, one question still remains in the minds of countless users. Who will be replacing The Elite, do you ask? To be honest, I know as much as you do. Even though a permanent replacement has not been recognized, there are already several names being dropped by users as what they feel are valid possibilities. For example, please reference [url=http://hackforums.net/showthread.php?tid=886101]this[/url] thread. Let the speculation begin! Nonetheless, The Elite made HF News what it is today, and I think we should all recognize him for it. His countless hours of hard-work and dedication have surely not gone unnoticed, and I believe we should all thank him for his contributions.\r\n\r\nAs many of you are already aware, HackForums was down today for quite a few hours. This was due to multiple issues being detected with the MySQL server. When attempting to quickly fix the errors, administration noticed that they may not be so easy to patch. In an act of good judgment, Omniscient closed down the site for a matter of hours, in order to set up the brand new MySQL server. After this fiasco, our administrator released this statement on his twitter account; \"[b][i]We are now running on new MySQL server. Let's see how it goes.[/i][/b]\". Whenever we upgrade to a new server, there are always slight glitches and anomalies involved. We ask that all users remain patient and report all unusual and previously unreported database anomalies, as it will assist in the efficiency and security of the website. Later on, Omniscient released an official on-site statement, in regards to recent downtime. Click [url=http://hackforums.net/showthread.php?tid=892014&page=6]here[/url] if you would like to read it. Also, all members are encouraged to check the official [url=http://twitter.com/hackforumsnet]HF Twitter Account[/url] when experiencing downtime, as our administrator tends to send out updates via social network whenever HF experiences vast technical difficulty. You can follow HF on twitter, under the user-name of [i]@hackforumsnet[/i]. Also, Omniscient posted yet another statement in regards to this matter, this time in a less-brief fashion. You can ready it by clicking [url=http://hackforums.net/showthread.php?tid=892163&page=1]here[/url].\r\n\r\nIn other news, The Lounge recently reached the tremendous milestone of 100,000 threads! With over 1,000,000 posts in total, [url=http://hackforums.net/forumdisplay.php?fid=25]The Lounge[/url] is by far the fastest growing section on the forum. Congratulations HF, as this is a wonderful achievement. I hope to report on more milestones of this kind, in the near future. Good work, loungers!\r\n\r\n\r\n[align=center][img]http://ploader.net/files/b870251eb67dcc675c518f246fb21619.png[/img][/align]\r\n\r\nA few days ago, a user by the name of [url=http://hackforums.net/member.php?action=profile&uid=116337]Priest[/url] created a report, in which he stated an inactive user by the name of [url=http://hackforums.net/member.php?action=profile&uid=395498]VipeX[/url] had passed away. Many users speculate his cause of death to be suicide, while others claim it was due to a heart-attack. Please note that HF News can not confirm or deny these allegations, as the possibility of this being a fake scenario for reputation and publicity is always relevant under these circumstances. In the event that this story is true, we send our condolences towards family and friends of this user. If you would like to read the thread we are referring to, you may do so by clicking [url=http://hackforums.net/member.php?action=profile&uid=395498]here[/url].\r\n\r\nBack in February, Omniscient created a thread in regards to the way the media and society in general stereotypes the art of hacking. In hope to enlighten those around the world, he sprung up the possibility of starting an international campaign to assist in halting the stereotypes and misinformed observations of users of this forum, and hackers alike. Click [url=http://hackforums.net/showthread.php?tid=289416]here[/url] if you would like to read his original thread. Just the other day, Crow took matters into his own hands by finally jump-starting this campaign. Almost a year later, the HF community is at-last taking matters into their own hands. If you would like to help, or learn more about this campaign, please read Crow's follow-up thread [url=http://hackforums.net/showthread.php?tid=889555]here[/url].\r\n\r\nAlso, controversial user [b]Braco[/b] was unbanned this week, after a short hiatus. Braco was originally banned a few months ago, but he remained a member of the community by creating multiple account and ban evading. If you would like to learn more, please stay tuned as HF News is lucky enough to join Braco later on in his first unprecedented interview since being reinstated as a full-time member.\r\n\r\nAnother notable mention would be the thread Omniscient created pertaining to increasing internet speeds. Within this thread, Omniscient shows users how they can easily increase the efficiency of their internet viewing experiences, by increasing their internet speed by up to 450%! If you are interested in taking a look at this thread, you may do so by clicking this [url=http://hackforums.net/showthread.php?tid=884082]link[/url].\r\n\r\nHF News would also like to congratulate [url=http://hackforums.net/member.php?action=profile&uid=126503]Techno[/url], for being promoted to Reviewer Leader. We here @ HF News wish the best for Techno, as we are sure he will continue to prosper as a valuable and contributory member of the Reviewer Group. We also encourage all members to send congratulatory messages his way, as he has worked very hard for his new-found position!\r\n\r\n[align=center][img]http://ploader.net/files/e09fde27192979fcc8c7608f799a2f48.png[/img][/align]\r\n\r\n[i]Opinion Of The Week[/i] is a brand new segment, here at HF News. Within this weekly article, the head-writer or a special-guest judge will search through the [url=http://hackforums.net/forumdisplay.php?fid=128]Science, Religion, Philosophy, and Politics[/url] section in order to find what we deem is the \"opinion of the week\". This can consist of an entire debate, or a single argument. This week, I have chosen to put a focus on a particular post in a thread regarding the topic of time travel. You can view the thread of which this opinion was posted, by clicking [url=http://hackforums.net/showthread.php?tid=884230&page=1]here[/url]. This week, we have chosen an argument by the user [url=http://hackforums.net/member.php?action=profile&uid=44389]υℓтιмαтє ¢яєє∂™[/url]. With out further ado, here is the featured opinion of the week!\r\n\r\n[spoiler=Opinion Of The Week]\r\n\r\n[i]Technically you time travel every time you get in a car or an aeroplane. Its called relativistic travel, if you travel at a greater velocity than someone or something else time passes at a much slower rate for you (in very simple terms). For example if you put a very accurate stopwatch on an aeroplane and then flew around the world, it would be slightly (nanoseconds) off from a stopwatch left at the airport. GPS satellites have to be routinely adjusted because they are travelling at high speed and need very accurate time keeping.\r\n\r\nSo travelling forward in time is possible. If it were possible to travel near light speed you could fly away from the planet to the nearest star and back. In your time frame one year would have passed, however on earth time hundreds of years have passed.\r\n\r\nTravelling back in time is not currently possible, even in theoretical physics. We don't know enough about black holes, neutrinos, antimatter, and space time to even say if it is possible.\r\n\r\nFaster than light travel also breaks rules, its the cosmic speed limit and nothing goes faster than light. Perhaps in the future it will be possible to bend space time and literally expand space behind a craft. If you were to draw two points on a balloon, and then squeeze the balloon you could change the distance between the points with out actually moving them.\r\n\r\nAnother interesting concept is being able to put two particles in phase, I read about this a while ago so I probably am leaving out a lot. But, when you put two particles in phase they stay in phase no matter what. You could move one particle millions of miles away and the particles would still be in phase. This indicates a physical relationship that moves faster than light. So it might one day be possible to send signals with no delay instantly across the universe. [/i][/spoiler]\r\n\r\nIf you would like to read his full argument, you may do so by following this [url=http://hackforums.net/showthread.php?tid=884230&page=4]link[/url]. Congratulations to υℓтιмαтє ¢яєє∂™! If you would like to be featured next week, please send me a PM with your nomination. Also, considering this is a new segment I would like to know if you all would like to see something like this again in the future. Your feedback is appreciated and is taken into vast consideration when writing each week's edition!\n[hr]\n[align=center][img]http://ploader.net/files/6a15bfbd014aac35682fe980c08de08c.png[/img][/align]\n\nTo end this weeks edition of HF News on a high note, it is now time for the weekly interview! This week, we were fortunate enough to catch up with a popular user by the name of [url=http://hackforums.net/member.php?action=profile&uid=277061]Braco[/url], who really needs no introduction. Because of all the controversy surrounding this user in recent weeks, I couldn't think of anybody more interesting to interview. Enjoy!\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] When did you join HF, and what brought you to the website in the first place?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]I joined on the 7th (Tuesday) of July, year 2009.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] When you originally joined, what was your favorite thing about the forum. Since then, has your opinion been altered in any fashion?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]The thing that I liked was the community. The first days when I joined I was selling my friend's SQL Injection tool. Yeah, because some members changed like I did and took the bad path.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] \nWe are all aware that you have had your account closed previously. Please explain the events that occurred, which would ultimately lead up to your temporary demise?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]Well long story short, I wanted to sell my youtube bot source and SpK found a potential buyer, but things went bad. The buyer disputed the transaction and I was raging about it and called SpK a scammer and that I will ban him. Thought he would take it as a joke but he didn't, he reported me and thus leading to me being demoted. After that I did some reputation abuse and was 3-4 times repfucked, and finally I went to release Omniscient's plugins and that lead to my permanent ban.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] After being banned, it became apparent that you had created a new account, in order to receive a fresh start. What was the name of this account, and what was your initial motive when creating it?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]The name of that account was Marik, my motive was to be a high quality member. I wrote a nice guide that got me the Bronze Tutorial Award.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] A short while after the creation of your second account, you were once again penalized for ban evading. When did this occur, and how did administration figure out that you were the same person who was behind the Braco account?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]I did a major mistake when asking Solidify to leak an e-Book for me and that got me banned. After that Omniscient realized that it was me and banned me.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] After having both of your accounts banned, you were just recently reinstated as a member of the forum. How did you convince administration to allow you back into the community?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]That's the most annoying question that everyone asks me, but I will answer it once more. I politely asked him for a second chance, and he accepted it. The Elite helped me though, so cheers to him.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] \nLooking back at this entire fiasco, is there anything you would do differently?\n[color=#FF1493][b]Braco:[/b][/color] [color=white]Yes. I wouldn't do the last mistake I mentioned and I would try to keep low profile.[/color]\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] Now that you have been granted a so-called \"second chance\", what are you going to change about the way you contribute to the forum, in order to ensure you continue to strive as an active member of the community? Do you have any specific goals and/or aspirations in mind?\n[color=#FF1493][b]Braco:[/b][/color] I will write lots of guides/e-books that I will give out to upgraded members, help the community in any way, shape or form, donate and buy member upgrades and other great things that have in my mind.\nMy goals are to get back to the respected place I was before I got demoted, hit 5.000 posts and hopefully get more friends.\n\n[b][color=#00BFFF]Virtual Reality:[/color][/b] That's great to know, and I look forward to seeing your new and improved attitude around the forum. Thanks for taking the time to answer these questions. Both the HF community and myself appreciate it!\n[color=#FF1493][b]Braco:[/b][/color] No problem, it was a pleasure to be able to share my side of the story in this kind of environment.\n\n--\n\nThat's it! Thanks for reading everybody. It was a pleasure to fill in as the interim writer this week, and I really hope to get the opportunity to write another edition in the future. Credit goes to [url=http://hackforums.net/member.php?action=profile&uid=141530]Malware Boss[/url] for designing the awesome new graphics! Once again, I appreciate you all taking the time to read through this edition. I hope it wasn't too long for you all (I actually had to edit the posts to fit all of the content in, as I was getting a \"message too long\" error when I tried to publish this). Feedback is as always, encouraged immensely!\n\n[i]Sincerely,\n[b]Virtual Reality[/b][/i]",
      "subject": "[12/04/2010] HF News"
    }
  ]
}