{
  "posts": [
    {
      "pid": "4445377",
      "uid": "74244",
      "dateline": "1275850743",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 4 [/align]\r\n[size=large][color=#FFA500]\r\nHeadlines[/color][/size]\r\n\n[color=#FF4500]Omniscient posted a thread [url=http://hackforums.net/showthread.php?tid=453675]here[/url] about a member who has been a member since 2007! Three years ago, HackForums wasn't even close to as big as it is now. On October 12 (6 days after this guy joined), HackForums only had 3,319 posts, 2,264 threads, and only 1,043 members! Talk about your loyal member! He may not post a lot (he usually hangs around in the IRC, which can be found [url=irc://irc.malvager.com/hackforums]here[/url]), but he still is a loyal member and to you we give our cheers![/color]\r\n\n[color=#32CD32]This week, a LUA Coding section was made after a request from [url=http://hackforums.net/member.php?action=profile&uid=319673]God Of War[/url]. The section can be found [url=http://hackforums.net/forumdisplay.php?fid=161]here[/url]. LUA is mainly used for game programming. We'll see if in the coming months we see this come up from the dust to become a popular discussion on HackForums.[/color]\r\n[color=#FF69B4]\r\n[url=http://hackforums.net/forumdisplay.php?fid=47]Hacking Tutorials[/url] has reached 8,000 threads. That's 8,000 threads of tutorials all for HackForums. Let's continue to strive forward with the great tutorials that make up HackForums!\r\n[/color]\r\n[color=#32CD32][url=http://hackforums.net/member.php?action=profile&uid=52868]\r\nLuchien Lachance [/url] got Moderator of the Science, Religion, and Politics section here in The Lounge. This will hopefully clear the low quality posters that go over there and post frequently.[/color]\r\n--\r\n[size=large][color=#00BFFF]User News[/color][/size]\r\n[color=#32CD32]\r\n[url=http://hackforums.net/showthread.php?tid=454478&pid=4356637#pid4356637]Tutorials of the Month[/url] is a thread by Panik in which he chooses tutorials that were the best in the month, and has voting and what not, and the best tutorial of HackForums is chosen for that month. There is no award for winning it, but PaniK might include some prizes later on.\r\n[/color]\r\n--\r\n[size=large][color=#FFA500]Just Plain Weird[/color][/size]\r\n\n[color=#FF4500]The-Black-Raven posted a thread [url=http://hackforums.net/showthread.php?tid=464004]here[/url] about him finding a \"chick\" on 4Chan and now stalking her. Houston, we DEFINITELY have a problem.[/color]\r\n\n[color=#00BFFF]lil bryzee posted a thread [url=http://hackforums.net/showthread.php?tid=464131]here[/url] about him starting to smoke that \"green green\". Here's the direct quote from the \"Newly Profound King of Awesomeness\"\r\n\n\"I just started smoking that green last friday. First time ever had 3 bong hits went to my first period class hella stoned oh fuck yea! Than yesterday my supplier has a big ass bong like its 4 feet tall. And we smoked .7 of an ounce in that shit! I was red eyed as fuck thank god my buddy had vizine. I bought 2 dimes worth the same day. I started smoking at 7pm and didn't stop till 1am. Damn i was fucked up. I layed in bed and couldn't feel my neck or my throught and arizona ice tea is the shit!\"\r\n\nOh fuck yeah! 3 BONG HITS! .7 OUNCE OF THAT SHIT MAN! RED EYED AS FUCK BROSKI! MY BROSKI HAD SOME VIZINE MAN. DAMN MAN 7 PM TO 1 AM I WAS SO FUCKED MAN. I COULDN'T FEEL SHIT IN MY BODY AND ALL OFF THE SUDDEN MAN I HAD SOME ARIZONA ICE TEA, THAT SHIT IS GREAT.\r\n\nI translated it for you other people that couldn't understand him. Seems like this guy is driving 10 MPH in a 100MPH zone.[/color]\r\n\n--\r\n[size=large][color=#32CD32]Bans of the Week[/color][/size]\r\n[color=#32CD32]\r\n[url=http://hackforums.net/member.php?action=profile&uid=63671]Soul Collector[/url] was banned this week for scamming. He's going to be gone for a while, and this makes sense as he had at least 15+ scam reports. Shame to see someone like that go. However, you can look at my reputation I gave him [url=http://hackforums.net/reputation.php?uid=63671&page=4]here[/url] which even says he was a dodgy character. iBruteforce also gave him a negative reputation, as it was too good to be true. He was never really trustworthy in my book, but he did make a ton of tutorials.[/color]\r\n----\r\n\nSuggestion format -\r\n\nThread link -\r\nMore details about it -\r\n\nPrevious thread - http://hackforums.net/showthread.php?tid=450222\r\n\nNext thread -",
      "subject": "HF News - [5/30-6/6] [COMMENT]  [FOURTH]"
    }
  ]
}