{
  "posts": [
    {
      "pid": "22096065",
      "uid": "515249",
      "dateline": "1335580775",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]89th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Massive down time[/b][/color]\nWhile our beloved owner [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] was away at Lake Tahoe this weekend HackForums went down for a lengthy time of 8 hours. The event occurred on the 22nd, only a day after HackForum's 5th anniversary. To see [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s short and sweet announcement click the following link: http://goo.gl/AXt0G\n\n[color=white][b]Beware of phishers[/b][/color]\nEarlier this week there was talk of a phishing scam where a non-upgraded member would PM you yelling at you for a post. In the PM it would contain a link that looked like a link to a thread or reply, but when clicked it would take you to a phishing site where members would be prompted to log back in to HackForums. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has not commented on this matter, however some members believe that he is going to take legal action in hopes of shutting down the website. To view a warning thread regarding this event click the following link: http://goo.gl/XqCMR\n\n[color=white][b]TechSperts now mentoring[/b][/color]\nThe TechSperts have been known for their tutorial making and wide variety of skilled members, however they have recently started a new mentoring program giving almost any member a chance to learn from the best here on HackForums. These Public Classrooms require members to apply, however they do post the lesson after they are finished for anyone that could not attend. To view the TechSpert's announcement thread click the following link: http://goo.gl/rb2nc\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=402384][b][color=#0066FF]Riggs[/color][/b][/url] has reached 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=510569][b][color=#FFD700]SWAGSTER[/color][/b][/url] was rep fucked for using an adult image as his avatar.\n[url=http://hackforums.net/member.php?action=profile&uid=539678][b][color=black]Velocity[/color][/b][/url] was banned for UB3R junk abuse.\n[url=http://hackforums.net/member.php?action=profile&uid=57913][b][color=black]Killerpop89[/color][/b][/url] had his account stolen.\n[url=http://hackforums.net/member.php?action=profile&uid=1260135][b][color=black]Marine[/color][/b][/url] was banned for fraudulent donations.\n[url=http://hackforums.net/member.php?action=profile&uid=1103896][b][color=black]BigDomePiece[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=1017766][b][color=black]Han.[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=707090][b][color=black]WARZONE[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=708719][b][color=black].Hack[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=1058203][b][color=black]Netflix[/color][/b][/url] was banned for advertising a social engineering site.\n[url=http://hackforums.net/member.php?action=profile&uid=474324][b][color=black]NiTrOwow[/color][/b][/url] requested to be banned.\n[url=http://hackforums.net/member.php?action=profile&uid=391680][b][color=black]Witness[/color][/b][/url] was banned for LQP.\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]HJT Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2435877]Inactivity Purge + Restructuring - Trainees, Teachers, and Helpers[/url] - [url=http://hackforums.net/member.php?action=profile&uid=45246][color=white][b]Valiant[/b][/color][/url] - Here tells a sad tale of how the HJT Team is falling, many are leaving and becoming inactive. However, new faces will join and start their training, all is not lost!\n\n[i][b]Admin Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2438646]Omniscient was at my house. [proof][/url] - [url=http://hackforums.net/member.php?action=profile&uid=323740][color=white][b]Positive[/b][/color][/url] - Positive tells his story of how he met Omniscient.\n\n[i][b]Dog Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2340905]Dog dog dog.. Bear Bear Bear.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1067987][color=white][b]Grammar Hax1n[/b][/color][/url] - Here we find a heartwarming thread of someone who would take a bullet for their dog.\n\n[i][b]RAT Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2429481]TechSperts | Lesson One - All about RATs[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1042274][color=white][b]-๖ۣۜDivine-[/b][/color][/url] - The Techsperts have released a new tutorial on RATs.\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=264993]Opulence[/url][/font][/size][/color][spoiler=]\n[b]Waleed[/b]: Hello Opulence, I'd like to thank you for taking a few minutes out of your day to participate in this interview. We generally kick off our interviews by giving our interviewee's the opportunity to give their favorite HackForums colleague's a shout out. Do you have anyone in mind?\n[color=#87CEEB][b]Opulence:[/b] Ωмεɢα comes first to my mind since we haven't spoken much lately! Should probably drop him a PM now lol. Then there is Sold, awesome girl. And of course the only sane mature person here Bugga. And let's not forget the mustbementioned Omniscient and Judge Dredd, strict to some but really cool to talk with.[/color]\n\n[b]Waleed:[/b] I hope they will be pleased to see their names mentioned in this edition of HF News. You may be aware that HackForums had reached its 5 year anniversary on the 21st; what are your views on this milestone?\n[color=#87CEEB][b]Opulence:[/b] Every milestone reached is worth a celebration. HF grows, and changes for every day that passes by, to some in a more negative direction. To me, every change is positive as the site and community keeps growing and it's a normal thing that people always romanticize \"the good old days when everybody loved anybody\". I do however wish to see some of the rulings on disallowed blackhat activity be lifted.[/color]\n\n[b]Waleed:[/b] HackForums has definitely come a long way, and you've been around for much of its progress. This month marks two years since you've joined HackForums, can you recall of any memorable moments you'd like to share with our readers?\n[color=#87CEEB][b]Opulence:[/b] Wow, has it been two years already? Memorable moments you say, hmm, HF is a jungle, epic things happens in the shadows all the time. But examples of noteworthy moments was when Braco got a whole country blacklisted, that was hilarious. So was the return of Hanzo, aka Judge Dredd and the thousands of repfucks that followed and who can forget Boxxy and partners that scammed for thousands of dollars. P R O D I G Y pulled one off as well.[/color]\n\n[b]Waleed:[/b] I see you have lots of memories to reminisce. What brought you to join HackForums and what were your intentions?\n[color=#87CEEB][b]Opulence:[/b] My original reason were embarrassingly enough to buy a Windows 7 key here, and just delete my account after that. I got not only one but several ones for free, and more keys for other software that got me stop using pirated, and cracked software. I stayed cause of the generosity by those members, and the great community that wanted me to learn.[/color]\n\n[b]Waleed:[/b] With three month worth of activity I have to ask what keeps you active on the forum?\n[color=#87CEEB][b]Opulence:[/b] I'm not as active as I used to but I stay for the many discussions here, and the constant new methods to do things. If you want to learn, there's a lot of people willing to teach in this community.[/color]\n\n[b]Waleed:[/b] There are plenty of sections here on HackForums; even ones that don't revolve around hacking. Which would you say is your favorite and why?\n[color=#87CEEB][b]Opulence:[/b] The Lounge for the laidback silly discussions, and the SRPP section for the more heavy discussions.[/color]\n\n[b]Waleed:[/b] I'm very joyous for our 5th anniversary and I'm sure much of the community is as well. What can HackForums improve on for next year?\n[color=#87CEEB][b]Opulence:[/b] Anything and everything always needs an improvement, I can't say what exactly but I'm sure Omniscient has tons of ideas for HF left in him. But as said before, keys and serials needs to return to HF, would fill a lot of pockets for some members here.[/color]\n\n[b]Waleed:[/b] I'd like to thank you once again Opulence for allowing us to interview you. Are there any last words you have for our readers?\n[color=#87CEEB][b]Opulence:[/b] Stay active and stay positive and show others the respect you want for yourself. And Ub3rs and L33ts, you guys can always be nicer to the normal members, we've all been there, not the annoying trolls of course. And to answer a question I get PM'ed about constantly, no, you don't have to pay a cent to receive these awards.[/color]\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=871604]Phismatic[/url][/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Phismatic! Thanks for taking the time out for this interview! Before we begin, would you like to give a shoutout to any special members or friends on Hack Forums?\n[b][color=#1466ff]Phismatic[/color][/b]: I'd like to give a shoutout to Koala. He's having a difficult time adjusting after coming out of the closet.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Great - I wish the best to Koala, I know that you too struggled when you eventually came out. I am sure it'll get better! How did you find Hack Forums, [b][color=#1466ff]Phismatic[/color][/b]?\n[b][color=#1466ff]Phismatic[/color][/b]: It's hard to remember, but I think I found HF from another forum I was on.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Ah! That was a while ago, wasn't it? Back with DJ Keemstar and all of that nonsense. What has been your most successful accomplishment on Hack Forums?\n[b][color=#1466ff]Phismatic[/color][/b]: Yeah, my most successful accomplishment on HF would have to be when I got accepted for ub3r.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Interesting! Congratulations, I was certainly rooting for you. If you could change one thing on Hack Forums, what would it be, and why?\n[b][color=#1466ff]Phismatic[/color][/b]: If I could change one thing, it would have to be to allow the disallowed blackhat activity.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: You have always had a tendency to be a naughty boy, haven't you Phismatic? That would be interesting, but would lead to legal repercussions for Omni. What's your best memory on Hack Forums?\n[b][color=#1466ff]Phismatic[/color][/b]: My best memory would probably be getting uber. It’s definitely a pretty cool to get accepted.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I agree completely! It’s the best feeling ever, I still have my acceptance PM from Omni I believe. What do you look forward to doing on 4/20?\n[b][color=#1466ff]Phismatic[/color][/b]: I’m definitely looking forward to all the marijuana threads in the Lounge, there aren’t enough of them. I’m going to enjoy myself with friends. What about you?\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I have no idea yet, thanks for asking! Hopefully I get to enjoy it also! In the spirit, what do you think about the marijuana legalization movement in the US?\n[b][color=#1466ff]Phismatic[/color][/b]: I think its fine, I just want people to stop bitching about it personally. It doesn’t hurt anyone. They’ll just tax the shit out of it. \n\n[b][color=#1466ff]Michael Westen[/color][/b]: I agree – Who knows, we’ll see what happens. Do you have any closing regards for the readers/smokers out there?\n[b][color=#1466ff]Phismatic[/color][/b]: Enjoy your holiday.\n[/spoiler]",
      "subject": "[4/27/12] - HF News"
    },
    {
      "pid": "22096134",
      "uid": "515249",
      "dateline": "1335580976",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][IMG]http://i.imgur.com/sotvw.png[/IMG]\n[video=youtube]http://www.youtube.com/watch?v=mjc9PfyQRIw[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Obama Picture with College Student goes Viral[/b]\nDuring his travel through Colorado on Tuesday, Obama entered a local pub known as the Stink and took a photograph with student Madalyn Starkey.  Madalyn uploaded the picture to her Twitter never guessing it would blow up that quickly but she was quickly proven wrong.  \n[spoiler=Obama Pictures][img]http://l.yimg.com/bt/api/res/1.2/BGb6_ez9iFEaKholoRJ4fQ--/YXBwaWQ9eW5ld3M7cT04NTt3PTYxMg--/http://media.zenfs.com/en/blogs/upshot/ObamaBarpic.jpg[/img]\n[img]http://l.yimg.com/bt/api/res/1.2/YO74gglcYORm6tFDAOAOiw--/YXBwaWQ9eW5ld3M7cT04NTt3PTYzMA--/http://l.yimg.com/os/152/2012/04/25/AP111108044301-jpg_194805.jpg[/img][/spoiler]\nEric Pfeiffer from Yahoo News stated that, \"After all the attention, it would seem the president is giving the Ridiculously Photogenic Guy a run for his money.\"\n\n[b]North Korea in possession of 'Mobile weapons' with capability of Striking USA[/b]\nRecently, a North Korean army official states that his country was armed with powerful mobile weapons with the ability to strike America.  He also claimed that the weapons could annihilate the United States \"at a single blow.\"\nReporters at Yahoo state that:\n[quote]North Korea made another unusual claim Monday, promising \"special actions\" that would reduce Seoul's government to ashes.\nNorth Korea is believed to have nuclear weapons but not the technology to put them on long-range missiles. A rocket launch that the U.S. claimed was a North Korean attempt to test missile technology failed this month.\n[/quote][/color]\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[b][color=white]Apple:[/color][/b]\nThe tech giant Apple Inc. has released their quarter two earnings. They made a whopping thirty-nine billion dollars, with the fact that they sold less iPhones and iPads this quarter.  Apple is believed it will be the first company to be worth a trillion dollars. It’s currently worth about half a billion dollars. Apple has been achieving things other company’s dream of. There are skeptics out there who say Apple will eventually be just a trend and fade out. A half a billion-dollar company fading out? I don’t think so. \n\n[b][color=white]The “Cloud”:[/color][/b]\nIt seems like every computer company know is releasing a cloud storage program. Apple and it’s iCloud, Microsoft’s SkyDrive , Dropbox, and Box. Storing things in the cloud has become the easiest thing ever thanks to all these companies coming out with their programs. Google recently joined the party with Google Drive, a nifty name, which stores five gigabytes for free. Google’s new Drive is supposed to be friendlier to users because it allows files up to ten gigabytes to be uploaded to their cloud storage.  It is available on both Windows and Mac, also on Android and iOS. \n\n[b][color=white]Viruses:[/color][/b]\nNew viruses have been going around like wildfire. The once thought to be untouchable OSX has been attacked many times this month with many new types of Trojans. Windows has always been attacked by viruses. There are many ways to protect yourself like: downloading things that you trust, don’t open emails from an unknown address, disable Java (has been attacked a lot lately), and if you can get your firewall setup.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Carrie Underwood[/b][/color]\nFew female vocalists in any genre can boast a more stylistically diverse résumé than Carrie Underwood. In the past year alone, she's scored a No. 1 country hit with pal Brad Paisley, partnered with rock icon Steven Tyler for top-rated CMT show \"Crossroads\" and performed with legendary crooner Tony Bennett at the Grammy Awards, serving up the classic \"It Had to Be You,\" their collaboration on Bennett's Duets II album\n\n[color=white][b]Hall Of Fame[/b][/color]\nThe Rock 'N' Roll Hall Of Fame recently inducted Guns N' Roses, Red Hot Chili Peppers, Beastie Boys and more.\n\n[color=white][b]Coachella[/b][/color]\nTupac rose from the dead and stole the show at Coachella, performing alongside Snoop Dogg and Dr. Dre. Read more about it [url=goo.gl/nqZyw]here[/url].\n\n[color=white][b]Kenny Chesney[/b][/color]\nKenny Chesney sat down recently with Billboard's Ray Waddell to discuss the many projects keeping him busy in an American Express Press Pass Q&A.\n\n[color=white][b]Music Videos Of The Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=oHg5SJYRHA0[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nFrankly, I'm dead tired. I'm sorry I cannot grace you with my wise words this night.\nYet, here's one quote from me \"Sometimes it's okay to opt out of something you usually do, if you just feel you aren't up to the task.\"",
      "subject": "*"
    },
    {
      "pid": "22096143",
      "uid": "515249",
      "dateline": "1335581003",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"If you spent 4/20 doing something special, what did you do? In detail.\"\n\n[i]\"A friend and I counted down 'till midnight before we lit our first joints. We \nhad spent over $350 on weed and additional necessities to celebrate 420, so \nwe were totally pumped. After four joints each, we went to sleep, since we \nhad school the next day. We were at his house and his parents weren't at \nhome, so the first thing we did the next morning was a peaceful wake and \nbake at the dinner table. My friend's mom had left bread from the baker, which \nwe ate entirely by ourselves before we even arrived at school.\nWe were forty minutes early, so that was enough time for us to smoke another \ntwo joints and roll a sticky for the first break.\nClass was perfect. Our teacher for the first hour didn't show up, so we spent the \nfirst hour outside, smoking. The teacher for the second hour was there, but I can \nguarantee you that we barely noticed that.\nDuring our first break, we both went to the school bathroom and smoked our \nsticky. We had to drill it, since we only have five minutes.\nWhen the bell announcing lunch break rang, we were the first two to get up and \nleave class. \nMy friend and I had made space cake for the occasion, so that's what we ate.\nAfter we had finished our 420 themed lunch, we sparked up three more joints each.\nOn our way back to school, we encountered a cop riding a horse. We were barely \nable to hold back our laughter. The cop noticed we were baked as, but instead of \narresting us like he should have, he wished us a happy 420 instead. We grinned, \nhigh-fived him, pet his pony and strutted back to class, laughing constantly as we \nwere walking.\nThe afternoon classes were slow as hell. Teachers were talking about boring shit \nand we weren't even paying attention. The only thing that made the afternoon \nmore fun was the occasional snort of laughter that came either from my friend \nor me.\nWhen school was over, we went back to my friend's house were we smoked some \nmore, but this time with Hash instead.\nWe prepared for a 420 party we were attending and left his house around 8PM. \nThe bus ride was hilarious. Everything was so beautiful, yet hilarious at the same \ntime. The bus driver realized we'd smoked, but he didn't say a thing about it.\nWe got at the other guy's home around 9PM. We rang the door and a stranger \nopened the door. His eyes were red as fuck, so we were clearly at the right address.\nWe entered the house and thick white smoke greeted our lungs.\nWe still had a LOT of weed left and quickly lit up another joint.\nThe night was young and we practically smoked one joint after another. The host \nof the party had also made space cake, so that was pretty much our 420 dish, 24/7.\nThe last thing I remember doing on 4/20 was passing out in a hotboxed Peugeot 106 \naround 11AM. I woke up the next day, Saturday, around 6PM and still felt a bit hazy.\nThat was the best twentieth of April ever!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=426299][i]-Oldskool.[/i][/url]\n\n[align=right][i]\"I think people need to chill. I mean what the world is coming to if \nyoung people started to smoke marijuana a lot. Imagine what society will be in the \nfuture: Full of prisoners, dropped out of school teens and so on. I think marijuana \nshouldn't be legalized, not the USA, Not in any other country in the world. What was \nillegal will stay illegal because it was illegal for a good reason. Now I know that people \nwill start to hate me for this opinion but chill, I'm just trying to warn people. Thanks.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=509788][i]-Makaveli The Don[/i][/url][/align]\n\n[i]\"My 4/20: 10 pipe bowls, 4 bong bowls, 1 Juicy J, and 3 King sizes. \nAll in the course of a 12 hour span.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=187420][i]-iDuL[/i][/url]\n\nThe topic for next week is \"How do you feeling about gaming nowadays, compared to old school gaming?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.imgur.com/WpQee.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/PMCn1.png[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/sxASX.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=uUYaDYquIng[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=451192][b][color=white]Existence[/color][/b][/url] was recently promoted to leader of Blackshades.\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=1011113][b][color=#0066FF]Dan.[/color][/b][/url] received the Youtube award.\n[url=http://hackforums.net/member.php?action=profile&uid=646916][b][color=white]Genuine[/color][/b][/url] received the Jokester award.\n[url=http://hackforums.net/member.php?action=profile&uid=515249][b][color=white]Sir[/color][/b][/url] received the Speaker of the House award.\n[url=http://hackforums.net/member.php?action=profile&uid=1007343][b][color=white]BELLAGIO[/color][/b][/url] received the Businessman award.\n[url=http://hackforums.net/member.php?action=profile&uid=1159829][b][color=white]Subscription[/color][/b][/url] received the Youtube award.\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][b][color=white]TheVortex[/color][/b][/url] received the Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=274613][b][color=white]Яǝʌǝɹsǝ[/color][/b][/url] received the Youtube award.\n[url=http://hackforums.net/member.php?action=profile&uid=1115097][b][color=white]TheVortex[/color][/b][/url] received The Alien award.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/KNR24]Starstruck[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/YEl4h]Waleed[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}