{
  "posts": [
    {
      "pid": "29929593",
      "uid": "515249",
      "dateline": "1358827267",
      "message": "[align=center][IMG]http://i6.minus.com/ivrhzVLpBYWA8.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#C802C6][b]126th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i4.minus.com/jSlMFVscGE1mv.png[/img][/align]\n[color=white][b]Anonymous - A message to Omniscient (Joke)[/b][/color]\nThis week a video was uploaded from a competing forum, that will not be mentioned here, to try to to trick members of HackForums that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] is apart of some FBI plot to arrest members on the site for illegal activities. The video can be seen [url=http://www.youtube.com/watch?v=SCc6_B59CHg]here[/url]. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s reply was: \"[i]And I trap them by telling them we don't allow BH activity and ban their accounts. LOL...400 members of Anon arrested! Where? Skids think if they spread rumors it will hurt me. I think it's funny as hell if anyone believes this crap. $100 says this is either a ban evader,﻿ scammer, or someone who started a wannabe HF clone. Still...it was good to watch for the laugh.[/i]\" He then [url=https://twitter.com/HackForumsNet/status/292525129907437568]tweeted[/url] a link to the video. Shortly after, the well known member, [url=http://hackforums.net/member.php?action=profile&uid=651051]Wolves[/url], posted a thread joking about the situation, which has been junked after 13 pages of comments. Omniscient then removed [url=http://hackforums.net/member.php?action=profile&uid=651051]Wolves[/url] from the Mentor usergroup.\n\n[color=white][b]Site Changes[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] tweeted: \"[i]Added a new avatar gallery by member \"★ Leo ★\". Go check it out. Enjoy.[/i]\" The new gallery can be viewed in the User Control Panel [url=http://hackforums.net/usercp.php?action=avatar]here[/url]. The \"iPhone and iPod Touch\" section was renamed to \"iOS and iDevices\" which can be viewed [url=http://hackforums.net/forumdisplay.php?fid=137]here[/url]. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] also raised the price for Paid Stickies stating: \"[i]Price increased on some paid stickies. Please read our help docs also for new info on paid stickies which helps explain the process.[/i]\" The new prices can be viewed [url=http://hackforums.net/misc.php?action=help&hid=25]here[/url].\n\n[color=white][b]Account Security Changes and Warning[/b][/color]\nRecently a large scammer was found by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], who posted a thread about it [url=http://hackforums.net/showthread.php?tid=3163253]here[/url]. The scammer had purchased many accounts on several small competing forums that will not be mentioned here. Due to this, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url][url=https://twitter.com/HackForumsNet/status/290904743063207936] announced[/url]: \"[i]When a PW reset request is initiated the requesting IP is sent in the email. This can help with stolen accounts.[/i]\" He then also [url=https://twitter.com/HackForumsNet/status/292010019094937602]stated[/url]: \"[i]HF accounts cannot be transferred, shared, or sold. Any accounts violating that will be closed permanently. Be warned.[/i]\" These changes and the reinforced warning will hopefully reduce scams and prevent scammers and ban evaders from purchasing multiple accounts.\n\n[align=center][img]http://i5.minus.com/jb1Y9pD6Yrsjue.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=#0066FF][b]Natha[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=898803][b]Valderino[/b][/url], [url=http://hackforums.net/member.php?action=profile&uid=1450962][color=#0066FF][b]Reptar ツ[/b][/color][/url] and [url=http://hackforums.net/member.php?action=profile&uid=1206954][b]Nickelodeon[/b][/url] reached 1,000 reputation points!\n\n[color=white][b]Repfucks[/b][/color]\nNone.\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=967025][color=black][b]Advanced[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=121196][color=#0066FF][b]Natha[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1326923][color=#0066FF][b]Strokes‌[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1205578][color=black][b]Fegelein[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=871059][color=black][b]def‌c‌on[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=330676][color=black][b]Diabolic[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=101228][color=black][b]Tate[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=388560][color=#383838][b]Øueen[/b][/color][/url] had her account closed.\n[*][url=http://hackforums.net/member.php?action=profile&uid=572367][color=black][b]The MammoTh[/b][/color][/url] was banned for scamming.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1263952][b]Daisy[/b][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] was banned for bullying Daisy!\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] received the Youtube award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1278319][b]iNuke[/b][/url] received  the YouTube award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1108450][b]BagHead[/b][/url] received  the Sticky Man award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=66329][color=#0066FF][b]t0ks1ck™[/b][/color][/url] received  the Spy award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=529870][b]+Pirate[/b][/url] received  the Gamer award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1113153][color=#0066FF][b]Tando[/b][/color][/url] received  the Flamer award for hurting people's feelings.\n[*][url=http://hackforums.net/member.php?action=profile&uid=316698][b]Anakin™[/b][/url] received both the Silver Medal and Ninja awards.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1098418][b]★ Leo ★[/b][/url] received the GFX Guru award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1181919][b]LevelUp[/b][/url] received both the Master Donator and Mad Scientist awards.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711][color=black][b]+Entity[/b][/color][/url] is now a group leader of the Writ3rs.\n[/list]\n\n[align=center][img]http://i5.minus.com/jF2TmnLO8uKPh.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=1232842][b]#Skyline[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3158507][b]♛ THE EMPIRE ♛ RAT SUPPORT HELP DESK ♛ RAT SETUP ♛ PORT FORWARDING ♛ ONLINE 24/7 ♛[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=8383][b]Wafflemonger[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3044038][b](The Alliance) Mega Security Guide[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=469528][b]Odin the Wanderer[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3179751][b]ϟ - Odin the wanderer's High voltage transformer tutorial. - ϟ[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=515249][b]Sir[/b][/url] - [url=http://hackforums.net/showthread.php?tid=3177634][b]Convert Terraria section to Indie Games section.[/b][/url]\n \n[align=center][img]http://i1.minus.com/jbf7WRuFga1kQ1.png[/img][/align]\n[color=white][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1121679]SkyGuy[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: Welcome to the latest edition of the HF News, SkyGuy! Any shoutouts?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Hey Phytrix, thank you for giving me the opportunity to be interviewed as a part of the HF News! I'd like to shoutout to dannyboy49, for being such a great friend as well as Tibit for letting me into The Empire.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: I’m sure they’ll appreciate the shoutouts. Why don’t you tell us what brought you to HF originally and why?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Originally I came to Hack Forums several times by accident when looking for various hacks on some games I used to play with friends. I was a typical 12 year old back then who just wanted to win against all my friends, no matter what I needed to do. I knew absolutely nothing about computers really and I would find the site over and over again, however whenever I opened it and saw the banner I'd think it was a 'virus' and immediatly close it and not look back. About a year later when I was 13, in December, I was looking around for places where I could learn how to program and I received many links which directed me to HF. Eventually I decided to sign up and I have to say I'm very glad I did.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: What have you learned in your time on HF thus far, and what do you hope to learn?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: That's a very difficult question since on my journey on Hack Forums I've learned so much about both computer hardware and software. I got into RATing fairly early and I'm now able to help out members who are lost with RATs like I was at the beginning. I've also gained a fair bit of knowledge about building computers - not only the physical 'putting-the-parts-together' but also the selection of components. I now know how to code fairly well in HTML and CSS, thanks to certain members on the forum and I also know a lot about protecting yourself from some of the 'dangers' on the internet. As I continue to post and remain active on the forum I hope to learn more about computer security and I hope to further develop the writing skills which I currently possess.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: On the note of writing skills, you recently joined the Writ3r’s as a Wiki writer. How is everything going there and are you hoping to gain anything further?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Yeah, I joined the Writ3rs back towards the beginning of December. I've written a few articles and it's been interesting to see how the other members have gone about writing their articles. I'd also like to mention that on the topic of recruitment, please don't apply if you don't think you're going to be able to manage the workload since at times it can get a little demanding if you have a lot of other things going. I've actually found it a little difficult to output articles lately as the school work I've had set for home has increased considerably due to the start of the GCSE work in the majority of subjects. Despite these few problems I feel that being a Writ3r has really helped me improve the way in which I write and I'm sure it will continue to do so. I've still got a lot to learn in terms of the way I write but I'm sure being amongst some of the best Writ3rs on Hack Forums will help me a lot.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: And what about your other groups?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: So I'm also in the Empire as of now, and I have to say I love the group. I've been in it for a while now, around 3 months, and it's been such an important experience for me on HF. I've made a lot of friends in the group, seen a lot of people come and go, and I've learned a lot about HF from the more senior members. Tibit has been a great friend for me throughout my stay in the Empire, and even though sometimes he's a little difficult to contact due to him being very busy, it's always nice to talk to him. I've seen a lot happen in the Empire, some things good and others bad, but at the end I'm always glad I'm part of the community there. It's such a fantastic group and I honestly don't think I could ask for more from anyone there. My other group, Eminence, is sadly not doing so well. The owner WiFi. is currently looking for a potential buyer of the group which I guess has lowered the overall morale of everyone. There is activity inside the group and Skype conversation which is always nice, however the topics which Eminence initially covered no longer play a role in the group's activity.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: I see. What issues or queries do you generally face in relation to RATs, participating in two RAT help desks yourself, and what advice do you provide usually?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Often people who have clearly not read any of the information on any threads ask questions which can be a little time consuming to answer so I often redirect them to places which they may find a little more informative. I'm happy to help people if it's clear that they have already looked around and have not found any answers, if they're encountering a problem with their RAT which is limiting what they're able to do. When giving someone help, if they have a problem, I'll usually first try and find out what's causing their problem and once I've found out the exact issue I'll give them the best advice from the top of my head. If what I tell them doesn't help, I'll search for some of my previous posts on the forums which have successfully solved problems and use them in order to help the person who is encountering an issue.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: What site changes or additions do you think could be beneficial to the forum?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Actually, I personally don't think that there's too much which needs to be changed. The forum has grown well and it's one of the most popular forums exisiting, with an amazing userbase. Clearly Omniscients done very well with the forum and I'm sure that he will continue to make the best decisions for the site. I'm not so good when it comes to thinking up improvements, particularly on Hack Forums where I think there's not that much that needs to be changed for the benefit of the users.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: I agree. Do you have any hobbies or interests IRL or outside of HF? If so, what are they and why?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Yeah I do actually even though I spend so much of my time on computers. I actually play a fair bit of sport including rugby and cricket, and I'm reasonably good at them. The school I go to finds the physical aspect of education very important and so I guess it's had an impact on me. I represent the school in both of the sports I mentioned and we do have a fair few games at times so sport is something I've become very familiar with. I don't actually have that many hobbies off screens, I talk to people and meet up with them at times and I enjoy working with computers a lot so I guess that's sort of it. I'm a pretty boring person in that sense.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=white][b]Phytrix[/b][/color][/url]: Well thanks for the  interview today SkyGuy. Any final thoughts or comments before I let you go?\n[url=http://hackforums.net/member.php?action=profile&uid=1121679][color=#1E90FF][b]SkyGuy[/b][/color][/url]: Thank you again for taking the time to interview, I appreciate it. Hope you had a nice weekend and I hope to see you around the forum!\n[/spoiler]\n\n[color=white][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=687297]Barneyyz™[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 125th edition of the HF News, we've painted our canvas over to Barneyyz. Any special comments or shoutouts you want to make?\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: First of all, thanks very much for having me here. I'm pretty honored to be interviewed. I'd also like to give a shoutout to the following people: Hysteria X, Rhythm, Possy, C4V, Vinnie, Soulzeh, Morchid, TechApp and generally just my Writ3rs and Graphic Master bros.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: What led to your rise within the Graphic Masters? You've been a leader for a long time now.\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: After becoming active on HF I always dreamed to be a member of the Graphics Masters. I applied, and applied but I was never good enough. I was absolutely terrible with Photoshop because I preferred drawing with the old fashion pencil and paper. After being accepted --FINALLY-- around August 2011, I was kicked for inactivity. Sadly, I got bored of HF and decided to give it a rest. After coming back, I re-applied to GM and was accepted by Etheryte. This was around September the 25th as it was pretty near my birthday. After being in GM a pretty long time, you start getting to know people and in my case loving Poseidon, it really is a great group. Everyone is pretty close and it's still pretty secluded! After Omni decided to make people free groups pay $500 to remain on HF, I offered to pay $200 to keep the group alive. I honestly loved GM, and didn't want it to die. This was around the time the corruption threads started appearing and all hell broke loose. Anyway, a month or two after (I think), I was then asked if I wanted to lead the Graphic Masters along side C4V, Flashy and Sai. I said yes, and to this day I do not regret my decision, I still love GM and 99% of the members in it - Hуѕтєяιa X™ is pretty gay.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: How much have you learned from the group, and how much have you taught?\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: I have learned quite a bit to be honest, ever since I started I have always wanted to improve and thankfully I have! I taught some members, I've also mentored a few. One of them was actually in the Writ3rs but have no idea what his name is now, I forgot. I gave him a few pointers and he did improve but I can't remember who it was, sadly as we don't talk much anymore. If a member PM's me, I'm always happy to help, though.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I'm sure you're one of the best GFX mentors around. Whoever that guy you helped is better off now than before. Do you go for a specific style of art or do you do all sorts?\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: I wouldn't say that, there's far better than me! I remember him now actually, and he has improved greatly. He's done pretty well. I still like drawing more than Photoshop. I love to sit back with my sketch book and just draw cartoons and characters I like, it's great!\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I do more digital art myself. I've never gotten the hang of drawing although I hope I can personally improve. Have you brought any dramatic changes to the Graphic Masters, or any change in general?\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: Practice makes perfect! Anywho, there hasn't been that many big changes in GM, not recently anyway. GM is fine the way it is, and hopefully it remains that way.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Let's hope so. How did you get involved in the Writ3rs? You're the Graphical Editor for the News if I'm not mistaken. HF NEWS-CEPTION\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: Haha, I won the little graphics contest for the old layout and was accepted in to the group. The Writ3rs is a great group and the members are pretty cool too. I've been the Graphics Editor for a long while now, but for the last two editions I have sat out on. There was a small mishap with the Christmas Edition, and +Awesome was recruited to fill in for me. He's done a pretty good job up till now, so I presume I'm just the backup for who ever needs me.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Even backups need backup. Although +Awesome was your backup, so you're backing each other up...? <paradox explosion> WHAT DO WE DO BARNEY?!\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: All I can really suggest is sit back, enjoy the ride and have a cracking new year.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Our ride is over? But we're only halfway across the rainbow... oh well. Any other comments you wanna make?\n[url=http://hackforums.net/member.php?action=profile&uid=687297][color=white][b]Barneyyz™[/b][/color][/url]: Thanks very much for having me and I hope everyone reading has a great new year.\n[/spoiler]",
      "subject": "[1/20/13] - HF News"
    },
    {
      "pid": "29929600",
      "uid": "515249",
      "dateline": "1358827279",
      "message": "[align=center][img]http://i6.minus.com/jbjeCjYYRqUi2d.png[/img][/align]\n[color=white][b]Chad disbanded... again[/b][/color]\nFollowing the disbanding of the faction a few weeks ago, Chad was dispersed yet again. After investigation by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url], Kappahz was found to have forcefully logged into [url=http://hackforums.net/member.php?action=profile&uid=737960]Hypnotoad's[/url] account by unknown means. Theories regarding the subject have been formed, one being that a hacked and infected client by the name of Wrath was used to steal the account and yet another being that Hypnotoad's account was bruteforced. Kappahz allegedly logged on to the HackerCraft server via Hypnotoad's account stealing all of his items and internally raiding Respawn, Hypnotoad's faction. Because Kappahz was a member of Chad, the faction was consequentially disbanded for the second time in under a month. Their base was deleted by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] and Kappahz was permanently banned from the server. Some are angry about the incident and have accused [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] of being biased against Chad, seeing as a single member of the faction was at fault. Hypnotoad's account, however, was left in Chad's base which suggests the loot was shared with the rest of the faction. More info can be found [url=http://goo.gl/fKY8n]here[/url], and a statement by Chad members can be found [url=http://hackforums.net/showthread.php?tid=3186545]here.[/url]\n\n[color=white][b]Various Raids Conducted[/b][/color]\nThis week has been fairly eventful for a few members, particularly Eric. He singlehandedly discovered and raided Diamond's Endermen farm, taking revenge against the members of Diamond who he claimed betrayed him, and released the coordinates afterwards. Approximately two days later he came across Platinum's Villager Farm and teleported various members to himself. They proceeded to kill the villagers and raid the farm. On another note, Dan. conducted a partial raid against Chad shortly before they were disbanded and their base was deleted completely. Along with a few other members from various factions, he used a wither to gain entry into the top floor of their base and proceeded to kill all of the sheep in their sheep farm.\nThreads regarding Eric's raids can be found [url=http://hackforums.net/showthread.php?tid=3174526]here[/url] and [url=http://hackforums.net/showthread.php?tid=3180793]here[/url]. Dan's thread about Chad being raided can be found [url=http://hackforums.net/showthread.php?tid=3180727]here.[/url]\n\n[color=white][b]Misc. News[/b][/color]\n[list][*]Advanced was banned for sales involving real money outside of marketplace\n[*]Enderborn, previously owned by [url=http://hackforums.net/member.php?action=profile&uid=1258606]Howard Stark[/url], was sold to [url=http://hackforums.net/member.php?action=profile&uid=1014203]Magic[/url] for an undisclosed amount.\n[*][url=http://hackforums.net/showthread.php?tid=3186275]Baysquad[/url] was formed and is the second faction, alongside The Company, to be owned by [url=http://hackforums.net/member.php?action=profile&uid=434812]Bay[/url]\n[*]BlazeRod formed by former Wolves members\n[*]Previously Shadows, Respawn was formed\n[*][url=http://hackforums.net/member.php?action=profile&uid=619030]iNviZ[/url] was promoted to Moderator\n[/list]\n\n[align=center][img]http://i5.minus.com/jE1UAUKgIioFS.png[/img][/align]\n[color=white][b]Halo 2 PC Going Offline[/b][/color]\n343 Industries announced that Halo 2 PC Multiplayer will end on February 15. 343i has been monitoring the online population for a few months, finding that peak users only reached about 20 players. Halo 2 PC LAN and single player will remain available, however all other network services will be switched off. \"Halo 2 PC launched in May 2007, more than two and a half years after the original Xbox version was released. It was ported to the PC by internal Microsoft team Hired Gun, which has since been dissolved.\" You can read 343i's statement right [url=http://blogs.halowaypoint.com/Headlines/post/2013/01/16/The-Halo-Bulletin-11613.aspx]here[/url]. \n\n[color=white][b]ARMA Devs Released from Jail[/b][/color]\nArma III developers, Ivan Buchta and Martin Pezlar have been released on bail from a Greek jail. Ivan and Martin were sent to jail in September last year for spying. Greek reports say that the pair were in possession of videos and photos of military compounds at the time of their arrest. The Greek island is the main location for Arma III and that the developers were only collecting reference material for the game. Ivan and Martin each posted bail of $6,686 to end their 128 day imprisonment. ARMA III is set to be released sometime in 2013.\n\n[color=white][b]Xbox LIVE Region Switching - Now available on Xbox.com[/b][/color]\nIt was such a painful task to switch your account region, however Major Nelson announced earlier this week that you can switch your account region via Xbox.com. You will keep your gamerscore, Microsoft Points, remaining time on your gold membership and your profile. Region specific apps or content won't be moved over due to legal obligations or region restrictions. Microsoft notes: \"Before you change your region, make sure you've downloaded any purchased content you want to keep, like movies or music. Content purchases aren't refundable.\" You can change your region every three months. If you want to do this now, you can click right [url=https://live.xbox.com/AccountMigration]here[/url] - I also recommend you click [url=http://support.xbox.com/en-US/billing-and-subscriptions/account-management/change-region]here[/url] to read the support document for region switching.\n\n[color=white][b]'Destiny' at GDC 2013[/b][/color]\nDestiny will be the topic in a session during the 2013 Game Developers Conference. \"Brave New World: New Bungie IP\" - Destiny is Bungie's and Activision's new IP. The session will cover \"the studio's approach in putting together Destiny's original setting, a place where the next ten years of great Bungie adventures will unfold.\" The Game Developers Conference runs in late March, however the date for Bungie's session hasn't been announced.\n\n[b][color=white]Microsoft Studios Presents PLAY[/color][/b]\nMicrosoft is bringing popular Xbox LIVE Arcade titles to PCs and Microsoft Surface tablets via the recently announced Microsoft PLAY. It's set to launch with 15 Xbox games, the ability to access your Xbox LIVE Gamertag, statistics and even a new marketplace which we will see later this year. Hardcore XBLA fans will be disappointed to see that the launch games contain older titles such as Solitaire, Minesweeper and Mah Jong. You can view the Microsoft PLAY video on the Xbox YouTube channel, or alternatively you can click [url=http://www.youtube.com/watch?feature=player_embedded&v=2ZPfrRxQ-k0]here[/url].\n\n[color=white][b]Dead Space 3 Demo[/b][/color]\nXbox owners who signed up for the Dead Space 3 demo now has access to download it via Xbox LIVE. You should have received a key via email (I know I did), which can be redeemed via the Xbox LIVE Marketplace. If you didn't sign up, or you are on another console, you can download it on January 22. Dead Space 3 is set to be released on February 5th.\n\n[color=white][b]Temple Run 2 Released[/b][/color]\nThe sequel to Temple Run was released on Thursday, the 17th of January. It features awesome new graphics, new environments, new obstacles, more power-ups, more achievements and even a bigger monkey. You'll be navigating cliffs, zip lines, mines and forests. Temple Run 2 is free - yes, I said FREE, on the App Store. So how far can you run? You can click [url=https://itunes.apple.com/us/app/temple-run-2/id572395608]here[/url] to download the newest runner on the App Store. \n\n[color=white][b]Top Xbox LIVE Activity for the week of January 7th.[/b][/color]\nAnother week, more statistics. Are you ready to see whats on top? The lists are from [url=http://majornelson.com/]Major Nelson[/url]. You can view the top titles in the spoiler.\n[spoiler=]\n[b]Xbox 360 Top LIVE Titles (based on UU’s)[/b]\nCall of Duty: Black Ops II \nMinecraft: Xbox 360 Edition \nEA Sports FIFA Soccer 13 \nHalo 4 \nCall of Duty: Modern Warfare 3 \nNBA 2K13 \nSkyrim \nCall of Duty: Black Ops \nMadden NFL 13 \nBattlefield 3 \nAssassin’s Creed III \nFar Cry 3 \nModern Warfare 2 \nGTA IV \nBorderlands 2 \nGears of War 3 \nHalo: Reach \nForza Motorsport 4 \nForza Horizon \nEA SPORTS NHL 13 \n\n[b]Top Arcade Titles (Full Versions purchased)[/b]\nMinecraft: Xbox 360 Edition \nTrials Evolution \nThe Walking Dead \nCastle Crashers \nTrials HD \nGuardians of Middle-earth  \nThe Misadventures of PB Winterbottom \nSonic Adventure 2 \nPinball FX2 \nFruit Ninja Kinect \nRetro City Rampage \nAxel & Pixel \nMagic 2013 \nPeggle \nCounter-Strike: GO \nPool Nation \nFez \nREAL STEEL \nFamily Game Night \nDungeon Defenders\n\n[b]Top Indie Games (Full Versions purchased)[/b]\nCastleMiner Z \nMurder Miners  \nAvatar Laser Wars 2  \nCastleMine\nTotal Miner: Forge \nShark Attack Deathmatch  \nXenomine\nWhite Noise: A tale of Horro\nAvatar Farm Online \nAvatar Deathmatch \nAvatar Legends  \nThe Impossible Game  \nPaintball Wa\nEnd of Days: Survivo\nBlock World \nThe $1 Zombie Game \nMiner Of Duty \nZombie Death Quota \nEnd Of Days: Infected vs Mercs \nAvatar Paintball\n\n[b]Games for Windows Top LIVE Titles (based on UU’s)[/b]\nGTA IV \nDark Souls Prepare to Die Edition \nAge of Empires Online \nBatman Arkham City \nSuper Street Fighter IV Arcade Edition \nFable III \nBatman: Arkham Asylum \nResident Evil 5 \nFallout 3 \nMicrosoft Flight \nDiRT 3 \nBioshock 2 \nStreet Fighter X Tekken \nColin McRae : Dirt 2 \nF1 2011 \nDead Rising 2 \nResident Evil Racoon City \nStreet Fighter IV \nBulletstorm \nVirtua Tennis 4\n[/spoiler]\n\n[align=center][color=white][b]Latest Xbox Achievements (New Games) [/b][/color]\n[url=http://www.xbox360achievements.org/game/sniper-ghost-warrior-2/achievements/]Sniper: Ghost Warrior 2[/url] - 38 achievements, 1000 points. \n[url=http://www.xbox360achievements.org/game/love-tore-bitter/achievements/]Love Tore: Bitter[/url] - 50 achievements, 1000 points. \n[url=http://www.xbox360achievements.org/game/resident-evil-revelations/achievements/]Resident Evil: Revelations[/url] - 50 achievements, 1000 points. \n[url=http://www.xbox360achievements.org/game/crysis-3/achievements/]Crysis 3[/url] - 50 achievements, 1000 points. \n[url=http://www.xbox360achievements.org/game/skulls-of-the-shogun/achievements/]Skulls of the Shogun[/url] - 20 achievements, 400 points. \n[url=http://www.xbox360achievements.org/game/tomb-raider-9/achievements/]Tomb Raider[/url] - 50 achievements, 1000 points. \n\n[color=white][b]Latest Xbox DLC Achievements[/b][/color]\n[url=http://www.xbox360achievements.org/game/borderlands-2/achievements/]Borderlands 2 - Sir Hammerlock's Big Game Hunt[/url] - 3 achievements, 125 points.\n\n[color=white][b]Upcoming Game Releases[/b][/color]\nDead Space 3 - February 5 - Xbox, PS3, PC\nAliens: Colonial Marines - February 12 - Xbox, PS3, PC, Wii U\nCrysis 3 - February 19 - Xbox, PS3, PC[/align]\n\n[color=white][b]Video of the Week[/b][/color]\nTheRedDragon shows you how to pick the best setups for BF3 and Black Ops 2.\n[align=center][video=youtube]http://www.youtube.com/watch?v=KYhbsO71LcE[/video][/align]\n\n[align=center][img]http://i1.minus.com/jbeAxOGy47zkAW.png[/img][/align]\n[b][color=white]Hostage Situation in Algeria Comes to End[/color][/b]\nThere was a hostage situation in Algeria that came to a violent end this Saturday. Since negotiations with the terrorists who took over the gas plant failed, special Algerian forces raided and cleared the plant. It was discovered that seven hostages were murdered after the raid resulting in the execution of 11 terrorist militants. The State News reported that there were about 30 militants who took hold of the building with hundreds of hostages. The situation garnered national attention after it was discovered that there were British, American, Japanese and Belgian workers who were also taken hostage. U.S. Secretary of State Hillary Clinton has remarked that this event signals the need for better communications with Algeria on counter terrorism. Secretary Clinton supported the actions by saying, \"Let's not forget: This is an act of terror,\"\n\n[b][color=white]15 Die in Indonesian Flood[/color][/b]\n15 deaths of Indonesia citizens occurred this week as a result of flooding. Thousands more in Jakarta, Indonesia are left homeless and with little amount of things necessary to even survive. It has been specifically estimated that 95,000 people were affected by the flood. The situation is economically devastating since the central business district experienced significant flooding that workers are now attempting to clean up. On Tuesday, there was more rainfall during that day than what they usually get in January altogether. Adding salt to the wound, the Climatology and Geophysics Board has publicly stated that more heavy rainfall should be expected the next few days.\n[b][color=white]\nFormer Ukrainian Prime Minister Faces Murder Charges[/color][/b]\nPrime Minister Yulia Tymoshenko has been notified by the Ukrainian government that she is now a suspect in a homicide case. The case stems back form the 1996 murder of policymaker and businessman Yvhen Scherban. The authorities assert that the former Prime Minister is suspected of ordering a contract-style hit. Prosecutors have stated that, even though she is not yet charged, the charges are likely to soon be filed. Tymoshenko is already in prison for abusing her power in office when she was closing a gas deal in 2009. Officials of Tymoshenko's party stated today was a \"shameful day in the history of the Ukrainian law enforcement system.\"\n\n[b][color=white]Lance Armstrong Admits to Doping[/color][/b]\nThe doping scandal surrounding Lance Armstrong has resulted in him losing almost everything he has built. Oprah Winfrey recently heard, along with the rest of the viewers, Armstrong publicly confess to his doping during has miraculous career. In the interview, he admitted that the situation was one that was very stressful, because he felt the burden of carrying a lie around for years. Lance Armstrong admitted to taking EPO, a banned substance, and blood transfusions. Winfrey boldly asserted, \"You brazenly and deliberately denied everything you've just admitted to me.\" There wasn't much of a fight put up by Armstrong as she stated these things, which isn't surprising considering this was his confession. You can watch the full interview here: http://goo.gl/J6TBP\n\n[align=center][img]http://i1.minus.com/jbbuNIQRz6biwp.png[/img][/align]\n[color=white][b]Microsoft[/b][/color]\nMicrosoft is almost ready to deliver its final version of IE for Windows 7 (i.e), IE 10 web browser. An official note from Microsoft said, \"last pre-RTW (release to Web/final) build of the browser that will be made available through Connect. \"While there is still no RTW date to announce at this time, please make sure you are filing prompt feedback if any issues are found.\" They also said that this is currently available to product feedback/testing. The previous public version of IE 10 for Windows 7 was released by Microsoft in November 2012. It was the release that had a new interface for IE 10.\n\n[color=white][b]Facebook[/b][/color]\nFacebook announced a new tool that will help in finding people, photos, places, and interests that are most relevant to Facebook users. The tool has been named as 'Graphic Search', making it the most easy way for the users to search for. Mark Zuckerberg said that this will be available only to a limited amount of people now. With this, users can search efficiently over the other one billion users, 240 billion photos, and one trillion connections. This tool comes with filters such as, \"place type,\" \"liked by,\" and \"visited by friends\" to enable the search to be even more faster. Meanwhile, last week, a man posted his status on Facebook that \"Well folkes [sic] im about to get shot. Peace\" and exactly he was shot dead by a policeman for kidnapping and raping a woman. It's not clear what time Ramsey was shot or how he had time to make the Facebook post.\n\n[color=white][b]HTC[/b][/color]\nHTC released their new smart phone HTC One VX. It cost around $49.99 and runs Android 4.0 Ice-cream sandwich as its operating system. Its design is pretty much the same as that of their other sets. However, unlike One S, One VX is slightly crafted from light weight plastic. It is 5.3 inches tall, 2.7 inches wide and 0.36 inch thick. With a 4.5-inch (960x540-pixel-resolution) screen, the One VX has a 1,810mAh removable battery. It runs on a 1.2GHz dual-core Snapdragon S4 processor and has an internal memory of 8GB. And just like their other handsets, One VX has also got 'Beats audio' feature.\n\n[color=white][b]Software Developer Outsources Own Job to China[/b][/color]\nWhile performing a routine check on system security, US based software development company Verizon discovered a live connection through their VPN system from an unidentified user in China. Thorough investigation revealed that the employee in question had contracted a consulting firm in Shenyang to complete his work for him, allowing him to spend the entire workday browsing Facebook, Reddit, Linkedln and watching cat videos.\n\n[align=center][img]http://i2.minus.com/jWKdWJ8bOn7Tv.png[/img][/align]\n[color=white][b]Selena Gomez's New Confessional Album a 'Big Turn'[/b]\n[/color]Selena Gomez announced her new album and it relating to a big turn in her life. Selena said this big turn relating to her personal and professional life is in each song of this new album as she feels she is ready to share her side of her stories. \"I think for me it was actually interesting to see that towards the middle of me recording my record, a big turn happened to me and it was incredible to see how I applied that to music because I've never done that before and it's great\" Selena says the first single should launch in March; so to all the fans, you don't have to wait much longer!\n\n[color=white][b]Rihanna and Chris Brown Have a New Collaboration Under Way[/b][/color]\nThe on-and-off-again couple Rihanna and Chris Brown are up to something. Both Rhianna and Chris Brown were caught leaving a recording studio together, creating assumptions of a duo song in progress. A representative of Chris Brown confirmed a track between the two artists was indeed happening. There aren't much details as this is mostly under wraps, but Chris Brown is suppose to have a 2013 album release, so this duo might be apart of it.\n[color=white]\n[b]Super Bowl Prowess, Alicia Keys[/b][/color]\nStarting with the National Anthem for the NFL Super Bowl of 2013, Alicia Keys will be singing to us this year. Alicia has been very busy between promoting her new #1 album as well as performing at President Obama's inauguration. A few words from Alicia, \"[i]Oh my goodness, I'm crazy excited about it. Being able to do the national anthem and actually set the whole game off is a dream come true. It's really exciting.[/i]\"\n\n[align=center][color=white][b]Music Video of the Week[/b][/color]\nPapercut Massacre - Lose My Life\n[video=youtube]https://www.youtube.com/watch?v=0B-xRO-vPPo[/video]\n[color=white]\n[b]User Suggested Music Video:[/b][/color]\nThree Doors Down - Kryptonite\n[video=youtube]https://www.youtube.com/watch?v=DMewC0uvBMg[/video][/align]\n\n[align=center][img]http://i6.minus.com/jbjGgxTO6c4xai.png[/img][/align]\nWow. Although it was late, this edition is pretty beefy. I hope you all enjoyed it.",
      "subject": "*"
    },
    {
      "pid": "29929615",
      "uid": "515249",
      "dateline": "1358827307",
      "message": "[align=center][img]http://i1.minus.com/jbddXPtg0jCtBO.png[/img][/align]\n\n\"What do you think of Omniscient's pruning/forum cleaning?\"\n\n[i]\"I think Omni does a great job for this community, he must be a very \nbusy man watching all members, groups and forums that are a waste of \ntime. I think this will be going on to the 5th year of HF and its still going \nstrong and getting bigger, so in my eyes his pruning and cleaning is all \ngood and 50% of the time his drunk on whiskey or getting distracted by \nporn, so he is doing very well and gets a high 5 from me 🤗\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=548259][i]-r0flez[/i][/url]\n\n[align=right][i]\"Well, I think it is a much needed thing since now the site will \ncleaner and the load on the server will be less. Which is always a good thing, \nthen again removing the SE section was good and bad, good because it was \nclosed anyway, bad because new members will no longer know how to SE.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1237824][i]-Perfect Cell[/i][/url][/align]\n\n[i]\"I think that the pruning, removal and addition of new sub-forums are a good \nidea as they remove the inactive posts, users and low-quality posts from the \nforum, which will hopefully encourage new ideas, sub-forums, topics and eventually \nprovoke more thought on the ideas promoted by HackForums.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url]\n\nThe topic for next week is \"What do you think of the HackerCraft server?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i3.minus.com/jrwXpDDKuoFYl.png[/IMG][/align]\n[align=center][img]http://i3.minus.com/ibwiKAgvLKww59.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i3.minus.com/jbzlurs46CQbzO.png[/img][/align]\n[align=center][spoiler=][img]http://kateordiecomics.com/wp-content/webcomic/kateordie/VolumeUpPorn.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.amazingsuperpowers.com/comics/2013-01-21-Special-Requests.png[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i5.minus.com/jF5Xgd3pVIpd.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1108450]BagHead[/url]\n[list][*]HackerCraft News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=138559]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]Prince[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=651337]Tibit[/url]\n[list][*]Music News\n[*]Headlines[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=763021]Retribute[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}