{
  "posts": [
    {
      "pid": "62822228",
      "uid": "2331053",
      "dateline": "1757958498",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/w-orange.png[/img]\r\n\r\n[b][size=xx-large][color=#ffffff][u]Hack Forum News - Edition 14[/u][/color][/size][/b]\r\n\r\n[b]Welcome back to another edition of Hack Forum News. Where we keep you up to date on the weekly events and news happening on site and around the world. If you have never heard of the Hack Forum News, don't worry, we have you covered. We are a team of members from the Hack Forums community who are journalists and writers, and we are here to keep you in the loop of the changes around the site and the events happening around the world.[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/headlines.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6308021][color=#ffffff]SRPP Deleted[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nLast week [mention=1] made the decision to delete the entire SRPP category from HF. This decision was made to try push the Forum to focus primarily on hacking and tech rather than being more social. The removal of these forums will delete almost 1 million posts. [mention=1] quotes \"We will no longer encourage discussion based on politics or religion. I want us to be a technology forum. In the early days of HF we had a policy against any political or nationality context in profiles. That mean no flags, no political statements, and we got along much better.\"\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6307040][color=#ffffff]Stanley Fan Award Goal[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nLast week [mention=1] released a brand new award for everyone to earn. With this new award you will need to make 250 posts that are replies to Stanley's threads. Stanley has been making threads for a while now and with this we can see a massive increase in replies to the threads the @Stanley bot is making. Good luck everyone award hunting.\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6307025][color=#ffffff]New Sales Tags[/color][/url][/size][/b][/u] By [mention=1]\r\n\r\nWith the recent changes to the design of the site, Omniscient has now started to look into changing the look of the current sales tags used on the site. The thread is looking for feedback from site members to see what they think of the new design made by Motusora\r\n\r\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6299866][color=#ffffff]Hack Forums News Team - Become a Writer[/color][/url][/size][/b][/u] By [mention=2331053]\r\n\r\nAre you looking to join the HF news team? Do you enjoy making threads or even want to become a better writer? Well, we are looking for members of the site to help write each week and are looking for anyone who has any interest. We have a few new sections opening up right now, and we would love for you to see if they would be anything of interest to you. If you are interested, please check out the thread or contact Mix to discuss joining the team behind the HF News.\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/statistics-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[img=800x400]https://i.gyazo.com/9e6e5899c6db14827c8df0862af2178d.png[/img]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/awards-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n[color=#ffffff]\r\n\r\n[b]Quick reminder, the donation awards page has had a bit of a change. Some of the classic awards are back up for purchase. If you would like to check out what is new, head over to the donation award page to snipe up some of the awards today.  Or [url=https://hackforums.net/buyawards.php][u]Click Here![/u][/url][/b]\r\n[b]\r\n\r\n[mention=1987062] Has obtained the \"Green Apple\" award - [award=78]\r\n[mention=583721] Has obtained the \"King Decade\" award - [award=194]\r\n[mention=5] Has obtained the \"Stanley Fan\" award - [award=230]\r\n[/color][/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/groups-header.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\r\n\r\n[b][u]GROUPS FOR SALE AND SOLD[/u][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6241882]Succubus group[/url] is still listed for sale by [mention=3604010]\r\n[url=https://hackforums.net/showthread.php?tid=6302394]Olympians group & Benevolence [/url] are listed for sale by [mention=1342286]\r\n[url=https://hackforums.net/showthread.php?tid=6307026]Fidelity[/url] group has been sold to [mention=2033319]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6304410]Mystery Inc[/url] listed for sale by [mention=3909991]\r\n\r\nNo recent group sales.\r\n\r\n\r\n[B][u]RECENT GROUP CHANGES & EVENTS[/u][/B]\r\n\r\nFidelity has been rebranded to Quantum\r\n\r\n[b][size=large][u]RECRUITMENTS:[/u][/size][/b]\r\n\r\n[url=https://hackforums.net/showthread.php?tid=6298855]Casino Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6226725]Pink LSZ Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6304113]Warriors Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6275486]Gamblers Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6294522]Legends Recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6046141]Allegiance Buy-in[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6295130]Olympians leader recruitment[/url]\r\n[url=https://hackforums.net/showthread.php?tid=6300585]The Academy Recruitment [/url]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/music-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\nRecently we introduced a brand-new section to the HF News. This section will grow over time to more things, but for now we are just going to be doing Song of the week. We are open to what more we could bring to the section from your suggestions, but as a start, we feel adding the song of the week will be a great start for the section and lead the way forward for more things in the future.\r\n\r\nNow we know some of you may question what the song of the week is all about, and we have thought of what a great answer. We feel like the song of the week should be a meaningful song that goes deeper than just general music and has meaning to it all. Granted, we may have a little fun with it sometimes. (Yes, we will have a Halloween version and Christmas version too.) But we want to keep it at a level where we have found the song has a true message behind it all and not just something that everyone will just see as another song that is just a bit catchy or got a good few beats to it. We hope this helps those with that question and if anyone has anything that they wish to ask, please feel free to add them below. We are more than happy to give the reason behind it.\r\n\r\nThis weeks Song Of The Week:\r\n[video=youtube]https://youtu.be/cZL4fiRO7Uw?si=nrlwjE0xkqjLTD0Q[/video]\r\n\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/contests.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6305248]\r\n$100 USD (BTC) Contest || Celebrating My Acceptance in The Academy[/url] By [mention=4189082] [/color][/size][/b][/u]\r\n\r\nA new contest has been created this week by [mention=4189082] They have recently been accepted into The Academy, and they feel like it's time for them to share the love by making a massive $100 BTC giveaway to one lucky winner. Let's make sure to spread the love, and thank them for the contest. The contest ends September 30th, 2025. Make sure you get yourself entered before it's too late.\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6306653]$10 Giveaway[/url] By [mention=5523666] [/color][/size][/b][/u]\r\nWho's after some easy crypto? Swing by this thread and follow some very simple steps and join this giveaway, get in quick as the giveaway closes on the 15th September!\r\nThere wasn't any reason on the thread as to why they're running this giveaway so I reached out to the member running it, this is what they said. \"[i]I am looking forward to share my old group Dev's over HF and also like to give someone a chance to upgrade, atm I don't have that much clue even tho I registered a year and half ago so I decided to do what I felt was good. I upgraded myself and did the giveaway so I could give someone a chance to upgrade.[/i]\"\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6307929]\r\n100,000 Bytes Contest || $250 Value || Post-To-Enter[/url] By [mention=5418830] [/color][/size][/b][/u]\r\n\r\nA new contest has been created this week by [mention=5418830] . Rules are simple. Upgraded Members Only, Post/Reply to enter, Max Popularity & Quick Love the OP. You have until 25th September to get in!\r\n\r\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6308018]\r\nWin 100,000 Bytes – Best Thread of the Weekend[/url] By [mention=7] [/color][/size][/b][/u]\r\n\r\nA new contest has been created this week by [mention=7] . \"📜 The Mission\r\nSubmit a unique, high-effort, or high-value thread this weekend. Whether it's a deep tutorial, a reverse engineering breakdown, a privacy guide, social manipulation technique, or even a useful tool release — if it’s impressive, you’ve got a shot.\r\n\r\nThis isn’t about popularity. It’s about substance.\" Ensure you make some awesome threads to enter!\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/user.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\r\n\r\n[mention=3098194] has been banned.\r\n[mention=5689546] Has been closed.\r\n@SKY NET@ has been banned.\r\n[mention=533443] has gone on vacation until Feb 29, 2026\r\n[mention=18] has reached 4000 Popularity.\r\n\r\n[b]\r\n[size=large]Remember if you have reached an achievement on your account feel free to post about it on our weekly reports thread. That way we can add you to the news for the next edition. [u][url=https://hackforums.net/showthread.php?tid=6299864]Click Here To See The Weekly Reports Thread[/url][/u][/size]\r\n[/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/gaming-header.png[/img]\r\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\r\n\r\n[size=large][color=#72FF84][b]Notable console & hardware releases:[/b][/color][/size]\r\n\r\n[size=medium][color=#FFFF44][u][b][size=large]Nintendo Reveals Prices for Switch 2 Virtual Boy Accessories[/size][/b][/u][/color][/size]\r\n\r\n\r\nNintendo has officially shared the prices for the upcoming Virtual Boy accessories set to be released for the Switch and Switch 2, necessary to play the newest games hitting Nintendo Switch Online. The September 2025 Nintendo Direct livestream brought plenty of big news for fans of a wide variety of franchises, both on Switch and Switch 2.\r\n\r\nA new listing on Nintendo's official online store has confirmed the launch prices for both versions of the Virtual Boy accessories for the Switch. The full-size Virtual Boy accessory for the Switch and Switch 2, modeled after the appearance of the original console, will retail for $99.99 USD through the Nintendo shop.\r\n\r\n[size=medium][color=#FFFF44][u][b][size=large]Steam Deck Receives Big New Update[/size][/b][/u][/color][/size]\r\n\r\nValve has issued a major new update for the Steam Deck handheld gaming PC. The September 9 SteamOS client update for the Steam Deck brings a long list of changes, marking one of the biggest patches the handheld has seen in months.\r\n\r\nSince the Steam Deck's launch in 2022, Valve has done well to maintain a regular cadence of support for the handheld. Once every few months, the Steam Deck gets a hefty update comprising a slew of bug fixes, heavily-requested features, and more. Steam Deck updates usually arrive first in the beta channel, where participants test experimental features and fixes before they go live for everyone. Over the past several months, Steam Deck beta users have received improvements ranging from controller fixes to third-party handheld support, but these upgrades were yet to make their way to the wider community.\r\n\r\n[size=medium][color=#FFFF44][u][b][size=large]Switch 2 Accessories Maker Genki Settles Lawsuit with Nintendo[/size][/b][/u][/color][/size]\r\n\r\nThe lawsuit between Nintendo and accessory maker Genki has concluded, and the gaming giant will get an undisclosed sum of money in damages pending final approval of the proposed settlement. The terms of the settlement between Nintendo and Genki also state that the latter must change its nomenclature and color schemes for products compatible with the Switch and Switch 2.\r\n\r\n[size=large][color=#72FF84][b]Notable News (September 2025)[/b][/color][/size]\r\n\r\n[color=#FFFF44]Rockstar Teases GTA 6 Launch Expectations[/color]\r\n\r\nRockstar expects Grand Theft Auto 6 to mark the largest launch in the video game industry history. The company mentioned as much as part of its recent efforts to expand parts of its team in the lead-up to the GTA 6 debut.\r\n\r\nMuch like the first GTA 6 trailer made YouTube history, Rockstar expects the game itself to set some records of its own. In a posting for a Lead Software Engineer at its Manhattan office, the company framed GTA 6 as \"the largest game launch in history,\" TheGamer reports. That's a striking bit of language to surface on an official careers page, underscoring the developer's confidence in the upcoming title.\r\n\r\n[color=#FFFF44]New Grand Theft Auto 6 Details Have Been Leaked[/color]\r\n\r\nNew details surrounding Grand Theft Auto 6 have been leaked once again, as a trusted industry insider has shared what is likely to be the names of various in-game websites for the next entry in the series. While it has been well over a decade since the last GTA game, it appears as though Grand Theft Auto 6 will likely continue some of the series' most beloved traditions, as the leaked website names appear to be clear parodies of real-life businesses.\r\n\r\nDespite being kept under tight wraps by Rockstar Games, Grand Theft Auto 6 has been the subject of some big leaks over the past three years. Prior to the game's first official trailer in 2023, a huge breach saw nearly a hundred different videos of an unannounced project make their way online. The leaker claimed that the footage was from an early build of Grand Theft Auto 6, but fans were incredibly sceptical. However, shortly after, Rockstar confirmed it had suffered a data intrusion and that the game featured in the videos was indeed from Grand Theft Auto 6.\r\n\r\n[color=#FFFF44]Next Minecraft Live Event Announced[/color]\r\n\r\nThe second episode of the anticipated Minecraft Live event is scheduled for September 27. An earlier accidental leak from the Minecraft team had suggested it might go live on September 22, but it looks like fans will have to wait a little longer.\r\n\r\nA new trailer reveals that 2025's second Minecraft Live event will stream on September 27 at 1:00 PM EDT or 7:00 PM CEST. Fans can watch the show on most platforms, including Minecraft's official accounts on YouTube, Twitch, Instagram, and even TikTok.\r\n[vide=youtube]https://youtu.be/5QU20HMPZ3M?si=9PKiCJYBcpsLUkZV[/video]\r\n\r\n[color=#72FF84][b]Game Releases - (September 2025)[/b][/color]\r\n\r\n[spoiler][list]\r\n[*]Above Snakes  — September 4\r\n[*]Adventures of Samsara  — September 4\r\n[*]Alien: Rogue Incursion Evolved (PC, PS5) — September 30\r\n[*]Arctic Awakening  — September 18\r\n[*]Atelier Resleriana: The Red Alchemist & the White Guardian — September 26\r\n[*]Baby Steps  — September 8\r\n[*]Baki Hanma: Blood Arena  — September 11\r\n[*]Borderlands 4  — September 12\r\n[*]Bubsy: Purrfect Collection  — September 8\r\n[*]Class of Heroes 3 Remaster  — September 18\r\n[*]Cronos: The New Dawn — September 5\r\n[*]Daemon X Machina: Titanic Scion  — September 5\r\n[*]Dark Deity 2 (Switch) — September 4\r\n[*]Demonschool  — September 3\r\n[*]Duckside  — September 3\r\n[*]Dying Light: The Beast  — September 18\r\n[*]EA Sports FC 26  — September 19 – 26\r\n[*]Everybody’s Golf: Hot Shots (PC, PS5, Switch) — September 5\r\n[*]Final Fantasy Tactics: The Ivalice Chronicles  — September 30\r\n[*]Formula Legends  — September 18\r\n[*]Frostpunk 2 (PS5, Xbox Series X and S) — September 18\r\n[*]Garfield Kart 2: All You Can Drift  — September 9\r\n[*]Gloomy Eyes — September 12\r\n[*]Hell is Us  — September 4\r\n[*]Henry Halfhead (PC, PS5, Switch) — September 16\r\n[*]Hirogami (PC, PS5) — September 3\r\n[*]Hollow Knight: Silksong  — September 4\r\n[*]Indiana Jones and the Great Circle: The Order of Giants DLC — September 4\r\n[*]Jotunnslayer: Hordes of Hel  — September 3\r\n[*]Karma: The Dark World  — September 10\r\n[*]Katanaut (PC) — September 10\r\n[*]Lapin (PS5, PS4) — September 2\r\n[*]LEGO Party  — September 30\r\n[*]LEGO Voyagers  — September 15\r\n[*]Little Witch in the Woods (PC) — September 4\r\n[*]Mandragora: Whispers of the Witch Tree (Switch) — September 4\r\n[*]Metal Eden (PC, PS5, Xbox Series X and S) — September 2\r\n[*]Moros Protocol (PC) — September 4\r\n[*]NBA 2K26  — September 5\r\n[*]NBA Bounce  — September 26\r\n[*]Nicktoons & the Dice of Destiny  — September 30\r\n[*]Otherskin (PC) — September 2\r\n[*]Pac-Man 2 Re-Pac  — September 26\r\n[*]Parasol Superstars  — September 16\r\n[*]Platypus Reclayed  — September 18\r\n[*]Scar-Lead Salvation  — September 2\r\n[*]Shuten Order (PC, Switch) — September 5\r\n[*]Silent Hill f (PC, PS5, Xbox Series X and S) — September 25\r\n[*]Slime Rancher 2  — September 23\r\n[*]Sonic Racing: CrossWorlds  — September 25\r\n[*]Star Wars Outlaws (Switch 2) — September 4\r\n[*]Strange Antiquities (PC, Switch) — September 17\r\n[*]Tiny Witch (Switch) — September 10\r\n[*]Trails in the Sky 1st Chapter  — September 18\r\n[*]Void Crew  — September 4\r\n[*]Wander Stars  — September 19\r\n[/list][/spoiler]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/tech-header.png[/img]\r\n[size=medium][b]Writer –[/b][/size]  [mention=5465469]\r\n\r\n[u][b][size=large][color=#ffffff]PowerSchool breach exposes data of 880,000 Texas students[/color][/size][/b][/u]  \r\nEducation platform PowerSchool has suffered a major data breach affecting nearly 880,000 students and staff across Texas. Sensitive information exposed includes Social Security numbers, medical/disability records, and bus stop data. Investigators highlight weak security practices such as missing MFA and poor encryption.  \r\n[b][url=https://www.houstonchronicle.com/news/houston-texas/education/article/powerschool-data-breach-21041067.php]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Adobe patches critical “SessionReaper” flaw in Magento[/color][/size][/b][/u]  \r\nAdobe has released an urgent patch for Magento Commerce & Open Source to address CVE-2025-54236, a critical Web API vulnerability nicknamed “SessionReaper.” The flaw allowed attackers to hijack active sessions without user interaction.  \r\n[b][url=https://www.techradar.com/pro/security/adobe-patches-most-severe-flaw-in-magento-ecommerce-platform]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]SAP S/4HANA vulnerability exploited in the wild[/color][/size][/b][/u]  \r\nA severe SAP S/4HANA flaw (CVE-2025-42957) enabling ABAP code injection via RFC is being actively exploited by attackers. The vulnerability bypasses authorization checks, potentially allowing complete system compromise. Organizations are urged to patch immediately.  \r\n[b][url=https://www.techradar.com/pro/security/sap-users-patch-now-worrying-s-4hana-vulnerability-being-exploited-in-the-wild]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Plex urges users to reset passwords after breach[/color][/size][/b][/u]  \r\nMedia streaming service Plex confirmed a breach exposing usernames, email addresses, and hashed passwords. While financial data wasn’t compromised, Plex has forced password resets and advises enabling two-factor authentication.  \r\n[b][url=https://www.theverge.com/news/774188/plex-breach-change-password-email]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Texas disaster grant system exposes sensitive applicant data[/color][/size][/b][/u]  \r\nA misconfiguration in the Texas Integrated Grant Reporting system exposed personal details of 44,485 disaster relief applicants from 2015–2024. Leaked data includes Social Security numbers, bank details, medical records, and birth dates.  \r\n[b][url=https://www.expressnews.com/business/article/texas-data-breach-disaster-grant-system-21039146.php]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Critical DELMIA Apriso flaw (CVE-2025-5086) under active exploitation[/color][/size][/b][/u]  \r\nResearchers report active exploitation of a deserialization vulnerability in DELMIA Apriso manufacturing software. The bug affects multiple versions (2020–2025) and allows unauthenticated remote code execution via exposed endpoints.  \r\n[b][url=https://thehackernews.com/2025/09/critical-cve-2025-5086-in-delmia-apriso.html]Source[/url][/b]\r\n\r\n[/align]",
      "subject": "Hack Forum News - Edition 14"
    },
    {
      "pid": "62822236",
      "uid": "2331053",
      "dateline": "1757960457",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/world-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[u][b][size=large][color=#ffffff]Russia Belarus military drills raise tensions in Europe[/color][/size][/b][/u]\r\n\r\nThe joint exercises known as Zapad 2025 between Russia and Belarus are causing concern among European leaders. The drills simulate scenarios including NATO threats, which reminds many of past escalations. In response, the UK has deployed Typhoon aircraft on air defence missions over Poland, working with Germany, France, and Denmark.\r\n\r\n[b][url=https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]Russia warns Europe over frozen assets[/color][/size][/b][/u]\r\n\r\nRussia has warned that it will take action (legal or otherwise) against any European state which uses frozen Russian assets to fund Ukraine’s defense or reconstruction. The EU is considering options involving these assets, estimated at $300 ‑ 350 billion. Russia claims seizure would amount to theft.\r\n\r\n[b][url=https://www.reuters.com/business/finance/russia-warns-europe-we-will-go-after-any-state-which-takes-our-assets-2025-09-15]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]UK & US deals on small modular reactors[/color][/size][/b][/u]\r\n\r\nThe UK and the US are lining up a series of agreements to build modular nuclear reactors in Britain. One plan involves building 12 reactors at Hartlepool with Centrica, which would create around 2,500 jobs. The deal also includes speeding up joint safety checks.\r\n\r\n[b][url=https://www.theguardian.com/business/2025/sep/15/uk-and-us-line-up-string-of-deals-to-build-modular-nuclear-reactors-in-britain]Source[/url][/b]\r\n\r\n[u][b][size=large][color=#ffffff]UK investment in maritime sector and green shipping[/color][/size][/b][/u]\r\n\r\nThe UK government, together with private industry, is making a major commitment: over £1.1 billion to upgrade ports, improve emissions from shipping, and boost coastal community economies. This includes public funds to reduce shipping emissions and private investments in port upgrades.\r\n\r\n[b][url=https://www.reuters.com/world/uk/uk-government-industry-invest-over-11-billion-pounds-maritime-sector-2025-09-14]Source[/url][/b]\r\n\r\n[hr]\r\n\r\n[img]https://hackforums.net/images/hfnews/comics-header.png[/img]\r\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\r\n\r\n[b][size=x-large][color=#ffffff]-1-[/color][/size][/b]\r\n[spoiler][img]https://i0.wp.com/warandpeas.com/wp-content/uploads/2025/09/war-and-peas-lost-soul.jpg?resize=768%2C960&ssl=1[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-2-[/color][/size][/b]\r\n[spoiler][img]https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1M8CLa.img?w=800&h=415&q=60&m=2&f=jpg[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-3-[/color][/size][/b]\r\n[spoiler][img]https://img-9gag-fun.9cache.com/photo/aByvN8Q_460s.jpg[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-4-[/color][/size][/b]\r\n[spoiler][img]https://i.pinimg.com/236x/a4/10/d1/a410d1c0e0fe1c8939e6ffd8c773600a.jpg[/img][/spoiler]\r\n\r\n[b][size=x-large][color=#ffffff]-5-[/color][/size][/b]\r\n[spoiler][img]https://pleated-jeans.com/wp-content/uploads/2025/09/hilariously-unhinged-comics-about-nutrition-and-healthy-choices-14.jpg[/img][/spoiler]\r\n\r\n[hr]\r\n\r\n[b][size=x-large]We would like to say a big thank you for you reading and a big thank you to the HF News Team members[/size][/b]\r\n\r\n[size=x-large] [mention=2331053] [mention=57618] [mention=3929084] [mention=3725052] [mention=5465469] [/size]\r\n\r\n[hr]\r\n\r\n[b][size=xx-large][u]Support The Team by wearing our signatures[/u][/size][/b]\r\n\r\nIf you have enjoyed the read please consider wearing one of our signatures to support us!\r\n\r\n[img]https://hackforums.net/images/hfnews/support-blue.png[/img] [img]https://hackforums.net/images/hfnews/support-green.png[/img]\r\n[img]https://hackforums.net/images/hfnews/support-orange.png[/img] [img]https://hackforums.net/images/hfnews/support-purple.png[/img]\r\n[img]https://hackforums.net/images/hfnews/support-red.png[/img]\r\n\r\n\r\n[b][size=xx-large][color=#E82A1F]Red[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-red.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#0074D9]Blue[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-blue.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#2ECC40]Green[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-green.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#E86E04]Orange[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-orange.png[/img][/url][/align][/code]\r\n\r\n[b][size=xx-large][color=#B10DC9]Purple[/color][/size][/b]\r\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-purple.png[/img][/url][/align][/code]\r\n\r\n\r\n\r\n\r\n[/align]",
      "subject": "RE: Hack Forum News - Edition 14"
    }
  ]
}