{
  "posts": [
    {
      "pid": "8103777",
      "uid": "0",
      "dateline": "1291489302",
      "message": "Since I have been part of HF News crew for 2 weeks now, The Elite has sadly stepped down. So I will be making this weeks news, and requesting admin move it to the section until they find an appropriate Leader.\r\n\n[align=center][IMG]http://min.us/icFot8.png[/IMG][/align]\r\n\nThis week has been a really intense week for all hack forum users.  Hackforums has been experiencing a lot of problems for the past few weeks, although Omniscient has decided its now time to really get a new server. He has been talking about upgrading to MyBB 1.6 and to read further you can view his thread [url=http://hackforums.net/showthread.php?tid=864282]here.[/url]\r\n[color=#00BFFF]\r\nThe new server will consist of the following features: (Note: These are coming from Omniscient’s posts)[/color]\r\n[list]\r\n[*]Dual quad core (8 cores total)\r\n[*]10k Raptor Drive\r\n[*]18 GB Ram (HackForums has 8 at the moment)\r\n[/list]\r\n\nSadly, our HF News Crew leader “[color=#00BFFF]The Elite[/color]” has asked to step down as moderator of the HF News section due to the reasons of being really busy in real life. He request this as he would want HF News to be the best it can be, and it couldn’t be top quality while he was busy so hopefully we see a new HF News leader in the future! [url=http://hackforums.net/showthread.php?tid=867317](CLICK HERE TO VIEW THREAD)[/url]\r\n\nAnother upsetting news is that [color=#00BFFF]N3w_2_H@Ck1n™ [/color]has stepped down from being staff because he is not as active as he wishes to be to fulfill the jobs as staff. He requested to be demoted,  and use the time he can on HF to chill and enjoy himself. We would all like to congratulate you on your 1 year staff position and that you have done a tremendous job to make HackForums be the best it can be! [url=http://hackforums.net/showthread.php?tid=846935](CLICK HERE TO VIEW THREAD)[/url]\r\n\n[align=center][img]http://min.us/icAP7c.png[/img][/align]\r\n\nIn regards to news that has become quite shocking news to many users. The user “[color=black][b]Solidify[/b][/color]” has been permantaly banned and got his account deleted due to the fact that he has stirred a lot of chaos with the staff and admins. Some people call him a hero, but others think of him as zero.\r\n\n[color=black][b]Cybr[/b] [/color]on the other hand received a 3 month banned because of the following quote: \r\n“`This isn't me asking for rep. But I'm demanding it, bitches.” I don’t think that was the best thing to say on a night that was lounge crackdown. Others call it a heroic quote.\r\n[color=black]\r\n[b]Ŀucien Lachance[/b][/color] who moderates the Science, Religion, Philosophy, and Politics section has received a 1 week ban for having multiple accounts.  \r\n\n[quote=Omniscient]He's no longer fit to be the section moderator. His ban is for about a week so he'll be back soon but not with any mod powers. [/quote]\r\n\nIt has come to the Lounge’s attention that [color=#00BFFF]Anonymous![/color] Claims that “I'm going to be a official government White-Hat !” The thread can be found [url=http://hackforums.net/showthread.php?tid=864679]HERE[/url] A lot of people may think he is a troll, but there have actually been people who believed his story and congratulated him.\r\n\n[color=#00BFFF]dyegunswin [/color]went to jail last night for an old ticket that was unpaid as he thought he did not have to worry about it as his Navy Trainer recruit told him that they dealt with it. He has had to pay 750 $ to get bailed out. To read more click [url=http://hackforums.net/showthread.php?tid=867428]VIEW THREAD [/url]\r\n\n[align=center][img]http://min.us/ieZ6M.png[/img][/align]\r\n\n[color=#00BFFF]FamousMassacre [/color]has started an Official HackForums Christmas wish list which can be found in this thread. [url=http://hackforums.net/showthread.php?tid=843846]Official HackForums Christmas List![/url]\r\n\nAlot of controversial issues this week about North Korea and South Korea who are on the verge of having war and this topic is being discussed in the following thread. [url=http://hackforums.net/showthread.php?tid=852946]North Korea deploys surface-to-air missiles on its coast[/url]\r\n\n[color=#32CD32]\r\nThe Rated R Superstar [/color]has made A Guide To Successful Weight Loss. From the vouches and customer reviews it seems as if what he is selling may indeed be a good ebook. The thread can be found [url=http://hackforums.net/showthread.php?tid=857013] Here[/url]\r\n\n[color=#00BFFF]Thoth [/color]has made a thread with many posts and views regarding a picture that represents the lounge posters. [url=http://hackforums.net/showthread.php?tid=856095]ALL OF THE LOUNGE IN ONE PICTURE [SUPER DOOPER PIC][/url]\r\n\nIt has come to our attention that members have been discussing that Wikileaks has released a massive leak on US Diplomatic cables, which has caused outrage to some people but others call it the new light in the world history. There have been numerous threads on this and one can be located [url=http://hackforums.net/showthread.php?tid=864618]on this thread[/url]\r\n\n[align=center][img]http://oi54.tinypic.com/358ryxj.jpg[/img][/align]\r\n[align=center][yt]http://www.youtube.com/watch?v=4rsEnwKrsvc&feature=related[/yt][/align]\r\n\n[align=center][img]http://i52.tinypic.com/auckgo.jpg[/img][/align]\r\n\n[align=center]First we would like to congratulate all the Jewish Hackforums users, and wish them a happy Hanukkah.\r\n\nWe would also like to congratulate the Lounge section on receiving 100,000 threads created in the specific section. [spoiler=Click to view Image][img]http://min.us/icU4Ae.jpg[/img][/spoiler]\r\n\nCongratulations to [color=white]Infallible[/color] for successfully completing his HJT training and will be an undergrad for the HJT Crew.\r\n\nHappy birthday to the following Users:\r\n[list]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=155834][color=#00BFFF]/d/[/color][/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=71764]\t[color=#00BFFF]flAmingw0rm[/color][/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=167198][b][color=#FFD700]Bosx™[/color][/b] [/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=183981][color=#00BFFF]Circus[/color][/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=170785]Infallible[/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=76474][color=#00BFFF]Russkiy the F♂x[/color] [/url]\r\n[*][url=http://hackforums.net/member.php?action=profile&uid=414557][b][color=#FFD700]Sonic™[/color][/b][/url]\r\n\n[/list]\r\n\nCongratulations to [b][color=#32CD32]Kr4z1[/color][/b] for being the second person to achieve 1k  rep. What an accomplishment!\r\n\n[/align]\r\n\n[align=center][img]http://min.us/icBmY2.png[/img][/align]\r\n\n[b]\r\n[color=#FF1493]1. EctoPlasm:[/color][/b] When did you join Hack Forums? What did you aim to achieve when you joined?\r\n[b][color=lime]1. Mike:[/color] [/b] [quote]10-12-09 [/quote]To learn how to DDoS people on Xbox, Then I found about Rats, explored them for about 4-5 months. After that I was very active in th Xbox 360 board.I left the board after Halo:Reach came out( September 14th, 2010. Now I am an active poster in the lounge.\r\n[b]\r\n[color=#FF1493]2. EctoPlasm: [/color][/b]Who was your first ever inspiration and or friend on Hack Forums?\r\n[b][color=lime]2. Mike: [/color] [/b]Off site, but now onsite is Tears I have known him for over a year, before I was even a member.On site I would have to say RyzR He gave me my first rep, and I have talked to him a lot, and played a lot of Xbox with him.\r\n\n[b][color=#FF1493]3. EctoPlasm:[/color][/b] Now that it has been a month, what is your response on an old video recording of you that Verdande uploaded? (http://www.youtube.com/watch?v=DnvPU3XwP_g)[b][color=lime]\r\n3. Mike: [/color][/b]I can't believe how wild I was, man have I changed a lot.\r\n\n[b][color=#FF1493]4. EctoPlasm:[/color][/b] Some of the members are aware that a user has your DOX, How do you\r\nfeel of him having access to all your info?\r\n[b][color=lime]4.Mike: [/color][/b] I feel frightened that a swat team could show up at my house at anytime.\r\n\n[b][color=#FF1493]5. EctoPlasm:[/color][/b] If you had the chance to ban one user permanently from this forum, who would it be?\r\n[b][color=lime]5.Mike: [/color][/b]  No one that I have encountered, some members may be annoying, but all deserve a chance to prove themselves.\r\n\n[b][color=#FF1493]6. EctoPlasm:[/color][/b] How long do you play blackOps on your 360 now a days?\r\n[b][color=lime]6.Mike: [/color][/b] Maybe 2-3 games a day, some times I don't play any, Xbox has drifted away from my interest.\r\n\n[b][color=#FF1493]7. EctoPlasm:[/color][/b]  What are some of your goals you wish to have completed before you leave Hack Forums?\r\n[b][color=lime]7.Mike: [/color][/b]  To help Hack forums, become bigger and better, and always succeeding.\r\n\n[b][color=#FF1493]8. EctoPlasm:[/color][/b] Thank you very much for taking this interview. To finish this interview, is there anything special you would like to say to the HackForum's community?\r\n[b][color=lime]8.Mike: [/color][/b] Thank you for letting me be a part of such an active and wonderful community.\r\n\n[hr]\r\n\n[b]\r\n[color=#FF1493]1. EctoPlasm :[/color][/b]When did you join Hack Forums? What did you aim to achieve when you joined?\r\n\n[b][color=#FFD700]-[O]ptimus Prime- : [/color][/b][spoiler=Answer]Join Date- 02-07-2010\r\n\nI was searching for AdsMedia.CC Bot.\r\nThread and Bot Made by napzter flashed on first page. I was convinced because Hackforums.net domain name gave +ive vibes to me for such tools.When i first joined i aimed to reach 20-30 reps and HQ posts but tables were turned upside down as usual.[Few - reps ]\r\n\nYellow Username ,Blue Username,7 stars,high reps Doped me to spend 15hours+ everyday on HF those days.[/spoiler]\r\n[b]\r\n[color=#FF1493]2.EctoPlasm:[/color][/b]Who was your first ever inspiration and or friend on Hack Forums?\r\n[b][color=#FFD700]\r\n-[O]ptimus Prime- : [/color][/b][spoiler=Answer]My first friend was \"IS\"\r\n\nThalada[He changed his username i guess]\r\n\nMy first Inspiration hmm \"Metal Tiger\"\r\n\nMetal Tiger was one of the most respected members on board that time. But then also he helped me and supported me at time when no one cared about me. Thalada also helped me whenever i needed him Thank You Both.\r\nDcrac23 Bought me Ub3r and Leet.Now My Best Friends List Conclude\r\n\nD3VIL,Kul Verma,Alone Vampire,Soul Extractor,Imraan,Rusty V,Incredible,Saboteur,Factor 8,Support  etc.[/spoiler]\r\n[b]\r\n[color=#FF1493]3. EctoPlasm:[/color][/b] Do you have any favorite Staff members?\r\n\n[b][color=#FFD700]-[O]ptimus Prime- : [/color][/b][spoiler=Answer]I respect all staff members but some of them are in my Special List.Rusty_v,R Rated Super Star,N2H & Krazi.\r\n\nI respect R Rated Superstar more because he helped every now and then when i was new here, though he was busy with other works he solved my small problems politely.Rusty_v Helps me these days in almost everything i want to learn\"Nothing Else.\"[/spoiler]\r\n\n[b][color=#FF1493]4.EctoPlasm:[/color] [/b]How do you feel about the quality of the lounge? Is it improving or worsening?\r\n[b][color=#FFD700]\r\n-[O]ptimus Prime- :[/color][/b] [spoiler=Answer]Lounge is useless nowadays according to me. Trolls & Pranks are NA now according to HF rules. I was punk'd once by Prone and Carbon but then also i enjoyed spending most of the time in lounge. Lounge was super fun those days.\r\n[b][/spoiler]\r\n[color=#FF1493]5. EctoPlasm: [/color][/b]What is your current goal on Hack Forums?\r\n\n[b][color=#FFD700]-[O]ptimus Prime- : [/color][/b][spoiler=Answer]I want to achieve:-\r\n\n    * Staff Position\r\n    * Membership In Review Team\r\n    * Well Known Member[+ive aspects only][/spoiler]\r\n\n[b][color=#FF1493]6. EctoPlasm:[/color][/b] What do you enjoy doing in your free time?\r\n[b][color=#FFD700]\r\n-[O]ptimus Prime- :[/color][/b] [spoiler=Answer]Video Games.[I am insane gamer completed COD black OPS campaign in 1 and half days. Mafia 2 campaign completed in 2 days]\r\n\nPlaying with my Pet Dog.\r\n\nWasting My evening in club with friends.[/spoiler]\r\n[b][color=#FF1493]\r\n7. EctoPlasm: [/color][/b]What is your favorite section on the forum, and why?\r\n[b][color=#FFD700]\r\n-[O]ptimus Prime- :[/color][/b][spoiler=Answer] Hmm please let me select 2\r\n\"Science, Religion, Philosophy, and Politics\" :- Serious and interesting debates.\r\n\nLounge:- Though lounge is nothing compared to what it was before but then also i love lounge.[/spoiler]\r\n\n[b][color=#FF1493]8. EctoPlasm:[/color][/b] Thank you very much for taking this interview. To finish this interview, is there anything special you would like to say to the HackForum's community?\r\n\n[spoiler=Answer][b][color=#FFD700]8. -[O]ptimus Prime-[/color][/b] I want to share something special with HF NEW MEMBERS please care less about your reps. When i was new one member named Cocaine Charlie flamed me without any reason in, what i did i flamed him back again and again publicly in worst manner he ever imagined,what happened nothing.[Few -reps to me and to him ]Never care about Idiots \"Mark My Words\".\r\n\nOne member -repped me for spamming i raged a lot about that and fetched more warning and all but R rated superstar and thalada suggested me not to care about reps and all. Now look at me i am answering questions for Interview and Cocaine Charlie is banned and other guy deleted his stupid -rep when he learned about my HQ posting so please never care about such things and carry on. HF is best place to learn and socialize\"Million times better than FB lol\"[/spoiler]\r\n\nHope everyone enjoyed the HF News this week!\r\n\n~EctoPlasm",
      "subject": "[11/29/2010] - HF News"
    }
  ]
}