{
  "posts": [
    {
      "pid": "5565332",
      "uid": "74244",
      "dateline": "1280804801",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\n[align=center]Edition 11 [/align]\n\n[size=large][color=#FF4500]Headlines[/color][/size]\n[color=#FF1493]\nThis week Omniscient has closed the suggestions and ideas section because he was tired of getting many repeat suggestions or they were just complete nonsense. He then stated if anyone decides to take up their suggestion in a PM or on the [url=http://hackforums.net/forumdisplay.php?fid=2]rules and announcements[/url] section, it will result in them closing their account! This was a great move on his part to get rid of the constant repeat suggestions or just one that would not help or make sense. Like [url=http://hackforums.net/member.php?action=profile&uid=64184]Notorious Mental[/url] said, \"Now that the activity stopped there, members may take some time to browse it as an archive and familiarize themselves with past suggestions. \" Overall even though some great suggestions would come out of there, I hope that when it's brought back Omni will not have to see as many bad suggestions! You can find that thread and post your opinion [url=http://hackforums.net/showthread.php?tid=579894]here[/url].[/color]\n\n[color=#32CD32]The annoying \"Hey look the home button is flipping me off!\" threads have gone on too long and are making many users mad about the constant new thread stating the same thing. Recently this week Omniscient came up with a great inside joke causing these threads to come from a joke to a idiotic idea to be posting it. Omniscient has decided that if a user makes a thread stating this, we have full permission to negative rep him. Soon members will be crying over their rep, but overall they will learn their lesson; Read the rules and announcements! If you'd like to take a gander at the thread and give yourself a good laugh you can navigate your way over by clicking [url=http://hackforums.net/showthread.php?tid=580739]here[/url]. Hopefully this wont have to be taken into action too much, but the announcement is there for future references. [/color]\n\n[color=#00BFFF]Something Omniscient added late this week was the sellers section default sort. Omniscient stated \"I've changed the default sort order in the Sellers Section to be based on thread creation. You can change the sort view for yourself on the bottom of the forum display page.This was done to make bumps in that section pointless.I will also be implementing a plug-in so that regular members can only make one thread per week, l33t 2 threads, and ub3r 3 threads per week. At least that's the plan. I may do this some other variation. It's just my first instinct. \" This is a positive and negative idea, but will result in users being more cautious about what they post there! One user [url=http://hackforums.net/member.php?action=profile&uid=111287]xvisceral[/url] stated \"People will keep making threads to bypass it...Bumping should just be reportable as 'Sales Bumping', which will get your thread locked. \" He does make a point! We'll see how it turns out! [/color]\n\n--\n[size=large][color=#32CD32]User News[/color][/size]\n[color=#FF4500]\nThis week on early Sunday morning (4am est) [url=http://hackforums.net/member.php?action=profile&uid=13201]fagalite[/url] made a thread that HF was hacked by the unknown user \"blinkman\". This name was unknown to some and familiar to others. This was the name of my msn and it was based to frame me, but many users that would know that it was my msn name knows that I don't hack. Many users thought that the user \"blinkman\", who is now banned, was selling the database. Many users after that changed their passwords. Later today Omniscient confirmed that it was a hoax and that the two main perpetrators (paniK and fagalite) were perma banned and the others affiliated with this hoax were banned for two weeks. Hopefully they learned their lesson! You can read the thread [url=http://hackforums.net/showthread.php?tid=580961]here[/url]. [/color]\n[color=#FF1493]\nThis week the user [url=http://hackforums.net/member.php?action=profile&uid=112139]Carbon[/url] made a devastating thread about a very sad loss. His girlfriend was driving home and on her way, she was struck by a drunk driver. Her last few hours she was still thinking about our carbon. If you want to throw him some support you can put (spam is tiny[b]u[/b]rl you just have to change that from spam.com) [spoiler=this][code][url=http://tinyurl.com/33o45hc][align=center][color=#FF1493][b]Her name was Chayanne. August 1st, 2010[/b][/color][/align]\n[/url][/code][/spoiler] in your signature. You can see the thread here [url=http://hackforums.net/showthread.php?tid=580603]here[/url] Be strong carbon!\n[/color]\n\n[color=#32CD32]Do you consider yourself a hacker? Well [url=http://hackforums.net/member.php?action=profile&uid=21113]shadowdeem[/url] this otherwise. He says that we don't know what we're talking about and to be honest, a lot of us really don't. I think that he does and doesn't make a point. Only one thing, if you don't know what you're talking about don't post in a thread acting as if you do! If you want to comment on the thread just follow this link [url=http://hackforums.net/showthread.php?tid=582310]here[/url]. \n[/color]\n[color=#00BFFF]This week MLG has stated he is tired of all the illegal Mexicans. He didn't really state more of a opinion after the thread title, and only shows some videos, but you can also state your opinion if you would like to [url=http://hackforums.net/showthread.php?tid=581927]here[/url]! [/color]\n\n--\n[size=large][color=#0000CD]Ban of the week[/color][/size]\n\n[color=#32CD32]This week fagalite and PaNiK got banned for the above statement in the user news. Nothing is to be said about then here, but here is the others that got banned because of the hoax -  [url=http://hackforums.net/member.php?action=profile&uid=80481]rollinthatdice[/url], [url=http://hackforums.net/member.php?action=profile&uid=43254]Minus-Zero[/url], and [url=http://hackforums.net/member.php?action=profile&uid=115975]M0D3RN H4X3R 1™[/url][/color].\n\n--\n[size=large][color=#FF1493]Other News[/color][/size]\n[color=#32CD32]\nLetter from publisher- I am terrible sorry guys that this news was so damn short. I was caught off guard when asked to do this. I am glad that I got another news out there though! Nothing too big happened this week anyway.. hope you guys enjoyed this!\n\nIn other news: Glad to see that the lounge crackdown is being put into play more and also the fact that most LQP'ers are withering away. Lets go quality! \n\nQuestions, comments, or concerns can be addressed in here and I do like criticism so then if I ever do it again I can fix things! Thanks for reading once again!\n\nRobi\n[/color]\n\nNote by Yin:\n\nI know I said I'd do it but Robbie is so anxious to do them, so I just let him. Next week I will! Take my word for it!",
      "subject": "[7/25-8/1] HF News"
    }
  ]
}