{
  "posts": [
    {
      "pid": "18981778",
      "uid": "515249",
      "dateline": "1326347528",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\r\n\r\nThe edition you are currently reading is the [color=#FF69B4][b]75th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\r\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\r\n[b]Warning system makeover[/b]\r\nOmniscient has remade the warning system to simplify the warnings and make them more understandable. The Low Quality Posting, Wrong Forum Posting, Cross Posting, and Off Topic warnings have been merged into the Posting etiquette warning which will be 20% with a duration of one month. A few warnings have been removed however there were no new rules added to HackForums.\r\n\r\n[b]Another word censored[/b]\r\nRecently Omniscient censored the word silent-rewards (without the hyphen) on HF.  The reason behind this is most likely because the website was fake, and it was just a way for the owner to make a few extra dollars.\r\n\r\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=140749][b][color=#0066FF]Poppins[/color][/url][/b] - reached 1000 reputation points!\r\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=white]Diabolic[/color][/url][/b] - reached 1000 reputation points!\r\n[url=http://hackforums.net/member.php?action=profile&uid=574192][b][color=black]Defcon[/color][/url][/b] - was banned for the reason \"Leaking at villainz\".\r\n[url=http://hackforums.net/member.php?action=profile&uid=11953][b][color=black]Nyx-[/color][/url][/b] - was banned for Reputation abuse, but has reached his goal on HF by reaching -1000 reputation!\r\n[url=http://hackforums.net/member.php?action=profile&uid=561239][b][color=black]iHydra[/color][/url][/b] - was banned for vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=950570][b][color=black]๖ۣۜHacker™[/color][/url][/b] - received a ban and a repfuck for the reason \"Anytime you want to stop by.\"\r\n[url=http://hackforums.net/member.php?action=profile&uid=415606][b][color=black]Costal Waters[/color][/url][/b] - is now a confirmed scammer and received a repfuck and a ban for it.\r\n[url=http://hackforums.net/member.php?action=profile&uid=989666][b][color=black]Gpizzle[/color][/url][/b] - has been banned for Advertising.\r\n[url=http://hackforums.net/member.php?action=profile&uid=808206][b][color=black]Spetsnaz[/color][/url][/b] - was banned for Ub3r Junk Abuse.\r\n[url=http://hackforums.net/member.php?action=profile&uid=622763][b][color=black]Quiet[/color][/url][/b] - formerly known as alabama, was banned for the suspicion of his account being compromised.\r\n[url=http://hackforums.net/member.php?action=profile&uid=1035793][b][color=black]Motorola™[/color][/url][/b] - has gone on vacation recently.\r\n[url=http://hackforums.net/member.php?action=profile&uid=371170][b][color=black]OVO™[/color][/url][/b] - our very own music news writer was repfucked for a l33t reversal.\r\n[url=http://hackforums.net/member.php?action=profile&uid=371170][b][color=black]AlbinoShadow[/color][/url][/b] - has taken some time away from HF.\r\n\r\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\r\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\r\n[i][b]4Chan Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2097331]Secret website found from decoding 4chan image. [UPDATED] [NEW DEVELOPMENT][/url] - [url=http://hackforums.net/member.php?action=profile&uid=285755][color=white][b]Cody8295[/b][/color][/url] - There has recently been a worldwide treasure hunt revolving around the image shown in this thread. It has to do with a cicada that has been reported in many different locations and countries. One of our very own is getting closer to cracking the code.\r\n\r\n[i][b]Ask Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1089175]Ask F8 any question.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=103669][color=lime][b]Factor8™[/b][/color][/url] - This thread has reached over a thousand replies and has been fairly active. If you have a question for F8, you better jump on it soon!\r\n\r\n[i][b]MOTM Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2095933]MOTM Timeline.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=730111][color=white][b]devilpsn[/b][/color][/url] - To better keep track of the previous and future MOTM threads, this timeline has been created.\r\n\r\n[i][b]Country Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2087795]Your attention please. [Hackforums' own country][/url] - [url=http://hackforums.net/member.php?action=profile&uid=183072][color=white][b]Mr Kewl[/b][/color][/url] - Interested in vacationing to an island owned by the Hack Forums community? It may actually be possible!\r\n \r\n\r\n[align=center][img]http://goo.gl/C6j11[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Diabolic[/font][/size][/color][spoiler=]\r\n[b][color=white]Innocence.[/color][/b]: Hey, Diabolic. I was honored to actually interview you today. I am glad you could take the time to have this interview with me... How are you today?\r\n[b][color=#1466FF]Diabolic[/color][/b]: I'm very good thanks. Just chilling and doing some business work then off to browse HackForums. What about yourself? \r\n\r\n[b][color=white]Innocence.[/color][/b]: Well. I'm pretty decent, thanks. I've just been doing some online gaming, browsing Hack Forums and talking to some friends. Anyways, before we start... Is there anyone you'd like to give a shout out to? \r\n[b][color=#1466FF]Diabolic[/color][/b]: I got a whole list but here it goes big shoutout to MrQuickModz, Bugga,  Reliable, Earthshaker, Legacy, PuertoRican, Genuine, Judge Dredd, Xch4ng3, Omniscient, T3h Hack3r, Peter Chao, Riggs, iNviZ, WiFi, Sir, Graphic Masters, Marketers and all the other groups I'm in. I may of missed some people off. Sorry.\r\n\r\n[b][color=white]Innocence.[/color][/b]: Oh, It's fine. 250 thousand members on Hack Forums, I don't think people expect you to remember everyone you love :). So, what do you think about the changes to come to Hack Forums in the future? Such as the vouch system, possibly two new official groups, etc.\r\n[b][color=#1466FF]Diabolic[/color][/b]: Well the two official groups, I know about of course. I think they'll both be great. The vouch system sounds great and I believe It'll be a great thing for the Marketplace and will hopefully crack down on scammers etc. The new P0W3R group should be awesome as I believe that's coming sometime in January. Other than that, who knows what can change on HackForums in 6months.\r\n\r\n[b][color=white]Innocence.[/color][/b]: Yeah. It will be a suprise to us all what happens. Do you think you'll be buying the new usergroup; P0W3R once it is released?\r\n[b][color=#1466FF]Diabolic[/color][/b]: I very much look forward to it, a good friend on HackForums who you all know I won't disclose her name(No it's not bugga lol) but I thank them for that. I can't wait till it comes out, I want it purely for the fact of the Inbox space since I get a lot of PM's and deleting PM's every 2-3 days can become a bore. Having 10,000 allowed space would be awesome.\r\n\r\n[b][color=white]Innocence.[/color][/b]: Haha, I agree. I could imagine how many PMs you get per day.. So, do you think all the updates, and major changes that are happening right now and will happen in the future will be a good or bad thing for Hack Forums? How will it effect Hack Forums in the future?\r\n[b][color=#1466FF]Diabolic[/color][/b]: I reckon Omniscient has got a lot in store for HackForums. I honestly can't wait to see what he has in store for us but all I can say is whatever it is us HackForums members are gonna love it. When does Omniscient not do quality updates? He's always trying to bring out new things for us to enjoy and make use of. Now that's what you call a good site owner/admin.\r\n\r\n[b][color=white]Innocence.[/color][/b]: Yes. He's always doing things that won't only be good for him and his site, but also for the community. That's very responsible and like you said.. A very good site owner and system administrator. Especially with the recent system editing and updating he did this week, he's a very good system administrator. How is your possible new official Hack Forums group, \"Propitious\" coming along?\r\n[b][color=#1466FF]Diabolic[/color][/b]: It's going great but may be delayed, I can't disclose much about the site but I'm sure you'll love it. Yeah Omniscient does try his best for us and his site.\r\n\r\n[b][color=white]Innocence.[/color][/b]: That's nice. I'm pretty curious to see what comes out of Propitious, and when it's going to be officially released and a group. So, how did you find Hack Forums and why did you come to Hack Forums?\r\n[b][color=#1466FF]Diabolic[/color][/b]: Signed up back in 2009 but got hacked so I left. Came back in 2010 due to a friend referring me and then here I am. I've came away from what I used to be but now I love to help out new members and donate to HF as much as I can and whenever I can.\r\n\r\n[b][color=white]Innocence.[/color][/b]: Yeah, you've become quite the idol and role model around Hack Forums. How did you come up with your alias, \"Diabolic\"?\r\n[b][color=#1466FF]Diabolic[/color][/b]: Well I own a company online called Diaolic-Servers which can be seend at www.diabolic-servers.com and I just used the name from that and that's how I'm known online and around HackForums.\r\n\r\n[b][color=white]Innocence.[/color][/b]: Yeah. I recently checked out that website and it's quite stunning. I love it, I may have to get a server from you at some point in time. Well, I think that just about ends what I wanted to talk about and ask you for this interview. Is there anything you'd like to say to wrap up the interview or anything you'd like to talk about?\r\n[b][color=#1466FF]Diabolic[/color][/b]: Just a big thanks to the community for being so active. I also thank you for the interview, thanks a lot.\r\n[/spoiler]\r\n\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - .Zo[/font][/size][/color][spoiler=]\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey .Zo – Thanks for giving me the oppurtunity to interview you! Before we begin, would you like to give any shoutouts to some special members?\r\n[b][color=#1466ff].Zo[/color][/b]: Oh most definitely. First and foremost gotta shout out Tate, good friend of mine since I pretty much came here. iDuL because I learned that he lives near me and we like the same shit and we've been homies since then. StarZ and Playskool, my cool coder homies. Uhhh lilsnoop for undisclosed reasons :P. Oh and Procrastination for managing my gaming communities servers, being a chill dude, and always putting up with my BS. Pataclocked for being my chill (most of the time) indian gaming pal. ScripT for teaching me how to surf in CS:S and playing with me. Vallium for sparking my interest in a new hobby and guiding me along in it and also being a chill stoner and becoming my buddy. And Michael Westen for helping me with photoshopped stuff and interviewing me! I don't think I forgot anyone but if I did I'm sorry.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: I recently got CS:S and I love surfing! We should do that sometime, it’s tons of fun! That’s a great list of members. So, how did you find Hack Forums?\r\n[b][color=#1466ff].Zo[/color][/b]: I found hackforums when I searched Google for a way to hack email accounts.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: I see – I think we all came about in a similar way. Why is your name .Zo? It’s very unique and I didn’t know what to make of it.\r\n[b][color=#1466ff].Zo[/color][/b]: A short version of my real name is Zo and its what everyone calls me IRL so yeah the dot came from me biting Daniel Tosh's swag so yeah but it stuck.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b] – Clever, I don’t think Daniel Tosh would mind! What do you think has impacted you the most on Hack Forums?\r\n[b][color=#1466ff].Zo[/color][/b]: Probably the social engineering section and meeting alot of great people. I can pretty much get anything/ get out of anything now (thanks clockwork). Oh yeah and of course the hacking tutorials / tools and programs section. Good to know how to do the basics of \"skid\" hacking, RAT, keylog, etc.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: I see – Clockwork is a great engineer and has helped me in the past. RIP Social Engineering Section! As that section is gone, what would you consider your favorite section and why?\r\n[b][color=#1466ff].Zo[/color][/b]: . Most likely the Computer and Online gaming section but the Social Engineering section came in a close second.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: I feel the same way – Since I got a new PC for Christmas, I can actually play steam games! If you had the chance to make 1 change to HF, what would you do?\r\n[b][color=#1466ff].Zo[/color][/b]: Bring some of the old banned stuff back. Some of the banned discussions you know?\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Definetely, I can say I miss a few things that were recently banned! How do you feel about the upcoming vouch system/rep reset?\r\n[b][color=#1466ff].Zo[/color][/b]: vouch system sounds like an ok idea I guess. WAIT WAIT WAIT REP RESET?!\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Not to worry! It was announced a while ago but hasn’t been put into affect. I personally have no opinion on it. What do you like to do outside of HF?\r\n[b][color=#1466ff].Zo[/color][/b]:  Scooter, play games, ride rollercoasters, cook (both kinds), listen to music, and chill with my friends.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Sounds like a lot of fun!  What was your big ticket item for the holidays?\r\n[b][color=#1466ff].Zo[/color][/b]: Shit I didn't get much for Christmas and I didn't want much but probably a trip to Disneyland/ Magic Mountain.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: I recently moved and can no longer go to Disney Land, it’s still fun for some older guys. Where do you see yourself in 5 years, in relation to HF?\r\n[b][color=#1466ff].Zo[/color][/b]: Probably still lurking and posting occasionally.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Well, that about raps it up for me! Do you have any words for members that are reading?\r\n[b][color=#1466ff].Zo[/color][/b]: Yes rep is just a number but it determines your social status on HF and the way people deal with you. So uh be yourself and stack those apples kay.\r\n\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Thanks .Zo!\r\n[/spoiler]\r\n",
      "subject": "[1/11/12] - HF News"
    },
    {
      "pid": "18981784",
      "uid": "515249",
      "dateline": "1326347556",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\r\n[color=white][b]Navy Seal Accidentally Shoots Himself in the Head[/b][/color]\r\nSan Diego police say that a Navy SEAL has been put on life support after accidentally shooting himself in the head.  Reports say that the soldier was showing off guns to a women he had met earlier and placed an ostensibly unloaded pistol to his head and pulled the trigger.  \r\n\nThe Naval Special Warfare community says they are saddened by this incident and their \"hearts and prayers\" go out the the family of the soldier.\r\n\n[color=white][b]Bieber's Tatts[/b][/color]\r\nRecently released photographs reveal Justin Bieber's new Jesus tattoo on the back of his cafe.  The tattoo was spotted on his way to a pizza parlor with his father and a few friends.  Biebers religious beliefs may not be too shocking to many although; along with getting the tattoo of Jesus's face, sources at MSNBC say that his movie \"Never Say Never\" has Christian reflection in it.  \"I believe that jesus died on a cross for my sins,\"; \"he's the reason that I'm here.\" said Justin to Billboard recently in November.\r\n\n[color=white][b]Selena's Stalker[/b][/color]\r\nCivil judge granted Selena Gomes a three year restraining order against Thomas Brodnicki, who had traveled from Illinois and threatened to kill the actress. She declared she was in extreme fear of the man who threatened to kill her.\r\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\r\n[color=white][b]CES is on its 3rd day[/b][/color]\r\nGreat new inventions have been unlived from CES this year. A great product is the new Gorilla Glass 2 which is said to be 10x stronger then regular glass. It could withstand 120 Pounds of pressure. This is a huge achievement for gorilla glass 2. There product will be used everywhere by companies that need there products to be elegant and durable.\r\n\n[b][color=white]iPad 3?[/color][/b]\r\nWell there are rumors that say the launch date will be in Feb. There already has been picture leaked out with parts of a different looking iPad parts. It should sport a Retina Display and maybe USB 3.0 compatibility. Other rumors are saying that it will not look any different only speed like the 4S. Maybe it could be named the iPad 2S?\r\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\r\n[color=white][size=x-large][font=Verdana][b]New Songs Of The Week[/b][/font][/size][/color]\r\nGucci Mane - A$$ Remix [url=http://digitaldripped.com/jan/8/2012/gucci-mane--dance-a-remix]Download.[/url]\r\n\nChris Brown - Don't Wake Me Up [url=http://digitaldripped.com/jan/7/2012/chris-brown--dont-wake-me-up-no-tags]Download.[/url]\r\n\nRick Ross ft. Drake, French Montana - Stay Schemin' [url=http://digitaldripped.com/jan/6/2012/rick-ross-ft-drake--french-montana--stay]Download.[/url]\r\n\nDaily Music Downloads can be found [url=http://digitaldripped.com/]here.[/url]\r\n\n[hr]\r\n\n[color=white][font=Verdana][b]Rick Ross - Rich Forever Mixtape[/b][/font][/color] [color=white][size=small]- Miami, FL[/size][/color]\r\nRapper Rick Ross released his new mixtape \"Rich Forever\" on Friday, January 6th 2012, at \r\nexactly 3:05 PM. This marvelous mixtape features artists such as Wale, Meek Mill, Drake, \r\nFrench Montana, NAS, and Diddy. Maybach Music Group (MMG) is rising up the charts. His \r\nupcoming album, God Forgives I Don’t, is still set to release. It was set to release on Decembe\r\r\n13, but was canceled after his health scare (seizures) in October. You can download the new \r\nmixtape [url=http://www.livemixtapes.com/download/15656/rick_ross_rich_forever.html]here.[/url]\r\n\n[color=white][font=Verdana][b]Yelawolf Punches a Fan On Stage[/b][/font][/color] - [size=small][color=white]Santa Ana, CA[/color][/size]\r\nFan runs on stage to tackle Yela, and Yela reacts by throwing a large punch to his face.\r\nVideo can be found [url=http://www.worldstarhiphop.com/videos/video.php?v=wshhUAJi8J40FXRR5cSN]here.[/url]\r\n\n[color=white][font=Verdana][b]Snoop Dogg Caught With Drugs[/b][/font][/color] - [size=small][color=white]El Paso, Texas[/color][/size]\r\nOn January 9th 2012, rapper Snoop Dogg was caught by border patrol with possession of\r\n drugs. He had rolled joints in a red prescription bottle. He was taken into custody, and then\r\n later released. \r\n\n[color=white][font=Verdana][b]Tyga Disappoints San Diego[/b][/font][/color] [color=white][size=small]- San Diego, CA[/size][/color]\r\nThis is from personal experience. Tyga refused to show up to 3 San Diego shows, and ran off\r\n with tens of thousands of dollars. He has promised them a free concert sometime this year.\r\n\n[hr]\r\n\n[color=white][b][font=Verdana]In other news...[/font][/b][/color]\r\n- Frank Ocean Says Debut Album Will 'Define' Him\r\n- Rihanna Named Best-Selling Digital Artist Ever\r\n- Black Keys Drummer Says Nickelback Are 'Crap'\r\n-JayZ & Beyonces baby girl is born. JayZ spends 1.3 million to rent out the hospital; Name is 'Ivy Blue Carter'\r\n- Coachella 2012 line-up has been released.\r\n- Wiz Khalifa and his Girlfriend making a movie.\r\n- Wiz Khalifa and Snoop Dogg Movie will be released soon.\r\n- Common and Drake are in beef.\r\n\n[hr]\r\n\n[font=Verdana][color=white][b]HF Artist Gone Viral[/b][/color][/font]\r\nUser [url=http://hackforums.net/member.php?action=profile&uid=371170]OVO™[/url] is a up and coming Hip Hop Artist from Southern California.\r\nYou can buy his song Like That [url=http://itunes.apple.com/us/album/like-that-single/id492790619]here[/url] on iTunes to support him. \r\n\n[hr]\r\n\n[color=white][font=Verdana][b]Music Videos Of The Week[/b][/font][/color][spoiler=]\r\n[video=youtube]http://www.youtube.com/watch?v=E_10tfbfO94[/video]\r\n\n[video=youtube]http://www.youtube.com/watch?v=qX8erLf0jTM[/video]\r\n\n[video=youtube]http://www.youtube.com/watch?v=AE3yia1AJeQ[/video][/spoiler]\r\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\r\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\r\n---\r\nOne thing I have never understood is when people say that you need to have a back-up plan and live your whole life as if you're going to live again. Regardless of different religious beliefs, I've always perceived that you should live your life how you want to. When people are fully against drugs as that will ruin your life, you should do what you want with your life. Now I'm not saying to go commit homicide because you felt like it, but to do what you want. You can live your whole life the way you're supposed to, but then at the end, what do you look back on? If you were spontaneous and radical, then you have many fun and interesting memories to look upon. If you spent your time kissing your boss' ass and grinding your teeth to make more money, you'll just wish you did more. Just try to live comfortably and actually live your life, don't follow the rulebook.",
      "subject": "*"
    },
    {
      "pid": "18981799",
      "uid": "515249",
      "dateline": "1326347582",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\r\n\n\"Are you happy with the recent changes on Hack Forums? Do you have any problems with them?\"\r\n\n[i]\"Yes I think the recent changes to HF are good. The Staff wouldn't make these changes\r\n if they wouldn't help and benefit the members of HF. To be honest, I haven't really noticed\r\n anything different because I am not usually around them sections. All I can say is, keep up\r\n the good work staff!\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=849324][i]-Text[/i][/url]\r\n\n[align=right][i]\"I like the recent changes on HackForums and the new buttons made with CSS\r\n are sexy. I do not have any problems with any changes so far and i'm surely looking forward\r\n for the Pow3r usergroup and the rep reset but I think from the rep reset a lot of people would\r\n start asking for reps to be the most + repped person on HF who currently is Cяιмιηαℓ with 2352\r\n + reps. I'm hoping that Omniscient allows a Paypal payment option for the pow3r group. So far\r\n all the changes were good though I miss the views feature which is gone and I know it can be\r\n viewed via UserCP but I liked seeing other peoples thread viewing but it got removed because\r\n people were botting views in their Marketplace so they could attract more customers. Hope the\r\n \"reply #\" option/feature is also not taken away.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=678298][i]-Kamz89[/i][/url][/align]\r\n\n[i]\"Most of the newest updates are a very good thing for HackForums. it allows for new people \r\nto see exactly who is on staff, and other important facts. The new sections are great so that \r\npeople are able to have their questions answered accurately and quickly by other members who \r\nare ready to help out. The new staff members are great, helpful people who are doing the best \r\nthat they can. The HF News has also really picked up and become very in-depth and accurate \r\nwith it's reports. The only problem that i currently have is not even out yet, which is the \r\nforthcoming \"Power\" group. It looks like this group is going to have the ability to -rep people while \r\nonly being \"l33t\" which gives the problem of not having to be 'Judged' if you will by Omniscient.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url]\r\n\n[align=right][i]\"Seeing that Omni is making changes that he believes are beneficial makes my day. \r\nThe Stafflist.php addition will be a great addition to the site and will help all members that need to \r\ncontact staff. The Modlist.php will also be a beneficial tool to have in case someone wants to report \r\na thread that needs to be moved. The only problem I have with the updates are the Premium Ebooks \r\nSections. Why would we have to have a premium section for ebooks? A majority of the ebooks are \r\nfake and they say they contain methods on how you can get hundreds of dollars in a short period of \r\ntime. If we had a premium section, that would leave the section for the regular members hopeless. \r\nThere would be no point to have the section for regular members if the regular members are only going \r\nto see threads that are selling ebooks that don't work. Then, that will cause a lot of scam reports and \r\ndeal disputes threads. I just hope Omni doesn't regret making some of this updates.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=434812][i]-Swag ♥[/i][/url][/align]\r\n\nThe topic for next week is \"What do you think of the leadership on Hack Forums?\" Example: Staff, Mentors, Admins. (Keep it civil) \r\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\r\n\n[hr]\r\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\r\n[align=center][img]http://i.imgur.com/zANlV.jpg[/img][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\r\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Rob/resolutions2012.png[/img][/spoiler][/align]\r\n[align=center][spoiler=][img]http://www.explosm.net/db/files/Comics/Dave/comictimemachine3.png[/img][/spoiler][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\r\n[align=center]\r\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\r\n[video=youtube]http://www.youtube.com/watch?v=QIteaJzrqa0[/video][/align]\r\n\n[spoiler=[i][b]Written topics[/b][/i]]\r\n[b]Awards[/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=434812][b][color=white]Swag ♥[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=27]Dancing Queen[/url] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=white]Diabolic[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=41]Dog Lover[/url] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=656453][b][color=white]ReactionZ[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=23]Gamer[/url] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b][color=white]xerotic[/color][/url][/b] got the [url=http://hackforums.net/myawards.php?awid=4]MOTM[/url] award.\r\n[/spoiler]\r\n\n[hr]\r\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/WpABi]0OTF[/url]\r\n[list][*]Headlines[/list][/list]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions[/list][/list]\r\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\r\n[list][*]World News[/list][/list]\r\n[list][*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[list][*]User News[/list][/list]\r\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\r\n[list][*]Tech News[/list][/list]\r\n[list][*][url=http://goo.gl/YQXAV]OVO™[/url]\r\n[list][*]Music News[/list][/list][/list]\r\n[list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*][url=http://goo.gl/piymJ]Kottonmouth.[/url]\r\n[/list]\r\n[*][color=white][b]Web Show Co-Host[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/VIJ7W]xerotic[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}