{
    "posts": [
        {
            "pid": "5779634",
            "uid": "74244",
            "dateline": "1281680970",
            "message": "[align=center][img]http://i35.tinypic.com/28vfuwo.jpg[/img]\nEdition 1[/align]\n\nWelcome to the new segment that I am introducing. It's called INTERACTIVE TUESDAYS! WOO! Anyway.. basically what this is.. is an interactive news segment! I take your threads, and put them and explain them to the members who read this thread! Simple! \n\nAlso, I do interviews, via MSN and what not and upload them on YouTube and embed it in the thread!\n\nThis is the first edition! \n\n[size=large][color=#FF1493]User submitted threads/news![/color][/size]\n\nThis is the section where I show off people's threads!\n\n[color=#FFA500][url=http://hackforums.net/member.php?action=profile&uid=277712]mdfilms[/url] is selling an eBook on how to make YouTube bulk accounts! It's only 50 cents, yes, 50 cents, so you can't go wrong! The reviews are good too! Buy the book [url=http://hackforums.net/showthread.php?tid=581625]here[/url]! Good luck with sales mdfilms![/color]\n\n[color=#FFA500][url=http://hackforums.net/member.php?action=profile&uid=97519]Nima304[/url] made a thread on \"downloading the internet\" with new technology coming up in 5 years, etc. It's a VERY interesting read, and has a lot of logic. Good for you Nima! I suggest you check it out, if you have an extra 1-2 minutes to read a quick thread! Comment on it too! Good luck with your adventures Nima![/color]\n\n[color=#FF1493]Haruhi-ILOVEANIME-Suzumiya is selling a seedbox for only $3, and $1 for UB3Rs! Yes! That's SUPER DUPER CHEAP! Check out, and purchase if you'd like in [url=http://hackforums.net/showthread.php?tid=587609]this[/url] thread! Haruhi, I'll watch some anime with you sometime.. if it's cool? We can also bring Nyx- along![/color]\n\n[color=#1E90FF][url=http://hackforums.net/member.php?action=profile&uid=127629]Pagman[/url] released his .NET protector, called BitCrypt, recently! Good for him! It hasn't been cracked yet, so crackers, the door is open! I kid, but good job not getting it cracked yet. Check it out if you wish, in [url=http://hackforums.net/showthread.php?tid=562361]this[/url] thread. Good luck Pagman!\n[/color]\n\n[color=#FF1493][url=http://hackforums.net/member.php?action=profile&uid=297903]SilverWolf [/url] wrote a review about the MMORPG Shin Megami Tensei Imagine Online! You can play SMTIO [url=http://megaten.aeriagames.com/]here[/url]. It's a game by the popular game creators, AeriaGames! It has a ton of good reviews, so you might want to check out the game, and his review! Good job![/color]\n[color=#1E90FF]\ncrawl7 has gotten his 1,000th post today! Congratulations to him! He has been a member here since May 2009. He reached 1,000 posts, after having been online for roughly 2 weeks (total online time)! Congratulations to him, and may him reach for 2,000 soon! Give your appreciations to him in [url=http://hackforums.net/showthread.php?tid=607617]this [/url]thread! Congratulations![/color]\n\n[color=#FFA500]-[i]Dzire-™  made a thread about his eBook safety guidelines, which are obviously unofficial, however, it's decent advice. Go check his thread out [url=http://hackforums.net/showthread.php?tid=592620]here [/url], and good job writing it. It's pretty long for a guideline type thing, so that's a plus. It's decently written, there's grammar errors, but you can still read it.[/color]\n\n[hr]\n[size=large][color=#FF1493]\nWebsite of the Week![/color][/size]\n\n[color=#1E90FF]This is a segment where I choose a Website of the Week. Technically, there'll be two of the week, since I'll do it on both Interactive Tuesdays AND Headline Saturdays.\n\nThe website of the week is Regime Radio! The thread is [url=http://hackforums.net/showthread.php?tid=607014]here[/url] and was made by KingDante! It's a radio that plays all types of music, so you should tune in sometime to them! I'm sure they'd appreciate it!\n\nTurn in at www.regime-radio.info and congratulations on being one of the Website of the Weeks![/color]\n\n[size=large][color=#1E90FF]INTERVIEWS![/color][/size]\n\n[color=#FF4500]I will also be incorporating this in Headline Saturday editions! This is where I interview someone over MSN and I post it on YT for you guys to enjoy! This week, was [url=http://hackforums.net/member.php?action=profile&uid=82952]Backslash[/url] an UB3R and Reviewer! Here is the interview, sorry it's in 3 parts..\n\n[YT]http://www.youtube.com/watch?v=Bro6BYZpCmc[/yt]\n\n[yt]http://www.youtube.com/watch?v=3OVWr3EOu2M[/yt]\n\n[yt]http://www.youtube.com/watch?v=3o2zPMRacgY[/yt][/color]\n\nOh, SORRY it was cut off for a little bit. Just try to understand what he's talking about, it's not that bad. I fixed it in Part 2.\n\n[hr]\n[size=x-large][color=#FF1493]IMPORTANT - FAKE CRYPTERS![/color][/size]\n\n[color=#FF1493]This is an extra segment I added, just to address some things. There has been fake crypters going around to infect people of HF, and it's not good! They will steal your account, then repost it on your account.\n\nThese are fully FUD on NVT, and other things. Common names go by Devil Crypter, XCrypter FUD 100%, TGEye Keylogger Crack.. etc.\n\nIMAGE OF XCRYPTER -\n\n[img]http://i67.photobucket.com/albums/h304/aznganster94/screenshot4dt8.jpg[/img]\n\nTGEYE CRACK -\n\n[img]http://tgforums.com/images/TGEYESS2.jpg[/img]\n\nThe description for the crack -\n\n\"I am now more in cracking Well. Here my first work. TGEYE Keylogger. Cracked by me. It is fully FUD etc. For more info read here: http://www.tgforums.com/TGEYE/\n\nIt was the Public Version where you can use it only 24 hours, but this is patched. No time limit!\n\nWhat I did:\n\nI unpacked the Keylogger\nI installed \"Reflexil\"\nI Disassembled TGEYE Keylogger\nI removed the \"checkTrial\" Stuff\nDone ))\"\n\nDo NOT download these! Just be weary about what you download on the forums these days. If you don't really trust it, then don't take a risk.\n\nSome of the threads -\n\nhttp://hackforums.net/showthread.php?tid=606403\nhttp://hackforums.net/showthread.php?tid=606432\n\nStay weary, HackForumers![/color]\n\nThat's all for this week! By the way, I did do it on a Thursday this week, but that was because I wanted to introduce it! Next week, it'll be on a Tuesday! The actual news will be posted on Saturday! Thanks everyone! Comments..?",
            "subject": "[8/13] HF News - INTERACTIVE TUESDAYS! [huge edition!] [INTERVIEW WITH BACKSLASH!]"
        }
    ]
}