{
  "posts": [
    {
      "pid": "7019563",
      "uid": "136025",
      "dateline": "1287134029",
      "message": "[align=center][IMG]http://i52.tinypic.com/28r1ux.jpg[/IMG][/align]\r\n\r\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 19th FULL edition. It is for the dates of 10/07/2010 to 10/14/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\r\n[align=center][IMG]http://i54.tinypic.com/qstieq.png[/IMG][/align]\r\nThis week on Hack Forums has been a long week for Omniscient, the Staff and members of the forum. The forum has been subject to downtime, planned changes and much more.\r\n\r\nLast week, Vorfin had notified the Staff team of his demotion. He has so humbly stepped down due to unknown reasons. We would like him to have his privacy, so we respect his reasoning and hope people do not question why he has done so. We would like to wish him luck on his future endeavors and wish him the best.\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nOmniscient has recently notified us of a MySQL crash that had affected the up-time of Hack Forums. To many, it might seem as an issue or a bad thing, although, this shows the pace of which Hack Forums is growing at. We wish luck to Omniscient so he may keep the up-time of Hack Forums at the great state it is currently at.\r\n\r\n[color=#1E90FF][b]You can read more of it [url=http://hackforums.net/showthread.php?tid=733042]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nIn regards to the MySQL crash, Omniscient is now planning on upgrading the current database server to two databases which would successfully speed up query requests (speeds up loading times). This is great news for all members as they can now enjoy faster loading times.\r\n\r\n[color=#1E90FF][b]You can read more of it [url=http://hackforums.net/showthread.php?tid=738481]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i54.tinypic.com/30rmg0j.png[/IMG][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=43626]Kutmustakurt[/url] has been re-promoted to Staff once again after the last mass demotion. We would like to wish him the best of luck and hope he does a great job once again. \r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nCrust was given access to a massive website with almost 100,000 customers. While trying to export the database (which is not recommended or condoned), he accidentally deleted the forum completely. Someone should be much more careful when committing actions like this. \r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=739451]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i51.tinypic.com/1zd6eja.png[/IMG][/align]\r\nIn similar news, Omniscient has discussed that Mentors might be introduced into Hack Forums after months of waiting. Mentors would be off great assistance to Staff mainly assisting them with low quality reports.\r\n\r\n[color=#1E90FF][b]You can read more about Mentors [url=http://hackforums.net/showthread.php?tid=405758]here[/url].[/b][/color]\r\n\r\n[color=#1E90FF][b]You can read his post regarding Mentors [url=http://hackforums.net/showthread.php?tid=734566&pid=6982233#pid6982233]here[/url].[/b][/color]\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\nEurospeak is now recruiting for new European applicants for it's courses on Ethical Hacking. Many people might be interested in Eurospeak although some say it's too expensive. \r\n\r\n[color=#1E90FF][b]Read more about it [url=http://hackforums.net/showthread.php?tid=738810]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i51.tinypic.com/2w4f95h.png[/IMG][/align]\r\nWe could not get an interview, we will begin interviewing regular members in the next edition!\r\n\r\n[align=center]**[color=#1E90FF]**[/color]**[/align]\r\n\r\n[color=#1E90FF][b]Letter from the Editor:[/b][/color]\r\nPlease read this [url=http://hackforums.net/showthread.php?tid=741915]here[/url].\r\n\r\nAlso, sorry for the lack of news. I could not scrape up much news, sorry.",
      "subject": "[10/07/2010] - HF News"
    }
  ]
}