{
  "posts": [
    {
      "pid": "17644145",
      "uid": "515249",
      "dateline": "1322197990",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]68th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[b]We got an interview with Peter Chao to make up for the missing sections![/b]\n\n[b]A couple of notices:[/b]\n[list][*]This edition was a little shorter due to it being Thanksgiving weekend\n[*]We would have had custom graphics, but our GFX Master has been having Graphics Card problems[/list]\n\n[align=center][img]http://goo.gl/jXMHO[/img][/align]\n[b]HM and SE Sub-forum Closed[/b]\nThe [i]Human Manipulation and Social Engineering[/i] section is now closed due to its persistent use for call-in and PIDs. The entire section has been closed because Omniscient felt that he had had enough of the constant annoyance from people posting threads asking for PID's and Call-ins. The sub-forum was abused for a long time before any action had been taken. Many people are sad to see it go but it had to be done.\n\n[b]Elder Scrolls Sub-forum Opened[/b]\nWith one lost, we gained another. Omniscient took the time and added the Elder Scrolls sub-forum under Computer and Online Gaming. This sub-forum was suggested numerous times and Omniscient took note, thus we have the sub-forum. It has already become a big hit among the users.\n\n[b]Birthday Wishes[/b]\nDaL33t recently had his birthday and Omniscient decided it would be decent to go that extra little bit and wish him a happy birthday on his twitter page. Towards the end he ended up tweeting the following statement: 'And anyone else asking me for a birthday tweet gets RF'd.' So anyone asking for their birthday to be announced on the official twitter will receive a customary repfuck.\n\n[b]More Theme Changes[/b]\nIt seems that there are going to be even more theme updates and changes in the near future as the buttons and tabs have recently been replace. A few members are disappointed with the latest change in the tabs, but they look professional and it's a welcome change from the tabs that were years old.\n\n[b]HackForums Thanksgiving Logo[/b]\nHackForums owner [url=http://hackforums.net/member.php?action=profile&uid=1][b][color=#4DD0FC]Omniscient[/color][/b][/url] made a thread requesting a logo for Thanksgiving. Many members submitted fantastic pieces of art, but he chose [url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic's[/url] graphic to be the Thanksgiving logo. See all of the submissions in this thread:\nhttp://hackforums.net/showthread.php?tid=1944039\n\n[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about Scam Reports and how they work in to the Marketplace?\"\n\n[i]\"I can personally see no effect scam reports have on a scammer. I've seen many scammers\n who have had clear evidence presented against them time and time again yet they received\n no bans, let alone a warning and are allowed to continue using HackForums as if nothing even\n happened. Staff needs to tighten up on scammers and it is disappointing to see that there are\n occasional scam reports made against L33ts and Ub3rs who are often allowed to slip through\n the fingers due to their status. If bans were more frequent and a no-chance scam policy was\n introduced, then HackForums would definitely see a significant decrease in the amount of scams.\"[/i]\n[url=http://goo.gl/KqcEh][i]-Valentine[/i][/url]\n\n[align=right][i]\"Scam reports work excellently it would seem, although I've never had to submit a\n scam report because I am very careful, I have seen many scammers get banned by it. Most reported\n people are also given a fair chance, as sometimes they did what was agreed upon but the person\n on the other end of the deal just wants to be a d*ck and report them for no reason. Everyone complains\n about scam reports going unnoticed, but you guys must get tons a day, and probably don't have time\n to look into them too deeply! Sometimes non-scammers get scam reported, so I like it that you guys\n give non-scammers who have been reported a fair chance at explaining themselves! Keep up the good\n work mods!\"[/i]\n[url=http://goo.gl/zIh5B][i]-Alex's Tutorials[/i][/url][/align]\n\n[i]\"The scam report system we have now, isn't very good IMHO. People are getting scammed everyday, and\n a lot of the time a significant amount of money. I honestly think we need a brand new one, and not just that,\n maybe a new way of selling things, were a middle man must be implemented at all times, and not always 'sent\n as gift' on PayPal. People are using other payment methods (such as MP) to prevent chargebacks, this is bad\n and good, bad due to the amount of people scamming members using this, and another to stop buying scammers\n from chargebacking. I think that scammers should be dealt with VERY severely, in a sense that a scam of over\n $20USD will earn them a permanent ban, and $1-19 will result in a longer ban. Of course this all happening after\n the two users try and deal with it in the appropriate section. Too much scamming happens here, it needs to stop.\"[/i]\n[url=http://goo.gl/Hol9p][i]-Graveee[/i][/url]\n\nThe topic for next week is \"Do you prefer having less staff and more mentors, what is your take on the subject?\" \n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[align=center][img]http://goo.gl/Bkvmj[/img][/align]\n[color=white][b]Intel’s Newest Chip Has 50 Cores and Will Eat Your Family[/b][/color] \nYes. Fifty cores. Five zero. All on a single, tiny chip. It's real. Intel beamed over their 50-core \"Knights Ferry\" processor yesterday at a supercomputing conference in Seattle, Brier Dudley of the Seattle Times reports. And they have good reason. The tiny chip is capable of 1 teraflop of processing power—an esoteric way of calculating how fast a chip is at crunching numbers. By comparison, the fastest Core i7 can only crank out 109 gigaflops. Stuffing this many cores onto one processor has pushed Intel to the point of just labeling it a \"many\" core chip—at a certain point, the number of cores becomes an abstraction.\n\n[color=white][b]Medvedev: Russia may target missile defense sites[/b][/color] \nRussia will deploy new missiles aimed at U.S. missile defense sites in Europe if Washington goes ahead with the planned shield despite Russia's concerns, President Dmitry Medvedev said Wednesday. Russia will station missiles in its westernmost Kaliningrad region and other areas if Russia and NATO fail to reach a deal on the U.S.-led missile defense plans, he said in a tough statement that seemed to be aimed at rallying domestic support. Russia considers the plans for missile shields in Europe, including in Romania and Poland, to be a threat to its nuclear forces, but the Obama administration insists they are meant to fend off a potential threat from Iran.",
      "subject": "[11/24/11] - HF News"
    },
    {
      "pid": "17644152",
      "uid": "515249",
      "dateline": "1322198018",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=93419][color=white][b]Minnesota Nice[/b][/color][/url] - This member has reach a milestone, 1000 reputation.\n[url=http://hackforums.net/member.php?action=profile&uid=827003][color=#FFCC00][b]dolphinman[/b][/color][/url] (ChromeWolf) - He got repfucked since all of his donations to Hack Forums were charged back.\n[url=http://hackforums.net/member.php?action=profile&uid=415606][color=#0066FF][b]Storm Watch[/b][/color][/url] - Storm watch got repfucked for calling Deceive a scammer via TinyChat.\n[url=http://hackforums.net/member.php?action=profile&uid=406243][color=white][b]WiFi.[/b][/color][/url] - The leader of Eminence has changed his username to [color=white][b]MrWiiwifi1[/b][/color].\n[url=http://hackforums.net/member.php?action=profile&uid=30595][color=lime][b]The Rated R Superstar[/b][/color][/url] - This staff member has changed his username to [color=white][b]Grееd[/b][/color].\n[url=http://hackforums.net/member.php?action=profile&uid=128873][color=black][b]T3h Hack3r[/b][/color][/url] - T3h Hack3r has gone on vacation until 11-25-11.\n[url=http://hackforums.net/member.php?action=profile&uid=679685][color=black][b]Bentley[/b][/color][/url] - Bentley went on vacation until 11-25-11.\n[url=http://hackforums.net/member.php?action=profile&uid=468670][color=black][b]Mr. Lazy[/b][/color][/url] - This user went on vacation until 11-25-11.\n[url=http://hackforums.net/member.php?action=profile&uid=729921][color=black][b]тнє σηє[/b][/color][/url] - He went on vaction until 11-23-11.\n[url=http://hackforums.net/member.php?action=profile&uid=298746][color=black][b]Grammar Rays[/b][/color][/url] got repfucked and banned until 12-23-11 for the following reason: 'Easy Decision.'\n[url=http://hackforums.net/member.php?action=profile&uid=565350][color=grey][b]Reported[/b][/color][/url] - Reported got repfucked twice within two days and was then moved to the dead group. He then continued to make a new account and ended up get his original account moved in to the banned group with the end date being 'Never.'\n\n[align=center][b][i]There wasn't enough time to do the Webshow, so here are the Awards and Leadership changes[/i][/b][/align]\n\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=32695][color=white][b]Etheryte[/b][/color][/url] got the [url=http://hackforums.net/myawards.php?awid=31]GFX Guru[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=809615][color=#0066FF][b]Jellyrolls[/b][/color][/url] got the [url=http://hackforums.net/myawards.php?awid=29]Silver Medal[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=717382][color=#0066FF][b]John*[/b][/color][/url] got the [url=http://hackforums.net/myawards.php?awid=26]Dabomb[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=955612][color=white][b]90k[/b][/color][/url] got the [url=http://hackforums.net/myawards.php?awid=41]Dog Lover[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=961270][color=#FFCC00][b]Ƨhadow[/b][/color][/url] got the [url=http://hackforums.net/myawards.php?awid=23]Gamer[/url] award.\n[url=http://hackforums.net/member.php?action=profile&uid=175033][color=white][b]xerotic[/b][/color][/url] got the [url=http://hackforums.net/myawards.php?awid=7]The Protector[/url] award.\n\n[url=http://hackforums.net/member.php?action=profile&uid=89554][color=#0066FF][b]RRain[/b][/color][/url] was rep fucked, got his award taken away, and his thread un-stickied after Ignite reported that his entire thread was leeched. Refer to [url=http://hackforums.net/showthread.php?tid=1835125&pid=17549324#pid17549324]this[/url] post for more information.\n\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=622763][color=white][b]WiFi.[/b][/color][/url] - Formerly known as Alabama, this member was promoted to Eminence leader.\n[url=http://hackforums.net/member.php?action=profile&uid=565350][b][color=grey]Reported[/color][/b][/url] - Reported was promoted to Reverence leader and then demoted a day later. This was before his banning.\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=white]Diabolic[/color][/b][/url] - He was demoted from Reverence leader but may be returning to leader soon.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Tutorial Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1920299]•The Ultimate Guide: Proxies & VPN's•[/url] - [url=http://hackforums.net/member.php?action=profile&uid=817877][color=#0066FF][b]Guess Who Is Back[/b][/color][/url] - Anyone who has any questions or doesn't fully understand proxies or VPNs should go read this guide.\n[i][b]Contest Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1765331][24/11/11] Get 50$ in 5 seconds. [15 Winners] [High Chance!!!!][/url] - [url=http://hackforums.net/member.php?action=profile&uid=744040][color=#0066FF][b]ASM[/b][/color][/url] - iCrypt is one of the best crypters around and ASM is doing a contest for two people a week to receive access to this crypter.\n[i][b]Video Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1950718][HLG] Modern Warfare 3 Hidden League Gaming - Episode 1 & 2 [HLG][/url] - [url=http://hackforums.net/member.php?action=profile&uid=620668][color=#0066FF][b]iKraZee[/b][/color][/url] - This thread advertises some great new videos coming out, if you like Call of Duty, come watch these videos!\n[i][b]Gaming Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=1870646]HackForums users - Battlefield 3[/url] - [url=http://hackforums.net/member.php?action=profile&uid=780686][color=#FFCC00][b] \nArsenal FC[/b][/color][/url] - This member has created a compilation thread to keep track of all Battlefield 3 players on Hack Forums.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Interview - Peter Chao[/font][/size][/color][spoiler=]\n[b][color=#145ff9]Michael Westen[/color][/b]: Hey Peter! Thanks for taking the time for this interview! To start it off, why did you first join Hack Forums?\n[b][color=#00ff00] Peter Chao[/color][/b]: I was linked to it from another forum. One of the moderator on that forum was 'hacked', and the user that was on the account kept linking people to HF. So I decided to join and see if I could prevent this from happening to me.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: I see, that's unfortunate but we're definately lucky to have you! You've certainly progressed a lot since you joined, even earning staff! What is that like, and what is your favorite part?\n[b][color=#00ff00] Peter Chao[/color][/b]: Being Staff is great, but at the same time time consuming. My favorite part is being able to access all the forums. 🤫\n\n[b][color=#145ff9]Michael Westen[/color][/b]: It must be hard to manage such a large forum with so few administrators - More power to you. I also see you're a member of the HJT team. Why did you first join them?\n[b][color=#00ff00] Peter Chao[/color][/b]: To learn more about malwares, prevent them from infecting me, and help others remove infections.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: Definately - I know you've saved many members from malware judging by your activity in the HJT section. Speaking of activity, Is Hack Forums the only forum you're active on?\n[b][color=#00ff00] Peter Chao[/color][/b]: I'm active on many other forums, but won't name them for privacy reasons. Very serious about my privacy. I'm more active on here than other ones though.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: I can  understand that for sure, we're glad to have you, Peter. What changes, if any, would you like to see on Hack Forums?\n[b][color=#00ff00] Peter Chao[/color][/b]: Argh, I personally would love to see members getting along with each other. New members have a sense of connection and feel that everyone on here is great because they sort of share the same interest, but as member age here and become ub3rs, they become douches and start thinking they are above everyone else, and that other people are nothing to them.Just get along.\n\n[b][color=#145ff9]Michael Westen[/color][/b]:  That's great advice, as I'd love to feel a more close welcoming feeling on Hack Forums. Where do you see yourself in 5 years, in relation to HF?\n[b][color=#00ff00] Peter Chao[/color][/b]: Not really sure, I doubt in the next six years I'll still be active, but if I am, I will probably be helping with the HJT Team, and maybe sell my on products.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: I'll be eager to see if you're still here in 6 years, I hope to be. If you aren't, I'm sure you'll be having fun outside of HF. Speaking of which, what do you do in your spare time outside of HF?\n[b][color=#00ff00] Peter Chao[/color][/b]: I read books about philosophy, economics, and other none-fiction books... Yeah, knowledge is power. I'm really into politics, and economics.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: Very cool - I'd be interested to hear about your thoughts on some of the economic problems currently. Why did you choose Peter Chao,\" as your username?\n[b][color=#00ff00] Peter Chao[/color][/b]: Peter Chao is the name of a YouTuber. I watched his video prior to coming on the forum I was linked to HF, and no, I am not Asian. \n\n[b][color=#145ff9]Michael Westen[/color][/b]: Well I think we're getting close to the end, but with the holidays approaching, I'm curious. What's the number one item on your holiday wishlist?\n[b][color=#00ff00] Peter Chao[/color][/b]: Probably a tower with awesome specs or another Samsung Galaxy.\n\n[b][color=#145ff9]Michael Westen[/color][/b]: I plan on getting a new tower as well :) That's about it for me, do you have anything you would like to say to the readers?\n[b][color=#00ff00] Peter Chao[/color][/b]: Special thanks to Acekidd01, Assass@in, Factor8, FlAmingw0rm, Hanzo, Infallible, N2H, Paradoxum, phyber, Rusty_v, Skill, S7N, Sneak, T3h Hack3r Valiant, Xch4ng3, and whoever I forgot that made my HF stay great.[/spoiler]",
      "subject": "*"
    },
    {
      "pid": "17644160",
      "uid": "515249",
      "dateline": "1322198045",
      "message": "[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/horoscopes.png[/img]\r\n[size=xx-small][i]These horoscopes were not written by us as we don't have the ability nor knowledge to do so.[/i][/size][/align]\r\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aquarius:[/font][/size][/color][spoiler=]\r\nExpect your popularity rating to increase during the next six weeks. You'll be out there flying you\r\r\ncolours, chatting to friends and acquaintances, and increasing your interaction with clubs, groups \r\nand organizations. Meanwhile, in your private fantasies, you'll be giving more serious thought to you\r\r\ngoals and dreams for the future. Ironically, something will tape-loop you into the past, bringing old \r\nfriends and acquaintances back into your life. But lo! This can be extremely helpful. These old pals \r\nknow your history. Share your future dreams with them to see what their thoughts are. Their feedback \r\nwill help you.\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Pisces:[/font][/size][/color][spoiler=]\r\nHeads up. For the next month (and this is the only time all year) the Sun will be slowly crossing the \r\ntop of your chart acting like a spotlight on you. This means bosses, parents, teachers, VIPs and the \r\npolice will notice you more than usual. Fortunately, this wonderful lighting makes you look fabulous in \r\nthe eyes of others. (Milk this for all it's worth! Demand the advantage.) If there's something you want, \r\nask for it! Now is the time to promote yourself by asking for a raise or endorsement. In fact, your best \r\nluck will be with previous authority figures and bosses from your past. Meanwhile, Mars sits opposite \r\nyour sign testing your patience with loved ones. Hey - this is a test you can pass. Relax.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aries:[/font][/size][/color][spoiler=]\r\nIt's time to get outta Dodge! For the next six weeks, you're eager to travel. Your sense of adventure is \r\nheightened and you're keen to learn anything new. Above all, you want fresh, stimulating experiences. \r\nObviously, travel somewhere new would be ideal. Unfortunately, retrograde Mercury could cause delays \r\nand snafus if you do this. Travel to somewhere you have already been before will be preferable. (Easier.) \r\nThe month ahead holds lots of opportunities in higher education, medicine, the law, publishing and the media. \r\nYou can easily wrap up old business in these areas. Old friends from other cultures might cross your path. \r\n\"Kemosabe! Is that you?\"[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Taurus:[/font][/size][/color][spoiler=]\r\nThe next six weeks are the perfect time for you to wrap up old issues about inheritances, wills, estates, \r\nbanking matters and anything to do with insurance details or shared property. (Boring but necessary.) Actually, \r\nclosure in these areas will be easy. For one thing, you're keen to make advances in these areas because you have \r\nsome concerns. Secondly, retrograde Mercury will actually help you to do this. In other words, looking back ove\r\r\nyour shoulder and finishing old business will be the easiest thing to do right now. Sign papers. Clear up red-tape \r\ndetails. Hey, you'll love yourself later when you see how much you get done. Just wade in and tackle some of this \r\nstuff.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Gemini:[/font][/size][/color][spoiler=]\r\nThe next month is the only time when the Sun is directly opposite your sign (as far away from you as it gets all year). \r\nBut the Sun is your source of energy! Conclusion: You'll need more sleep. Factoid. Respect your need for more rest. \r\nSleep on the job. Doze watching TV. Let someone else drive while you catch 40 winks. Meanwhile, during your awake \r\nmoments, you'll deal with ex-partners more than usual. (Whaat?) Fortunately, this coming month is an excellent time to \r\nwrap up old business, especially with ex-partners. (Perhaps closure with past issues?) Relations with partners and friends \r\nwill be a strong focus but they can be pleasant, diplomatic, warmhearted and friendly. Be patient with stuff at home, \r\nespecially family members.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Cancer:[/font][/size][/color][spoiler=]\r\nCapitalize on your urge to get better organized working at home or at your job because this will please you in the next six \r\nweeks. Somewhere deep in your psyche, you have made a personal decision to be more efficient, effective and productive. \r\nYes! No slack asses allowed! Ironically, at this same time, while you're setting your sites so high, retrograde Mercury will likely \r\nsabotage some of your efforts. (Bummer.) Expect delays, confused communications, lost paperwork, cancelled appointments \r\nand silly, goofy errors. Nevertheless, your desire to pull your act together will be a match for these obstacles. (We shall overcome!)[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Leo:[/font][/size][/color][spoiler=]\r\nIt's playtime for Leos! (\"Candygram for Mongo.\") The next six weeks are ripe for pleasure, entertaining diversions, parties, flirtations, \r\nmovies, the theatre, musical performances, clubs and playful times with children. Basically, you want to have fun. And you will! \r\nFlirtations and love affairs will pique your interest. (You adore being adored.) This is also a fabulous time to slip away on a vacation. \r\nWarning: While schmoozing and living it up, expect to encounter some old flames. (Oh yes - your checkered past comes back to \r\nhaunt you.) Quite likely, you'll blow a lot of money but, hopefully, you'll be clever about boosting your earnings as well. Ka-ching![/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Virgo:[/font][/size][/color][spoiler=]\r\nOh boy! Mars is in your sign for the next eight months. (Get used to it.) Actually, it won't be any trouble for you, it will be a challenge fo\r\r\nothers! (Oh yeah.) You'll be high-energy and super assertive about going after what you want. No holds barred! Meanwhile, in another part \r\nof the forest, your focus turns to home, family and domestic matters for the next six weeks. Relatives might be camped out in your kitchen,\r\n cooking and chatting with others from the past who are suddenly camped on your doorstep, sleeping on your sofa, and eating out of you\r\r\nfridge. Oy! Fortunately, Virgos are marvellous hosts. You give good hotel. No wonder your guests never leave.\r\n\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Libra:[/font][/size][/color][spoiler=]\r\nYou're entering a very busy month ahead (perhaps longer) full of short trips, increased errands, conversations with everyone (especially \r\nneighbours and siblings) plus increased reading, writing and studying. (A mildly hysterical pace because, as usual, you're trying to do it all.) \r\nHowever, you cannot ignore (except at your peril) Mercury retrograde, which will cause transportation delays and confusion in all you\r\r\ncommunications. (Cell phones, computers and conversations.) Prepare for this: Stay on top of car repairs, charge your batteries, pay you\r\r\nphone bill and back up your computer. For the next month, Murphy's Law rules. (Groan.)[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Scorpio:[/font][/size][/color][spoiler=]\r\nNow your attention turns to earnings, cash flow and financial matters. (Yet again, there is too much month left \r\nat the end of the money.) It's very easy to identify with what you own and what you earn, and assume this adds \r\nup to your worth in life. But you are not your bank account or your possessions (but, of course, you are your car). \r\nMany of you are looking for a new job. Others want new duties or more money or both. Your best chances will be \r\nto get in touch with old contacts from the past, i.e. old jobs, old employers, etc. because potential opportunities \r\nare definitely there in the next six weeks. Many of you are thinking about what really matters in life. In other words, \r\nwhat values are truly worthy?[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Sagittarius:[/font][/size][/color][spoiler=]\r\nFor the first time in 11 months, the Sun is back in your sign. Yay! This is your turn to recharge your batteries for the \r\nnext year. Use this powerful energy to your advantage. Important people and auspicious circumstances will be attracted \r\nto you. Be open to this and make the most of it. However, retrograde Mercury is also taking place in your sign. This is \r\na signal you will be involved with ex-partners and old friends - perhaps briefly, maybe longer. (Yup.) Use this as opportunity \r\nfor closure or clearing up old business. Make goals for the next year. Be specific because the more precise your objectives \r\nare, the more likely you will achieve them.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Capricorn:[/font][/size][/color][spoiler=]\r\nThe month ahead is a wonderful time for research of any kind. You will definitely prefer keeping a low profile and working alone \r\nor behind the scenes. Projects related to publishing, the media, medicine and the law have your attention, that's for sure. The \r\nmonth ahead is also a wonderful time to make travel plans. Some of you will be actively involved in politics, religion or racial \r\nissues because you strongly identify with your beliefs now. However, fair Venus in your sign makes this a marvellous time to \r\nschmooze with others! You'll be oh-so-charming and diplomatic. This is a good month to shop for wardrobe items because you \r\nlike what you see in the mirror. (\"I rock!\")[/spoiler]\r\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/news.png[/img][/align]\r\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list]\r\n[*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][url=http://goo.gl/aJS0l]Diabolic[/url][list][*]\r\n[*]Headlines[/list]\r\n[*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions[/list]\r\n[*][url=http://goo.gl/jZvPh]TheHackersLove[/url][list]\r\n[*]World News\r\n[/list]\r\n[/list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*][url=http://goo.gl/JJuWm]Daniel Faraday[/url]\r\n[/list]\r\n[*][color=white][b]Web Show Co-Host[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/gGUxd]Astonish is NJ[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}