{
  "posts": [
    {
      "pid": "20194417",
      "uid": "515249",
      "dateline": "1329974562",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]80th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[b]New section[/b]\nOmniscient recently added a new subforum in the Premium Sellers Section called 'Server stress testing'. At this moment the section is closed and members are unable to create news threads. Omniscient has yet to provide a reason behind adding this section, however it will help organize the section a bit more. To view this new subforum click the following link: [url=http://goo.gl/WMbyU]http://goo.gl/WMbyU[/url]\n\n[b]Theme problems[/b]\nRecently many members have noticed that there were several issues with the theme at HackForums. According to Omniscient the problem was caused by the CDN for the forum theme no longer working. At this point it seems that all errors have been fixed and everything is running smoothly. To view Omniscient's tweet about the error click the following link: [url=http://goo.gl/XCfG2]http://goo.gl/XCfG2[/url]\n\n[b]Login Security[/b]\nAfter noticing some odd activity in the member logins Omniscient decided to add additional login security to ensure that all members' accounts are safe. Any members that continuously attempt and fail to login to multiple accounts will have their IP blocked from HackForums. This is to prevent account bruteforcing and ensure account safety. To read Omniscient's detailed thread about this new security, click the following link: [url=http://goo.gl/FCA7Z]http://goo.gl/FCA7Z[/url]\n\n[b]Account recovery[/b]\nAs most of you know Factor8 is HF's most recent admin. Omniscient recently announced that Factor8 will be in charge of stolen/lost accounts. All questions or comments are to be PMed to Factor8 himself, or via the contact forum. To view Omniscient's tweet regarding this change click the following link: [url=http://goo.gl/sHf1N]http://goo.gl/sHf1N[/url]\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=300616][color=#0066FF][b]Thoth[/b][/color][/url] has been rep fucked because he made three threads asking for positive reputation.\n[url=http://hackforums.net/member.php?action=profile&uid=667183][b][color=#0066FF]ß|Λcksí-íΛdΘw™[/color][/b][/url] has reached 1,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=690470][color=black][b]Evil.[/b][/color][/url] has been banned and rep fucked for swatting members.\n[url=http://hackforums.net/member.php?action=profile&uid=427899][color=black][b]iZan[/b][/color][/url] has been permanently banned for attempting to steal HF accounts.\n[url=http://hackforums.net/member.php?action=profile&uid=333869][color=black][b]Fanatic[/b][/color][/url] has been banned and rep fucked for supporting Cataclysm and giving mfjc a positive reputation on his new account.\n[url=http://hackforums.net/member.php?action=profile&uid=148750][color=black][b]Rowdy[/b][/color][/url] has been banned and rep fucked because he was reselling for mfjc.\n[url=http://hackforums.net/member.php?action=profile&uid=398532][color=black][b]Skirex[/b][/color][/url] requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=black][b]Vitani's Mate[/b][/color][/url] requested to be banned while on vacation.\n[url=hthttp://hackforums.net/member.php?action=profile&uid=468670][color=black][b]Mr.Lazy[/b][/color][/url] requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=132486][color=black][b]420[/b][/color][/url] requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=1021197][color=black][b]mfjc[/b][/color][/url] has been rep fucked and placed into the dead account group because he DOS attacked HF with 42,000 page views and then he reversed all payments he made to Omniscient. Because of this, he is now receiving Omniscient's full wrath.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]MFJC Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2232752]MFJC Sales Banned[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] - Through all of the problems caused by MFJC, Omniscient made a thread announcing that he is done with the site, and all of his products are banned.\n\n[i][b]Game Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2232455]Community Playnight [HF vs Respawn] SIGN UP![/url] - [url=http://hackforums.net/member.php?action=profile&uid=946680][color=white][b]Ignite.[/b][/color][/url] - Respawn will be hosting a weekly event where members can come and play against the Respawn team on the game of their choice. At the moment, it looks like MW3 will be the usual.\n\n[i][b]Mental Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2230404][BELIEVE] The Power Of The Mind [YOU CAN ACHIEVE][/url] - [url=http://hackforums.net/member.php?action=profile&uid=813594][color=#FFCC00][b]Compose[/b][/color][/url] - For those of you who believe in the power of the mind, this thread may be a good way for you to understand what you can do and further your own capabilities.\n\n[i][b]Crypter Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2221235]NG CRYPTER ♜ PURE ASM ♜ MOST ADVANCED CRYPTER ON HACKFORUMS ♜ ~Creators of iCrypt[/url] - [url=http://hackforums.net/member.php?action=profile&uid=744040][color=#0066FF][b]ASM[/b][/color][/url] - While yes, this is a sales thread, it is also to note a breakthrough in crypting technology. This crypt is unbelievably small and still has the crypting power of a horse. See for yourself!\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Astonish is NJ[/font][/size][/color][spoiler=]\n[b][color=white]Paradise.[/color][/b]: Hey, Astonish is NJ! Great to have this interview with you. Glad you could take the time to have it with me as well.\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I am happy to be here today.\n\n[b][color=white]Paradise.[/color][/b]: Same with me. It's actually quite an honor to have this interview with you! Anyways, before we begin; is there anyone you would like to give a shoutout to?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I would first like to give a shoutout to Omni, for making this wonderful site. I would like to also give shoutout to Ignite., McFlurry,Cartel, Xerotic, iNviz, and Factor8. Also all Respawn members who make the group the best it can be :).\n\n[b][color=white]Paradise.[/color][/b]: I agree, it's quite a fantastic site. Imagine that, 200some thousand active members(as said by Omni, we have over a million accounts but he prunes them). Now, your name \"Astonish is NJ\" is quite unique. Never seen you change your username either; how did you get your alias, \"Astonish is NJ\"?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: Well my Xbox gamertag use to be Astonish, I was a WaW Gamebattles star. Well I had to change my gamertag from Astonish as I got ban from GB for a month. I changed it to Astonish is NJ, which means Astonish is New Jersey. New Jersey is where I reside\n\n[b][color=white]Paradise.[/color][/b]: That's cool. Well, uprising the topic of gaming; How is your new group Respawn?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: It currently is working out great.\n\n[b][color=white]Paradise.[/color][/b]: That's great! I'm actually very excited to be a member of Respawn! What do you hope for Respawn? Basically, what do you want to come out of Respawn?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I want Respawn to bring the best gaming to Hack Forums. I also want us to contribute to HF in every aspact. We have such great ideas which Respawn will interact with HF members and bring them together to play with Respawn gamers. We want to be HF's most elite gamers.\n\n[b][color=white]Paradise.[/color][/b]: Yes, only a few weeks after it opened, and the sub-forum is very active, and outgoing. Now, if you could add, change or remove one thing from Hack Forums - What would it be?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I would add more Staff/Mentors. Even know the current Staff/Mentors do a great job, I just think we need more. I would change the whole group system, by not allowing people not to apply via the User groups control pannels. I would remove the whole Suggestion section as they just generate stupid un-needed suggestions.\n\n[b][color=white]Paradise.[/color][/b]: I completely agree, especially with the suggestions statement. Some of the suggestions are completely absurd, and not even related to Hack Forums. Which uprises the topic; How do you think Hack Forums is in general as a community? How do you think it could improve?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I think Hack Forums is a grear general community, with full of great caring members. Although there is always those bunch, most are so nice and caring members. I think it could improve by just getting rid of the trolls, as there are that many there are still a few that troll every member at some point or another.\n\n[b][color=white]Paradise.[/color][/b]: Yes, I think if we could get rid of trolls - life would be good. Even though sometimes it's funny, there's a time and a place for trolling. Now, with a lot of major updates and changes happening now and in the future such as; RATs Crew being removed, Introduction area removed, Vouch System, P0W3R, etc... What do you think about all that?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I think everything Omni does is in the best intrest of HF. I really like all the updates. They are all great\n\n[b][color=white]Paradise.[/color][/b]: So, Astonish. You're quite the gamer I've noticed within Respawn - Including that, what are some other hobbies you like to do outside of Hack Forums?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I play hockey, I really love to play hockey. I also collect Air Jordans and I love to hang out with friends and girls. :)\n\n[b][color=white]Paradise.[/color][/b]: Ooooh. Astonish is aPlayer? Haha, I'm kidding. You are officially a thug for wearing Jordans. Now, where do you see yourself in 5 years related to Hack Forums or outside of Hack Forums?\n[b][color=#1466FF]Astonish is NJ[/color][/b]: I can not predict what will happen in 5 years. I hope I am still here, but only time can tell right?\n\n[b][color=white]Paradise.[/color][/b]: Alright, Astonish. I think I talked about everything I wanted to talk about today. Feel free to wrap up this interview!\n[b][color=#1466FF]Astonish is NJ[/color][/b]:Thanks so much for this chance. I would like to thank HF for making it where it is today. I would like to thank Respawn members for making it where it is today. Thanks so much guys.\n[/spoiler]",
      "subject": "[2/22/12] - HF News"
    },
    {
      "pid": "20194435",
      "uid": "515249",
      "dateline": "1329974622",
      "message": "[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - VipVince[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]:  Hey VipVince! Thanks for taking the time out for this interview! Before we begin, would you like to give any shoutouts to special members?\n[b][color=#1466ff]VipVince[/color][/b]: I would like to give a shout out to those members who make Hackforums what it is and stay true to its name and the original purpose of its being. The guys that take time to now only learn the craft's but are willing to sit down and share their learned knowledge and pass it down to the people less aware than them via detailed and well structured tutorials. Without these users the hacking section would not evolve and would be riddled with \"how do i\" kind of threads. The members who I would like to give a shout out to are ZeroFreak, Hooded Robin, Cheatson, Downfall, Techie, Benzi, .Mx, HaXor, 3k1yp2, ZeroPwn, and Team INTRA as a whole. Keep up the good work guys.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  That looks like a great list! I see you mentioned Team INTRA and I’d like to ask you about that in a bit. To start us off, why is your name VipVince?\n[b][color=#1466ff]VipVince[/color][/b]: There really is no big story to my name. My first name is not actually Vince. It is kind of an alter ego. I think I got the idea from billionaire Wrestling owner Vince McMahon lol. I just found it catchy and had no idea I would be using it for as long as I have been but it worked and it has stuck so as they say if its not broke do not fix it :P.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Sneaky! I wouldn’t have expected an alter ego, Superman.  I see you have the drunk award, why is that? What's the backstory of that night?\n[b][color=#1466ff]VipVince[/color][/b]: My drunk award does not come from one night more like a series of drunken times and months. I have worked 3 summer seasons since I was 18 in the crazy, sunny party island that is Ibiza in San Antonio Spain. This would be an accumulation of 5 straight months May to October getting drunk and bugging tourists on their holidays lol. The actual award came from Ibruteforce. I posted some of my pics of one of my seasons in Ibiza and he just happened to view the thread and awarded me the drunk award for my antics.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  Sounds like a great time! I suppose hardwork never goes unrewarded. I would really like to know about this Team INTRA. What is Team INTRA?\n[b][color=#1466ff]VipVince[/color][/b]: Team INTRA is a forced to be reckoned with on the web. Relatively new but what it lacks in time it has made up for with achievements. It is a close knit group. Trust is a big thing. Due to the sensitivity and importance of some of the shares made within the group it is key to ensure that there is no leakers. Members are not permitted to register without being closely evaluated and sent quite an extensive set of questions in regards to computer security. Sky-net is a dedicated admin and works hard to ensure the team stays active. We have talented members freshly joining the team and I sense there will be plenty more achievements and news made by Team INTRA in 2012. Watch this space...\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  It sounds like a great community! Reminds me of some secret club, possibly the Dark Brotherhood? You seem to be very active in Website and Forum Hacking - What inspired you activity there?\n[b][color=#1466ff]VipVince[/color][/b]: I have always been inspired by computer security. I do not like the term hacking. I see it as an endless way to flex the imagination. Its like giving us paints and a brush and the internet being our canvas. It is down to us just how good a picture we paint and how much recognition we get for our work. Also there is so many different methods and things to learn that no body is ever able to sit back and be like \"I reached perfection, I am at the top of my game\", learning is a never ending process and yes it does get frustrating at times but the reward of being able to pull of certain tasks that you spent days and weeks trying to get your brain around is worth it in the end. I believe hacking and hackers are a crazy misconception in society. I see 'normal' people on my Facebook putting up statuses like \"watch out for the hackers they are praying on profiles\" and I think \"would they class me a hacker if they were aware of my alter ego VipVince?\". We are not guys that sit in the dark with pimples and glasses from morning noon and night. I actually enjoy it though, I like being part of something most people do not understand.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  I think those who aren’t familiar with the internet fear it. Hackers have shown their potential in the recent months and that has thrown up flags for people everywhere. This has caused inspiration and fear in different people.  What advice do you have for people that would like to start hacking websites and forums?\n[b][color=#1466ff]VipVince[/color][/b]: If you are serious about computer security then go about it the right way. Short cuts do not exist were learning is involved. You can cheat a test at school to get temporary good grades but really you have not grasped the concept of learning the fundamentals of that subject. Same applys to hacking if you want to show off on Facebook to your friends sure download a nice DOS tool with a 'scary' looking GUI post a pic of it on your wall and wait for the people who have no idea to call you a 'big shot'. \n\nA fraction of us though are prepared to dedicate the time and effort, it is not hard to distinguish the enthusiasts and those willing to learn who actually have a career ahead of them in the computer industry as opposed to the guys just wanting to make a quick buck via scams etc. I would definitely recommend getting familiar with coding. Learn about methods, modules, variables. All that. It makes the 'jibberish' make sense further down the road. A hacker who ignores the programming aspect to computers is a bit like the Kimbo Slice of martial arts. Sure he can throw hands in a street fight but when shit hits the fans he has no submissions, no cardio, his box of tricks is limited. If you want to be serious learn about programming, the architecture of the database, server, client, browser. Everything.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That’s great advice right there.  If you could change one thing about Hack Forums, what would it be and why?\n[b][color=#1466ff]VipVince[/color][/b]: Probably the rep system. It is unjust in my opinion. People get really worked up by it. I got a -3 negative today cause I had a certain plugin or something on my browser that another user did not like. Which is fine I do not get mad about things like that. However I just find rep as an unfair representation of users. If I made a HF account and spent hours and hours out of my day sharing priceless information I would still get less rep than if I made an account pretending to be a chick and putting up some skanky pictures. The rep system is run on testeratone not work ethnic. It is the immature users weapon when he has lost his case and has run out of words. I do not get mad by it but I just feel there is a lot of users on here who do not get the credit they deserve. While lounge whores get too much credit.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I agree completely, as I assume many of the females on Hack Forums do. Thank you so much Vince! Do you have any final words for the viewers?\n[b][color=#1466ff]VipVince[/color][/b]: I am not going to have a clique exit with a \"keep it real\" kind of statement. However just keep making the most of your talent's. To those of you still in school do not underestimate the power of education. Whatever field of skills you possess in this life there is no limit to how good you can get. I believe the key to life is figuring out your purpose, being able to expose a certain talent and making something of it rather than leading an empty life of never really being able to figure out what it was you were good at. Much love.\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Flaw in Neutrino Speed Calculations[/b][/color]\nRecently, researches have found a flaw in the theory that neutrinos are faster than the speed of light.  Physicist Albert Einsteins claimed that the speed of light is the fastest speed out there which caused much skepticism when this news first came out.  Scientists for the European Organization for Nuclear research say that they will not know the exact measurements until further testing done later this year.\n\n[color=white][b]Jennifer Aniston Gets a Star[/b][/color]\nActress Jennifer Aniston was given a star on the Hollywood walk of fame recently.  She was the first member from the 'Friends' television show to earn their own star.  Aniston was accompanied at the ceremony by her father, boyfriend, Adam Sandler, and many others.\n\n[color=white][b]Rihanna and Brown Back Together[/b][/color]\nAfter beating her up three years ago, Brown can now be heard on Rihanna's \"Birthday Cake\" remix which was released Monday.  Chris raps about wanting to \"f***\" her and \"give it to her in the worst way,\" in the new release of the song.  You can also hear Rihanna's voice featured in Brown's remix of \"Turn Up the Music\" which was released Monday.  While many were happy for her, many others were disappointed, renouncing their respect for her.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[color=white][size=large][b]Apple:[/b][/size][/color]\n[color=white][b]iPad 3[/b][/color]\nThe iPad 3 has been supposedly photographed by MacRumors(macrumors.com) apparently they have obtained an iPad 3 display and have measured it and have put it under a microscope and found it that it has retina display. Also, many more pictures and measurements have been brought up and now there is strong evidence that the iPad 3 will be a larger iPad and will maybe sport a retina display. No one knows for sure, for all we know this could be a fake.. The iPad 3 is said to be set to release on March 23 in China.\n\n[color=white][b]iPhone 5[/b][/color]\nRumors have started to come in about the iPhone 5. A little is known about it, but it could have a larger screen and maybe slimmer design. Some are saying it will have a quad-core processor and 4G capability. Apple might not go with 4G because it’s not nationwide yet. It’s not everywhere for Apple to include it. Qualcomm is working on a chip that will work on both 3G and 4G, we might see this on the new iPhone which is said to be released in Fall 2012.\n\n[color=white][b]OSX Mountain Lion[/b][/color]\nOSX Lion was a revolutionary product. It was released last year by Apple and it changed operating systems. About a week to two weeks ago, Apple suddenly released OSX Mountain Lion. Mountain Lion is set to be a elegant combination of iOS and OSX. ML (Mountain Lion) has many features that we have seen on the iPad. Things like Game Center, Messages, and Notification Center have made their way onto ML (Mountain Lion).\n\n[color=white][size=large][b]Other:[/b][/size][/color]\n[color=white][b]Microsoft Word[/b][/color]\nPictures have surfaced of Microsoft Office on an iPad. Reports have said there might be a delay in the release but maybe not. Microsoft also made an update to their Cloud Drive which is an iCloud like software (cloudware). Microsoft also is still working on Windows 8. Windows 8 is set to be released in Fall 2012 also.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]Pitbull[/b][/color]\nThe upcoming Pitbull concert, \"Carnaval De Salvador\" is recieving a lot of hype. It's located in Salvador, Brazil and will take place on Tuesday February 21st, 2012.\n\n[color=white][b]Skrillex[/b][/color]\nSkrillex, the famous dubstep artist has his fans excited with the upcoming release of his new album \"Voltage.\" It is said to be released on February 27th, 2012.\n\n[color=white][b]Adele[/b][/color]\nAdele's early 2011 song, \"Set Fire To The Rain\" is becoming viral and is currently number two on the billboards.\n\n[color=white][b]Katy Perry[/b][/color]\nThis popular pop artist released a new song recently titled \"Part of Me\". She stated that all profits from this song will be donated to charity.\n\n[color=white][b]Music Videos of the Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=CdXesX6mYUE[/yt]\n[yt]http://www.youtube.com/watch?v=YJVmu6yttiw[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nPeople often see procrastination has a horrible thing, something that must be eradicated and eliminated from every working individual. In my own personal opinion, I see it as both beneficial and detrimental. Beneficial in the sense that when you procrastinate, you are taking the time that you want and need for yourself. I have also seen it work well for those who thrive under pressure, I myself work the best when something is due the next day. Like with most of my essays, I slowly gather what I need and procrastinate, but then the night before it is due, I slam it out and it's the best thing I've ever written. Yet it can be detrimental for those who don't work well under stress, and it can literally destroy their abilities. I say that we don't hate procrastination, as it's a necessary tool in our arsenal, but we let it be, and let the person figure out their own place on it.",
      "subject": "*"
    },
    {
      "pid": "20194451",
      "uid": "515249",
      "dateline": "1329974681",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\r\n\n\"What's your opinion of Factor8?\"\r\n\n[i]\"Factor8 is an extremely great asset to Hackforums. Whenever\r\n I needed an expensive deal completed over the years, he was the\r\n only middleman in my mind as I knew my money was safe. I don't \r\n think any of those deals ever went through (other side backs out or\r\n can't complete) so he would just refund me without any hassle. The \r\n guy has strong opinions against the people who build up a fake \r\n appearance of trust to screw other people over - be quiet, be fair,\r\n be honest - this guy gets it.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=121256][i]-mrwhich[/i][/url]\r\n\n[align=right][i]\"I admire Factor8. I'm not trying to be a kiss ass, but that \r\nguy does his job well as a staff member. He's even caught me for Low \r\nQuality posting twice... He's also been a staff member for as long as I \r\ncan remember. Much respect goes out to him from me.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=187420][i]-iDuL[/i][/url][/align]\r\n\n[i]\"Factor8 was the first staff member i ever contacted since i joined \r\nHackForums. I wanted him to remove for me a thread i made. He \r\nresponded immediately! He sent me a pm saying that he will remove \r\nthe thread! So he did! Since then, whenever i had a problem or i \r\nwanted to ask something i contacted Factor8! I think he is one of \r\nthe most helpful members, not only staff! He does his job right! In \r\nmy opinion, he is very cool member and he always attracts the \r\nattention on a thread! I would love to talk to him sometime, because \r\ni know i will have great time :D\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=581766][i]-Creador[/i][/url]\r\n\nThe topic for next week is \"What do you think of Hack Forums' theme?\"\r\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\r\n\n[hr]\r\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\r\n[align=center][img]http://i.imgur.com/Izgo2.png[/img][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\r\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/2825984_460s.jpg[/img][/spoiler][/align]\r\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/2833275_460s.jpg[/img][/spoiler][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\r\n[align=center]\r\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\r\n[video=youtube]http://www.youtube.com/watch?v=GK2sN8lzchw[/video][/align]\r\n\n[spoiler=[i][b]Written topics[/b][/i]]\r\n[b]Leadership Changes[/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=946680][color=white][b]Ignite.[/b][/color][/url] is now the leader of [i]Respawn[/i].\r\n\n[b]Awards[/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=770060][b][color=#0066FF]Invisus[/color][/b][/url] received the [i]Master Donator[/i] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=770060][b][color=#0066FF]Invisus[/color][/b][/url] received the [i]FPS Gawd[/i] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=964299][color=white][b]Purple Haze[/b][/color][/url] received the [i]Fish Err Man[/i] award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=355307][color=white][b]Chocothunda[/b][/color][/url] received the [i]Gamer[/i] award.\r\n[/spoiler]\r\n\n[hr]\r\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\r\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\r\n[list][*]Headlines[/list][/list]\r\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions[/list][/list]\r\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\r\n[list][*]World News[/list][/list]\r\n[list][*][url=http://goo.gl/WeMMO]ReactioNz[/url]\r\n[list][*]User News[/list][/list]\r\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\r\n[list][*]Tech News[/list][/list]\r\n[list][*][url=http://goo.gl/xZk3T]Purple Haze[/url]\r\n[list][*]Music News[/list][/list][/list]\r\n[list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*][url=http://goo.gl/piymJ]Paradise.[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WeMMO]ReactioNz[/url]\r\n[/list]\r\n[/list]\r\n",
      "subject": "*"
    }
  ]
}