{
  "posts": [
    {
      "pid": "62848006",
      "uid": "2331053",
      "dateline": "1760372944",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/3-gray.png[/img]\n\n[b][size=xx-large][color=#ffffff][u]Hack Forum News - Edition 18[/u][/color][/size][/b]\n\n[b]Welcome back to the Hack Forum News. Where we keep you up to date on the weekly events and news happening on site and around the world. If you have never heard of the Hack Forum News, don't worry, we have you covered. We are a team of members from the Hack Forums community who are journalists and writers, and we are here to keep you in the loop of the changes around the site and the events happening around the world.[/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/headlines-red.png[/img]\n[size=medium]Writer -[/size] [mention=2331053]\n\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6309469][color=#ffffff]OctoberFest 2025[/color][/url][/size][/b][/u] By [mention=1]\n\nOctoberfest is underway! We have seen a massive increase of activity across the site and, with the event, [mention=1] has announced a giveaway that includes over $2000 worth of prizes to be won. And the award for this year's event has been released, and a few members have already managed to get it twice. If you haven't seen this yet, then it's worth checking out and seeing what prizes are up for grabs this year, and you might even get lucky and get yourself a free $500.\n\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6299866][color=#ffffff]Hack Forums News Team - Become a Writer[/color][/url][/size][/b][/u] By [mention=2331053]\n\nAre you looking to join the HF news team? Do you enjoy making threads or even want to become a better writer? Well, we are looking for members of the site to help write each week and are looking for anyone who has any interest. We have a few new sections opening up right now, and we would love for you to see if they would be anything of interest to you. If you are interested, please check out the thread or contact [mention=2331053] to discuss joining the team behind the HF News.\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/statistics-magenta.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[img=800x400]https://i.gyazo.com/050abd1f6d723caf5c41c53cc651e29f.png[/img]\n\n[b]Last Week:[/b]\n[spoiler][img=800x400]https://i.gyazo.com/15892f17b50c8ebf1c5c2984317f5982.png[/img][/spoiler]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/awards-yellow.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n[color=#ffffff]\n\n[b]\n[mention=5252466] Has obtained the \"Medal of Honor\" award - [award=117]\n[mention=50] Has obtained the \"King Decade\" award - [award=194]\n[mention=2370822] Has obtained the \"Quickly Loved\" award - [award=146]\n[mention=2017813] Has obtained the \"Stanley Fan\" award - [award=230]\n[mention=4273612] Has obtained the \"Octoberfest 2025\" award - [award=231]\n[mention=1131394] Has obtained the \"King Decade\" award - [award=194]\n[/color][/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/notable.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=5655318]\n\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310352]The Academy Octoberfest Award Progress Tracker[/url][/color][/size][/b][/u] - [b]by [mention=123]  [/b]\n\nOctoberfest vibes are in full swing, and @Charlie Sheen@ delivered the perfect utility for the season, a Tampermonkey script that tracks your October posts and threads in real time. With a clean UI, auto-refresh, and Halloween-themed flair, it's the easiest way to monitor your award progress without lifting a finger. An awesome example of coding meets community spirit.\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310504][The Academy] HACKFORUMS DASH: Complete API Dashboard & Automation Platform[/url][/color][/size][/b][/u] - [b]by [mention=5680404] [/b]\n\n[mention=5680404] launched a game changer - *HackForums Dash*, a full API-based dashboard that gives users total control over their HF accounts. From managing bytes and auto-bumping threads to checking contracts and ratings, it's built with security in mind using .official HF API. A sleek, modern automation suite for power users that pushes the forum’s ecosystem forward in a big way.\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310256]You find $1,000,000 — What are you going to do?[/url][/color][/size][/b][/u] - [b]by [mention=5699805] [/b]\n\nAn intriguing hypothetical sparked by [mention=5699805] what if you literally found a million dollars buried in your backyard? The thread's already filling up with wild takes, from responsible investing to disappearing acts. A classic HF-style mix of imagination, humor, and practical chaos.\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310306]How do you start your Day?[/url][/color][/size][/b][/u] - [b]by [mention=5447855] [/b]\n\nSometimes the simplest threads make for the best reads. A discussion opened up about morning routines and rituals, asking how members set the tone for their day. From gym sessions and coffee habits to coding sprints and meditation, it's a wholesome look at how HF starts its mornings.\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310535]Craziest thing that happened on HF?[/url][/color][/size][/b][/u] - [b]by [mention=5595387] [/b]\n\nEvery old-timer on HF has a story or two. From legendary bans to wild exploits and real-life drama, this thread is turning into a living archive of HF lore. If you missed some of the forum's craziest moments, this is your chance to catch up.\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310664][Quantum]My journey building a tool for doomscrolling awareness + Facebook post analysis[/url][/color][/size][/b][/u] - [b]by [mention=5655318] [/b]\n\nIt might feel a bit weird to add one of my own, but I shared a personal journey creating a Chrome extension to combat doomscrolling and analyze Facebook posts. What began as a response to dark algorithmic loops turned into a tool for emotional awareness. A raw, thoughtful post that blends mental health awareness with serious tech craft.\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/groups-yellow.png[/img]\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\n\n[b][u]GROUPS FOR SALE AND SOLD[/u][/b]\n\n[url=https://hackforums.net/showthread.php?tid=6241882]Succubus group[/url] is still listed for sale by [mention=3604010]\n[url=https://hackforums.net/showthread.php?tid=6302394]Olympians group & Benevolence [/url] are listed for sale by [mention=1342286]\n\n[url=https://hackforums.net/showthread.php?tid=6304410]Mystery Inc[/url] listed for sale by [mention=3909991]\n\nCasino has been sold to [mention=2650469]\n\n\n[B][u]RECENT GROUP CHANGES & EVENTS[/u][/B]\n\nNo reported changes this week.\n\n[b][size=large][u]RECRUITMENTS:[/u][/size][/b]\n\n[url=https://hackforums.net/showthread.php?tid=6298855]Casino Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6226725]Pink LSZ Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6304113]Warriors Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6275486]Gamblers Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6294522]Legends Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6046141]Allegiance Buy-in[/url]\n[url=https://hackforums.net/showthread.php?tid=6295130]Olympians leader recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6300585]The Academy Recruitment [/url]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/music-header.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\nRecently we introduced a brand-new section to the HF News. This section will grow over time to more things, but for now we are just going to be doing Song of the week. We are open to what more we could bring to the section from your suggestions, but as a start, we feel adding the song of the week will be a great start for the section and lead the way forward for more things in the future.\n\nNow we know some of you may question what the song of the week is all about, and we have thought of what a great answer. We feel like the song of the week should be a meaningful song that goes deeper than just general music and has meaning to it all. Granted, we may have a little fun with it sometimes. (Yes, we will have a Halloween version and Christmas version too.) But we want to keep it at a level where we have found the song has a true message behind it all and not just something that everyone will just see as another song that is just a bit catchy or got a good few beats to it. We hope this helps those with that question and if anyone has anything that they wish to ask, please feel free to add them below. We are more than happy to give the reason behind it.\n\nThis weeks Song Of The Week:\n[video=youtube]https://youtu.be/oKsxPW6i3pM[/video]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/contests.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310206]\n$100 Crypto Contest - Celebrating my entrance to Quantum[/url] By [mention=5655318] [/color][/size][/b][/u]\n\nA new contest has been created this week by Oh_Well . He is celebrating hi entrance to the new group Quantum by giving away $100. Make sure to enter!\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6310576]$49 GIVEAWAY[/Url] by [mention=5701814] [/color][/size][/b][/u]\n\nA quick little giveaway hosted by jails . All you do is make a post and you're entered!\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/tech-brown.png[/img]\n[size=medium][b]Writer - [/b][/size]  [mention=5465469]\n\n[u][b][size=large][color=#ffffff]“Qilin” ransomware gang claims hack on Japan’s Asahi Group[/color][/size][/b][/u]  \nRansomware group *Qilin* claims, that it breached Asahi Group Holdings, stealing 9,300+ files (~27 GB) and disrupting brewery operations.  \n[b][url=https://www.reuters.com/world/asia-pacific/cybercriminals-claim-hack-japans-asahi-group-2025-10-07/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]CL0P linked hackers exploit Oracle EBS zero-day to breach dozens of organizations[/color][/size][/b][/u]  \nA new campaign exploiting a zero-day (CVE-2025-61882) in Oracle’s E-Business Suite has allowed attackers to exfiltrate data from numerous organizations.  \n[b][url=https://thehackernews.com/2025/10/cl0p-linked-hackers-breach-dozens-of.html]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Nintendo allegedly hacked and results in production & dev files exposed[/color][/size][/b][/u]  \nThe group *Crimson Collective* claims to have accessed internal Nintendo assets, developer backups, and production files. Nintendo has not confirmed the breach yet.  \n[b][url=https://www.tomshardware.com/tech-industry/cyber-security/nintendo-allegedly-hacked-by-crimson-collective-hacking-group-screenshot-shows-leaked-folders-production-assets-developer-files-and-backups]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Healthcare cyberattacks disrupt patient care, revealing systemic risk[/color][/size][/b][/u]  \nA recent study shows 93% of U.S. healthcare orgs faced cyberattacks in the past year, 72% of those incidents disrupted patient care which further caused delays in critical services.  \n[b][url=https://www.helpnetsecurity.com/2025/10/13/report-cyberattacks-disrupt-patient-care/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]CISA adds new actively exploited vulnerability to KEV catalog[/color][/size][/b][/u]  \nCISA has added a recently discovered vulnerability to its “Known Exploited Vulnerabilities” (KEV) catalog based on evidence of active exploitation.  \n[b][url=https://www.cisa.gov/news-events/alerts/2025/10/07/cisa-adds-one-known-exploited-vulnerability-catalog]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Netgear rolls out enterprise grade security for SMEs via Exium acquisition[/color][/size][/b][/u]  \nNetgear launches a new security platform for small to mid-sized enterprises (SMEs) and managed service providers (MSPs), merging firewall, ZTNA, SWG, and SASE features.  \n[b][url=https://www.avnetwork.com/news/netgear-introduces-enterprise-grade-security]Source[/url][/b]\n\n[/align]",
      "subject": "Hack Forum News - Edition 18"
    },
    {
      "pid": "62848022",
      "uid": "2331053",
      "dateline": "1760373820",
      "message": "[align=center]\n\n[img]https://hackforums.net/images/hfnews/spec-ops.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=5550319]\n\n[u][b][color=#FF4136]Security Research Digest[/color][/b][/u]\n\n[color=#FF4136][b]PoC Exploit Released for Sudo Vulnerability that Enables Attackers to Gain Root Access[/b][/color]\n\nA publicly available proof-of-concept (PoC) exploit has been released for CVE-2025-32463, a local privilege escalation (LPE) flaw in the Sudo utility that can grant root access under specific configurations. \n\nSecurity researcher Rich Mirch is credited with identifying the weakness, while a functional PoC and usage guide have been published in an open GitHub repository, accelerating the urgency for patching across Linux environments that rely on Sudo’s chroot functionality. \n\nAccording to the project documentation, versions 1.9.14 through 1.9.17 are vulnerable, with fixes available in 1.9.17p1 and later. Systems running legacy builds prior to 1.9.14 are not impacted because the chroot feature did not exist in those releases.\n\nRead more - https://cybersecuritynews.com/poc-exploit-sudo-vulnerability/\n\n[color=#FF4136][b]Attackers Actively Exploiting Critical Vulnerability in Service Finder Bookings Plugin[/b][/color]\n\nAnalysis of the plugin’s source code shows that it implements account reversion through the service_finder_switch_back() function, which restores a user session based on the original_user_id cookie value.\n\n[code]function service_finder_switch_back() {\n    if (isset($_COOKIE['original_user_id'])) {\n        $original_user_id = intval($_COOKIE['original_user_id']);\n        if (get_userdata($original_user_id)) {\n            // Switch back to the original user\n            wp_set_current_user($original_user_id);\n            wp_set_auth_cookie($original_user_id);[/code]\n\n\nHowever, this mechanism is critically flawed. The switch-back process relies solely on user-supplied cookie data and fails to perform any authentication or authorization validation before reassigning the session.\n\nThis oversight allows unauthenticated attackers to arbitrarily set the original_user_id cookie and impersonate any valid user account—including administrative users. Successful exploitation can result in full compromise of the affected WordPress instance, granting adversaries control over site content, user data, and potentially enabling further post-exploitation activities such as malware injection or privilege escalation\n\nRead more - https://www.wordfence.com/blog/2025/10/attackers-actively-exploiting-critical-vulnerability-in-service-finder-bookings-plugin/\n\n[b][color=#FF4136]Villager — AI-native pen-testing framework[/color][u][/u][/b]\n\nDeepSeek v3–powered tool from a China-based red-team project (Cyberspike), distributed on PyPI. Villager automates multi-stage operations using containerized Kali toolsets, browser automation, a large prompt-driven vulnerability DB, and AI orchestration. Reported downloads: ~10k since July.\nTechnical detail: Villager orchestrates attack workflows by spinning ephemeral containerized Kali instances and invoking existing toolchains (nmap, nikto, proxy injectors, browser automation) from a prompt-decision loop. Its DeepSeek integration provides semantic vulnerability matching (natural-language mapping from target output to exploit module), while the 4k+ prompt corpus drives adaptive tool selection and parameterization. Persistence options are implemented as modular post-exploitation playbooks that combine shell implants, scheduled jobs, and lateral-movement primitives — all coordinated through an AI task planner.\nSource: https://www.itpro.com/technology/artificial-intelligence/this-deepseek-powered-pen-testing-tool-could-be-a-cobalt-strike-successor-and-hackers-have-downloaded-it-10-000-times-since-july\n[b]\n[color=#FF4136]Mic-E-Mouse — optical-sensor side channel that reconstructs speech[/color][/b]\n\nHigh-performance optical mouse sensors capture microscopic desk vibrations; processing can reconstruct spoken audio from those signals.\nTechnical detail: The attack chain samples raw sensor deltas at device polling rates, applies denoising and band-pass filtering, then resamples to audio frequencies for STFT/spectrogram analysis. A learned model (encoder-decoder or spectrogram-to-waveform network) maps sensor-derived spectrograms to intelligible audio. Signal isolation leverages multiple capture windows and correlation with expected desk modal responses to recover speech-form signals from otherwise noisy micro-vibrations.\nSource: https://cybersecuritynews.com/mic-e-mouse-attack/\n[b]\n[color=#FF4136]Spyloud — analysis of “Asgard Protector” crypter[/color][/b]\n\nDetailed breakdown of packing, obfuscation, and evasion techniques used by Asgard Protector; useful for detection engineering and telemetry hunting.\nTechnical detail: The analysis outlines a layered runtime: small stub + obfuscated loader → encrypted payload blob → runtime unpacker that resolves APIs dynamically and applies in-memory decryption. Evade techniques include API hashing, import-table erasure, custom stack-based decode loops, and optional anti-emulation checks. The report surfaces YARA-friendly artifacts (specific decoder routines and encrypted blob headers) useful for behavioral detection and telemetry correlation.\nSource: https://spycloud.com/blog/asgard-protector-crypter-analysis/\n[b]\n[color=#FF4136]CVE-2025-49844 — RediShell (Redis)[/color][/b]\n\nUse-after-free in Redis’ embedded Lua interpreter enables post-auth escape of the Lua sandbox and arbitrary native code execution via crafted EVAL/EVALSHA payloads. Roots trace back ~13 years in the codebase.\nTechnical detail: Analysis indicates the UAF occurs in the lifecycle management of internal Lua objects allocated by the embedded interpreter (C-level userdata / VM structures). A crafted sequence of API calls forces a dangling reference after a free of a VM object; subsequent interpreter operations reuse the freed memory, enabling an attacker-controlled write/read primitive. Exploits chain this memory corruption into a native code invocation path (e.g., hijacked function pointers or controlled return addresses) within the redis-server process.\nSource: https://www.wiz.io/blog/wiz-research-redis-rce-cve-2025-49844\n[b]\n[color=#FF4136]CVE-2025-61984 — OpenSSH ProxyCommand command injection[/color][/b]\n\nCommand-injection in ProxyCommand handling when fed specially crafted usernames; bypasses earlier mitigation for CVE-2023-51385 and can lead to remote command execution in proxy helper contexts.\nTechnical detail: The flaw arises where username-derived strings are interpolated into a shell-invoked proxy helper (instances of sh -c or similar). If expansions or control bytes in the username are not sanitized before forming the ProxyCommand invocation, shell metacharacters can terminate or extend the intended command line, injecting attacker-controlled tokens. The bug is specifically notable in setups that use shell wrappers rather than direct exec calls for proxy helpers.\nSource: https://cybersecuritynews.com/openssh-vulnerability-proxycommand/\n[b]\n[color=#FF4136]CVE-2025-61882 — Oracle E-Business Suite[/b]\n\n[/color]Leaked exploit scripts (server.py + exp.py) coerce Oracle EBS into fetching attacker payloads via an encoded return_url (numeric HTML entities), chaining SSRF and additional flaws into RCE. Leak posted to Telegram; public weaponization observed.\nTechnical detail: exp.py crafts a request whose return_url is encoded with numeric HTML entities (e.g., http…) so that the server-side decoder reconstructs the URL and performs an HTTP fetch. The initial SSRF is used to retrieve payloads that exploit downstream parsing or deserialization flaws inside EBS components; server.py serves specially formatted payloads or staged binaries to provoke execution. The chain relies on multiple small input-handling weaknesses to progress from SSRF to code execution.\nSource: https://www.helpnetsecurity.com/2025/10/07/leaked-oracle-ebs-exploit-attacks-cve-2025-61882/\n\nNotable [color=#FF4136]CVEs [/color]— Technical Notes\n[color=#FF4136]\nCVE-2025-11356[/color] — Tenda AC23 (/goform/SetStaticRouteCfg)\nA vulnerable sscanf parses POST fields into fixed-size stack buffers; oversized numeric/string arguments overflow destination buffers during format-driven writes. Exploit payloads align fields to overwrite saved frame/return pointers or adjacent function pointers, enabling stack-smash ROP or return-to-libc chains. Public PoCs target the POST parsing routine and leverage predictable firmware memory layouts and absent or weak stack protections.\nSource: https://www.exploit-db.com\n[color=#FF4136]\nCVE-2025-11355[/color] — UTT 1250GW (/goform/aspChangeChannel, pvid)\nstrcpy copies the pvid parameter into a fixed buffer without bounds checking; long values overwrite adjacent stack memory (saved registers/return address). The HTTP handler runs with elevated privileges inside firmware, so successful overwrite yields in-process arbitrary code execution. PoCs use deterministic buffer offsets to reliably control the instruction pointer.\nSource: https://nvd.nist.gov\n[color=#FF4136]\nCVE-2025-10162[/color] — WooCommerce OrderConvo (plugin < v14) — Path traversal download\nThe download endpoint concatenates user-supplied filename input into a path and opens it without canonicalization (realpath()/basename()), allowing ../ sequences (or URL-encoded equivalents) to escape the intended directory. Attackers can download configuration files, backups, and other webroot assets via unauthenticated requests.\nSource: https://www.wordfence.com\n[color=#FF4136]\nCVE-2025-11362[/color] — pdfmake — Resource exhaustion via embedded redirect URLs\nThe embedding parser handles nested or repeated redirect entries without loop detection or allocation caps. Crafted documents produce recursive or chained redirects that grow internal structures unbounded (e.g., lists/queues of pending embeds), ultimately exhausting heap memory and causing OOM/crashes. Root cause: missing recursion depth limits and unbounded aggregate allocation when resolving redirect chains.\nSource: https://nvd.nist.gov\n[color=#FF4136]\nCVE-2025-61774[/color] — PyVista / dependency-confusion\nBuild/install scripts use pip --extra-index-url while relying on package names/versions not present on PyPI. If an attacker publishes a higher-versioned package to PyPI with the same name, pip may resolve to the malicious PyPI artifact. Because Python package installation can invoke arbitrary build/install hooks, a malicious package can run code during install, compromising CI or developer hosts.\nSource: https://pypi.org\n[color=#FF4136]\nCVE-2025-6985[/color] — langchain-text-splitters (HTMLSectionSplitter) — XXE via XSLT\nThe component accepts custom XSLT and calls lxml.etree.parse() / lxml.etree.XSLT() without hardened parsing options. In affected lxml versions, external entity resolution and the XSLT document() function can access file:// or remote URIs, enabling stylesheet-driven reads of local files (SSH keys, .env) or cloud metadata endpoints.\nSource: https://github.com/langchain-ai/langchain\n\n[color=#FF4136]CVE-2025-57515 [/color]— Uniclare Student Portal v2 — SQL injection (time-based)\nUnsanitized user input is injected into SQL statements. Attackers use time-delay functions (SLEEP(), pg_sleep(), or heavy BENCHMARK() loops) to infer binary data via response timing, enabling blind extraction of database values even when results are not returned. Several endpoints accept unauthenticated requests in common deployments, facilitating remote blind exfiltration.\nSource: https://www.securityfocus.com\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/comics-magenta.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[b][size=x-large][color=#ffffff]-1-[/color][/size][/b]\n[spoiler][img]https://www.boredpanda.com/blog/wp-content/uploads/2025/09/This-American-Artist-Living-in-Thailand-Creates-Absurdly-Funny-Comics-About-Hedgehogs-Bears-and-Everyday-Life-68c1316c47168__700.jpg[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-2-[/color][/size][/b]\n[spoiler][img]https://i.ytimg.com/vi/BZfKnCQ5zS0/hq720.jpg?sqp=-oaymwEhCK4FEIIDSFryq4qpAxMIARUAAAAAGAElAADIQj0AgKJD&rs=AOn4CLBYgcx22CPW3H5NNX7DWsfPFiE1YA[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-3-[/color][/size][/b]\n[spoiler][img]https://pbs.twimg.com/media/G2mAQ6dWgAAdZSm?format=jpg&name=4096x4096[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-4-[/color][/size][/b]\n[spoiler][img]https://thunderdungeon.com/wp-content/uploads/2025/10/safely-endangered-comic-gallery-featured-image-20251007.jpg[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-5-[/color][/size][/b]\n[spoiler][img]https://i.pinimg.com/474x/90/2a/db/902adbb3f7055649d5b71328fdd65ab5.jpg[/img][/spoiler]\n\n[hr]\n\n[b][size=x-large]A big thank you to all the members who put in the hard workto bring us another edition of HF News this week[/size][/b]\n\n[size=x-large] [mention=2331053] [mention=57618] [mention=3929084] [mention=5465469] [mention=5550319] [mention=5655318] [/size]\n\n[hr]\n\n[b][size=xx-large][u]Support The Team by wearing our signatures[/u][/size][/b]\n\nIf you have enjoyed the read please consider using one of our signatures in any way to support us!\n\n[img]https://hackforums.net/images/hfnews/support-red.png[/img] [img]https://hackforums.net/images/hfnews/support-gray.png[/img]\n[img]https://hackforums.net/images/hfnews/support-magenta.png[/img] [img]https://hackforums.net/images/hfnews/support-brown.png[/img]\n[img]https://hackforums.net/images/hfnews/support-magenta-2.png[/img]\n\n[b][size=xx-large][color=#E82A1F]Red[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-red.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#0074D9]Blue[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-gray.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#2ECC40]Green[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-magenta.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#E86E04]Orange[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-brown.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#B10DC9]Purple[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/forumdisplay.php?fid=2][img]https://hackforums.net/images/hfnews/support-magenta-2.png[/img][/url][/align][/code]\n\n\n[/align]",
      "subject": "RE: Hack Forum News - Edition 18"
    }
  ]
}