{
  "posts": [
    {
      "pid": "62813764",
      "uid": "2331053",
      "dateline": "1756735673",
      "message": "[align=center][img]https://hackforums.net/images/hfnews/w-orange.png[/img]\n\n[b][size=xx-large][color=#ffffff][u]Hack Forum News - Edition 12[/u][/color][/size][/b]\n\n[b]Welcome back to this week's edition with another update on the weekly news happening on site and around the world. If you have never heard of the Hack Forum News, don't worry, we have you covered. We are a team of members from the Hack Forums community who are journalists and writers, and we are here to keep you in the loop of the changes around the site and the events happening around the world.[/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/headlines.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6307040][color=#ffffff]Stanley Fan Award Goal[/color][/url][/size][/b][/u] By [mention=1]\n\nThis week [mention=1] has released a brand new award for everyone to earn. With this new award you will need to make 250 posts that are replies to Stanley's threads. [mention=1337] has been making threads for a while now and with this we can see a massive increase in replies to the threads the [mention=1337] bot is making. Good luck everyone award hunting.\n\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6307025][color=#ffffff]New Sales Tags[/color][/url][/size][/b][/u] By [mention=1]\n\nWith the recent changes to the design of the site, [mention=1] has now started to look into changing the look of the current sales tags used on the site. The thread is looking for feedback from site members to see what they think of the new design made by [mention=776749]\n\n[u][b][size=large][url=https://hackforums.net/showthread.php?tid=6299866][color=#ffffff]Hack Forums News Team - Become a Writer[/color][/url][/size][/b][/u] By [mention=2331053]\n\nAre you looking to join the HF news team? Do you enjoy making threads or even want to become a better writer? Well, we are looking for members of the site to help write each week and are looking for anyone who has any interest. We have a few new sections opening up right now, and we would love for you to see if they would be anything of interest to you. If you are interested, please check out the thread or contact [mention=2331053] to discuss joining the team behind the HF News.\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/statistics-header.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[img=800x400]https://i.gyazo.com/ab621deb502b7670c23e5cdf70852b42.png[/img]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/awards-header.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n[color=#ffffff]\n\n[b]Quick reminder, the donation awards page has had a bit of a change. Some of the classic awards are back up for purchase. If you would like to check out what is new, head over to the donation award page to snipe up some of the awards today.  Or [url=https://hackforums.net/buyawards.php][u]Click Here![/u][/url][/b]\n[b]\n\n[mention=1805852] Has obtained the \"King Decade\" award - [award=194]\n@B FOR BADASS@ Has obtained the \"King Decade\" award - [award=194]\n[mention=2470866] Has obtained the \"King Decade\" award - [award=194]\n@♕ ιηтєℓ ♕@ Has obtained the \"King Decade\" award - [award=194]\n@IG Growth@ Has obtained the \"Dicey\" award - [award=97]\n[mention=2470866] Has obtained the \"Green Apple\" award - [award=78]\n[mention=1618863] Has obtained the \"Stanley Fan\" award - [award=230]\n[mention=5458992] Has obtained the \"Stanley Fan\" award - [award=230]\n\n[/color][/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/groups-header.png[/img]\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\n\n[b][u]GROUPS FOR SALE AND SOLD[/u][/b]\n\n[url=https://hackforums.net/showthread.php?tid=6241882]Succubus group[/url] is still listed for sale by [mention=3604010]\n[url=https://hackforums.net/showthread.php?tid=6302394]Olympians group & Benevolence [/url] are listed for sale by [mention=1342286]\n[url=https://hackforums.net/showthread.php?tid=6307026]Fidelity[/url] group has been listed for sale by [mention=811]\n\n[url=https://hackforums.net/showthread.php?tid=6304410]Mystery Inc[/url] listed for sale by [mention=3909991]\n\nNo recent group sales.\n\n\n[B][u]RECENT GROUP CHANGES & EVENTS[/u][/B]\n\nThere are no recent reported group changes in the last week.\n\n[b][size=large][u]RECRUITMENTS:[/u][/size][/b]\n\n[url=https://hackforums.net/showthread.php?tid=6298855]Casino Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6226725]Pink LSZ Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6304113]Warriors Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6275486]Gamblers Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6294522]Legends Recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6046141]Allegiance Buy-in[/url]\n[url=https://hackforums.net/showthread.php?tid=6295130]Olympians leader recruitment[/url]\n[url=https://hackforums.net/showthread.php?tid=6300585]The Academy Recruitment [/url]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/gaming-header.png[/img]\n[size=medium][b]Writer - [/b][/size] [mention=3929084]\n\n[size=large][color=#72FF84][b]Notable console & hardware releases:[/b][/color][/size]\n\n[size=medium][color=#FFFF44][u][b][size=large]Developers are struggling to get dev kits[/size][/b][/u][/color][/size]\n\nSmaller indie game developers are struggling to get dev kits to develop games for the newly released Nintendo Switch 2. This comes on the back of Nintendo prioritizing larger projects with the bigger developers to produce games that wouldn't have originally been doable on the previous console.\n\nChris Wright, founder and managing director of Fellow Traveler – the publisher of Citizen Sleeper 2, along with titles like 1000xResist and Afterlove EP – says that they don't currently have access to Switch 2 development kits.\n\n\"It’s understandable that dev kits are heavily restricted before a console launch, and they usually remain restricted for a while afterward,\" he says. \"The Switch 2 has been very normal in this regard, and we didn’t expect to have access to kits ahead of launch.\"\n\n[size=medium][color=#FFFF44][u][b][size=large]Microsoft adds full stereo Bluetooth for gaming to Windows 11[/size][/b][/u][/color][/size]\n\nMicrosoft has launched their LE Audio update on Windows 11, which will now properly support super-wideband audio in stereo, even when using a mic at the same time. Prior to this update, gamers using wireless headsets may have had issues with spatial effects and found audio in games to go muddy at times, mainly when using a mic at the same time. This has caused most gamers that struggle with this issue to switch back to using a wired headset. For those wanting to make the switch to Bluetooth, good news, the issue has been fixed!\n\n[size=medium][color=#FFFF44][u][b][size=large]Glorious is bringing an actually customisable gaming keyboard to the 'boring entry-level market'[/size][/b][/u][/color][/size]\n\nHardware company \"Glorious Gaming\" is launching a new customizable gaming keyboard into their range to meet a more entry-level price point. You may know some of their products, like the GMMK Pro keyboards, which are customizable using their online keyboard designer, which those that know come at a pretty high price point. Well, they're now looking at releasing a new keyboard that is still customizable but will come in at a cheaper price point. Although you won't be able to get the same build quality as the more expensive keyboards they offer, you will still have the option of having a customizable keyboard that you can afford.\n\n[size=large][color=#72FF84][b]Notable News (August 2025)[/b][/color][/size]\n\n[color=#FFFF44]Monster Energy reveal Call of Duty: Black Ops 7 rewards[/color]\n\nMonster Energy has revealed the full list of rewards that will be available in Call of Duty: Black Ops 7 as part of the brand's returning promotion with the shooter. The two companies previously collaborated for Call of Duty: Black Ops 6 and will once again be teaming up for the next installment in the series, Call of Duty: Black Ops 7, which launches on November 14.\n\n[color=#FFFF44]Street Fighter 6 Reveals Monster Hunter Collaboration Event[/color]\n\nStreet Fighter 6 and Monster Hunter Wilds are teaming up again, but this time in the Street Fighter universe. Capcom has revealed that Street Fighter 6 will host a month-long collaboration starting September 1, and fans of both series can expect loads of content celebrating Monster Hunter Wilds.\n\nStreet Fighter 6 players will have a lot of options for this event with Monster Hunter Wilds. Players can purchase five EX colors for Blanka, Akuma, Manon, Cammy, and Ken inspired by different monsters from Monster Hunter Wilds. All players that log in during the collaboration period will receive a challenge screen effect, Quest Start sound effect, 10 stickers, and two wallpapers. The Battle Hub will be decorated with a Monster Hunter Wilds theme, and players can visit photo spots to take commemorative photos with Rathalos and Rathian from Monster Hunter Wilds.\n\n[color=#FFFF44]Call of Duty: Black Ops 7 Clarifies Split-Screen Support[/color]\n\nThe upcoming Call of Duty: Black Ops 7 will have split-screen, but not for its co-op campaign mode. Call of Duty: Black Ops 7 is the first game in the series to feature a co-op campaign since Black Ops 3 in 2015. All the games since then have either featured single-player campaigns or, in the case of Black Ops 4, no campaign at all.\n\n[color=#72FF84][b]Game Releases - (September 2025)[/b][/color]\n\n[spoiler][list]\n[*]Above Snakes  — September 4\n[*]Adventures of Samsara  — September 4\n[*]Alien: Rogue Incursion Evolved (PC, PS5) — September 30\n[*]Arctic Awakening  — September 18\n[*]Atelier Resleriana: The Red Alchemist & the White Guardian — September 26\n[*]Baby Steps  — September 8\n[*]Baki Hanma: Blood Arena  — September 11\n[*]Borderlands 4  — September 12\n[*]Bubsy: Purrfect Collection  — September 8\n[*]Class of Heroes 3 Remaster  — September 18\n[*]Cronos: The New Dawn — September 5\n[*]Daemon X Machina: Titanic Scion  — September 5\n[*]Dark Deity 2 (Switch) — September 4\n[*]Demonschool  — September 3\n[*]Duckside  — September 3\n[*]Dying Light: The Beast  — September 18\n[*]EA Sports FC 26  — September 19 – 26\n[*]Everybody’s Golf: Hot Shots (PC, PS5, Switch) — September 5\n[*]Final Fantasy Tactics: The Ivalice Chronicles  — September 30\n[*]Formula Legends  — September 18\n[*]Frostpunk 2 (PS5, Xbox Series X and S) — September 18\n[*]Garfield Kart 2: All You Can Drift  — September 9\n[*]Gloomy Eyes — September 12\n[*]Hell is Us  — September 4\n[*]Henry Halfhead (PC, PS5, Switch) — September 16\n[*]Hirogami (PC, PS5) — September 3\n[*]Hollow Knight: Silksong  — September 4\n[*]Indiana Jones and the Great Circle: The Order of Giants DLC — September 4\n[*]Jotunnslayer: Hordes of Hel  — September 3\n[*]Karma: The Dark World  — September 10\n[*]Katanaut (PC) — September 10\n[*]Lapin (PS5, PS4) — September 2\n[*]LEGO Party  — September 30\n[*]LEGO Voyagers  — September 15\n[*]Little Witch in the Woods (PC) — September 4\n[*]Mandragora: Whispers of the Witch Tree (Switch) — September 4\n[*]Metal Eden (PC, PS5, Xbox Series X and S) — September 2\n[*]Moros Protocol (PC) — September 4\n[*]NBA 2K26  — September 5\n[*]NBA Bounce  — September 26\n[*]Nicktoons & the Dice of Destiny  — September 30\n[*]Otherskin (PC) — September 2\n[*]Pac-Man 2 Re-Pac  — September 26\n[*]Parasol Superstars  — September 16\n[*]Platypus Reclayed  — September 18\n[*]Scar-Lead Salvation  — September 2\n[*]Shuten Order (PC, Switch) — September 5\n[*]Silent Hill f (PC, PS5, Xbox Series X and S) — September 25\n[*]Slime Rancher 2  — September 23\n[*]Sonic Racing: CrossWorlds  — September 25\n[*]Star Wars Outlaws (Switch 2) — September 4\n[*]Strange Antiquities (PC, Switch) — September 17\n[*]Tiny Witch (Switch) — September 10\n[*]Trails in the Sky 1st Chapter  — September 18\n[*]Void Crew  — September 4\n[*]Wander Stars  — September 19\n[/list][/spoiler]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/contests.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=3929084]\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6305248]\n$100 USD (BTC) Contest || Celebrating My Acceptance in The Academy[/url] By [mention=4189082] [/color][/size][/b][/u]\n\nA new contest has been created this week by @W1NK1LL3RX. They have recently been accepted into The Academy, and they feel like it's time for them to share the love by making a massive $100 BTC giveaway to one lucky winner. Let's make sure to spread the love, and thank them for the contest. The contest ends September 30th, 2025. Make sure you get yourself entered before it's too late.\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6304791]$75 ETH Crypto Contest | Celebrating my upgrade to L33T[/url] By [mention=5670768] [/color][/size][/b][/u]\n\nIf you are looking to get your hands on some free ETH, the user known as CyberGiggler has the thread for you. They have recently started a contest for everyone on site, and you can get your hands on an entry right now. All you will need to do is head over to the thread and follow the three steps to enter, and you could get your hands on that $75 ETH on the 2nd of September. Good luck to everyone who enters!\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6303945]$50 Crypto Contest || Celebrating my upgrade to Ub3r[/url] By [mention=5655318] [/color][/size][/b][/u]\n\nAnother contest is also giving away $50 worth of free crypto too. This member has recently just got themselves Ub3R on site and is celebrating becoming Ub3R by giving away to one lucky winner a $50 crypto. Once again, they have a few requirements for the contest, but everyone can easily enter this lovely contest and will get themselves an easy $50 to do whatever they want with it. Make sure you check this one out as it's worth checking it out!\n\n[u][b][size=large][color=#ffffff][url=https://hackforums.net/showthread.php?tid=6306653]$10 Giveaway[/url] By [mention=5523666] [/color][/size][/b][/u]\nWho's after some easy crypto? Swing by this thread and follow some very simple steps and join this giveaway, get in quick as the giveaway closes on the 15th September!\nThere wasn't any reason on the thread as to why they're running this giveaway so I reached out to the member running it, this is what they said. \"[i]I am looking forward to share my old group Dev's over HF and also like to give someone a chance to upgrade, atm I don't have that much clue even tho I registered a year and half ago so I decided to do what I felt was good. I upgraded myself and did the giveaway so I could give someone a chance to upgrade.[/i]\"\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/user.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[b]\n[size=large]Remember if you have reached an achievement on your account feel free to post about it on our weekly reports thread. That way we can add you to the news for the next edition. [u][url=https://hackforums.net/showthread.php?tid=6299864]Click Here To See The Weekly Reports Thread[/url][/u][/size]\n[/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/tech-header.png[/img]\n[size=medium][b]Writer -[/b][/size]  [mention=5465469]\n\n[u][b][size=large][color=#ffffff]EU rebuffs Trump pressure, defends Digital Acts[/color][/size][/b][/u]\nEU antitrust chief Teresa Ribera urged the bloc to stand firm against U.S. President Trump’s demands to weaken the Digital Services Act and Digital Markets Act as the price for advancing a trade deal—warning the EU shouldn’t compromise its regulatory sovereignty.\n[b][url=https://www.ft.com/content/010c5b1e-e900-4ec2-b22a-61300c70e531]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]FBI warns of Salt Typhoon hacking campaign targeting global infrastructure[/color][/size][/b][/u]\nThe FBI, alongside cybersecurity partners in Europe, issued an alert over “Salt Typhoon,” a Chinese state-linked campaign targeting telecom and government infrastructure in over 80 nations. The advisory emphasizes the indiscriminate and expanding nature of the attacks.\n[b][url=https://www.washingtonpost.com/politics/2025/08/28/tech-fbi-chinese-hacking/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Trump ends duty-free exemption for small international packages[/color][/size][/b][/u]\nEffective August 28, the U.S. revoked the duty-free threshold for shipments under $800, imposing tariffs of $80–$200 or equivalent country-dependent rates. The policy change stems from escalating trade tensions, prompting some foreign postal services to halt deliveries to the U.S.\n[b][url=https://www.ft.com/content/a0225f09-61fb-44f9-b9e1-c378e36bd639]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Europe still heavily dependent on US tech, study warns[/color][/size][/b][/u]\nDespite calls for digital sovereignty, a recent analysis shows European companies—especially in Ireland, UK, and Nordic nations—are deeply dependent on U.S. tech providers like Microsoft and Google, raising concerns about national security and strategic autonomy.\n[b][url=https://www.techradar.com/pro/with-trump-sanctions-beginning-to-bite-which-eu-countries-rely-the-most-on-american-tech-the-answers-honestly-might-surprise-you]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]U.S. markets buoyed by Wall Street tech rally; Asia eyes U.S. inflation data[/color][/size][/b][/u]\nWall Street’s tech-fueled rally lifted global stocks, with Asian markets following suit. Investors are now focusing on upcoming U.S. PCE inflation data to gauge potential shifts in Fed policy.\n[b][url=https://www.reuters.com/world/china/global-markets-wrapup-2-2025-08-29/]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Colorado AI regulation delayed; tech industry relieved[/color][/size][/b][/u]\nTech stakeholders are breathing a sigh of relief after Colorado lawmakers postponed the implementation of the state’s first AI regulatory framework—giving companies more time to adapt and comply.\n[b][url=https://www.mlex.com/mlex/artificial-intelligence/articles/2382241/tech-industry-relieved-after-colorado-ai-act-postponed]Source[/url][/b]\n[/align]",
      "subject": "Hack Forum News - Edition 12"
    },
    {
      "pid": "62813792",
      "uid": "2331053",
      "dateline": "1756740076",
      "message": "[align=center]\n[img]https://hackforums.net/images/hfnews/world-header.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[u][b][size=large][color=#ffffff]Devastating Earthquake in Afghanistan[/color][/size][/b][/u]\n\nA powerful earthquake has struck Afghanistan, resulting in more than 800 confirmed deaths and approximately 2,800 people injured. Entire villages have been destroyed, and relief efforts are being severely hampered by ongoing challenges in access and infrastructure.\n\n[b][url=https://news.sky.com/world]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]Guyana Election Marks Key Turning Point[/color][/size][/b][/u]\n\nGuyana, now among the world’s fastest-growing economies following an oil boom, heads to the polls in a critical election. Incumbent President Irfaan Ali is pushing for continued infrastructure-driven development, while opposition leader Aubrey Norton promotes an expanded welfare model. A third-party candidate, Azruddin Mohamed, may disrupt entrenched political dynamics.\n\n[b][url=https://www.ft.com/content/43d686f5-a70c-4e75-8500-5d096db30d8e]Source[/url][/b]\n\n[u][b][size=large][color=#ffffff]UK–Norway Naval Deal and AstraZeneca's China Comeback[/color][/size][/b][/u]\n\nThe UK secured a £10 billion contract to build warships for Norway, a strategic move aimed at countering Russian submarine threats in the Arctic. Meanwhile, AstraZeneca is recovering from a significant scandal in China, backed by a $2.5 billion investment and renewed ties with Chinese leadership.\n\n[b][url=https://www.ft.com/content/43d686f5-a70c-4e75-8500-5d096db30d8e]Source[/url][/b]\n\n[hr]\n\n[img]https://hackforums.net/images/hfnews/comics-header.png[/img]\n[size=medium][b]Writer -[/b][/size] [mention=2331053]\n\n[b][size=x-large][color=#ffffff]-1-[/color][/size][/b]\n[spoiler][img]https://assets.rebelmouse.io/eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpbWFnZSI6Imh0dHBzOi8vYXNzZXRzLnJibC5tcy8yODc0NzcxMi9vcmlnaW4uanBnIiwiZXhwaXJlc19hdCI6MTc4OTgwMjE1MX0.sABvDyuE-U3uTt_FLKWNcBUjTFd2vY7uZj7fzXs88CQ/img.jpg?width=800&quality=85[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-2-[/color][/size][/b]\n[spoiler][img]https://i0.wp.com/warandpeas.com/wp-content/uploads/2025/08/war-and-peas-sisyphus.jpg?resize=768%2C960&ssl=1[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-3-[/color][/size][/b]\n[spoiler][img]https://b3666184.smushcdn.com/3666184/wp-content/uploads/2025/06/dark-humor-comics-24-20250625-600x749.jpg?lossy=2&strip=1&webp=1[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-4-[/color][/size][/b]\n[spoiler][img]https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1LaX08.img?w=800&h=415&q=60&m=2&f=jpg[/img][/spoiler]\n\n[b][size=x-large][color=#ffffff]-5-[/color][/size][/b]\n[spoiler][img]https://pbs.twimg.com/media/GzMcvwWaAAAa8kR?format=jpg&name=large[/img][/spoiler]\n\n[hr]\n\n[b][size=x-large]We would like to say a big thank you for you reading and a big thank you to the HF News Team members[/size][/b]\n\n[size=large] [mention=2331053] [mention=57618] [mention=3929084] [mention=3725052] [mention=5465469] [/size]\n\n[hr]\n\n[b][size=xx-large][u]Support The Team by wearing our signatures[/u][/size][/b]\n\nIf you have enjoyed the read please consider wearing one of our signatures to support us!\n\n[img]https://hackforums.net/images/hfnews/support-blue.png[/img] [img]https://hackforums.net/images/hfnews/support-green.png[/img]\n[img]https://hackforums.net/images/hfnews/support-orange.png[/img] [img]https://hackforums.net/images/hfnews/support-purple.png[/img]\n[img]https://hackforums.net/images/hfnews/support-red.png[/img]\n\n\n[b][size=xx-large][color=#E82A1F]Red[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-red.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#0074D9]Blue[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-blue.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#2ECC40]Green[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-green.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#E86E04]Orange[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-orange.png[/img][/url][/align][/code]\n\n[b][size=xx-large][color=#B10DC9]Purple[/color][/size][/b]\n[code][align=center][url=https://hackforums.net/showthread.php?tid=6299864][img]https://hackforums.net/images/hfnews/support-purple.png[/img][/url][/align][/code]\n\n\n\n\n\n[/align]",
      "subject": "RE: Hack Forum News - Edition 12"
    }
  ]
}