{
  "posts": [
    {
      "pid": "7383073",
      "uid": "136025",
      "dateline": "1288556020",
      "message": "[align=center][IMG]http://i52.tinypic.com/28r1ux.jpg[/IMG][/align]\r\n\r\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 21st FULL edition. It is for the dates of 10/23/2010 to 10/30/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\r\n\r\nBefore we begin, we would like to wish you all a Happy Halloween 2010! May you all have a great celebration, stay safe!\r\n\r\n[align=center][IMG]http://i54.tinypic.com/qstieq.png[/IMG][/align]\r\nThis week on Hack Forums has truly been a hectic week. With numerous occurrences happening, confusing members and such.\r\n\r\nToday Hack Forums had suffered 3-4 hours of down time. Omniscient has stated that this was due to a DDOS attack. Omniscient has stated, \"Seems that I woke up late only to find that Apache had crashed.\" Fortunately Omniscient had spotted the issue quickly and resolved it.\r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=779366]here[/url].[/b][/color]\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nHack Forums has also suffered more issues with uptime and efficiency this past week. A few days ago the database had impacted by the users online and had closed up, causing a short amount of downtime. Omniscient had analyzed this issue and swiftly resolved it. This event had showed the rate at which Hack Forums is growing at.\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nWe would also like to welcome two former Staff members to the team again. [url=http://hackforums.net/member.php?action=profile&uid=82773]Kewlhotrod[/url] and [url=http://hackforums.net/member.php?action=profile&uid=7807]VipVince[/url] have had their Staff position reinstated to them. We would like to wish them the best of luck and hope they continue to serve Hack Forums efficiently.\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nHack Forums has gotten into the Halloween Spirit today, showing off a new banner. Although, as the banner was being set up, many people had suffered connectivity issues and could not see it.\r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=779711]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i54.tinypic.com/30rmg0j.png[/IMG][/align]\r\nThere has been quite a bit of controversy on Hack Forums in regards to users and their account status.\r\n\r\nToχic has reentered the Hack Forums community after being given a chance by Omniscient. He has posted a thread referring to his come back which has caused quite a bit of discussion.\r\n\r\nThe thread has been junked and can not be seen anymore.\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nThis week, the former Gamers group leader Mendacious decided to start up his own forum so that his crew and others could talk about gaming. Omniscient wasn't too fond of the idea and had removed Mendacious from his position as leader. Mendacious has consequently left Hack Forums. We would like to wish him the best on his future endeavors. \r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=730374]here[/url].[/b][/color]\r\n[color=#1E90FF][b]His farewell thread can be found [url=http://hackforums.net/showthread.php?tid=767987]here[/url].[/b][/color]\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nCobija has recently requested a temporary 1 month ban so he may keep up with his studies. We would like to wish him the best of luck with his schooling.\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nIt is unfortunate to say, that Yin, Former Staff member, Moderator, Reviewer Leader and founder of HF News has been banned for scamming and infecting members. It seems that the once-respected member has went rogue and betrayed the community. \r\n\r\n[color=#1E90FF][b]You can read the scam report [url=http://hackforums.net/showthread.php?tid=759721]here[/url].[/b][/color]\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nZach has recently had a brush with the law, he is attending court due to a misunderstanding and small prank at school. We would like to wish him luck and hope everything turns out well.\r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=778111]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i51.tinypic.com/1zd6eja.png[/IMG][/align]\r\nIn the past week, there has been some news that has enlightened the members.\r\n\r\nOmniscient had decided to join a Tinychat group discussion and one thing led to another, where he was filmed vomiting in to a bucket after getting 'wasted'.\r\n\r\n[color=#1E90FF][b]You can see the video [url=http://hackforums.net/showthread.php?tid=762765]here[/url].[/b][/color]\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nArruke has shown members a person who claims he will light himself on fire if he yields 10,000 subscriptions in 7 days. We hope that this is not true as it is extremely dangerous and could possibly be a fatal action.\r\n\r\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=780919]here[/url].[/b][/color]\r\n\r\n[align=center][IMG]http://i51.tinypic.com/2w4f95h.png[/IMG][/align]\r\nWe were lucky to get an interview with Rusty_V.\r\n\r\n[color=#1E90FF][b]1.[/b][/color] When did you join Hack Forums and why? What were you looking for?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] 1 and a half year back when I was looking for Gmail bruteforcer I discovered this site, I didn't signed up at that time, again another day I was looking for a way to get free brazzer passes, I saw a tut on here.I bookmarked it, that day I joined hackforums.[/i]\r\n\r\n[color=#1E90FF][b]2.[/b][/color] What factor of Hack Forums kept you here, what made you want to stay and become active?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I used to see members bragging about rooting website/making money/making their own keylogger, I started using Rats/loggers in July 09 and became much active in the Hacking tools and Vb.net section.\r\n [/i]\r\n[color=#1E90FF][b]3.[/b][/color] When did you upgrade and who bought it?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I bought it myself after selling 2-3 torrentleech invites in October 09 which I got from my logs.\r\n [/i]\r\n[color=#1E90FF][b]4.[/b][/color] After knowing that Hack Forums was a community you'd like to stay in, what section were you most active in?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I started learning Vb6 and Vb.net, gave out some free crypters and loggers to the community. I stopped giving out free tools after I got banned and accused of infecting Hf members.There was big scene after I got banned, Check out my threads for more info.\r\n [/i]\r\n[color=#1E90FF][b]5.[/b][/color] What inspired you to write your e-Book?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] Some members recommended me to write an eBook after seeing my spreading skills and thread in service offerings.But I was never into writing eBooks before.\r\n[/i]\r\n[color=#1E90FF][b]6.[/b][/color] How did you feel when it got leaked?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]Obviously I wasn't happy to see something making you money being given out for free, Actually Yin never liked me and never did I.But now I could care less.\r\n [/i]\r\n[color=#1E90FF][b]7.[/b][/color] Many people know you were scammed for over $1,000, can Hack Forums and it's members know what actually happened?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] Yep, incident reminds me of ol days, I trusted him too much that was my fault, I got scammed for $1257, I gave that money to a guy named \"Mr.Xchange\" for exchanging it to WU.He ran out with money.I was shocked to see how that all happened in front of my eyes.But still I believe what happens is for good.Life carry's on..[/i]\r\n\r\n[color=#1E90FF][b]8.[/b][/color] Are there some things that you have learned that you owe to Hack Forums?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]Never trust anyone on the internet from the bottom of your heart. I have seen scammers like Vaqxine and Xchange, difference was situation made him scam and the later scammed taking advantage of the situation. I still feel for vaqxine.\r\n [/i]\r\n[color=#1E90FF][b]9.[/b][/color] Did you ever see yourself as a Staff member on Hack Forums?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] I never thought I would make up to staff but yep I'm happy :)[/i]\r\n\r\n[color=#1E90FF][b]10.[/b][/color] How did you feel when you were contacted and asked to become a Staff member?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I woke up in the morning, sat before my PC, logged into hf and I was shocked to see Omni's PM wih the title \"The invite\", that was my luckiest day on hf. :P [/i]\r\n\r\n[color=#1E90FF][b]11.[/b][/color] What are your future goals on Hack Forums?\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i]I want to be a member of this great community as long as it is there. I don't think I'll be active much in the coming months but still I'll try to keep Hf clean and spam free with my efforts. :) [/i]\r\n\r\n[color=#1E90FF][b]12.[/b][/color] Is there anything you would like to finish off the interview with? Maybe a message to the members or a quote.\r\n[color=#32CD32][b]Rusty_v™:[/b][/color] [i] Well, you ain't asked about the \"P3\" in my usertitle so I won't be saying anything.I would like to end up saying this famous quote - \"Faith consists in believing when it is beyond the power of reason to believe\". The one and only best friend I've got on this forum is \"Factor8\", I want to be your bffl.\r\n\r\nThank you and I'd like to apologize for my bad english.[/i]\r\n\r\n[align=center][color=#1E90FF]**[/color]**[color=#1E90FF]**[/color][/align]\r\n\r\nThank you for reading and check back next week for another great edition of HF News. Happy Halloween 2010!",
      "subject": "[10/23/2010] - HF News"
    }
  ]
}