{
  "posts": [
    {
      "pid": "4167667",
      "uid": "74244",
      "dateline": "1274536387",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\n[align=center]Edition 2 [/align]\n\n[b]Note: I do post these on Saturday, because the week starts on Sunday, which means Saturday is the last day of the week (so when you see nothing that happened on Sunday, you'll have to wait til next week's edition)[/b]\n\n[size=large][color=#FF4500]Headlines[/color][/size]\n\n[size=medium][color=#1E90FF]This week Omniscient has added a Contests section. It can be found [url=http://hackforums.net/forumdisplay.php?fid=155]here[/url]. This is a great place to go if you want UB3R or L33T and can't afford it (if they deem you worthy).[/color][/size]\n\n[size=medium][color=#FF1493]This week --([-S7N-])-- was appointed staff. He's a great HJT worker, an even better person, and a Yin lover at best. Congratulations to you, and may you succeed in the future. If you want to show a little gratitude to the guy, drop him a nice little PM [url=http://hackforums.net/private.php?action=send&uid=110893]here.\n[/url][/color]\n[/size]\n[size=medium][color=#FFA500]Yesterday, Omniscient made a change that will forever break the hearts of many businessmen. Only kidding, but he did make a dramatic change to the forum. The thread can be found [url=http://hackforums.net/showthread.php?tid=433590]here[/url]. Member profile contact details were removed, and I quote -[/color][/size]\n\n[size=medium][b][quote='Omniscient' pid='4159581' dateline='1274478918']\nI've taken the liberty of removing the contact details from the member profiles template. This is to help protect members exposing their accounts to be spammed or frozen.  While I will not create a rule forbidding them in signatures I don't encourage users to openly provide their contact info.  \n\nThis was a decision I've considered in the past but reviewing some recent activity I think it's wise to finally commit to action.\n\nThank you.\n[/quote][/b][/size]\n[size=medium]\n[color=#FFA500]Recently, many datacenters were blocked. The big guns include ThePlanet,  SharkTech, FDC, and Hurricane Electric. Omni decided that nothing but malware was coming from those datacenters. This means you have to be weary with your VPN and proxy use. Check out what Omniscient said [url=http://hackforums.net/showthread.php?tid=428354]here[/url][/color].[/size]\n\n[size=medium][color=#FFA500]Not too long ago, there was a new tab made. It's the Graphics tab. Instead of smudging it into one tab, Omniscient decided to add a new tab. Along with this came a GFX Battles subforum, and GFX Contests subforum. Omnicsient made them all (RMG, Graphics, Graphics Tutorials) all into each individual subforum for more convenient use. The tab can be clicked on the homepage where you see all the other tabs.[/color][/size]\n\n[color=#32CD32]--[/color]\n\n[size=large][color=#FFD700]User News[/color][/size]\n\n[size=medium][b]In other news, Uchiha_Ownz made [url=http://hackforums.net/showthread.php?tid=425577]$1,700[/url] this week. Not bad for a day at the computer. My guess is that it'll be all spent on school 😉. Only kidding, but great work Uchiha and keep making that money![/size]\n[/b]\n[size=medium][color=#DDA0DD]This week, a great tutorial came out. It's a tutorial on how to write a high quality tutorial (the irony!). Fireren made it (props), and it can be found [url=http://hackforums.net/showthread.php?tid=425030]here[/url]. Maybe drop him a little comment on what you think about it on his thread?[/color][/size]\n\n[size=medium][color=#1E90FF]This week, Delphinum released a HackForums Toolbar [url=http://hackforums.net/showthread.php?tid=432450]here[/url]. It seems to have a lot of features for use, and you should check it out. \n[/color][/size]\n--\n[size=large][color=#FF4500]Repfucks/Bans of the Week\n[/color][/size]\n\n[size=medium][color=#FF1493][url=http://hackforums.net/member.php?action=profile&uid=52160]Psyk[/url] was banned this week. You'd think that after a ton of scam reports (on his PornFeed program, and some other program, forgot what it was), that'd he'd be gone. The reason for the ban was \"Scamming\", so it gives you a bit of a clue.[/color][/size]\n\n-- \n[size=large][color=#FFA500]Just Plain Weird[/color][/size]\n\n[size=medium][color=#98FB98]SehCure posted a thread [url=http://hackforums.net/showthread.php?tid=434394]here[/url] asking people how they hide their \"pr0nz\". I don't know what \"pr0nz\" is, but sounds to me like someone needs to go back to school, as \"pr0nz\" probably isn't a word. Regardless, go share your hiding \"pr0nz\" with them in that thread. This \"pr0nz\" word has earned SehCure a spot on Just Plain Weird!\n[/color][/size]\n\n[size=medium][color=#6B8E23]Matt posted a thread about Sarah Palin stripping [url=http://hackforums.net/showthread.php?tid=432377]here[/url]. I don't know who that is, but where the hell is the Miss Alaska I asked for?! If this is the meaning of \"less taxation, more flirtation\", I'll take the taxation. I've already booked my tickets to Chicago, sadly.[/color][/size]\n\n[size=medium][b]Question Authority wants to get [url=http://hackforums.net/showthread.php?tid=433725]laid[/url]. He's 16, and needs your tips to get laid. I don't know about you, but 16 seems like a good age that you weren't laid at that time. Regardless, he has some money to spare, and hook him up with some tips to get that first \"play time\". His actions and him taking a stand have landed him a spot on this week's Just Plain Weird![/b][/size]\n\n--\n[size=large][color=#FF4500]Sorrow Times in HackForumania[/color][/size]\n\n[size=medium]This week, Valiant's school bank clerk died. You can find the thread [url=http://hackforums.net/showthread.php?tid=434010]here[/url]. Even if we didn't know who he was, he seems like a great guy (from Valiant's description of him), so this section is dedicated to him. May he rest in peace. This just shows that you guys should take care of your body and be thankful for it as well.[/size]\n\n[img]http://saysomethingfunny.files.wordpress.com/2009/01/rest-in-peace.jpg[/img]\n--\n\n[size=x-large][color=#98FB98]Suggestion Format[/color][/size]\n\nSegment it goes under (Just Plain Weird, Headlines, etc) -\nLink to the thread -\nA bit more describing the news -\n\n--\n\nPrevious thread was here http://hackforums.net/showthread.php?tid=423656\n\nSucceeding thread - http://hackforums.net/showthread.php?tid=450222&pid=4316110#pid4316110\n\nRemember to comment on what you think about this week's edition.",
      "subject": "HF News Week (5/16-5/23) [COMMENT]"
    }
  ]
}