{
  "posts": [
    {
      "pid": "23815381",
      "uid": "515249",
      "dateline": "1340513290",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]97th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]New section[/b][/color]\nAfter being requested several times in the past [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally decided to add the Networking, Routers, Switches, and Firewalls section. The section is dedicated to all help and question threads regarding networking or similar topics. To view the new section click the following link: http://goo.gl/SWm16\n\n[color=white][b]Small changes[/b][/color]\nA few small changes were put into affect this week including the the changed usertitle on banned members which now reads \"Exiled\". Also this week the modlist.php page was renamed to showmods.php. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet regarding this change click the following link: http://goo.gl/fPfef\n\n[color=white][b]Possible new feature[/b][/color]\nRecently [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has confirmed that he will be adding a close protection feature much like the logout protection that was added earlier this year. The new feature will be very helpful to l33t members who are unable to reopen their threads upon accidental closing. To view the suggestion thread click the following link: http://goo.gl/KCn6v\n\n[color=white][b]Rhythm[/b][/color]\nFormerly the Techsperts, a group dedicated to writing tutorials and other various activities has now revamped their group into a unique music theme. The new group is certainly the first of it's kind and so far seems to be a great success with new members joining daily. To view the groups recruitment thread click the following link: http://goo.gl/ChPzc\n\n[color=white][b]Coders paid off[/b][/color]\nAfter several changes to the Coders the group leaders have finally managed to pay off the remaining payments for the group. Hopefully this will give group members a feeling of relief knowing that the group isn't going anywhere anytime soon. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet regarding the payment click the following link: http://goo.gl/BeMoE\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=74244][color=#FFD700][b]Yin[/b][/color][/url], who is the founder of these very HF News and also an ex-Staff member, returned this week. You can welcome him back [url=http://hackforums.net/showthread.php?tid=2603171]on his thread[/url].\n[url=http://hackforums.net/member.php?action=profile&uid=101228][color=#0066FF][b]Tate Sr.[/b][/color][/url] returned briefly today and posted [url=http://hackforums.net/showthread.php?tid=2603712]a thread[/url] about some odd plan of his.\n[url=http://hackforums.net/member.php?action=profile&uid=414404][color=black][b]Musky[/b][/color][/url] stole [url=http://hackforums.net/member.php?action=profile&uid=330676][color=#0066FF][b]Diabolic‌[/b][/color][/url]'s user name and used it to scam other members.\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=#0066FF][b]Vitani's Mate[/b][/color][/url]'s account was merged with his old account. His registration date is now one year earlier than his previous one.\n[url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] gave out numerous -10 reputation ratings this week.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=915044][color=#0066FF][b]Kung Lao[/b][/color][/url] was repfucked by Judge Dredd for unknown reasons. \n[*][url=http://hackforums.net/member.php?action=profile&uid=1134703][color=#383838][b]bobjon[/b][/color][/url] was repfucked by Judge Dredd for unknown reasons. \n[*][url=http://hackforums.net/member.php?action=profile&uid=515249][b]Sir[/b][/url] was repfucked by Judge Dredd for unknown reasons. \n[*][url=http://hackforums.net/member.php?action=profile&uid=87114][color=black][b]Reptar ツ[/b][/color][/url] was repfucked by Judge Dredd for unknown reasons. \n[*][url=http://hackforums.net/member.php?action=profile&uid=170785][color=black][b]Infallible[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=849960][color=black][b]Confidence.[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=414404][color=black][b]Musky[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=898803][color=black][b]Valderino[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1134703][color=#383838][b]bobjon[/b][/color][/url]'s account was closed.\n[*][url=http://hackforums.net/member.php?action=profile&uid=87114][color=black][b]Reptar ツ[/b][/color][/url] was banned for flaming in reputation.\n[*][url=http://hackforums.net/member.php?action=profile&uid=358978][color=black][b]Zуνoχ™[/b][/color][/url] was banned for posting a picture of [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] roasting a piece of toast with flashy lasers from his eyes.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1053743][color=black][b]Protein[/b][/color][/url] was banned for challenging a warning given to him.\n[*][url=http://hackforums.net/member.php?action=profile&uid=127956][color=black][b]Plutonium[/b][/color][/url] was banned for posting marketplace threads outside the marketplace.\n[*][url=http://hackforums.net/member.php?action=profile&uid=849960][color=black][b]Confidence.[/b][/color][/url] was banned for being low quality.\n[*][url=http://hackforums.net/member.php?action=profile&uid=651337][color=black][b]Tibit[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=881106][color=black][b]Fact[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=414404][color=black][b]Musky[/b][/color][/url] was banned for being a low quality member.\n[*]20 members were banned by [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] for being low quality.\n[*][url=http://hackforums.net/member.php?action=profile&uid=170785][color=black][b]Infallible[/b][/color][/url] was banned for making a wrong move.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2610018][b]Its \"ethically wrong \" to not have sexual harrassment in games[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2597542][b]LOL @ Virgin gamers.[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1340433][color=#FFD700][b]HC‌‌[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2598912][b]We live in a society where...[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=65167][color=#FFD700][b]Horkos[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2595609][b]What was your dream last night?[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=651773]Hexicidal[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Hello, and welcome to the 97th edition of the HF News, [url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]. Are there any shout outs you want to give before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: Hello, I would like to give a shoutout to Lust. and Phenomenal my two great leaders.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: So recently I am sure many have seen your feedback thread you created. It raised one very good question, what made you want to buy Coders from Omni?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: Ever since I have been on HackForums it has always been one if not my pivotal goal to be an owner of a group. I felt like I needed to give something back to the community, and after the incident that occured with HEV I felt this was perfect.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well it's great that you want to give back to the site. So the Coders is a fairly new group, and it seems that you guys haven't done much pubicly. Do you have any plans or special group attractions or features? Also bringing up goals, what are some of your other goals, and besides becoming owner of a group, what is your biggest ahcievment so far?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: Publicly we haven't been very active. In the future we plan to release a help desk in most of the coding sections of help of any kind. Right now we are creating a student program in efforts to help educate the community in different languages. Classes for that are going to start very soon. I'm even enrolled in one. It's all about learning. Other goals? Hmmm. My biggest achievement so far is just coming where I am today. I think it's a real achievement being able to wake up. A lot of people don't have that. You just kinda have to put things into retrospect and realize where everything in life stands.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well sounds like you are putting your group to good use then. Also I know what you mean, being able to manage everything can be a bit much. Also the fact that you are enrolled in one of the courses that your group is teaching brings up a question. What made you buy a programming group, considering that you aren't an exper programmer. Of course no offence.\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: Oh I understand fully. I bought to group in an aims to help others. I never bought the group just to be able to wear a silly badge. It's about helping others. That's what it should be about at least. You should be able to learn in a helpful environment with the ability to ask questions of any types. It's a new opportunity for many members who wish to learn and I try and offer the best environment that my group can offer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Seems you really do care about the better of others before yourself. So how do you manage your group? A lot of groups go through many reforms before they get a system down, but from what I have seen you guys have been making a good amount of progress. Also how did the leaders of your grop come about. Also back to an old point, you never really said what your future goals are on HF. So where do you see yourself in 4 years? Will you still be using HF.\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: I manage my group with graceful force in a sense. We did have a reform but many groups forget to take into account that without sense and change it will revert back to the same old problem. You have to change the issue, not the people. I don't ask a lot from my members but they are so much help when asked. Lust. was around since I previously had the idea of creating the group \"Logic\". He's a great member on these forums and honestly a great friend. He is the mastermind behind many things relating to our group. Phenomenal... We wouldn't be here without him. He single handedly launched us to become official. I knew him before I owned the group but never in a million years would I have thought he would have created Coders. Without him, I probably wouldn't be doing anything I am today. I skipped that question because it really made me think... I honestly don't know. I will be using HF for as long as I can. I adore the community and every member, but goals. Once you reach something, it's kinda a plateau of thought after that. I don't know what is ahead for the future honestly, but I expect anything and everything.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: That makes a lot of sense, a lot of bigger corporations need to understand that. Also it is interesting how your group leaders have stuck with you. I know what you mean when you talk about getting to that point, where you don't know what is next. Though I am sure it will come with time. So besides HF, what do you do with your personal time?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: I adore going to the cinemas, it is one of my favorite things to do. Actually, two nights ago I went to see Roger Waters'[Mastermind behind Pink Floyd] The Wall. It was the best concert I have ever seen. If anyone ever has the chance to see Roger Waters live, I highly recommend it honestly. I go to the beach a lot too, I actually have plans to later tonight. Then, I do what most everyone else does... I browse HF and play xbox. Since I am a full time student and it's finally summer vacation, it's nice to finally have some time off.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Sounds amazing, go soak up some sun! Also I agree, going to see movies is always a great time. So with school in mind, what kind of career feild do you plan on going into the future. Maybe something code related?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: Honestly for the future I plan to probably delve into a chemistry major. I love that with out a doubt.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Chemistry is no doubt an amazing study. So with that in mind, do you have any colleges or Universities you have in mind? Also if you could visit one foriegn place, where would you go and why?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: I would love to go to Duke to further my education. That is my essential dream university. I wish I could travel the whole world, but if I could only visit one place I would visit Rome. With such a rich and vibrant culture who couldn't be interested? It would be a dream come true to be able to visit Rome.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Same, in fact I actually might be visiting their for my Latin Class Senior trip. As for College, I wish you the best of luck. Though we are approaching the end of this interview, one more question. Right now, since you are undecided about your future on HF, make one goal for yourself.\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: On goal that I would love to accomplish while on HackForums is to go through the amazing HJT program that we have. Currently I'm waiting for recruitment to open so that I might have the chance to join such an elite group of members.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well that is a great goal. Though recruiting should be open soon. With that, this ends our HF interview. Do you have any final comments, questions or concerns?\n[url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url]: No, not really.\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well, with that we conclude the 97th edition of HF News' Interview, featuring [url=http://hackforums.net/member.php?action=profile&uid=863752][b]Hexicidal[/b][/url].\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=651773]Vitani’s Mate[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Hello Vitani's Mate, thanks for participating in the 97th full edition of the HF News! Is there anybody you'd like to give a shoutout to before we start? \n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: It’s a pleasure to be here man, and I’d like to give a shout out to all the members on HF, since I have too many people to mention seperately. xD\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, a warm welcome to everyone! Always nice :) To get the ball rolling, why don't you enlighten us on what brought you to HF? \n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: Well, I was going to hack a few accounts on Facebook, so I started searching on Google, when I saw Hackforums. So I registered, and I guess I just grew to love the forums, and just couldn’t stop posting! I then bought L33t, and things just happened. :p \n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds like a classic story. As most people would know, you've recently surpassed 50K posts, and have the highest post count on HF. How do you manage to stay so active, and how do you feel about people who call you a 'post whore'?\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: I guess I just love posting on HF... I know that people say that I have no life and other stuff, but I do have a job. At night time I get on HF, and just post. I just love being here and trying to help out members with their problems. It isn't really that hard if you get yourself into a routine and just aim for a certain amount of posts a day. I have been asked how many posts I do a day, and I say “oh that is easy: about 100 to 250 a day depending on my mood.” I am pretty f__king happy that I have broken 50K post count, and it only took me a year and a half to do it! I have been through a few things, such as bans and power outages, which restrict me from posting at times. I guess I just try and work around them as much as I can.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: You seem like a very ambitious member :). Your account was recently merged with an account you claim not to be yours. What are your reactions to this, and what do you think the reason for this was?\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: Well, I don't really know how to feel, I mean... I don't where this account came from or anything, and it makes my account unlegit now since it looks like i got 50k posts in 2 and a half years instead of one and a half. I guess I was a bit mind-fucked at first, but it is no big deal now. I assume the reason was because my brother was on here. He was more into hacking and stuff like that, than myself, and he mentioned something about HF not too long ago. I'm pretty sure it was just about me getting Xbox live for him though... O_O.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well that sucks. Shit happens sometimes though, I suppose. Where do you see yourself in the near future? What are your goals, and are you aiming for a staff position? \n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: I am not sure. I already have a stable and decent paying job at a music store. I LOVE music, and I know quite a lot about it. As for a staff position, I am not sure whether I’d like it or not. It would be fun and rewarding, yet at the same time so demanding, for both time and quality. I notice that a lot of members respect staff, which would be a benefit in my eyes. I’d like to be admired as such, of course not as much as Admins. They are the top dogs around here! :p\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds like a decent lifestyle. I suppose we should head to the unavoidable question: what's the deal with your username? \n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: Well I get asked this all too often in my ‘ask me’ thread. Vitani is a character from the movie ‘The Lion King’. She is Zira’s daughter, and happens to be my favourite character out of the whole series. I guess I just love her too much, but I don't really know. I have had other usernames before, but this one seems to stick.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I see. Of your 14 username changes, 8 are related to Vitani in some sort. What attracts you to such a character?\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: Yeah, I know. I guess I am her number 1 fan. I am not sure: probably since she is cute and she just doesn't take shit from no one. That is why she is a tomboy, and I do like tomboy girls a lot. I [b]love[/b] her blue eyes. I just [b]love[/b] them. Those are pretty much the main things that attract me to her I suppose. I can relate to her personality. \n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Haha, number 1 fan indeed! Your 'ask a question' thread has taken off with flying colours recently. What are some strange or interesting questions you’ve been asked?\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: Haha, well I am not really sure at this point. I guess one of them is \"Do you fap over Vitani\", and my answer is always yes. I do fap over her since I am her mate. Why wouldn't I fap over her!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, we all have different tastes ;). You mentioned earlier that you are a music finatic. What music do you listen to, and do you think that the Dubstep trend will override the current rap/pop trend?\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: I listen to a lot of music. I am a Metal fan though, hence why I listen to a lot of Rammstein, and other metal bands. I also love to head bang, and I have been to [b]many[/b] live shows. Rammstein are just awesome, and one of the best live shows I have been to in years. Dubstep has become really popular these days, but it depends on the listeners choice and what they prefer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Ah, glad to see there are still metal fans! Thanks for your time today. I understand you are a busy man, and I must let you get back to work! Any final thoughts/comments before we wrap it up?\n[url=http://hackforums.net/member.php?action=profile&uid=651773][color=white][b]Vitani’s Mate[/b][/color][/url]: Thanks for the interview, and I do have one final thought.\nLiebe ist für alle da (love is there for everyone – German) :D\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=731778]Lemonade[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Hello Lemonade, Thanks for participating in the 97th edition of HF News, any shout outs to other members before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: Hello thanks for having me. I would like to give a shoutout to McFlurry and everyone part of the HJT Team and Reviewers group along with my other groups.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Alrighty, I'm sure they will be pleased about their shoutout. Now simple question here, What did you intend to do when you first joined hackforums ?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: I really didn't have any long term plans when I first joined. Like most people I heard about the site and simply joined. At first I stuck to the Xbox 360 section then slowly I learned about the other sections and I never saw myself being here for over a year.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well it's a good thing you did stick around for 1 year, You are a great memeber to the community. Now you said you was a leader of the Reviewers correct? How does it feel being a leader of Official group like Reviewers? \n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: The Reviewers group provides a lot to the HF coummunity. It feels great knowing that I get to be a part of the group. At time it can be stressful knowing that you have to be on HF freqently to send out eBooks and publish theads but it is something that I enjoy doing and I never really saw myself becoming leader. I applied when they recruited and over the course of the year I moved up and learned more and eventually got to the position I am in today.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Wonderful answer there Lemonade. It's great to see such a dedicated memeber to the community in The Reviewers and the other groups you're in. Now if there was one thing about HackForums you could change, What would it be ? and why?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: Well I personally don't have any ideas or things I would change much because the only person that knows what to do with the site is Omniscient. Members may come up with ideas and things they want to change but many times members suggest ideas simply because it will benefit them more then the community. The Staff and Admins on this site do a great job in keeping everything in order. If I could change one thing it would just be that the site has 100% uptime although it already has like 98% or 99% uptime.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Another wonderful answer there Lemonade <3. I would actually have to agree on the uptime but you know how kids get these days when DDoS'ing things becomes a hobby. Well going to ask you the opposite question to the one before, What is your favourite part about HF? and why?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: My most favorite part about HackForums would have to be the private groups such as HJT Team. They really are an escape from the rest of the forum and give you an oppourtunity to be apart of something else. The private groups are sort of a brotherhood between members on the site. They also give you a way to contribute back to the forum. Some of the public sections are also just fun to browse like the lounge.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well wonderful, I have to agree with you a 100% Private groups are like a brotherhood. Now I have a question about HJT, What is it like in HJT?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: Well the HJT Team is a learning expierence. I was eager to join and was luckliy accepted. It is tough at points when you are trying to fix an infection and you don't know what to do but that is the great thing you get to learn from your mistakes and with the guidance of great teachers. The teachers really put pressure on you but asking tough questions to make you acutaly research and think. I am not even done with the training but I have learned quite a lot and I always look forward to learning more. I hope to graduate and help members that are infected and from there I look forward to teaching other trainnes in the future. Even though I am not going to pursue Computer Science or security as a profession this basic knowledge is something useful.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]: Well I have to admit I would love to be a part of that group, I've kind of set my own goal to learn a lot and hopefully learn a lot more. Lovely answer, I'm sure all you readers reading will enjoy this. So keep in mind readers if you ever need a guy to fix an infection LEMONADE is your man<3. Now just a basic question here, being in HJT do you feel proud while wearing the userbar?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: Well I am still training so members shouldn't come to me for a fix, yet. It feels great knowing that you get to be apart of a group that contributes heavily to the forum. Wearing the userbar is also motivation for me to graduate and do well on my PLs since members before me have strived to do their best. Being part of the HJT Team is also a great opportunity that I had. I feel very proud to be part of the group.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]:Well soon they should come to you lol. It's a wonderful group don't get me wrong. Do you think it's a challenge to get into the group?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: Somewhat yes. I would rather say that you need to prove that your dedicated and willing to work hard over the course of months to earn the status of a HJT Helper. It can be hard to prove your dedication and commitment. Once you get into the group that doesn't mean you can stop with the hardwork actually it just starts from there and you have to continue to prove that you deserve to be in the group and have make the best of your opportunity to learn.\n\n[url=http://hackforums.net/member.php?action=profile&uid=516470][color=#0066FF][b]SoulZeh[/b][/color][/url]:Alright I think we are done here for this interview, I have to say it was great having you here <3 Got anything else you would like to say before we finish this up?\n[url=http://hackforums.net/member.php?action=profile&uid=731778][color=white][b]Lemonade[/b][/color][/url]: Nothing else to say. Thanks for having me on the news and I enjoyed being part of this weeks edition.\n[/spoiler]",
      "subject": "[6/23/12] - HF News"
    },
    {
      "pid": "23815424",
      "uid": "515249",
      "dateline": "1340513393",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][img]http://i.imgur.com/AjAOE.png[/img]\n[video=youtube]http://www.youtube.com/watch?v=wymo4gHYql4[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]Jerry Sandusky[/b][/color]\nOn Friday, June 22nd, Jerry Sandusky was convicted on 45 of the 48 counts of child sex abuse charged on him. Jerry Sandusky can be sentenced to as little as 60 years in prison to as much as 442 years. Jerry Sandusky was an assistant head coach for Joe Paterno and the Penn State football team for 30 years from 1969 to 1999 and was also the reason of last year's Penn State scandal which ended up costing head football coach Joe Paterno his job. Sandusky was convicted for sexually abusing 10 boys over 15 years. Joe Amendola, the lead of Sandusky's defense team, plans to appeal the jury's ruling claiming that the defense team did not have enough time to go through all the evidence and make a case for the defense.\n\n[color=white][b]Bus Monitor Bullying[/b][/color]\nThis week, a 68-year-old bus monitor named Karen Klein was sitting in the back of school bus 784 in Greece, New York, when four middle school students started verbally abusing her, making fun of how fat she was and of her entire family. The students were also recording a ten-minute-long video of them abusing the 68-year-old woman. After that, one of the students uploaded the video to YouTube where it went viral very fast and got millions of views, which led to  donations for the bus monitor to go on vacation. Around 600,000 dollars have been donated to her in the past few days. Three of the four students bullying her have apologized to her already.\n\n[color=white][b]Egypt[/b][/color]\nThis week, there are still no official results on the presidential election in Egypt. The results are now planned to be released on Sunday, June 24th. Egyptian authorities have delayed the results because they are currently going through hundreds of complaints about the 2 candidates: Ahmed Shafik, the former Egyptian air force officer, and Mohamed Morsi of the Muslim brotherhood. Also, this week, former president of Egypt Hosni Mubarak was in critical condition. Some reports have said that he is clinically dead and others reported that he had a stroke and may be in a coma. Hosni's attorney denies that Hosni is clinically dead. Hosni is currently 84 years old.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]App Store[/b][/color]\nApple has delivered billions of downloads across the globe from its App Store. During the company's Worldwide Developer Summit earlier this month, the App Store was made available to 31 new countries: Albania, Benin, Bhutan, Burkina Faso, Cambodia, Cape Verde, Chad, Republic of the Congo, Fiji, Gambia, Guinea-Bissau, Kyrgyzstan, Laos, Liberia, Malawi, Mauritania, Federated States of Micronesia, Mongolia, Mozambique, Namibia, Nepal, Palau, Papua New Guinea, São Tomé and Príncipe, Seychelles, Sierra Leone, Swaziland, Tajikistan, Turkmenistan, Ukraine and Zimbabwe. It sure does look like Apple is interested in taking their service to each and every place of the Earth. \n\n[color=white][b]Microsoft Tablet[/b][/color]\nRumors about whether Microsoft is going to make its own tablet have come to an end, because Microsoft has announced that it is expected to launch this October. Reports say that it will be Wi-Fi-only at first. Steve Ballmer, the CEO, has announced that it is expected to be sold without any connection to mobile phone networks as a cost-saving move. It has also been said that it will have a battery life inferior to that of its rival, Apple's iPad.\n\n[color=white][b]Windows 8[/b][/color]\nDuring the Windows Phone Summit in San Francisco, Microsoft announced eight specific platform updates for its upcoming mobile OS. One of the most consumer-oriented updates is the new start screen. The other changes include the processor and memory card support, IE 10, shared native code between Windows Phone 8 and Windows 8, a new Wallet hub, Nokia Maps and also a Windows Phone 8 for business.\n\n[color=white][b]Facebook[/b][/color]\nFacebook is on its way with its acquisition of Face.com, paying an amount of $60 million as a mix of cash and stocks. It looks like the Face.com technology could give Facebook users quicker and easier photo-tagging abilities, but some users raise privacy questions regarding that. It is believed that this will make it easier for Facebook users to identify people in photos and videos, especially when they are on their mobile devices.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]50 Cent Weighs In on Drake vs. Chris Brown[/b][/color]\nWith the fight between Drake and Chris Brown still unresolved, people are gossiping and arguing about the very known feud. On the radio with the L.A. Leakers, rapper, 50 Cent said that he was \"surprised\" after hearing about last week's bar fight and he questioned the cause of the fight. 50 Cent said that he has witnessed other men have problems caused of women before and claimed that he wondered if Chris Brown might be sensitive about Drake's so-called relationship with Rihanna. 50 Cent claimed that he was not sure of who would win a fight between Drake, Chris Brown, and Meek Mill, a fellow club-attendee. 50 Cent did rate them in the terms or aggressive musical content from greatest to worst. His results were as follows: Mill, Chris Brown, Drake.\n\n[color=white][b]Usher Tops Billboard 200 with Looking 4 Myself[/b][/color]\nUsher's latest LP, Looking 4 Myself, is now number 1 on the Billboard albums chart. It sold 128,000 copies in its first week. This album has the ability of being his fourth straight album to reach the top of the charts. In other news, Usher will join G.O.O.D. Music, Nicki Minaj, 2 Chainz, and Chris Brown in the group of performers at the 2012 BET Awards. The BET Awards will be on the air on Sunday, July 1st on BET and Centric.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=SeIJmciN8mo&feature=g-music[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=XPTZIbB1hUU[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=_0q5eAaG-38[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=buZBbyBwCjk&feature=relmfu[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nAhh, how quickly life goes. The way we comprehend things doesn't truly allow us to appreciate life. What happened yesterday is a blur among the activities of today. You probably can't even remember what you had for breakfast today, or dinner the night before. Human minds are set to a literal short-term memory. We forget things that we don't deem important, and it is left in a giant pot of swirling emotions and events that will never be recalled again. It's sad, in a sense. Life moves so quickly, and we only have the high-points to remember it. I wish we could all remember everything, and life our life moment to moment, but we don't. We live it day to day. Week to week. Life is short. Sure, you'll never do anything longer, but the amount of it that we actually remember is minimal compared to the actual amount of life we live. My two cents, try to remember everything. You'll live a more fulfilling life, because you'll actually be living all of it.",
      "subject": "*"
    },
    {
      "pid": "23815443",
      "uid": "515249",
      "dateline": "1340513434",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"Which group do you believe is most integral to Hack Forums? Minus the moderator groups--Admin, Moderator, Mentor, Staff\"\n\n[i]\"I think that the HJT Team plays an extremely important role to Hack Forums. Many new \nusers view Hack Forums as a place where only malicious acts are taught/ shared, but the HJT \nTeam sheds a new light upon the community and what is offered. Not only has the HJT Team \nprovided Hack Forum's users with free virus removal and a variety of similar services, but have \naccepted and taught many users how to remove and detect malicious items from computers in \ngeneral. Overall, I feel as if the HJT Team plays a large role in \"balancing\" the image of Hack \nForums and its user base, while helping users with a variety of problems for no cost at all.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=948300][i]-Pointz[/i][/url]\n\n[align=right][i]\"In my opinion, Illuminati is the most integral group on HackForums. They have \nthe highest quality members who contribute to the forum daily. Their tutorials, ebooks, graphics, \nand giveaways are easily the most popular on HackForums. A big thanks to Dub and Bugga for \nkeeping the group invite only and carrying on with only allowing HQ members into their group\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1235445][i]-Кristian[/i][/url][/align]\n\n[i]\"I believe the most necessary group, excluding moderator groups, would have to be the \nHighjackThis group. For those that are unaware, this group consists of white-hat analysers, \nand focus on the removal and recognition of malware and infections. Without this team, many \npeople on HF would currently be infected, and infected accounts never result in anything but \nhavoc. I believe it's one of the few groups that actually serve the community for the better, \nwith the exclusion of the Writ3rs, The Alliance, and Reviewers.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][i]-Phytrix[/i][/url]\n\nThe topic for next week is \"How do you feel about prestige?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iehSDx02HEO7d.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/iJLYc01pt24yP.jpg[/img][/spoiler]\n[spoiler=][img]http://i.minus.com/iAMgAcGlbjyjA.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=qvDPvikOb14&list=UUrKHpgaHOGBCXWVYQUiecbA&index=1&feature=plcp[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[color=white][b]Awards[/b][/color]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=175033][b]xerotic[/b][/url] is no longer a group leader of Rhythm.\n[url=http://hackforums.net/member.php?action=profile&uid=1087815][b]BasedGod[/b][/url] is now a leader of Rhythm.\n\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://goo.gl/nN5aK]RDCA[/url]\n[*][url=http://goo.gl/eswtU]SoulZeh[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/iIaDf]PyroStorm[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}