{
  "posts": [
    {
      "pid": "4960428",
      "uid": "74244",
      "dateline": "1278319507",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 8 [/align]\r\n\r\n[size=large][color=#1E90FF]Headlines[/color][/size]\r\n\r\n[color=#FF4500]It's been a quiet week at HackForums. There has not been any \"official\" announcements this week! The only \"headline worthy\" story was AsSaSs@iN stepping down from Super Moderator! He was a great staff member. His reasons were that he served a year, and felt like he had done his job. He was not demoted. We all appreciate his work, he's a great guy. He's still going to be active as a HJT Teacher and Analyzer. Thank you so much again for your work AsSaSs@iN! We all love you! [/color]\r\n\r\n[color=#FF0000]Not much news at HackForums this week. When there isn't news, I don't really feel like I have to post anything. The news is mainly Headlines, that's the most important thing. This week, there was one, and it wasn't really a headline, but I guess you could call it that.[/color]\r\n\r\n[color=#1E90FF]A reminder to all people! Check the SoTW in [url=http://hackforums.net/forumdisplay.php?fid=157]this forum[/url], and participate! Winning signature of last week -\r\n\r\n[img]http://i49.tinypic.com/5lum2e.png[/img]\r\n\r\nLook for the topic posted sometime on Monday.[/color]\r\n\r\n[color=#FF4500]As for Reviewers, Skill and I are still in process of it. Kicking members isn't as easy as you think. We'll get it done soon. Until then, sit tight if you want to become a Reviewer. Be prepared to answer a good application if you even want a chance in.[/color]\r\n\r\n[color=#9400D3]Last little note, the reason why it's coming on Monday (technically Monday, 3:42 AM here), is because I was busy on Saturday, and didn't have time today. I was going to do it today, but the day went fast, as today was a holiday. I went to a long fireworks show too. Next week's might not be posted until Monday, as I am going on a trip to Chicago for a week. I might have internet, I might not. I probably will have some, but I'm not going to be all day on the computer. If I can get it done by Saturday, I'll post it then. Hopefully there's some headlines then.[/color]\r\n\r\n~Yin",
      "subject": "HF News [Minor edition] [6/26 - 7/3]"
    }
  ]
}