{
  "posts": [
    {
      "pid": "26294532",
      "uid": "515249",
      "dateline": "1347238180",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#9f2dc5][b]108th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Junk Enabled[/b][/color]\nAfter an extensive period of time without a junking system for users (excluding Mentors/Staff), [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has finally created a [b]new[/b] system to prevent junk abuse, along with reintroducing the Ub3r Junk feature. Only Ub3r members can junk threads, and they can only do so once every 24 hours to prevent misuse/abuse. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about this change, click the following link: http://goo.gl/5v6XH\n\n[color=white][b]New Sections[/b][/color]\nEarlier this week, under the 'Miscellaneous Computer Talk' forum, the 'Web Browsers' subforum was nested. It is already home to over 700 threads, and growing! It is intended for questions and tutorials regarding all web browsers. In addition to that, the 'Graphics Resources' subforum was introduced under the 'Graphics' forum. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the new sections, click the following link: http://goo.gl/jVTvq\n\n[color=white][b]Upgraded Member Features[/b][/color]\nFor unknown reasons, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has announced that now only L33t and Ub3r members possess the ability to subscribe to threads. In addition to that, a popup message was introduced for upgraded members when attempting to close threads.\n\n[color=white][b]Minor Announcements[/b][/color]\nAs many of you know, last week Hackforums was having some trouble in relation to Microsoft's email services. The email service blocked HF emails, and despite the fact that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] is attempting to resolve the issue, it seems that Microsoft aren't living up to their customer service expectations. The issue has yet to be resolved, despite [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s efforts, although it is hoped to be fixed shortly. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] also announced that he'd be doing some maintenance work on the site, and while doing so, he updated the MySQL version for Hackforums. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the issues with Microsoft, click the following link: http://goo.gl/AOL1B\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#FFD700][b]+Entity[/b][/color][/url] was accidently downgraded to L33t while upgrading another member.\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1160330][b]WarrioR™[/b][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1011113][color=black][b]Dan.[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=144401][color=black][b]Kaleb[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=91531][color=black][b]ven0m[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1061502][color=black][b]тнє мαѕтєямιη∂[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=879431][color=black][b]Sіgma[/b][/color][/url] was vacation banned.\n[/list]\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1160330][b]WarrioR™[/b][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=144401][color=black][b]Kaleb[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=183072][b]Mr Kewl[/b][/url] received the MOTM award. Congratulations!\n[*][url=http://hackforums.net/member.php?action=profile&uid=89554][color=#0066FF][b]ℱℓℴw[/b][/color][/url] received the Sticky Man award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=871484][color=#FFD700][b]Andy[/b][/color][/url] received the YouTube award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1164841][color=#FFD700][b]Zalgo‌[/b][/color][/url] received the Dog Lover award.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=529870][b]+Pirate[/b][/url] is now a leader of Respawn.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1109404][color=#0066FF][b]Touch[/b][/color][/url] is now a leader of Respawn.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1285731][b]Aur0ra[/b][/url] is now a leader of Root.\n[*][url=http://hackforums.net/member.php?action=profile&uid=272608][b]ShadowCloud[/b][/url] is now a leader of Infamous.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=991769][color=#0066FF][b]Zecora[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2846145][b]One Reason why the Universe is not Random but Instead, it is Created by Someone.[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2842187][b]I love America[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1326923][b]Strokes[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2835607][b]Stealing For Survival[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1326923][b]Strokes[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2845378][b]What Makes Your Life Worth Living?[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=837416]Soulmate[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, Soulmate, to the 108th edition of the HF News! Any shoutouts before we get into it?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Yes, I'd like to give a shoutout to a few of my close friends, including but not limited to: Saturday, Apock, Yellows, Mittens, and Hexicidal.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Not me, such ashame :(. How were you originally attracted to HF, and which members made your starting few months most memorable?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Oh, sorry about that. A few members were talking about it in an Xbox Live party, Saturday and Cloudy I believe, so I decided to join. I soon quickly got into the GT business and sold a bunch of tags and made tons of legit deals to I had to stay, until recently, when I sold all my good tags and just kind of left that part of HF behind.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I see. You brought on an interesting topic... what is it about the HF Marketplace that aroused you back in your starting days, and what is it that triggered you to more or less quit the GT business?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Well, basically I wanted to make some money, and pick up some good tags, and I was in for a while because I was constantly buying and reselling, and there was always something to get rid of, then all of the sudden a lot of the good tags either got banned or FNCd, so that section more or less went to shit, and I didn't have anything left to contribute their either, so feeling helpless I just moved onto different parts of HF.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Makes sense. Which different parts of HF did you move on to, and do you think it was for the better? What do these parts of HF possess that others lack?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Basically the lounge, and there it wasn't just sales so practically anyone could post, and people couldn't sales trash anybody, and I was very active in the subforums for the groups I was in practically all summer, and now those are practically the only two places I \"hang out\" at now. I definitely think it was for the better since I've had 6k posts there, and it wasn't exactly the most HQ place on HF then, nor is it now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: The Lounge, sweet. You are currently in 5 custom usergroups. How do groups contribute to your life on HF, and what do each of the groups that you're involved with bring to the table?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Well I haven't been doing much for Respawn lately, but I was there for quite a while since it was practically my first group. Currently I frequent the Rhythm lounge every once in a while, as I did donate $250 to TechSperts and I've made some good friends in Rhythm, then I enjoy Logic very much as it's basically a private SRPP section, and InFaMoUs is awesome also, as it definitely has HF's finest in my opinion. Empire helps me out a lot also, as the members there are very nice.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds great. You mentioned Respawn, which you are obviously a member of. How do you feel about the recent happenings, in regards to Astonish stepping down as head, and selling off leadership positions?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Even though he was a great leader, I'd love for him to stay, but since he's been inactive Respawn has taken a change for the worse, which is why I believe he made the right decision.\n[size=small]This has changed since the interview. Astonish is no longer selling positions.[/size]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: As many members would be aware, you are probably (if not definitely) the most prominent L33t member. Your hope seems to be crushed time after time. One could assume that this hasn't taken affect on your acivity, based on you being at almost 20K posts. What are your tips to staying active?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Well as long as you're interested and don't feel like you \"have\" to stay on the site, it will bring you a long way, especially if things keep coming up like you getting into groups, and goals to strive for, such as the 24k post star, if you're close of course.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Good luck achieving that goal. How do you view the maturity level of members, the activity of members, and are there any other general observations that you've made in relation to the community recently?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Thanks. Well I believe the activity is at it's finest being here for a year, but I wouldn't say the same for the quality, nor maturity, if you take a look in the lounge, you'll find at least 3 LQ/immature threads om the front page.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: The next question is SRPP related, and comes from the recently popular thread by [url=http://hackforums.net/member.php?action=profile&uid=325511]Erudite[/url]. The thread can be seen [url=http://hackforums.net/showthread.php?tid=2816296]here[/url], and more or less is questioning todays youth. So Soulmate, where is society going wrong with today's youth, and who/what is to blame, if anyone/anything?\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Well there isn't really anyone to blame in my opinion, I mean I could say Drake for publishing the song \"The Motto\" as that looked like one of Erudite's main points to me, but it's not just \"YOLO\" and \"Swag\" that are making them act stupid, also doing things like smoking and drinking at a very early age, but I guess if the parents don't watch their kids and observe their behavior, the kids basically think they can do anything they want.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: True. There may not even be an issue; it may just be the world taking a new turn, but that's a whole other discussion. Thanks for joining us for this interview, Soulmate. Anything you'd like to add before I release you? 🤭\n[url=http://hackforums.net/member.php?action=profile&uid=837416][color=white][b]Soulmate[/b][/color][/url]: Yes, that could be a possibility. Anyway, thanks for reviewing me and thanks to everyone who's been with me here since the beginning. 😁\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1263952]Daisy[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, Daisy, to the 108th full edition of the HF News! Any shoutouts before we get into it?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: Yes, I'd like to give a shoutout to Cody, of course, because he is the Ben to my Jerry!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure he will be happy to see that. Before we get started, as usual, what brought you to HF?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: Actually Cody told me about HF. We had previously been on various different sites, chatting together and whatnot, when he asked me if I wanted to come and check Hackforums out. I really enjoyed the forum. Its members seemed friendly, and it had a really good vibe. Since then, Cody and I started to get more involved in the community and started to form good relations, mainly from contests/giveaways. It just seemed like a really nice place to settle into, so here I am.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: As one of the few females on Hackforums, you must live a different life to the male members of HF. How does being a female affect both your relations, and activity, on the forum as a whole?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: I don't really see it as a benefit, nor do I see myself to be different in any way. I don't make a big deal about it as much as other people do. Some people will PM me constantly saying \"You're not a girl\", which I respond with \"Well, I am...\". They either want proof or are really rude about it. For the most part, though, people usually question whether or not I'm a girl, and after establishing that, progress into conversation. They usually want to get to know me, what brought me to HF, what I do, things like that. Most people are friendly and welcoming like that. I don't really do much of anything but chat online, along with various things IRL. I enjoy forming relationships and holding contests/giveaways with Cody. I'm kind of like Cody's secretary. I help him out, and we do things together. It's not a huge deal, though, and I certainly don't go around bragging about it. Some people are questioning whether my reputation or popularity has been gained because I'm a girl, but that's most definitely not the case. Gender doesn't play a role in my current position.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's definitely an interesting take on the topic. What sense of satisfaction do you get out of the contests/giveaways that you and Cody host, and why do you continue to do so many?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: Personally, I like to be able to help people. That's just the kind of person I am, even IRL. I like to help, and fortunately, I can do that. When we (Cody and I) cross paths with someone who seems worthy of an upgrade or something of the sort, we'll review them further, and if we decide they really are a good member, we'll do something for them. Of course Cody likes to check the legitimacy of their quality, so he more or less stalks them to see if they are contributing, outstanding (unique), and what their HF history is like. Cody really goes deeper in that sense before making any decisions. Reputation, join date, contributions (threads/posts) and overall standing within the community are vital to review. A lot of the time, there are so many awesome members who are being held back financially. To me, $20, $40, $60 is not a massive deal, but I know it can mean a lot to some people, so why not? Helping people out in that sense is rewarding in itself, which is why we do so many contests/giveaways. He'll get on to me when we start a contest. We'll set an estimated run time, prize amounts (number of people), etc., which I'll agree to. I usually get overtaken by the satisfaction, and end up having double the estimated amount of winners. I just like helping people, and contributing financially, even if that sounds a bit lame, but that's just what I like to do, especially when it's someone who can't upgrade, buy MSP, obtain a decent email or buy an award. The response that I get on occasion from people is a true reward. What else would I spend my money on? Another purse, more shoes?\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, your generosity doesn't go unnoticed. What do you feel is the best part about HF, if you had to highlight some in particular?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: Definitely the community, people that I've met. I've met some really awesome people, and I'm the type of person who believes that connections [b]can[/b] be formed online. The one between Cody and myself, which has been going for around 4 years, is different, though. I've met some really great friends since I've joined. We talk online, about life in general, and there's lots of people who i can talk to about a whole array of things. I enjoy talking to Sam (Brock Obama) about a bunch of things, Yellows (Phegget) as we have a lot in common, and I have formed a decent relationship with Positive over recent times. I also enjoy talking to Grin about anything, from his cat, to his lack of bowel movement, as awful as that sounds. I received a PM from Grin while I was away, which linked to a thread. I thought \"Wonderful\", but after reading about his bowel movements, I changed my mind... The human aspect of it is very real. Some people look at virtual things as a computer screen and keyboard, but don't stop to think about the person and memories on the other side. They don't see how you can connect on a different level. Sometimes just scraping the surface, sometimes deeper, you can make a meaningful connection and get to really know people online. I'm a people-person anyway. Maybe because I'm a Southern 'gal, I don't meet a stranger and see things in black and white. I love to talk. As much as my mouth moves, my fingers move twice as fast. Relationships are the key.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I agree. You are currently an active member in two groups (Rhythm and Serenity). How do these groups play a role in your HF life?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: These two groups are so different in comparison to the rest of HF. That's what I love about them. Serenity is so cerebral. That's where I go to get my intellectual fix. I love going there and reading the debates, seeing the opinions of various members, in particular Apathy, malichi, Libertarian, Dan. and of course Cody. They're so many knowledgeable people in serenity, and it's a really great group. Rhythm is just what it sounds like; Rhythm. Just saying the word is great. There are so many fun people in that group, and the statement \"It's the people who make the place, not the place that makes the people\" definitely plays true. I suppose I'd consider Rhythm my home group. I would just sit there all day and do everything for Rhythm if I could. I hold pizza contests, giveaways, contests and post generally interesting threads/post as my part. It's definitely one of the more fun places of HF. It's . It's definitely one of the more fun places of HF. It's starting to slow down, with people starting school and whatnot, but we'll get the rhythm back soon enough.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: As a person who obviously maintains a healthy relationship, what tips can you provide those lost in the field of love? How can one maintain a lasting and working relationship?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: I think the key to any relationship is, as cliche as it may sound, communication. Even though I don't like arguing or having any negativity around me, to keep things healthy, you have to talk about everything and anything. If something is bothering you, let it out. You have to know when to stand back and put the other person first as well. I think a lot of the time we tend to be selfish, and think about ourselves rather than the other person. If two people love each other, they should think about the other person a lot more than they think about themselves. Sometimes that's a good thing, sometimes bad. You need to know where to draw a line.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Wise words from a wise woman. Being the debating group that Serenity is, you must have a philosophical attraction towards arguments and debates. Extending on the topic of religion, what religion do you follow, and what is your view on the ongoing debate about religion?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: Well, I must say that being a Southern gal, there are a few things that I don't discuss, and they would be religion, sex and politics. We don't talk about those things, it may be a bit old fashioned, but that's how I was raised. Those discussions tend to get heated or out of hand. Yes, it's a debating group, but I can pick which debates I partake in. I can otherwise see religion threads, read them, view opinions, see people go back and forth, and contemplate on all of it. The beauty of Serenity is that discussions can get lively, but stays calm, professional and adult-like. At the end of the day, members can agree to disagree. There is no trolling, flaming or idiocy. Again though, personally, I don't speak on those topics. Financial status isn't discussed, either. You can assume financial status, but it's rarely discussed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I see. This topic was introduced by Zane, and the topic was questioning whether mankind is inherently evil. One could suggest that, if no laws existed, the world would enter a new stage of turmoil. Are humans really civilized, or is it simply the punishment that is holding us back? What are your views on this topic?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: I think we have both good and evil inside of us, and we possess the ability to choose how we want to act upon things that happen. Whether it's about morality, laws, or even some strict religious views, we make a conscious effort towards every decision we make. We all have both in us, but we can decide which to choose as we desire.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: The next question comes from us from Sigma, previously Pali, and he asked what your definition of 'contributing' is. So, Daisy, what is your definition?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: I think contributing is basically helping in any way or form possible. Whether it's taking a new member under your wing, helping them navigate around the forum and guiding them towards appropriate behavior. Show them the way. It's so easy to say \"Welcome, [help]\". If people do even bother to read it, they usually just skim through and leave valuable details out. They'll probably end up messing up, so even explaining to them some of the rules is beneficial. If you guide them, people take in the info better, and will, in result, go further. Left and right, people attack new members rather than explaining things to them. Show them how this is done, how that is done, and you're making a lasting contribution. Making tutorials are great also. I enjoy reading a large array of guides/tutorials, and the sharing of knowledge is the best form of contribution. Giveaways/contests, and just being active plays a role in a contributing member also. A good kind of active, though. In my eyes, there's two kinds of active; the type where you're simply taking up space, and then there's [b]pro[/b]active, when you're really helping out. Contributing can refer to a huge range of things, so it's hard to cover them all, but it's more about helping and sharing in the best way you can. Share your knowledge. If I had more to teach/share, I would, but I don't have a vast knowledge as far as HF goes. I give advice where needed, get personal and form relationships, or even feed people (pizza contests)! I don't eat pizza, but I have no problem fattening up the rest of the world! :)\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Great answer. Thanks for joining us for this interview today Daisy. It's been an honor to have you. Any final thoughts/comments before I let you get back to life?\n[url=http://hackforums.net/member.php?action=profile&uid=1263952][color=white][b]Daisy[/b][/color][/url]: I'd like to thank you for choosing me to be interviewed. It's an honor for me to be chosen by you, especially since you have such a great standing; not just amongst the community, but amongst the HF News team. I'm truly honored, so thank you. A quick hello to all my Rhythm buddies, and to all of the great people in Serenity as well! For the record, now that you've talked to me, and we've been on Skype, just to clarify, I am a girl. So people like bellita can stop telling me I'm not. Thanks Phy :)\n[/spoiler]",
      "subject": "[9/8/12] - HF News"
    },
    {
      "pid": "26294546",
      "uid": "515249",
      "dateline": "1347238207",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[i]MarkMare was unable to produce his article.[/i]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]France's 1% of the 1% applies to be a Belgian[/b][/color]\nThe newly appointed French president Francois Hollande is pushing his plans to tax French millionaires up to 75 per cent. This is in result to the recent falterings of the euro, and the need to jump-start the French economy. Bernard Arnault, the richest man in France, has revealed his intentions to become a citizen of Belgium. Although he feels these new tax rates to be unfair, he has stated he will remain a taxed resident in France. Judging by his total worth of around US$41 billion, if he doesn't end up seeking tax exile, the French government could stand to make a lot of financial relief from this one man.\n\n[color=white][b]Jobless Rate Drops to 8.1%[/b][/color]\nThe rate of jobless Americans is still an issue in today's society. In just this last month, American employers added around 96,000 new jobs to the job pool. Even though that seems like a hefty amount, it's just not enough to turn the tide. People are starting to leave the workforce, finding it easier to live off of unemployment benefits--rather than work their fair share. While it is good that the per cent has dropped, it's heavily weighed upon the fact that some 360,000 Americans left the labor force, lowering the amount of people in the statistics. A success on paper, but not a success that will last. \n\n[color=white][b]Old Mars, New Studies[/b][/color]\nWith the recent focus on Mars, several new studies have been coming out. In the past, it was deemed that Mars was a possible location of other life-forms due to the higher levels of specific minerals pointed to the presence of water. However, scientists are now finding that Mars had much worse living conditions than previously anticipated. There were frequent volcanic eruptions, and with the rover, they are able to tell that the only presence of water, was in water-rich lava--leaving behind a false trail, for the expectant conspiracy theorist.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Amazon[/b][/color]\nAfter months of hype from techies globally, Amazon has officially announced and previewed their three new Kindle Fires: Fire HD, Thick Fire HD and extra-fancy Fire HD. The costs of these new Kindles are $199 (Fire HD), $299 (16GB Thick Fire HD), $369 (32GB Thick Fire HD), and $499 (32GB extra-fancy Fire HD) and $599 (64GB extra-fancy Fire HD). Every tablet has its own uniqueness in comparison to each other, and are [b]all[/b] expected to all take off with a bang. The extra-fancy Fire HD has AT&T's 4G LTE support. Each of the new tablets will have improved display, design, and other hardware specs than the old Kindle Fire lacked (faster processor, more storage and front-facing camera). These new releases are expected to outshine the profits of the previous Kindle versions, burn iPad sales, and even put the Nexus 7 sales to shame! The 7-inch Fire HD starts shipping on September 14th, while others will be released in the months to come. The high-end LG 4TE models aren't expected until November 20th, although dates may still fall slave to fluctuation.\n\n[color=white][b]Spotify[/b][/color]\nThe infamous music streaming giant, Spotify, has leaked word that they are currently working on a browser-based version of the currently popular desktop application version. Spotify currently requires users to download a player, although this new age of technology has persuaded them to extend their market, TechCrunch reports, citing unnamed sources. This application is currently available to all Windows, Mac, Linux and mobile users, along with various smaller-scale devices. This application currently has both visual and audio advertisements implemented, which led to Spotify's plans of an ad-free version, for only $8 a month for mobile users, and $5 a month for mobile users! Spotify is also preparing an offline listening service for only $10 a month. \n\n[color=white][b]HTC[/b][/color]\nHTC, arguably the underdog in the Smartphone business, has stated that they plan to come back into business. HTC is looking forward to compete against the world's best-selling Smartphones, such as the Samsung Galaxy S3 and iPhone 4S. HTC claims that their HTC One X will be a major threat to the current Smartphone leaders, Apple and Samsung. Reports say that the HTC One X has doubled the sales of HTC's other available products. HTC also demonstrated why they believe the One X is better than the S3 in a press conference earlier this week. \"We've got a great product. When I demo the camera, I always get a 'wow' reaction; we need to deliver that 'wow' in our communication\" said Jason Mackenzie, HTC's head of marketing and sales.\n\n[color=white][b]Apple[/b][/color]\nIt's been rumored that the success of Apple's tablet sales, among the other companies, is persuading Windows, along with other companies which excel in the laptop business, to extend their target market. Amazon's Kindle Fire HD ($199) and Google's Nexus 7 (also $199, $249) are prime examples of the need for portable and cost-effective devices as a major sector of Microsoft's sales. It points out the flaws in selling $700 laptops to businessmen, women and other consumers who need a device for entertainment or smaller scale work. It's obvious that the consumer is looking for something both affective and portable, yet Microsoft continues to release larger and more expensive products. As a result, expect to Microsoft release a tsunami of tablets and portable devices over the coming months. The question is not whether Microsoft will follow the trend, but rather what they will do to revolutionize the industry.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]PETA Slams Gaga[/b][/color]\nEarlier this week, while the pop-star Lady Gaga was in Germany, PETA made a statement on an image of her wearing fur. Lady Gaga, who had previously been a minor spokesperson and took a stance [b]against[/b] wearing fur by wearing a jacket made of Kermit the Frog puppets, now no longer states whether she wears animal fur or not. A female spokesperson for the globally renowned animal rights organization stated \"The picture speaks for itself (referring to Gaga's image). PETA is considering passing the hat so that someone can buy her a heart.\" \n\n[color=white][b]'Lil Wayne Suing Quincy Jones[/b][/color]\nThe infamous rapper 'Lil Wayne filed a lawsuit against producer Quincy Jones earlier this week. 'Lil Wayne claims that the producer never asked permission to use his music in a documentary 'The Carter', a documentary about him. Jones has yet to make a statement, although there is some sense of irony in the lawsuit. It seems that 'Lil Wayne had somewhat cooperated in the filming of the documentary, based on the fact that he let a camera team follow him around and film his everyday life, although apparently nobody on the production team had clarified whether or not they could use any of his music. The documentary used over a dozen of 'Lil Wayne's hits.\n\n[color=white][b]Pharrel Williams Likes Older Women[/b][/color]\nThe N.E.R.D. star, Pharrel Williams, revisited his childhood earlier this week when he stated that he lost his virginity to an older woman, and has a fetish for them still. The 16 year-old Williams lost his virginity to a more senior lady. Ages weren't mentioned, but Williams also stated that powerful women with life experience who are intelligent, are a major turn on for him. The 39 year-old also stated that he doesn't like girls who plays games.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=Gj5L9SYhoSE[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\nThese aren't actually member submitted videos, although since the actual Music News writer is out, I chucked these in. Enjoy!\n[video=youtube]http://www.youtube.com/watch?v=eu-xFvLaE68[/video]\n[video=youtube]http://www.youtube.com/watch?v=ghb6eDopW8I[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nWe have a few openings this week. This will go much like last time, I will provide characters that directly relate to one of the positions, and you must post whichever ones you are interested in your reply to the HF News. Just copy and paste the selected characters you're interested in to show your interest in joining the Writers.\n◘ = Interviewer (1x Opening)\n○ = World News Writer (1x Opening)",
      "subject": "*"
    },
    {
      "pid": "26294548",
      "uid": "515249",
      "dateline": "1347238212",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What is your dream job? Why?\"\n\n[i]\"My dream job is to become an entrepreneur, but not like a lame one who \nis always trying to find work and never does. I wanna be one who can just \ncome up with the next big thing and make something outta nothing. Because \nfrankly becoming a lawyer, firefighter, police officer or something along those \nlines sounds boring to me. Now don't get me wrong I have been on a ride along \nwith my dad who is a cop, He was on the grave-yard shift at the time and \nsome pretty cool things happened. But I want to work and own a company \nthat is my way my business and my empire.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1058305][i]-Ida[/i][/url]\n\n[align=right][i]\"My dream job is nothing really special. I want to become a band \nteacher. I'm starting my junior year, and everything I do, is based and crafted \naround music. To me, learning tens of different instruments and being able to \nteach others those instruments would be very rewarding in its own way.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1091100][i]-Racutt[/i][/url][/align]\n\n[i]\"My dream job has always been to be a web developer but as of right now im \njust a newb at web design more recently I have been working on a friends website \nwith no success, I've always wanted to do web design as a job because I figure it's \nan easy job once you know what your doing and I'm one of those people who once \nI start something I'll finish it.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1119610][i]-Winner[/i][/url]\n\n[align=right][i]\"My dream job would be that of a medical practitioner. It's something \nI've always wanted to be simply because I like helping others and I like the satisfaction \nI would get when I see that 12 year old walk out with a smile on their face, or the thanks \nof a spouse as I assisted in the treatment and rehabilitation of a person with a stroke. \nFor me, it is about the people and knowing that I have made a difference in their lives.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=899243][i]-Harry Dresden[/i][/url][/align]\n\nThe topic for next week is \"What's your favorite/least favorite thing about Hack Forums?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/ioQ9QDnguVVGB.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibcd7AAWyUcLBt.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/iwW8j8PjU4DtK.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=7TfwDkVd2SA[/video][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*]OPEN\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*]OPEN\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}