{
  "posts": [
    {
      "pid": "34298759",
      "uid": "515249",
      "dateline": "1375249709",
      "message": "[align=center][IMG]http://i.minus.com/jKNmbtspH7Pil.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#E42217][b]153rd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jbd50RvJc3HTdt.png[/img][/align]\n[b][color=white]HF News Team Makes Some Changes[/color][/b]\nRead [url=http://hackforums.net/showthread.php?tid=3658776]this[/url] right now. Don't even finish reading this edition, go there now and read it. Then, reply with your thoughts.\n\n[b][color=white]HF News Team Open For Recruitment - W4TCHL1ST[/color][/b]\nIf you're interested in joining the Writ3rs under the HF News team, go read [url=http://hackforums.net/showthread.php?tid=3658966]this[/url].\n\n[color=white][b]Avatars Temporarily Disabled and Server Migration[/b][/color]\nHackForums has recently been migrated to a new server, announced by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]. There was talk about this happening by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] himself listed in last weeks addition, this will provide better protection, and next to no downtime at all. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] claimed DDoS attacks should be virtually impossible from this point on. Avatars are also disabled while the above changes are made and altered to perfection. So if you're wondering why you cannot upload your avatar, then that is the answer.\n\n[b][color=white]@HackForums.net Email Forwards Have Returned[/color][/b]\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has annoucned that HackForums.net email forwards have now been re-enabled for Ub3r members. All current emails have been lost which were previously forwarded. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] disabled this previously due to the abuse and attacks at the mail server at HackForums, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] claims he has purchased a third party mail server and it will have no problem this time around. If you would like an email, you may sign up for an Ub3r email here: http://hackforums.net/ub3remail.php by the looks of it, only those who previously had it can apply for one, at this point in time.\n\n[b][color=white]HackForums Rehab[/color][/b]\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] started a thread asking HackForums members why they are personally addicted to HackForums. This thread received a lot of attention and responses. Tell us why you are addicted to this wonderful forum [url=http://hackforums.net/showthread.php?tid=3632915.]here.[/url]\n\n[b][color=white]HackForums Twitter[/color][/b]\nWe would just like to take a moment to point out the official twitter account for HackForums is @HackForumsNet and can be found here: https://twitter.com/hackforumsnet here you will find a lot of updates, news and happenings posted by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] himself. Thanks.\n\n[b][color=white]Remember To Help Us Out![/color][/b]\nThe HackForums News Team (Writ3rs) can only cover so much ground around this huge form and we appreciate all the help we can get about the current happenings around HackForums. So please don't forget to post everything that [b]you[/b] think should be in the news in this thread [url=http://hackforums.net/showthread.php?tid=3318994]here.[/url] This way we will be able to cover everything we deem necessary, we don't have eyes on the back of our head, or though we wish we did.  \n♥ -HF News Team\n\n[align=center][img]http://i.minus.com/jbrPyz6ReCubi3.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1008927][color=#0066FF][b]Lads[/b][/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=931798][color=#0066FF][b]Tiszy[/b][/color][/url] & [url=http://hackforums.net/member.php?action=profile&uid=275104][color=#0066FF][b]Delicious[/b][/color][/url] hit 1,000 reputation.\n[url=http://hackforums.net/member.php?action=profile&uid=183072][b]Mr Kewl[/b][/url] was demoted back to Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=11960][b]Kn1ght[/b][/url] was promoted to Staff.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=496906][color=#383838][b]TiME FLiES[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1539739][color=#FFD700][b]George Zimmerman.[/b][/color][/url] was repfucked for Reputation Abuse.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1377364][color=#FFD700][b]Tweet™[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1033713][color=#0066FF][b]Formula1[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1848922][color=#383838][b]Shαdow[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1702377][color=black][b]Justice™[/b][/color][/url] was repfucked for selling their account.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1759389][color=#0066FF][b]Tᴇɴᴀxɪᴜᴍ[/b][/color][/url] was repfucked.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1341359][color=black][b]Unacknowledged[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=47360][color=black][b]The-Ex[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=496906][color=#383838][b]TiME FLiES[/b][/color][/url] had their account closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=667703][color=#0066FF][b]NetScope[/b][/color][/url] was banned as a precaution as their account was compromised.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=646916][b]Genuine[/b][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1848922][color=#383838][b]Shαdow[/b][/color][/url] had their account closed.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=763021][color=black][b]Retribute[/b][/color][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1382766][b]Paranоrmal[/b][/url] took a vacation ban.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1249103][color=black][b]Frost Byte[/b][/color][/url] was banned for selling his account.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=737632][color=#0066FF][b]Senior Sherlock[/b][/color][/url] was banned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1422674][color=black][b]Raitz[/b][/color][/url] was banned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1702377][color=black][b]Justice™[/b][/color][/url] was banned for selling their account.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1759389][color=#0066FF][b]Tᴇɴᴀxɪᴜᴍ[/b][/color][/url] was banned then unbanned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1341359][color=black][b]Unacknowledged[/b][/color][/url] was banned.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1371476][color=black][b]Feynman[/b][/color][/url] was vacation banned.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1121674][color=#0066FF][b]FroStorm[/b][/color][/url] bought the Brony award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1797738][color=#FFD700][b]Canc℮r[/b][/color][/url] received the Black Hatter award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=880484][color=#FFD700][b]Icosahedron[/b][/color][/url] received the Sushi Lover award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1050193][b]Connected[/b][/url] received the Spy award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1759389][color=#0066FF][b]Tᴇɴᴀxɪᴜᴍ[/b][/color][/url] donated for Master Donator.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1777686][color=#0066FF][b]Huskers[/b][/color][/url] received the Cat Lover award.\n[*] [url=http://hackforums.net/member.php?action=profile&uid=1085827][b]Razmus[/b][/url] received the Pizza award.\n[/list]\n\n[align=center][img]http://i.minus.com/jMSrdyQChTalc.png[/img][/align]\n\n[i][b]Graphic Tutorial[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3640362]Vector Tracing and Coloring Tutorial[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1632487][b]mjaj13[/b][/url] - A fantastic vector tutorial.\n\n[i][b]Lounge Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=3646632]Who Would You Want To Meet At An HF IRL Gathering?[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1113153][b]Tando[/b][/url] - A thread to discuss who you'd like to meet on HF.\n\n[align=center][img]http://i.minus.com/jun9oZkuCHRrn.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=133256]Umbrein[/url][/font][/size]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: For the 153rd edition of the HF News, we've traveled across space and time to chat with Umbrein. Any shoutouts you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: Yea I'd like to make a shout out to my brother Pookie, he was wrongfully convicted for bank robbery and mass murder. He din' do it! I'd also like to shout out to; \n[size=small]Skill, Nate, Dexus, Paradoxum, Robbie, Qwazz, Inviz, Pali, THL, Wolves, Tasemu, Happeh, Hexicidal, Teh Hacker, Saged, Vorfin (I miss u :c), AeonHack, BagHead, Lovol, Positive, Sir, Yck, Nyx, Reece, Sold, and aslkwhelajkfh everyone I don't fucking hate. D: TOO MANY PEOPLE.[/size]\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: You've got quite the circle of friends. How did you come to meet some of these people?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: I'M SUPPOSED TO REMEMBER? God dammit. Uhm most of them are from the groups I've been in or led. Skill, Para, & Saged, I knew of all of them for a long time, but I didn't really get to know them until I was added to The Alliance and later made leader. Tassy and Happeh I know from AA, Vorfin and Aeon from the .net section. They both were my mentors in a way for a long while. Wolves, Inviz, THL, & Reece I know from being their leaders in either BK or TA. BagHead, Lovol, Pali, Dexus, and Hex are all people I've met in the groups I've been in and developed a friendship with. Robbieava, Positive, and Qwazzypooh I just sort of happened to meet. We just started talking and became good friends. They're easily three of my closest friends (in terms of what they know about me) on this forum. Nyx and Yck I know just because they were around when I lurked the forum and ended up meeting them at one point or another in The Lounge. Nyx actually lived an hour away from me for a long while. I met him, though I didn't introduce myself as Xypher to him. :3 And then Sir, I met him a few years ago when he and one other member (??? I believe?) started a forum called ThinkForums, which was more or less a forum dedicated to the subjects that are discussed in the SRPP section. All of them are members that have made my life on this forum exist and whether they know it or not, have helped me through a lot of my personal shit. Last year Qwazz and I planned on moving to San Fran together, which at the time was the only thing keeping me from killing myself. Plans fell through because I went to the hospital, but just the plan alone helped. Tasemu and Happeh helped me rediscover the kid in me which helped keep me happy. BagHead, Lovol, and a few others are the ones helping me move forward and stay dedicated to a project I want. God there's so much I could say about how I've met them, but this is turning into an essay. :3 Love you guys <3\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Groups, groups and more groups... why did you get involved in usergroups such as The Alliance and the Black Knights?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: When I first joined the forum I was a group whore. I applied for every group I could, official or unofficial. Black Knights was the first official group I got accepted into and the only one for a long time, until The Alliance. BK was beginner friendly. At the time Yin was the active leader of the group and he wanted to help people start off, it helped me get a foothold in this forum. The Alliance... to me that was the top. If you were in The Alliance, you were basically the best. Most of the staff members at the time were involved in the group, and we're talking back when there was 8-13 staff members or so. To me, they were the gods of the forum and I wanted to be one of them.\n\nWith The Alliance, it was a time where Para was busy with what I'm assuming to be finals and couldn't be around. Saged was the only other leader and he too was busy with school as well as staff. The group was inactive, on the brink of actual death. I just kept pushing for people to be active and apparently it was noticed. I remember waking up and seeing a PM from Saged, titled, \"-\" and all it said was, \"don't fuck up.\" I had no idea what he was talking about, then I went to deny people that had applied to The Black Knights via UserCP and noticed The Alliance was there also. I basically clapped like a retarded penguin. As for The Black Knights, it was the same scenario, just S70N3R, Maximo, and I were the three pushing for activity.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Interesting. I could imagine feeling the same way, as I did for the Techsperts. What has attached you to those groups in the past and present?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: The people in it. If it wasn't for such great people within the groups, I would have surely just left and found a different group to be apart of.\n\nAND LEAVE US? Kidding. Do you have any plans to start your own group in the future, given the experience you have?\nI've thought about it, sadly I'm not in a place to just up and spend what I'd assume to be $5,000 on a group. I have people that I know want to bring back Black Knights, but to me Infamous is the second coming of BK. Inviz and THL started in BK just as I did, now they own/lead a group that is exactly as it once was. It'd be pointless having to of the same group.. sort of like most of the groups now. >.> I do have ideas for a group, but again, not the money. :3 But we'll see what the future brings.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Perhaps Omni will sell groups again if he sees the opportunity. Alas, how would this group be different from others?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: That I can't say. The group I'm planning now will be quite different from how other groups are on this forum. Every group on this forum ends up having the same functioning or goal in one way or another, I want to be different just to be different. :3 But like I said, the details are a secret for now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Secrecy. I admire that. What attracted you to HF initially? How did you find your way here?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: I wanted to get all the pussy. That and I wanted to learn to hack. Something of mine had been hacked, I wanted revenge at first, then I got to the point of anger that I wanted to be the big bad cyberterrorist that hackers had the reputation of. It took me about a year to get bored of that, but by then I was attached to the community, the programming sections, the graphics sections, and people.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: We're all like that when we come here, aren't we? When did you stop being immature and become the cat god we all know?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: When I first started actively posting, I had the same internet grammar every gamer did. I said, \"u\" instead of, \"you.\" I didn't use punctuation and I didn't care about spell check. It took about a week for me to realize that that just doesn't work on this forum. People expect grammar and properness (at least, they did.) Of course, I didn't have great grammar either way, but once I started paying attention.. I'd say it took a month for me to have proper grammar. In terms of how I acted, I've always been more mature than my age group. My mother and my grandparents raised me, I always preferred sitting at the adults table and talking politics, religion, economics, etc. I never enjoyed teen gossip or high school drama so it was easy to avoid that here. I just acted how I normally did. Though just like everyone, I have my moments where I just act like a little kid, but y'know.. I find that important, it keeps life fun when you have a kids perspective, even if others view it to be an improper time.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: \nYou can have fun while being an adult. What skills or attributes have you picked up as a member here?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: Four and half years gives you a lot of time to no-life a forum and a lot of different areas at that. I've spent most of my time studying programming, cryptography, computer security, graphic design, server administration, group leadership, marketing, reverse engineering, and other black hat/illicit topics that aren't okay to be discussed on this forum. My strongest of those these days are marketing, graphic design, and server administration as those are three I do daily, whether it be at work or at home with my game servers I work on.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: You've built up quite an arsenal of tools. Do you use any of these to make money or for school?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: D: That sounds so exhausting. For my job, the graphic design and marketing takes place. The rest of it, no. I'm too lazy and have too many interests to stick with one idea long enough to see it through. >.> It's bad, I know, but I don't know how to change it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][b][color=lime]D3xus[/color][/b][/url]: Whatever works best for you. :P That's all the time we've got for now... any closing comments or remarks?\n[url=http://hackforums.net/member.php?action=profile&uid=133256][b]Umbrein[/b][/url]: 😑 Mommy always said if you don't have anything nice to say, don't say anything at all.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview[/font][/size][/color] [color=white][size=large][font=Monotype Corsiva]-[/font][/size][/color] [size=large][font=Monotype Corsiva][url=http://hackforums.net/member.php?action=profile&uid=1306528]Tibit[/url][/font][/size][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Today, for the 153rd edition of the HF News, we will be interviewing the infamous member Tibit, owner of The Empire and its products, who will be leaving the forums shortly and transferring ownership to [url=http://hackforums.net/member.php?action=profile&uid=1306528][b]xadamxk[/b][/url]. Any shout outs before we begin?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] Just to The Empire, it's the reason I've stayed on HF for this long and is about to come up on it's one year anniversary on the 7th. I'll do more specific shoutouts when I finish my feedback thread.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: I'm glad to have been a part of The Empire since September 2012. Why are you leaving Hack Forums?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] I am not going to completely leave for awhile. I will be on vacation for the month of August, however, I don't intend to be active or playing a large role on the site after my vacation. The site is good overall, but I don't have as much free time as I used to nor do I have as much interest in the site any longer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: What will happen to the Official Empire Products?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] They will continue on until mad is ready to leave as well. We will give more than a month notice before slowing down or stopping any products. We will keep them going for the forseeable future, but my role in them will be drastically reduced.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Has your career on Hack Forums changed you in any way?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] Yes. I have learned quite a bit that has influenced me throughout my time on HF. It showed me all kinds of people, those that are the worst types of people, who are completely hateful individuals, and those who are the best types of people, who are always willing to do whatever they can to better the lives of others. The experiences I had either directly from Hackforums or indiectly due to something relating to Hackforums have taught me quite a bit.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: What will you miss the most when going inactive?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] I will mainly miss The Empire. It's the reason I've stayed on HF so long. I made some good friendships that will continue whether I'm on HF or not and had some fun.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: What is exactly planned to happen with The Empire in the near future?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] We will be doing a group-wide giveaway for the 1 year anniversary of The Empire soon. xadamxk will be taking over starting August 1st. I will officially transfer ownership to him sometime after my vacation. However, right now he basically is the owner. I preferred to give it to him rather than sell it so it remains The Empire and is able to continue on.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: I'm sure it's a good idea to make the group live on for a very long time. Is anything going to change when the ownership transfer happens? Userbar, Leaders, Description, etc?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] No. The Empire will remain the same for the time being. The current leadership team will remain the same until Adam decides to make any changes to it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Why have you chosen xadamxk?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] I chose him for several reasons. However, the most important is that I trust him completely, he is a great friend on-site and off-site. I'm giving him the group as a 'thank you' for being a great friend for the last year. Many of the members were quite upset when rumors of the group being sold surfaced months ago, the group is a family, many of the members have strong friendships with each other that were formed inside the group and are now friendships both on and off-site. I want The Empire to continue to be that family, even if I'm no longer able to continue that personally. I believe Adam will do a great job ensuring that continues to happen.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Tell us about the donations/giveaways you've made on Hack Forums.\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] I've given away quite a bit of money and items over the couple of years that I've been on HackForums. Specifically to Omni I've sent between $14,500-$15,000. I've helped some groups pay off their balances, paid for awards for people, sent gifts on holidays and birthdays, and I've done plenty of contests inside and outside of group sub-forums. I don't regret it either. I am glad I was in a situation where I was able to help others.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: Thank you very much for being in this interview, Tibit. Do you have any final words and goodbyes that will be forever engraved in this edition of the HF News?\n[url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] Thank you, only this to the reader, remember to be yourself, if you wouldn't say it in person don't say it through a computer, don't take everything so seriously either, get out every once and awhile, enjoy your life while you can.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1050193][color=#91FF00][b]Connected[/b][/color][/url]: That's so true, I hope the members understand it as well as I do. Dear readers, please send a private message to me  [url=http://hackforums.net/private.php?action=send&uid=1050193&subject=Interview%20Feedback][b]here[/b][/url] with feedback and comments about this interview.[img]https://cdn1.iconfinder.com/data/icons/mazes/07%20Cool.png[/img]\n[/spoiler]",
      "subject": "[7/29/13] - HF News"
    },
    {
      "pid": "34298763",
      "uid": "515249",
      "dateline": "1375249722",
      "message": "[align=center][img]http://i.minus.com/jnu3IMOhyb7dH.png[/img][/align]\n[color=white][b]MineCraft TU12 Coming Soon![/b][/color]\nThe long-awaited TU12 update is coming for all of the Minecraft players on Xbox. The update features numerous already-available PC features such as: texture packs, jungle biomes, mob heads (except wither skeleton skulls), iron golems, ocelots, cats, and a few other tweaks.\n\nWith the implementation of the new biome, players can definitely expect some biome-specific blocks. Blocks such as jungle wood, jungle wood planks, cocoa beans, redstone lamps, and chiseled stone blocks will arrive. Players will definitely get the full feel of jungle biomes.\n\nTU12 also offers a few tweaks regarding stairs. Much like on the PC version, you can now place stairs upside down in addition to any other direction. They're also now interactive in that corner pieces will automatically adjust. It's not the most useful thing to fix, but it sure does help those who care about design.\n\n[color=white][b]New Skin Pack to Come for 360![/b][/color]\nComing July 31st, any Borderlands fan will be happy to hear that a new Minecraft skin pack is being released oriented partially around Gearbox's popular game. Skin Pack 5 will feature not only characters from Borderlands, but from Dead Space as well.\n\nNew skins will include the Borderlands characters Handsome Jack, Maya, Salvador, and Axton. The Dead Space characters will include Carver, Isaac Clarke, the Puker Necromoprh, and Ellie. \n\nPlayers will be able to buy the Skin Pack starting July 31st for a low price of 160 Microsoft Points. \n\n[b][color=#ffcc33]Featured Server of the Week:[/color] [color=white]Woodycraft[/color][/b]\nAfter a video made by a popular Youtuber, WoodysGamertag, a new server was released in his name. In addition to the survival play-type, the server features a few different sub-servers including factions, creative, and survival games. When playing, you can buy some of the upgrade ranks which offer exclusive in-game features. Surely you'll never be alone on that server as plenty of his Minecraft-loving fans are always on. Check it out today at hub.woodycraft.net!\n\n[align=center][img]http://i.minus.com/jQ5EQ2ltjeK36.png[/img][/align]\n[color=white][b]Robber Steals $53 Million Worth of Jewels[/b][/color]\nAs police watch over the Carlton Hotel in Cannes, France, they reported that a man stole $53 million worth of jewels. Inside the hotel, an exhibition as going on. An armed robber decided to ruin the party and stole everything he could. The robbery took place on Sunday, July 28th in the morning. An officer stated that he did not know how much the jewels valued, but is determined to find whomever did this. The robber was supposedly wearing a hat and a scarf threatened everyone at gun point if they didn't hand up the jewels. The guards couldn't do anything because they were unarmed and unable to fight back. This is the second robbery regarding something over $1 million of value this year.\n\n[color=white][b]Bananas Thrown at Italy's First Black Minister[/b][/color]\nItaly has received a new minister. Racial slurs and various other rude things were thrown at Italy's first black minister, Cecile Kyenge. During a rally that took place to celebrate Cecile's new position, bananas were thrown at her. For the past three months she has been getting hate from Italian residents, too, but this is the most recent incident. This horrible mess occurred this past Friday, July 26th. Police have not found who threw the bananas and this is simply a childish act being played. Kyenge just 'shrugged' this off and went on with her day. Giancarlo Mazzuca, chief editor of the daily newspaper \"Il Giorno,\" only two chairs award from Kyenge. \"I was able to verify which levels can be reached by human stupidity,\" he wrote in one of his articles.\n\n[color=white][b]1,200 Inmates Escape From Benghazi Prison[/b][/color]\nAuthorities involved in the escape of 1,200 inmates are currently trying to find the fugitives who ran away. The prisoners escaped Friday, July 26th, but news have shared that only 18 people have been captured and put back into custody. The residents even helped the escapees; they told the government that they did not want to live near a prison, so they helped prisoners by opening floodgates to help them escape. Authorities were instructed \"not to draw arms against citizens.\" The prime minister, Zaidan, has ordered the closure of Libya's borders.\n\n[align=center][img]http://i.minus.com/jbirdFfeOijxAv.png[/img][/align]\n[color=white][b]Admittance to 'Too Much?'[/b][/color]\nShortly after the release of the Surface RT tablet, Microsoft CEO, Steve Ballmer, made a short, blunt, and sufficient statement regarding his regret of the tablet's release. Despite what anyone thought of the product, it's very obvious that Microsoft had a hard time selling it, leaving 6-million unsold copies. It's said that Microsoft had lost over $900-million due to the skim sales of the new product, putting the company at a situation almost no one would want to be in. Steve Ballmer stated the following when prompted, \"We built a few more devices than we could sell.\"\n\nRegardless of said recent failure, Microsoft still remains as one of the top-selling companies– especially with it's newly released mobile operating system, Windows 8.\n\n[color=white][b]Act Fast– MacBooks on Sale![/b][/color]\nAnticipating its regular Black Friday sale, Apple put some of their MacBook Retina display models on sale subtracting $200 from their regular prices. Although the sale only lasted two days (July 25th-27th), many people took advantage of it buying themselves a brand new laptop. It's also said that students with a @domain.edu email would receive an extra $100 price deduction. Additionally, Apple's $100 gift cards went on sale for $85.\n\nNeedless to say, people needed to act fast if they wanted a deal on Apple products!\n\n[color=white][b]iPhone 5s– Plastic Case?[/b][/color]\nJust recently, a rumor was made that the new iPhone –the 5s– was to be released on Friday, September 6th. Being that the new iOS has just recently prevailed, many were trying to explain the rumor as something convenient to time. The rumored iPhone 5s is said to have a sleek, new, and mainly plastic design. It's lighter, thinner, and perhaps a little bigger than previous iPhone designs, making it much like the 5th generation iPod Touch.\n\nAdditionally, it's said that future versions of popular Apple products such as the iPhone and the iPad are to be released with noticeably bigger screens/displays.\n\nBelow is a video both elaborating and analyzing the new design in which was leaked by Sonny Dickson, a man known notoriously for leaking iOS products.\n\n[video=youtube]http://www.youtube.com/watch?feature=player_embedded&v=44biradk84Y[/video]\n\n[align=center][img]http://i.minus.com/jsSqf056c30Ww.png[/img][/align]\n[color=white][b]Justin Bieber's Mom-Inspired Tattoo [/b][/color]\nJustin Bieber has various different tattoos including a very interesting one that looks like his ex, Selena Gomez. His latest piece would be the 'Eye' above his 'Believe' tattoo. This is probably the most valuable one that he has. Bieber went to the Bang Bang Tattoos studio in New York City earlier this week. He got the tattoo to symbolize the idea that, \"Mom's always watching.\" He did it in honor of her to show her how much he loves her. Justin has been to this tattoo studio various different times. The tattoo artist stated that Bieber would always have to think at the time of getting it to find a nice place. This time, he automatically new where he wanted it and what he wanted, which is the new piece he has acquired. Sadly, this is not a picture of her real eye, but \"It was a model, photograph, the anatomy of an eye,\" they both approved of.\n\n[color=white][b]A$AP Rocky Losing His 'Gold Teeth And Swag' For 'Phoenix' Music Video[/b][/color]\nHarlem rapper, A$AP Rocky has been nominated  for Best Hip Hop Video of 2013. The song being nominated is, \"F----n' Problems\" from his Long.Live.A$AP album. Rocky did not think he would get a shot at this, and he was surprised when this was announced to him. For the fans familiar with the music video, there's flashy women, gold bling, and various other things to please a man such as golden teeth. Smile! As Rocky was on set of his music video for his song 'Phoenix' he explained how he will not be using golden teeth for such a song with deep emotion. This is what he had to say about the song, and his album, \"This is one of the more serious songs on my album, so people are really expecting something cinematic from this video,\" Lord Pretty Flacko told MTV News. \"They don't expect the average...me with my gold teeth and swag, it's just really about a life message. My whole album is based upon life,\" he added. \"It's just showing that we vicariously live forever. Tupac, Biggie, Elvis Presley, John Legend, Basquiat are living through all of us because we bring them up every day.\" They didn't want to spoil what is going to happen, but the video is going to be filled with a lot of dramatic scenes that will keep the watcher/listener in sync with what's going on.\n\n[color=white][b]Tomorrowland 2013 Lifts Off[/b][/color]\nThe magical world of Tomorrowland finally lifts off in Belgium. Starting off the celebration, they had parties in 29 planes that were on route to the location of Tomorrowland. To get a ticket for this you must have been wide awake and aware. The site sold out all their tickets in under five hours! MTV News went on one of the party flights, too. They said that they had music playing, video projections of some performances from last year, and various different gifts that were given out on the plane, complementary of Tomorrowland. Some included watches and on two lucky flights there were live DJ's. In Tomorrowland terminal, the guests were treated like royalty. This could open some eyes for people who want to travel the world. If you have the money to afford a plain ride and a ticket, this is the place for you! Good music and great people, overall it will be one of the best festivals of your life. \"The increase in passenger numbers and countries [we] were able to service this year via global journey is a testament to the increasing international popularity of the festival,\" Get In PR's Toby Andrews, director of publicity for the fest, told MTV News. \"To witness people landing into Brussels Airport from all corners of the globe was a real special moment and we're proud to host them for these five days at the festival.\"\n\n[color=white][b]Music Video of the Week[/b][/color]\n[spoiler=]\n[video=youtube]http://www.youtube.com/watch?v=pBv7AZ1AFLM[/video]\n[/Spoiler]\n\n[align=center][img]http://i.minus.com/jj0OFp0aBuwTS.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nRead the latest sticky in this subforum.",
      "subject": "*"
    },
    {
      "pid": "34298765",
      "uid": "515249",
      "dateline": "1375249735",
      "message": "[align=center][img]http://i.minus.com/jbyZ42NjdFe8OT.png[/img][/align]\n\n\"How do you feel about the new HF Ep1c?\"\n\n[i]\"Love the idea, but personally I think Pow3r was a better name. Who \ncares if people ripped it? HF is superior to the other inferior sites, therefore \nwe should show that we will not step down to people who cannot think of \ntheir own ideas. As long as the HF community knows Omni came up with \nPow3r, why does it matter that other people stole it? Also...that userbar, \nyikes. If Omni is all about being consistent (like he said numerous times in \nthat 3p1c thread) I HIGHLY suggest he does not use that icon. Every \ndonation upgrade icon (l33t, ub3r) has a symbol rather than a person. The \nperson makes it look like you are an admin, which can become confusing to \nnew users. I suggest making the icon one of the awards like Omni did with \nl33t (Bronze Tutorial Award). If he does use the current one, it is facing \n<-- way. The flow would be better if it went -->. Also, ub3r and l33t face \nstraight forward, towards you. So, once again, if Omni prefers consistency, \nthis human icon would not fit. Do you guys remember the pow3r upgrade \nuserbar? It had a power symbol that faced straight forward, which met the \nconsistency of the others. I personally hope Omni does implement pow3r, or \nsome sort of ub3r upgrade. Considering he has (my opinion) drastically lowered \nthe requirements for people to get ub3r (I've seen 200 posts with 40 rep), \npeople like APG, Diabolic, Natha, 630, Hexidical, Sir, Saturday, Tibit, etc, \nshould NOT be in the same category as them.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1356625][i]-Nero[/i][/url]\n\n[align=right][i]\"The new \"3P1C\" usergroup will be amazing for a lot of \nmembers who spend their time on HF. It will be a great addition shorter \nsearching time since many members complain about the search time and \nthe cost of it might be fairly low as Omniscient stated $10-12 but some \npeople may have problems because it maybe a BTC bought user group \nunlike the other ones (L33T/UB3R) I hope to see the new usergroup get \nreleased. Good luck Omniscient. \"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1700066][i]-Gary`[/i][/url][/align]\n\n[i]\"After a long wait after the announcement of \"HF Pow3r\" I'm happy that \nOmniscient has finally taken the time to start making it now. Many forums \nhave stole his idea for it but there was no need to really change it. If people \nalready knew that Omniscient had the original idea which probably everyone \ndoes it's fine off as it was, they're eventually going to copy it anyway, doesn't \nreally bother me though. It looks great so far, the userbar is quite plaine but \nother than that is is cheap and a great addon.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1544384][i]-Apostle.[/i][/url]\n\n[align=right][i]\"I think the HF Ep1c group news is great and I'm glad that it \ndoesn't have any requirements unlike uber etc just a couple of things I would \nlike clarified about the group before it's released by purchasing it would it allow \nyou to be able to do +5 and -5's rather than the +3's ub3rs can do now as this \nwas the original plan. I am glad after all this time there is news of the new group \nand I look forward to it's release.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1119610][i]-Winner[/i][/url][/align]\n\nThe topic for next week is \"What do you think of the proposed plans for the HF News team?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jt8zvcWASdwiA.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iojqJn3FtSJhC.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbgT0f4nbbOTe0.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/XscZET1.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/4ZWFg9n.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.lonniemillsap.com/wp-content/uploads/2013/07/surgery-color-1024x1024.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://www.toonhole.com/comics/2013-07-29-135_WishingWell.gif[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jlltcZhXLjBbZ.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=121196]Natha[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second\n[*]Comics[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1645227]Lovol[/url]\n[list][*]Minecraft News\n[*]Tech News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=469528]Odin the Wanderer[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=692131]Anima Libera[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1050193]Connected[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]D3xus[/url]\n[/list]\n[*][color=white][b]Graphical Editors[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=632426]+Awesome[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=135189]Bad Meets Evil[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody‍[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=133256]Umbrein[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}