{
  "posts": [
    {
      "pid": "17421554",
      "uid": "515249",
      "dateline": "1321505333",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\r\n\r\nThe edition you are currently reading is the [color=#f66058][b]67th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\r\n[b]A couple of notices:[/b]\r\n[list][*]The news will be released on Wednesdays.[/list]\r\n\r\n[align=center][img]http://goo.gl/utY40[/img][/align]\r\n[size=large][b]Removing Thread Views[/b][/size]\r\nOmniscient removed view count because of botters botting their threads for more views--which was also another form of DDoSing Hack Forums. The tool was overused and all it simply did was count how many views your thread had received. You can still view your threads view count by going to your User CP and if you want to see another thread's views, you can subscribe and go to [url=http://hackforums.net/usercp.php?action=subscriptions]subscribed threads[/url] to view that thread's count. \r\n\r\n[size=large][b]MyTweets[/b][/size]\r\nOur owner decided to add the MyTweets plugin to Hack Forums after its success on Support Forums. A benefit of MyTweets being added is that now people can view Omniscients profile and see the official Hack Forums twitter feed. It also to makes it easier for people to share what's going on, almost like a note plugin.\r\n\r\n[size=large][b]New Buttons[/b][/size]\r\nThere has also been a change in the postbit buttons to increase loading times for threads. They are now CSS buttons and for a few they taking quite some time to upload on your browser, but when they do, you'll be impressed. \r\n\r\n[size=large][b]Reverence Coders[/b][/size]\r\nThe well known group, Reverence has dropped the coders section from the group completely. The exact reasoning for it has not been exposed but it's down to the lack of commitment from the coders themselves, if they had put the effort in, then maybe this wouldn't have happened.\r\n\r\n[size=large][b]DDoSing Hack Forums and Downtime[/b][/size]\r\nHack Forums recently got ddosed at three gigabytes per seconds, but that wasn't the reason behind the whole nine hours of down time. This was also one of the longest down times HackForums has had in such a long time. Many missed the downtime as it was morning PST and mid day in GMT time zones so a large chunk of the members were asleep.\r\n\r\n[align=center][img]http://goo.gl/nctCW[/img][/align]\r\n\r\n\"How do you feel about the Marketplace and how it runs?\"\r\n\r\n[i]\"Currently, the marketplace is full of people who are honest and willing to trade, but \r\nthere is always something to ruin this peace. Scammers hide in the Marketplace and there \r\nis not much that people can do about it. I am going to be using the (now closed) account \r\n\"Legitti\" for an example. The HF Help Docs says, and i quote-[b]Our staff on occasion will \r\nban a scammer, if the evidence is on site and apparent.[/b] however Legitti had [b][u] SIXTEEN[/b][/u] \r\nscam reports on him. Omniscient Himself and -10'd him saying not to trust him, yet he never \r\ngot banned. I personally think that there needs to be a harsher action taken against scammers \r\nin the Marketplace, but that is just my opinion.\"[/i]\r\n[url=http://goo.gl/S9Xxg][i]-+Pirate[/i][/url]\r\n\r\n[align=right][i]\"I personally think the Marketplace is a great section. It gives people the opportunity \r\nto make money online and expand their horizons. I personally use it frequently, as many things are \r\nreasonably priced. Many people will point out the problem of scamming, but I don't see the issue. \r\nScamming is wrong of course, but each time you make a deal, you need to realize the potential. The \r\nrules state pretty clearly that you deal at your own risk. As always, read the rules and staff classy, \r\nHack Forums.\"[/i]\r\n[url=http://goo.gl/Et7FB][i]-Michael Westen[/i][/url][/align]\r\n\r\nThe topic for next week is \"How do you feel about Scam Reports and how they work in to the Marketplace?\" \r\n\r\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\r\n\r\n[align=center][img]http://goo.gl/rDAeD[/img][/align]\r\n[color=white][b]\"Nuclear Winter\" NBA Lockout[/b][/color]\r\nAre you ready for some basketball? Too bad. The NBA season is in danger of being canceled entirely after talks between the owners and players “completely broke down,” players’ union executive director Billy Hunter told the Wall Street Journal. The union not only rejected the owners’ latest offer but has started the legal process of disbanding, moving the dispute from the negotiating table into the court system. The union said it plans to file an antitrust lawsuit against the league in the next day or two. In an interview on ESPN’s SportsCenter, league commissioner David Stern did not say he would cancel the season, but admitted it was in jeopardy. “We’re about to go into the nuclear winter of the NBA.” The players’ move came after Stern last week laid out a final offer that would have split the league’s basketball revenues 50-50 between players and owners. Under the old deal, the players got 57 percent. If the players had accepted it, a 72-game season would have begun Dec. 15. Instead the union rejected it, with executive director Billy Hunter saying, “The players were not prepared to accept any ultimatums. They thought it was extremely unfair.”\r\n\r\n[color=white][b]Suspect in shooting near White House arrested[/b][/color] \r\nA man with an apparent obsession with President Barack Obama has been arrested in Pennsylvania after the Secret Service discovered two bullets struck the White House while the president was away, authorities said Wednesday. One bullet smashed into a window of the living quarters of the executive mansion but was stopped by ballistic glass. The arrest of Oscar Ramiro Ortega-Hernandez, 21, came days after reports of shots fired on Friday night near the White House while Obama and his wife Michelle were on a trip to California and Hawaii. The president has since traveled on to Australia, second stop on a nine-day Asia-Pacific tour, and the White House had no comment on the unfolding events. The U.S. Secret Service said it discovered Tuesday that the two bullets hit the White House. U.S. Park Police had earlier linked Ortega, a 21-year-old man from Idaho Falls, Idaho, to the reports of gunfire.\r\n\r\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\r\n[align=center][img]http://goo.gl/DQEaq[/img][/align]\r\n\r\n[align=center][img]http://goo.gl/b4JkO[/img][/align]\r\n[url=http://www.gamecove.net/][img]http://gamecove.net/images/gamecoveHF.png[/img][/url]\r\n\r\n[align=center][URL=http://goo.gl/VX8xv][IMG]http://img710.imageshack.us/img710/580/contactforadvert.png[/IMG][/url][/align]",
      "subject": "[11/16/11] - HF News"
    },
    {
      "pid": "17421561",
      "uid": "515249",
      "dateline": "1321505366",
      "message": "[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[align=center][i]There weren't all that many Notable Account Changes this week[/i][/align]\n\n[url=http://goo.gl/Dij0p][color=#0066FF][b]Bytes[/b][/color][/url] - This member ran in to some trouble when someone got a hold of his email and other information. If you wish to read more about this read [url=http://goo.gl/ScgpR]here[/url].\n[url=http://goo.gl/QNFEU][color=#FFCC00][b]CM Punk[/b][/color][/url] - CM Punk has returned after two and a half months. \n[url=http://goo.gl/L5CL5][color=black][b]Tate[/b][/color][/url] - The well known user Tate was banned for posting a thread that can be found in the Notable Threads section, his ban lasts until 12-10-2011. The reason was \"Tired of your attention whoring.\"\n[url=http://goo.gl/3CZkj][color=black][b]CyB3R PoliCe[/b][/color] [/url] - Cyber has been banned until 11-17-2011 for \"Tom Foolery.\"\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Interesting Thread[/b][/i] - [url=http://goo.gl/ndiBn]Why thread views are important[/url] - [url=http://goo.gl/L5CL5][color=white][b]Tate[/b][/color][/url] - This thread is about how Tate thinks that Thread Views are important, he was later banned for posting this.\n[i][b]Contest Thread[/b][/i] - [url=http://goo.gl/Xypiu]SE Nation - Giving Away 3 Amazon Kindle DX's - $380 Retail Each![/url] - [url=http://goo.gl/2vNh9][color=#0066FF][b]Decoy[/b][/color][/url] - Decoy is offering a great deal for posting on his new forum about Social Engineering, anyone interested in a brand new Kindle should definitely check this out.\n[i][b]Informative Thread[/b][/i] - [url=http://goo.gl/G5Oqw]◢What is the Bragging Rights section?◣[/url] - [url=http://goo.gl/3fcaX][color=white][b]Genuine[/b][/color][/url] - This member wrote a lengthy thread on what the Bragging Section really is, and explains some common misconceptions.\n[i][b]SRPP Thread[/b][/i] - [url=http://goo.gl/borl2]What is the true definition of Evil ?[/url] - [url=http://goo.gl/dIkOa][color=#0066FF][b]clectric[/b][/color][/url] - An interesting debate about the true meaning of \"evil\" is in this thread, you should go give your opinion.\n\n[color=#FFFFE0][size=large][b]Gaming Thread(s)[/b][/size][/color]\n[i][b]Minecraft Mobile Thread[/b][/i] - [url=http://goo.gl/vwvuf]AWESOME MINECRAFT MOBILE APP! REVIEW WITH PICTURES! [SWAG][/url] - [url=http://goo.gl/fbLE9][color=#0066FF][b]treestompz[/b][/color][/url] - Treestompz shares a great thread on the new application in the Apple market that resembles a 2D Minecraft.\n[i][b]Runescape Thread[/b][/i] - [url=http://goo.gl/2aquR]RSbuddy.com Mod Section Release[/url] - [url=http://goo.gl/F7xDK][color=#0066FF][b]maniac‎‎[/b][/color][/url] - Maniac was able to hack a moderator's account a RsBuddy.com and release the entire moderator section to the internet. Check out the domains given in the thread.\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Reliable[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Reliable - Thanks a million for doing this interview with me!\n[b][color=#ffcc00]Reliable[/color][/b]: Not a problem Michael, thanks so much for giving me this opportunity!\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Sure! Before we start the interview, I'm sure you have some shoutouts you'd like to give.\n[b][color=#ffcc00]Reliable[/color][/b]: Of course. I'd like to make a shoutout to the fellas at Plague Booter, Suhinder and \nthe guys at FuZioN Crypter. Also I'd like to give a personal thank you to  Designer and NRD because they've \nalways been there for me in times of great need. Also to the staff at Epic Web Hosting. Thanks for helping me all you guys.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That's quite the list, I can see you're very active in a variety of products! I understand your the FuZioN \nCrypter manager, what's that like?\n[b][color=#ffcc00]Reliable[/color][/b]: It's quite different. I like the staff there. They are very reasonable and extremely nice. Also the crypter's going \nto be a HUGE SUCCESS. As support manager I have quite a few jobs. Including the setting up the Live Support and Ticketing systems. \nIt's going to be a bit tough, but I'll enjoy it. The FuZioN Crypter Team hopes to have everything ready by saturday.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That sounds awesome - Live support is a great feature for any product. I know you manage FuZioN Crypter, \nbut what do you do with the product \"Plague Booter?\"\n[b][color=#ffcc00]Reliable[/color][/b]: I don't do much with that just the owners are really nice and I thought I'd give them a shoutout because they have \nalso helped me a bit throughout the last couple of weeks. Their great people and I enjoy talking to them on Skype.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definately - I've spoken with Suhinder once or twice and he seems great. I see you're a member of the \nyellow team (Leet), what inspired you to take that oh so important step?\n[b][color=#ffcc00]Reliable[/color][/b]: Well, when I first joined HF I didn't really know what \"hacking\" was. I figured a few things out on my own \nand had some people help me with others (NRD). I saw that HF is actually a great community. It has all the different sections \npossible on a forum. Eroticism, Hacking, Downloads, Selling, Hosting, Trading, Gaming, etc. It has everything and I thought that \nwas amazing. I'd never seen a forum like it. All the forums I was on previously were Game Hacking forums. I knew how to hack in video games. \nThen I found HF. Ratting still isn't SUCH amazing hacking but it's still so much better than hacking in a crappy game like Combat Arms \n(No offense to all CA players).  So when I saw that HF was this awesome forum, I decided to join. Then I started my web hosting business.... \nand I made some money. Then I thought to myself, \"HF made me this money.... least I could do is buyh L33T , plus it would help the business....\n\n[b][color=#1466ff]Michael Westen[/color][/b]: For sure - HF has a huge marketplace, especially for web hosting and the such. I know your active in the Marketplace, but what \nis your favorite section?\n[b][color=#ffcc00]Reliable[/color][/b]: I would have to say my Favourite section would be the Free Services Section. I think it's great to see people sharing with the \ncommunity, it's great to see that people are willing to give back to the community. I've shared there quite a few times myself. I am currently \ngiving away HMA Proxy listings, daily.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Very cool - I love that we still have members who do stuff out of the kindness of their heart. You seem to cover the entirety of the Marketplace, \ndo you see yourself becoming even more active in it? Perhaps selling more products or something?\n[b][color=#ffcc00]Reliable[/color][/b]: Well I hope to expand my horizons soon. Epic Web Hosting is getting a VERY VERY POWERFUL VPS in the next few days and we hope to have quite \na few customers coming from it. Hopefully when that happens, we'll start selling other products and such. I am also trying to get money so I'll be selling other things on the side.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Sounds exciting - Be on the look out for that guys!v Aside from HF, what other things do you take interest in?\n[b][color=#ffcc00]Reliable[/color][/b]: Well I enjoy watching movies. A lot. And I also enjoy chilling with friends and playing video games. I'm also starting to enjoy school... who would have thought that would happen right?\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Ouch, I know I definately don't like school! What are your top 5 favorite movies?\n[b][color=#ffcc00]Reliable[/color][/b]: I do as a matter of fact. I love reading. 1984 was a great book. I've talked to people who hate books and prefer movies. \nThen they read a book that was made before the movie and they love the book way more. Also I find books are magical. If you have a good imagination, \nlike myself, you can see literally EVERYTHING you read in your mind. It's amazing. So to all HF'ians out there, read a book but make sure it's an interesting subject.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definately some great advice for the members out there! That's wraps it up for me, do you have anything else you want to say?\n[b][color=#ffcc00]Reliable[/color][/b]: Yea. Just a couple of more shoutouts. I'd like to say hello to all the Canadians here on HackForums. I also want to say hi to the guys at RebelSecurity \nand all my clients at Epic Web Hosting. Now last but not least I'd like to thank YOU so much Michael, for giving me this opportunity. I really appreciate and look \nforward to another opportunity like this again! Thanks so much.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Bentley[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Bentley! Thanks for taking the time out to do this interview!\n[b][color=#1466ff]Bentley[/color][/b]: Okay.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: For sure! Before we get started, do you have any special people that deserve a shout out?\n[b][color=#1466ff]Bentley[/color][/b]: Shout out to Polymath 1.0 and Michael Westen, haha.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Alright, cool. What made you decide to join Hack Forums?\n[b][color=#1466ff]Bentley[/color][/b]: Um, I actually joined to buy a booter, I know it sounds noobish. I thought it was cool and was kind of a DDoS kiddy. I also joined it because I liked the theme of Hack Forums. It was different and better than TheBotNet. There also wasn't a lot of spam at the time and seemed like fun!\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Very cool - I joined because a friend showed me the site, and he's regretted it every since. What is your favorite part of Hack Forums?\n[b][color=#1466ff]Bentley[/color][/b]: My favorite part of Hack Forums? Hmm, I really enjoy the Lounge. I would have to say I spend most of my time in the VIP area, there's not too many people and I really enjoy it.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: The goals you had coming into Hack Forums, as far as DDoSing and generally have fun, have they been accomplished to your satisfaction?\n[b][color=#1466ff]Bentley[/color][/b]: I would have to say all of them have been accomplished, mostly because I got uber. I always thought Uber was cool, every since the day I joined. The blue username was really a big icon for Hack Forums.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: HF has gone through a few changes lately - Do you have any ideas you see beneficial to Hack Forums?\n[b][color=#1466ff]Bentley[/color][/b]: I would definitely like to see Ubers having the ability to move their own threads. I think it'd be a lot quicker, and might save Staff and Mentors a little bit of time. I would also like to see a total revamp of the userbars attributed with official HF usergroups. I also think he should give people the ability to create their own themes that they could use and pick from on a menu.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definately, but I think I would use the good 'ol theme we have now. Where do you see yourself in 5 years, as far as Hack forums goes?\n[b][color=#1466ff]Bentley[/color][/b]: Well if HF happens to be up in 5 years, I would definately still be an active member. I'd love to see what HF is like in 5 years!\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Do you see yourself having any position among staff/administration if you were to be a member in 5 years? \n[b][color=#1466ff]Bentley[/color][/b]: I'd probably say no because I'm one of however many people, so the odds aren't really with me! I honestly don't think\nOmniscient wouldn't pick me over Nokia or someone like that.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Well hey, you can always hope, right? What is your opinion of the current staff of Hack Forums?\n[b][color=#1466ff]Bentley[/color][/b]: Um, well some of them are really bitchy to be honest. There are also a few who I don't see ever, I think the inactive staff, admins, and mentors should be replaced.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I agree - There are tons of members and only a few people to contain them all. How did you come up with your username?\n[b][color=#1466ff]Bentley[/color][/b]: Obviously because I love Bentleys! :)\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I thought there might be a little bit more, but Bentleys are definitely the way to go. Thanks for taking the time for this interview. Do you have any closing remarks?\n[b][color=#1466ff]Bentley[/color][/b]: Just to read the rules, it'll save your ass![/spoiler]\n\n[align=center][img]http://goo.gl/G1F5k[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=ckVIjtjYVAA[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Viral Dragon\n--Leadership\n---N3w_2_H@Ck1n™ (http://goo.gl/uKHpp) - <Leader - Reverence\n---Wolves (http://goo.gl/4o2x9) - <Leader - Black Knights\n--Awards\n---Vanadium (http://goo.gl/OxtbC) - Businessman - For all your business knowledge.\n---Spafic (http://goo.gl/UfiWP) - Gold Medal - 10k posts deserves something.\n---VeNoMz (http://goo.gl/9Knrx) - RAT Expert - Don't tell people why you got this. But you're a RAT Expert.\n--Misc.\n--Questions\n---[/spoiler]",
      "subject": "*"
    },
    {
      "pid": "17421567",
      "uid": "515249",
      "dateline": "1321505393",
      "message": "[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/horoscopes.png[/img]\r\n[size=xx-small][i]These horoscopes were not written by us as we don't have the ability nor knowledge to do so.[/i][/size][/align]\r\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aquarius:[/font][/size][/color][spoiler=]\r\nTo say your gonads are in overdrive for the next year is putting it mildly. You're definitely going to be \r\nhot to trot! Sex will become a fixation for some of you right up until next winter. (Gasp. Buy sexy \r\nunderwear.) Actually, Mars will make you feel passionate about many aspects of your life simply because \r\nMars will hugely increase and enhance your passions! However, Mars will also make you more of a fighte\r\r\nwhen it comes to defending your own interests with inheritances, shared property, insurance matters, \r\ntaxes and debt. Remind yourself to be fair and accommodating. (Mars is a strong ego planet.)\r\n[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Pisces:[/font][/size][/color][spoiler=]\r\nPerhaps more than any other sign, you face the greatest challenge with this very unusual sojourn of Mars \r\nin one sign for the next eight months. I say this because Mars is going to oppose you. Whenever Mars \r\nopposes you (generally only for seven weeks every two years) it heightens the potential for conflict with \r\npartners and close friends. But hey - this doesn't have to happen! Mars does tend to make you feel easily \r\nannoyed with others and ready to call them on something even if they're not aware of what they're doing. \r\nAdmittedly, it can attract aggressive people to you as well. So it's a tough call who is actually starting the \r\nargument. Your best bet is to consider this an opportunity to demonstrate grace under pressure and learn \r\nmore about how to relate to partners and good friends.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Aries:[/font][/size][/color][spoiler=]\r\nThis unusual phenomenon of Mars in one sign for eight months will interest you because Mars is your ruler. \r\n(That's why you're the warrior of the zodiac.) Fear not, this doesn't mean you have to saddle up, lock and \r\nload. Au contraire! It means you'll be totally psyched on becoming more efficient in every aspect of your life. \r\nYou'll work super hard to make your job and personal life become better organized. Do not hesitate. Get with \r\nthe program. Purchase the right tools and materials to do a great job. Buy cleaning equipment, paint, \r\nshelving, file folders - whatever you need. Make it happen. You also can use the next eight months to really \r\nboost your health as well. (Lucky you!)[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Taurus:[/font][/size][/color][spoiler=]\r\nDear Taurus. While this unusual duration of Mars in one sign causes havoc in the lives of some, for you, it's you\r\r\nchance to kick back, relax and have a great time! Since you love your creature comforts (good food, good wine, \r\ngood sex and a nice place to live) this is great news! From now until the autumn of 2012, enjoy vacations, \r\nappreciate the arts (musical performances, movies, dance and the theatre) and immerse yourself in the thrill of \r\nsports. Playful activities with children will also be big on your agenda. And let us not forget love affairs and \r\nromance! Just remember that Mars is energy. Use it to enjoy these areas or waste it fighting about them. Your call.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Gemini:[/font][/size][/color][spoiler=]\r\nIt's important to remember Mars is pure energy. You can use it to fight or to work. Like a hammer, it can kill \r\nsomeone or build a house. It's important to remember this distinction and be aware of how to use this burst of \r\nenergy that hypes you until the autumn of 2012. (Make it work for you.) I say this because Mars will activate \r\nyour home and family life. This means you can use this energy to renovate, repair and fix up where you live. O\r\r\ndo special things for family members to please and delight them. Or you can use this energy to fight with everyone \r\nat home. What's it going be? (Gee, that's a no-brainer.)[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Cancer:[/font][/size][/color][spoiler=]\r\nSome signs have an easier choice of how to use the energy of Mars. Unfortunately, you're not one of them. Mars \r\nwill make all your communications with others more direct, lively and aggressive. (\"I say what I mean and I mean \r\nwhat I say.\") The positive use of this energy is to channel it into vibrant, dynamic communications in sales, marketing, \r\nwriting, teaching, acting and driving for a living. The negative use of this will be to quarrel with siblings, neighbors \r\nand daily contacts. Don't be pushy and overbearing in your communications. This influence lasts until the autumn of \r\n2012. You can majorly win or lose miserably.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Leo:[/font][/size][/color][spoiler=]\r\nUsually, you have a pretty casual attitude about money. You see it as a way to express your rights. And you spend \r\nmoney even if you don't have it. To you money is energy to make things happen. This blast of energy from Mars (until \r\nthe autumn of next year) hits you in the pocketbook. (Most curious.) It makes you much more focused on making money \r\nand boosting your earnings. This will be a positive use of this energy. However, it will also encourage you (tempt you, \r\nentice you), to blow your money big time! Be careful about diverting the powerful energy of Mars into foolishly wasting \r\nyour money. (You know who you are.) Use Mars to improve your life, not drain it.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Virgo:[/font][/size][/color][spoiler=]\r\nLordy, Lordy! For the first time in your life, fiery Mars will make you PowerPoint on steroids! This will be like riding a rocket. \r\nIf you know where you're going, you'll get there fast. If you slip off course, you're in serious trouble. (You get the picture.) \r\nYour personal energy field will cause you to work hard, party hard, express yourself energetically and get an enormous amount \r\ndone. The dark side (oh yeah) is Mars can make you insufferably overbearing, bossy and in your face, ready to fight at a \r\nmoment's notice. One manifestation is miserable and the other has wonderful possibilities for big accomplishments. Think about it.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Libra:[/font][/size][/color][spoiler=]\r\nI'm looking at how this eight-months-blast of Mars affects each sign. But for Libra, it's tricky and hard to explain. That's \r\nbecause Mars will hide in a secret part of your chart, and by doing so, activate your unconscious impulses. It could make \r\nyou become your own worst enemy by activating immature, petulant, childhood reactions when others press your buttons. \r\n(Yikes!) But hey - Mars is just energy. You can use this energy to penetrate what makes you tick. What are your self-defeating \r\nhabits and patterns? What knee-jerk reactions do you invariably have that you later regret? Mars can be your own personal \r\nSherlock Holmes. Scrutinize yourself for these answers.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Scorpio:[/font][/size][/color][spoiler=]\r\nThis unusual burst of energy due to Mars in Virgo for eight months (maybe longer in your chart) will impact your relationships with \r\nfriends and, in particular, groups. In the next year, you're going to find out you're a Dynamo! People in group situations will look \r\nto you for leadership. You will direct their activities, energize the group and busily delegate. Because of you things will happen! \r\nSimilarly, you'll also be gung ho about going after your dreams and wishes for the future. You'll be unusually energized about attaining \r\nyour goals. The downside is you might use the energy of Mars to be too pushy with others. Be careful of this because you are a \r\npowerful sign.[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Sagittarius:[/font][/size][/color][spoiler=]\r\nYou have a great opportunity to use this energy of Mars, perhaps until the winter of 2012. In fact, it's a rare opportunity! Why? \r\nBecause Mars will arouse your ambition as never before. It will energize your motivation to succeed. You will work super hard, with a \r\nspecific focus in mind to achieve what you want. It's like you have a rocket strapped to your back. You'll go places! The only disadvantage \r\nis you will easily be overbearing with bosses and threaten people in authority. Naturally, this will get you nowhere and will only create \r\nobstacles for you. So use this precious energy but be smart about it. Capice?[/spoiler]\r\n\n[color=deepskyblue][size=xx-large][font=Monotype Corsiva]Capricorn:[/font][/size][/color][spoiler=]\r\nAn exciting nine months ahead! (Perhaps longer.)This sustained blast of energy from Mars will make you travel more than ever before. \r\nIt will also energize you to accomplish a lot in higher education. (Great for anyone who has to finish a thesis in grad school.) It will also \r\ngive you tons of energy for publishing, the media, medicine and the law. You'll be shocked at how much you will accomplish and how \r\nstrong these areas will suddenly become in your life in the next year. You'll be out there flying your colours! Resist the urge to make \r\nothers agree with you politically and religiously. (Because you will be tempted to do this.) Just lighten up.[/spoiler]\r\n\n[align=center][img]http://i1214.photobucket.com/albums/cc499/HFGenuine/news.png[/img][/align]\r\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\r\n[list]\r\n[*][color=white][b]Publisher & Head Journalist[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[/list]\r\n[*][color=white][b]Journalists[/b][/color]\r\n[list][url=http://goo.gl/aJS0l]Diabolic[/url][list][*]\r\n[*]Headlines[/list]\r\n[*][url=http://goo.gl/4W9dI]Sir[/url]\r\n[list][*]User News\r\n[*]Opinions[/list]\r\n[*][url=http://goo.gl/jZvPh]TheHackersLove[/url][list]\r\n[*]World News\r\n[/list]\r\n[/list]\r\n[*][color=white][b]Interviewers[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\r\n[*][url=http://goo.gl/JJuWm]Daniel Faraday[/url]\r\n[/list]\r\n[*][color=white][b]Web Show Co-Host[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/gGUxd]Astonish is NJ[/url]\r\n[/list]\r\n[*][color=white][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/WtTLD]Tasemu[/url]\r\n[/list]\r\n[*][color=white][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/89giM]Ignite.[/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}