{
  "posts": [
    {
      "pid": "24254254",
      "uid": "515249",
      "dateline": "1341709181",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#FFD700][b]99th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Valor[/b][/color]\nFormerly known as Blackshades Valor is one of two new groups created this week. As an official group Valor has many focuses, some of which include Networking, Marketing, and others. To view Valor's announcement thread click the following link: http://goo.gl/99AaX\n\n[color=white][b]Omniscient's injury[/b][/color]\nAs many of you know our site owner, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has recently broke his knuckle, which means he will be a little behind for PM's, upgrades and so on. He has also mentioned that when he fully recovers from his injury he will explain what happened. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s announcement thread click the following link: http://goo.gl/fCJKC\n\n[b][color=white]Infamous[/color][/b]\nFor unknown reasons the propitious group leaders have decided to do a full group reformation. During the reformation quite a few members were kicked from the group, they also changed the group userbar and renamed it to \"Infamous\".\n\n[color=white][b]1,000,000 posts[/b][/color]\nEarlier the Hacking Tools and Programs forum reached a total of 1,000,000 posts. This is a great achievement for HackForums as a whole and really shows that a good majority of members don't mind contributing once in a while. To view the forum itself click the following link: http://goo.gl/2sEhw\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=795825][color=#0066FF][b]Dr.Quickmodz[/b][/color][/url] reached 1000 reputation points! Congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=295848][b]Qwazz[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=1061502][color=#0066FF][b]Mαѕтєямιη∂[/b][/color][/url] reached 2000 reputation points! These are the third and fourth members to reach this milestone.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1151947][color=black][b]Baby Jesus[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=729494][color=black][b]Grumpy[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=949857][b]Thrust[/b][/url] was repfucked again.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=946680][color=black][b]Ignite.[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=857963.][color=black][b]Burn™[/b][/color][/url] was banned for \"marketplace begging\".\n[*][url=http://hackforums.net/member.php?action=profile&uid=1151947][color=black][b]Baby Jesus[/b][/color][/url]  was banned for reputation abuse.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1072161][color=#0066FF][b]Give me Asswipe Award[/b][/color][/url] was temporarily banned for low quality posting.\n[*][url=http://hackforums.net/member.php?action=profile&uid=667703][color=black][b]Asthima[/b][/color][/url] was banned for threatening members.\n[*][url=http://hackforums.net/member.php?action=profile&uid=729494][color=black][b]Grumpy[/b][/color][/url] was banned for reporting an administrators post.😠\n[*][url=http://hackforums.net/member.php?action=profile&uid=944024][color=black][b]Neal Caffrey[/b][/color][/url] was banned for complaining about a repfuck.\n[*][url=http://hackforums.net/member.php?action=profile&uid=633611][color=black][b].Skittles. ツ[/b][/color][/url] was banned for posting threads outside of the marketplace.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1017611][color=black][b]Draw[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1028401][color=black][b]Zanelot[/b][/color][/url] was banned for posting marketplace outside the marketplace.\n[*][url=http://hackforums.net/member.php?action=profile&uid=730772][color=black][b]Wizard‌‌[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=905325][color=#0066FF][b]‌‌OFWGKTA[/b][/color][/url] was temporarily banned for having multiple accounts.\n[*][url=http://hackforums.net/member.php?action=profile&uid=529870][color=black][b]+Pirate[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=931148][color=black][b]Grim ‍[/b][/color][/url] was vacation banned.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2640161][b]I believe in Creationism and Evolution.[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1326923][color=#FFD700][b]Mᴏzzie[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2648922][b]Same-Sex Marriage Ban Unconstitutional?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=398007][color=#FFD700][b]Apathy[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2644293][b]Torture as a Form of Punishment[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url]  - [url=http://hackforums.net/showthread.php?tid=2652102][b]Virgin Gamers continue acting like Virgin Gamers[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=931610][color=#FFD700][b]Hello Friends[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2652694][b]Why is homosexuality \"okay\" but incest is \"wrong\"?[/b][/url]\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=309536]Verilog[/url][/font][/size][/color]\n[spoiler][url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, Verilog, to the 99th edition of the HF News. Any shoutouts you'd like to make before we get into it? \n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: Yes, to all the wonderful people that I've met here, and members of the following groups; Marketers, Propitious, Rhythm, Ex-Wraith, TRC, and Black Knights. <3\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure all of those groups, and their members, will appreciate the shoutouts. So Verilog, you've been on HF for over two years now. What originally attracted you to HF, and what kept you coming back?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: The largest thing that attracted me was hacking tutorials, and the Marketplace. When I arrived here I wanted to know everything about hacking, so I started with the basics, and eventually completed all of the tutorials. I then joined three custom usergroups; TRC, Wraiths, and the Black Knights. I suppose I just grew fond of the groups, so I started coming back day after day, for these three sections only. I guess I became addicted.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds interesting :). While we are on the topic of groups, what are your thoughts on the recent group changes (Propitious to Infamous, TechSperts to Rhythm, BlackShades to Valor)?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: Can't really say anything about it. It is a leaders choice to change the group name/focus, and I believe that by changing, these groups have also started moving towards different directions, which is a really good thing for members who wish to learn different topics. \n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Very true. Your unofficial group 'Clixors' has recently taken off with a bang. For all of those that are unaware, this group is an ever-growing monetizing group, which focuses on exchanging clicks. I see that your forum is also somewhat related. Why did you decide to launch projects in this direction, how are they going, and what are your future plans with them?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: Well the thing is, if we can make money without any pain and earn money with little effort, it is a great thing! I recently created a private password protected forum for this, but now I believe that having an application for this will be the best thing. An application means that it will automate the project, which in result means a lot more money to everyone. I'm planning automation since it is a pain when you start clicking 100 people links, and you have to wait 5 seconds to progress. :) \n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds like a great project for all of the monetizing community! Some people would consider you somewhat of a website marketing genius. What is it about websites and the marketplace that keeps you so active and contributing, and what is it that you're hoping to achieve in the long run?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: SEO (search engine optimization) is great, and I truly have grown to love it recently. Most of the time people think that getting backlinks will improve your site, but this is where they are mistaken. I practically implemented and learned this art. In relation to the Marketplace, I do have future plans, although nothing immediate. I really love to see my friends make money and see their hard work lead to success. This is what a lot of them came here for, and it's an honour to see that they are finally doing it. I am really happy for all of my friends/clients who have been successful at SEO (search engine optimization). :) \n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: It's great to see someone as experienced as yourself helping the community with such passion. I suppose I should ask you about the recent happenings with the FBI (see [url=http://hackforums.net/showthread.php?tid=2623715][color=#0066FF]here[/color][/url]). What are your thoughts on the matter?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: Well I guess it is a warning for all of those members who are participating in blackhat activities, expecially for the sake of money. I will say to all members here that before doing anything illegal, think about your family and your future.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: All too true. Nothing good comes from blackhatting in the long run. As an externally-proclaimed SEO (search engine optimization)  master, what do you believe are the keys to success, in relation to website construction, and forums in-particular?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: Be smart, innovative, positive and never let go of your goals.\nSet a target, and don't slack off. These are all important things that I would like to point out. I also wrote an 11-page detailed eBook for all people who wish to give their forums a kickstart. :) \n[align=right][url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][i][size=x-small][b]Verilog[/b][/size][/color][/url][size=x-small]'s SEO Power Pack can be seen/purchased [/size][url=http://hackforums.net/showthread.php?tid=2551091][color=#0066FF][size=x-small]here[/size][/i][/color][/url].[/align]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, there you have it. Tips from a master! Verilog, I'd like to thank you for joining us today, and enlightening us with your story, opinions, and tips. It was truly an honour to have you here :). Any final thoughts/comments before I let you go?\n[url=http://hackforums.net/member.php?action=profile&uid=309536][color=white][b]Verilog[/b][/color][/url]: I would like to thank you for considering me worthy enough for an interview, and to all the members of HF who read this, I would recommend you to stay safe and deal safely. Hackforums is the best forum I have even been on, hands down, and I love it :). Thank you. \n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=828184]Airon[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Hello, and welcome to the 99th edition of the HF News, Airon. Are there any shout outs you want to give before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: I would like to thank all the members on hackforums.net for the help and great stuff they give us and how friendly they are.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Noble of you to thank the entire site. So, you're a very helpful member on HF most people would say. Though, most people would also agree that you don't have the best grammar or spelling. What do you think about the sterotpye and corrolation of grammar and quality on HF.\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: Yes. my grammar and spelling isnt that good, but i always do my best to write it correct. I also know that people think that members that cant write the correct english and spelling are low quality, thats not true since this is not my language that i normally speak.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Yes, you're an example that defies that sterotpye, which is clearly evident by MOTM, how do you feel about winning the race, or even just being nominated.\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: Well, i was verry happy that i got nominated and then also got in the MOTM voting. But i saw that people are cheating to get vote's. thats not really cool of them since its not fair for other members that normally should win. I am now in the lead and i really didnt expect that. So thanks everyone that voted for me i really appreciate it and it show that you guys have respect for my giveaways and help.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Cheating has plauged the HF MOTM, but Judge Dredd is usually ontop of it. It's sad that people have to cheat, when it is just something fun for the community. If you win, how do you think you're going to feel. Also, if you could nominate someone else, for example next month, who do you think you would nominate?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: If i would win the MOTM i would be really happy and its a great thing if you win the contest that means that people have respect for what you do for the community and if you are a nice guy etc. And if i could nominate someone it would be Mr Kewl or adampelletgun, adampelletgun is a really good person and i have respect for him he got allot of Reported Posts and he is always helping people in the 'Rules, Announcements, News and Feedback' so thats my opinion about him.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Mr Kewl is an amazing member, and if you win I hope you're delighted, not many people get to experience that feeling, and that causes them to be jaded with envy, so don't let them get to you. So, you do many give aways to the community, and offer many services as well. Don't you think sometimes it would just be easier to make money off of it, rather than just giving it away?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: Hmm. Why would i ask money for it ? I mean many members doesnt have the money for buying Installs, Crypts, Youtube services and more. Thats why i dont ask money for it, its more like that i buy the things and then give it to the members. The most of my giveaways are for all the members because i think it isnt really fair if you just give it to members that are upgraded, Normal Members are sometimes more HQ then Upgraded Members thats why i dont ask money for it and i have respect for Normal members, l33t and ub3r members so they always can ask for help i will not ignore them.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: It is good that you value respect more than money. So, besides HF what are some of your extra activities you do?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: Well, i have 2 months vacation now and i think i will be spend it on Hackforums and go outside with friends and go on vacation but i'm not sure where it is at the moment.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Hopefully some place sunny. Well enjoy your vacation, and spend some time with your family as well as your friends. So, what are some of your hobbies? Also, do you have any goals for HF?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: Of course i will spend time with my family they are everything for me. And i like to ride with my bike and i am learning for my scooter license so i'll learn a couple hours a day for it and just chilling with friends, i dont need much to amuse myself though. my goals on hf is to make it better and that ub3rs and l33t stop abusing their power on Normal Members, and i really hope i will become a Mentor on hf but i know that it will not happen.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: That is good, and who knows, you might become one some day. Keep up the amazing quality and helpfullness and someone is bound to notice. Well, we are starting to come to a close to this interview. So if you could change 3 things about HF, what would you do?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: I would BAN the weed threads in the Lounge since this is a hackforum and not a weedforum.\nIn the marketplace i would make a subforum for Crypters since, if you go to the Premium Sellers Section, you see like 10 crypters on the first page.\nAnd my last thing, If you scam someone then you are deleted from all your groups and that would help to not get scammed because the scammer  cant get in groups anymore.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Alright, that brings us to the end of our HF Interview. Do you have any final questions, comments or concerns?\n[url=http://hackforums.net/member.php?action=profile&uid=828184][b]Airon[/b][/url]: I am verry happy that i can write a review about HF this is my first time and i have respect for the writ3rs and reviewers. Thanks for the interview and have a good day!\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Thanks for being my interviewee Airon, I wish you the best of luck in the MOTM contest, and any future goals.\n[/spoiler]",
      "subject": "[7/7/12] - HF News"
    },
    {
      "pid": "24254323",
      "uid": "515249",
      "dateline": "1341709363",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][img]http://i.imgur.com/Dgbzk.png[/img]\n[video=youtube]http://www.youtube.com/watch?v=TfHysS7gIMs[/video]\n[/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[b][color=White]Higgs Boson:[/b][/color]\nThis week scientists at CERN have discovered a particle consistent with Higgs Boson. Higgs Boson also known as the God Particle is what some scientists believe made all the mass of the universe. Scientists also believe that this particle could be a key to discovering more information about or universe. The particle was predicted to exist in 1964 by Peter Higgs who Higgs Boson is named after. After almost 50 years of research on July 4th in Geneva CERN announced that they have finally found the particle.\n\n[b][color=White]Heat Wave:[/b][/color]\nThis week a large heat wave has swept across the mid west and east coast portion of the USA. ,There have been record heat all across the united states this week with numerous states currently have city's over 100 degrees fahrenheit and in some places it has reached at least 108 degrees Also in this heat wave has been a lot of power outages across the east coast. The heat wave has also been blamed for at least 43 deaths. It is planned that the east coast will still have a few more days of this record setting heat.\n\n[b][color=White]Virgin Galactic:[/b][/color]\nVirgin Galactic's spaceshiptwo is planning on making its European debut at this years Farnborough international airshow. The airshow will start on July 9th and will go for 6 days. The spaceshiptwo is capable of taking 2 pilots and 6 passengers into space. Virgin Galactic spaceships are planning on starting to fly passengers into space next year. Sir Richard Branson the owner of virgin Galactic is planned to appear at the air space show revealing some of the new changes to the design on the spaceship two. Seats on this spaceship are planned to cost at least 200,000 dollars.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Microsoft[/b][/color]\nMicrosoft has announced that their users who want to update their machines to Windows 8 will be able to do it as soon as the upcoming OS is released for $40. It's a lot less than what Microsoft charged their customers for their previous upgrades. \"I think they're certainly responding to competitive pressure from other platforms and devices like tablets and even smartphones,\" Dan Olds from Gabriel Consulting Group said.\n\n[color=white][b]Apple[/b][/color]\nAn issue on the App Store which was corrupting the apps has been affecting iOS and Mac apps this week. It's been said that it was causing newly downloaded apps to crash when users opened them. Apple has confirmed that this issue has been resolved now, thanks to Instapaper creator Marco Arment who noticed the problem for the first time and published a list of the affected apps. \"We had a temporary issue that began yesterday with a server that generated [Digital Rights Management] code for some apps being downloaded,\" Apple said. \"The issue has been rectified, and we don't expect it to occur again. Users who experienced an issue launching an app caused by this server bug can delete the affected app and re-download it.\"\n\n[color=white][b]Android[/b][/color]\nMicrosoft's anti-spam engineer Terry Zink has said on his blog that an international botnet could be using affected Android handsets to send massive amounts of spam. He reportedly identified the botnet and its Google Android connection by identifying the headers of spam which included signatures such as \"Sent from Yahoo! Mail on Android.\" IP address analysis shows that Android smartphones from all over the world have been affected including some in Chile, Indonesia, Lebanon, Oman, the Philippines, Russia, Saudi Arabia, Thailand, the Ukraine and Venezuela. Most believe that the problem is likely to get worse. Hackers have already targeted widely used operating systems, which is why Windows is a prime target.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]Frank Ocean: \"I Feel Like a Free Man\"[/b][/color]\nFrank Ocean, a member of the group: Odd Future, has finally announced something he's wanted to for a long time about his sexuality.\n“4 summers ago, I met somebody. I was 19 years old. He was too. We spent that summer, and the summer after, together. Every day almost, and on the day we were together, time would glide. Most of the day I’d see him, and his smile. By the time I realized I was in love, it was malignant. It was hopeless.\" -Frank Ocean\n[url=http://frankocean.tumblr.com/post/26473798723]Click Here[/url] to read Frank Ocean's full statement.\n\n[color=white][b]Rihanna Sues Former Accountants[/b][/color]\nRihanna has filed a lawsuit against her accounting firm (Berdon LLP) in Manhattan Federal Court. She is accusing the company of breach of contract and negligence. Rihanna also blames them for messing up her taxes. Now, the IRS is auditing Rihanna for the tax years 2008 to 2010. Rihanna immediately discontinued her relationship with Berdon last September after she found out about the mishandling of her money.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?feature=player_embedded&v=3X45AWsnFYY[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?feature=player_embedded&v=9WXErRF9bfs[/video]\n[video=youtube]http://www.youtube.com/watch?feature=player_embedded&v=WZB7yswo6a0[/video]\n[video=youtube]http://www.youtube.com/watch?feature=player_embedded&v=nvRqqawd6VI[/video]\n[/spoiler]\n\n[color=white][b]Rap Made By [url=http://hackforums.net/member.php?action=profile&uid=1252530]Adolf Hitler[/url][/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=XY5FGMKpF1M[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThere's something interesting that I've been witness to up here in Alaska. I'm in Seward for a few days, and we're going charter fishing. My step-dad is a Captain for one of the charter boats, and there's this weird political thing going on. If you have an issue with someone, and they were out at sea, sinking, you would leave them. It's an interesting side of the human race. Living in my town, it's pretty much, if someone's in trouble, you put aside your difference and help them. Up here, you keep your grudges and break out the knuckle dusters. It's just something to think about, how far it really matters when you're angry at someone.",
      "subject": "*"
    },
    {
      "pid": "24254338",
      "uid": "515249",
      "dateline": "1341709402",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What's your favorite thing about Hack Forums? Explain?\"\n\n[i]\"My favourite thing about HF would have to be it's extensive userbase, hands down. \nExcept for the few complete idiots, and the occasional troll, I find practically all HF \nmembers to be knowledgable in different fields, and willing to lend a hand. I love learning \nabout different topics, and meeting new people, and what better way to do that than \ndiscussing these topics with members from all around the world? Different cultures, different\nexperiences, different lives. You get a real understanding of different cultures and their \npeople. Being cultural and knowledgable is never a bad thing, hence why I am still here \ntoday. :)\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][i]-Phytrix[/i][/url]\n\n[align=right][i]\"The best thing about Hack Forums in my eyes is the amazing community, \nthe people on Hack Forums make it what it is today.. Without every single one of us, Hack \nForums wouldn't be so popular and so warm to so many of us. I just love coming on Hack \nForums and talking to a few friends and then browsing some threads.. It's become apart of \nmy routine and apart of many others daily routine also.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=330676][i]-Diabolic[/i][/url][/align]\n\n[i]\"My favourite thing about HF is the news. Sense I'm only active in a few sections the news \nsums up what had happened in the other sections. From scam reports to notable threads to \nwho was repfucked. It lets people know what is going on in parts of the forum that they do \nnot know about. Apart from that my other most favourite thing about HF is that I came here \nto learn. I came here to find ways to make money and I did. Its so nice that the forum has \nmany different sections for the different peoples needs.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=874827][i]-EpicXXCrushor1[/i][/url]\n\n[align=right][i]\"My favorite thing about HackForums is that it is such a large community with so \nmany different people, that it is easy to make friends. Since the forum has multiple sections, \naside from hacking, it is really convenient for finding players to game, chat or meetup with. The \nmain reason I come back to HackForums now is to talk with certain members and just have an \noverall good time. I originally joined to learn how to hack and get free stuff, but those motives \nquickly changed.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1235445][i]-Kristian[/i][/url][/align]\n\n[i]\"My favorite thing is easily the lounge. Once you get past the weed threads, it's quite enjoyable. \nAll of my threads have been there. The community is what makes the lounge fun, with people like \nMinnisota Nice, and SoulZeh.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1330641][i]-PeanutButterSmack[/i][/url]\n\nThe topic for next week is \"Where do you see Hack Forums in five years? Expand?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iQOOOsrmx6tCb.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/iwmWSNB28bUox.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibjhgTaztqjI3V.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=JZok1ZqUslI[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[color=white][b]Awards[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1125749][b]Kray[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=1172544][color=#0066FF][b]Cоdy[/b][/color][/url] both got the Master Donator awards on the same day. This is the second time this has happened.\n[url=http://hackforums.net/member.php?action=profile&uid=1125749][b]Kray[/b][/url] got the Sushi award.\n[url=http://hackforums.net/member.php?action=profile&uid=580684][b]RDCA[/b][/url] got the HJT graduate award!\n[url=http://hackforums.net/member.php?action=profile&uid=1316890][b]Oats[/b][/url] got the Da Bomb award because he loved [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] to much.\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=646916][color=#00FF00][b]Genuine[/b][/color][/url] is now a group leader of Valor.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://goo.gl/nN5aK]RDCA[/url]\n[*][url=http://goo.gl/eswtU]SoulZeh[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/iIaDf]PyroStorm[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}