{
  "posts": [
    {
      "pid": "28041069",
      "uid": "515249",
      "dateline": "1352696381",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#00BFFF][b]117th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Server Issues[/b][/color]\nThe last 36 hours have been rather grueling for [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]. Members of the forum were noticing extended downtime for much of yesterday, which was the result of various DDoS attacks. Furthermore, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] then found multiple errors and bugs in the server, which led to a long day of downtime and stress to everyone. An extended blog post on the matter can be read [url=http://www.vbum.com/2012/11/a-day-gone-wrong-and-right/]here[/url], along with tweets from the official Hackforums Twitter [url=https://twitter.com/hackforumsnet]here[/url].\n\n[color=white][b]Fraud Crackdown[/b][/color]\nWithin the last week, many users of the forum have been the subject of bans and repfucks. On the basis of attempted fraud concerning Amazon products, various users were subject to punishment(s). It should be duly noted that any form of fraud is disallowed on Hackforums and consequences [b]will[/b] arise from it. To see the posts made by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] on the matter, please follow the links below:\n[list]\n[*][url=http://hackforums.net/showthread.php?tid=2960760&pid=27938769#pid27938769]One[/url]\n[*][url=http://hackforums.net/showthread.php?tid=2990531&pid=27938889#pid27938889]Two[/url]\n[*][url=http://hackforums.net/showthread.php?tid=2997158&pid=27938885#pid27938885]Three[/url]\n[*][url=http://hackforums.net/showthread.php?tid=3001666&pid=27938879#pid27938879]Four[/url]\n[*][url=http://hackforums.net/showthread.php?tid=2992218&pid=27938811#pid27938811]Five[/url]\n[/list]\n\n[color=white][b]New Section[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] created a new sub-section for the Marketplace section this week. The section is called 'Rewards and Small Favors', which can be found [url=http://hackforums.net/forumdisplay.php?fid=255]here[/url]. This was created in an attempt to further organize things within the Marketplace section. The main use of the section will be for services that aren't as large as those in the \"Service Offerings\" section. An official statement on the matter can be seen [url=https://twitter.com/hackforumsnet]here[/url], on the HF Twitter.\n\n[color=white][b]MOTM Landslide[/b][/color]\nThis month, the user [url=http://hackforums.net/member.php?action=profile&uid=1011113]Dan.[/url] won the Member of the Month award by a landslide of 108 votes. This has been proclaimed to be the biggest win in any MOTM competition this year. The closest member to Dan. had 62 votes, which is a total difference of 46 votes. The voting thread can be found [url=http://hackforums.net/showthread.php?tid=2988325]here[/url].\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=121196][b]Natha[/b][/url] reached 10,000 posts! Congratulations!\n[url=http://hackforums.net/member.php?action=profile&uid=143654][color=#0066FF][b]Kr4z1[/b][/color][/url] is no longer a Mentor.\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1316890][color=black][b]Oats‌‌‌[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=74674][color=black][b]Blazin[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=280487][color=black][b]Snapback.[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=284171][color=black][b]Aspolale[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1246572][color=#0066FF][b]USMC Chris[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1206954][b]Nickelodeon[/b][/url] received the Brony award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1270485][color=#0066FF][b]Kool Kid[/b][/color][/url] received the Sticky Man award.\n[*][url=http://hackforums.net/member.php?action=profile&uid=923753][b]Juicy Booty[/b][/url] received the Cool award.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=1450962][color=#0066FF][b]Reptar ツ[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2992802][b]Windows 8 [Information Thread][/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][color=#0066FF][b]Mr. Anderson[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=3008693][b]Let's create a Virtual Nation for Hack Forums[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=879655]iElement[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: For the 117th edition of the News, and a tribute to the recent Halo 4, we have iElement. Any shoutouts or comments you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: Get ready for a long shoutout for my good friends out there. Hexicidal, Soulmate, Saturday, Positive, Closure, Vinnie, Chief, and a few more that I cant't think of. I would to say that I love of you guys and you have helped me in some way through my time on HackForums.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: You've got a lot of friends, but you can never have too many. Unless you start to lose track of all of them. A lot of those people are in Logic; how did you become so closely affiliated with that group?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: Thank you for asking this question because I'm sure that many people out there are wondering how someone like myself is a leader of a group such as Logic. It all starts out with Hexicidal and I being friends for a few years before hand up until now. When Hexicidal started up the whole Logic idea in May I jumped right i with him to help out. Right around this time the whole Coders group being closed was happening and there came an oppertunity to get everything started. Hexicidal purchased Coders from Omniscient with the help of the member Phenominal. Abiding by Omniscients rules we waited six months to change Coders to Logic we all know now. I created the graphics including the userbar, logo, and forum icon. After doing things for the group Hexicidal promoted me to the leader I am as of now.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: You've had a history of making userbars for groups. What current groups use your work?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: Currently only Rhythm and Logic use work of mine. Even though these are the two official groups that wear my work I have made graphics for many more that have failed becoming official.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: It sucks to see hard work go nowhere. How did you start getting into graphics, and group related artwork?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: I have been doing graphics related things since around 2008. One day I saw that Positive was looking for a userbar for his new group that he was making out of TechSperts. I took this opportunity to help get my self noticed as I just started getting active and was still a l33t member. The first idea that I sent to Positive he loved it and sent me a PM asking for my skype username. Positive and I sat in a skype call for several hours just bullshitting about stuff and getting ideas out of him to help finish my design. After the userbar I made was choosen out of several I started having people request my work from both non-official groups and big official groups like the Illuminati. Since I wanted Logic to be an awesome group I took my time and made something that made Hexicidal scream like a little girl to me in a PM and other member enjoy wearing.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: That explains your friendship with Positive. How did you find HF in the first place?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: I'm going to be completely honest with you on this one. I joined HackForums to download this amazing tool that my old friends told me about that makes people go offline on Xbox. Some may know this tool as Jays Bootah as it is called in the community today.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: I came here for something similar. Eventually I realized the tool I wanted, a Facebook hacker, was fake. So naive, aren't we? What has made you stay on HF versus leaving?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: Again being honest I stayed to continue finding cool programs to hit people offline. This was something that completely amazed me. Eventually I bought l33t membership and realized that i won't get swatted and doxed. When I found out what the meaning of swatted was I literally pooped my self and was scared to death of posting on here.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: There are safeguards in place... I doubt either of us will be swatted anytime soon. Have you regretted anything on HF?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: The only thing that I can say I regret doing is leaving the Writ3rs.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: And why did you leave them?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: I didn't have the time when I joined because school had just started and I had a lot of things to do that were more important. Things have recently calmed down over the past few weeks and I wish I had never left.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: What's one thing about you that no one else on the forum knows?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: That is a really hard answer and I had to think about it for a second due to me not knowing something off the top of my head. No one on HackForums know that I am secretly a female.\n\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: Well all right then. Any closing comments you have for the readers?\n[url=http://hackforums.net/member.php?action=profile&uid=879655][color=white][b]iElement[/b][/color][/url]: I love you.\n[url=http://hackforums.net/member.php?action=profile&uid=827711][color=#0066FF][b]+Entity[/b][/color][/url]: <3\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=620004]iceybunneh[/url] and [url=http://hackforums.net/member.php?action=profile&uid=23809]Viral Dragon[/url][/font][/size][/color] (LONG)\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 117th edition of the HF News, iceybunneh and Viral Dragon! Shoutouts before we get started?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: Hello to everyone I normally talk to and to the people who have kinddd of seen me lurking around in HackerCraft xD. And hellooo Phytrix! Thank you for the interview!\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: Sure. Shout out to Iceybunneh, Paradoxum, T3h Hack3r, Anderson, Lions, Ethereal. A few other friends I missed but can't put in here to save space.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Hopefully everyone will appreciate this threesome we've whipped up for them ;). So, you two have been lurking around Hackercraft lately. How do you think it's going, and what experience do you two have with Minecraft?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: Hackercraft is definitely a different experience from the server that Viral, Lions and I run. We're incredibly strict on the set of rules we have, so to see a server that's the complete opposite for me (who doesn't play any other servers besides our own and HC) it's a new experience. :)\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: I joined HackCraft the first day it came out. Truth be told. I wasn't actually that dissapointed. I expected it to turn out as so. However, ...while I did expect this I still feel though Omni could have made a better choice than Mr. H. to run the server pretty much for him (at least, to me this is how it seemed. ). At this point -- The server is starting to do better but could still use a lot of work. That being said though, ...I'm just a guy with an opinion. It's not like I can tell Omni how to run a server...Why would he listen to someone who isn't \"recognized\" you could say on the forums as an MC Server owner. Unlike Dan who is known for having a server that banks at least $1k a month.\nAs per my experience with servers....I've been running servers for about 2-3 years now. My first server ever was me being a co-admin on a friend's server who had about 60 players daily. Gradually I worked my way up from my own computer hosted server to a dedicated server. The biggest server I've ever run has about 200 players only daily and gets pretty chaotic. A lot of the servers I used to run or help run has closed down though.\nMy current server holds about 64 players which you can find at: 66.7.207.77:25603 (Soon to be \"server.anamoria.com\") -- shameless plug I know. But why not?\nI really want to help HackerCraft but Omni would learn nothing if everyone did it for him. Which is why I think Dan should be teaching Omni alongside him not doing it for him and then conversing about it later.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I definitely agree with a lot of the points made, and it's good to see that so many Hackercraft members actually have experience with servers. You two are very active and contributing with the Writers, with Viral Dragon being the leader of the HF Wiki team and icey being the head proofreader. How did you two get to such a position and how do you think you have changed the group?\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: Well....Originally Writ3rs was a group consisting of JUST the wiki team and meant solely for the wiki team. Itylerallen was given the position of leader by Omni. As per why...I don't actually know. After Itylerallen had re-installed Mediawiki at least 3 times and then I painstakenly put it up again, all 3 times (the help docs with the other current documents we had) -- he decided to \"leave HF\" for whatever reason he had.\nThe wiki was originally hosted on his webhost and since he left that also went down. So I took my personal server (a server in which I'm just rooming with a friend (thank you)) and hosted the wiki off that. After getting it all set back up again. I did some major edits to the configuration. Got the accounts set back up and made a thread in the Writ3rs section naming myself a \"Self Appointed Temporary Leader\". And then proceeded to ask if people were ok with this. After literally every member of the team said I should have been leader in the first place gave their approval I proceeded to develop a system. Which worked nice for a while. I'm currently on revision 3 of the system. Each time I think it gets better and better.\nWhen I became leader, Sir asked me if the News team could just share a sub forum with us. I said I didn't mind and gladly welcomed him with open arms. The subforum seems so empty with just 10 members (the size of the wiki team). That said we have our own rules and our sub structures of how things work and honestly....I think we get along just great together. Why make 2 groups if we don't need it. A sub-sub forum would be nice. But not needed. That aisde, ..Sir. It's been great working with you thus far. And here's to many more months or even years of being side by side working together.\nSimply put though. I became a leader by being dedicated to the project and the team. Putting damn hard work into it and then appoting myself the leader when Itylerallen left without doing jack to help sort out the mess he left behind. (No disrespect meant ..but it was chaos).\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well iceybunneh, it seems you are quite a decent writer, and an aspiring one at that. Where do you get your passion from, what are you currently working on, and where do you hope that it'll take you?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: I became an editor through Viral. I've been writing stories since I was 11, and it was only a few years ago that I decided to pursue it seriously as a career. Throughout my own novel editing process, I've developed a serious eagle eye for grammatical errors and fact checking. The same kind of critiquing I give myself I give to the Writers that I proof read. They're all talented writers, so I demand nothing but the best, even if it seems like a daunting and sometimes demeaning process, because I want something worded differently, or with less words.\nAs for what I'm working on... I have several novels in mind that have been developing for years. Right now I'm split between a fantasy trilogy that I'm about halfway through (meaning I'm about halfway done with the second book) and a paranormal romance idea. The fantasy trilogy took five years of off/on/off development until I finally got it down. The passion you speak of is the ideas in my head and the drive to write them down as accurately as possible. It seems strange, but I see my novel ideas develop like how you'd watch a film, so I try to transcribe that process down, usually before I confuse myself with more ideas :P\nAnd of course, I hope to someday get that winning letter from a literary agent that says yes, I will represent your work; as well as that winning letter from a publishing house that says they will publish me. That's been something I've dreamed of since I was 11, but it wasn't until I put serious thought and consideration into it recently that I really understood the publishing process. So here's to some good fortune. :D\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: For those that don't know, iceybunneh and Viral are married. If it's not too personal, how did you two meet and form such a strong relationship? Also, do you HF next to eachother, or in seperate rooms/locations, or...?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: We met over MSN. At the time, I had nooo idea of what malware was, so I asked a friend who knew Viral if he could help me out, and he sent me to Viral. Viral not only removed the malware for me, but did other things like unlock my locked myspace account (you know, whenever myspace was cool) ...and I thought all of his hacking or general computer knowledge was just really cool, so we kept talking XD. Viral can answer the other half, since he wanted to see my reply first. ;]\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: Right. We met over MSN. I had a friend name Blast, who sadly, hardly talks to me anymore because of his personal rea life issues. He said that he knew this girl from a graphics forum who had a virus or a trojan on her computer. I, being a skeptic, didn't think she had a virus. However he got us into MSN chatroom and she proceeded to tell me her name, how greatful she was I was helping her, how she didn't know jack about computers that much, and what symptons she was having.\nAfter she described the problem to me, it was nothing more than some adware and spyware you can pick up from torrenting and going to various sites litered with them. -- After I had solved the problem for her she began to ask if I knew anything about hacking. Well...back then, I was more than egotistical I was probably arrogant as high as the sky. And ashamedly, I will admit this. She asked me if I could hack into Myspace and recover her account. Well...I had nothing better to do, so why not? Back then, there was a worm still going around for Myspace and I took advantage of it to recover the account. After giving it to her...we said our \"farewells\" to move on..or so she thought. Actually. I had obtained her IP address, her screen name and a few other things and began to pull a up DoX on her. As sad and as skiddish as it might sound. Real hacking does include doing actual foot work or mundane boring stuff, such as pulling every piece of info you can find ont he target. -- After proceeding to break into her physical computer (well...I didn't have physical access but I didn't break into her account. I broke into her actual computer) ...I began a conversation with her via notepad. Which, she freaked out over. After talking to her on MSN some more. ...we got to know each other a bit better. -- At this point I had to leave for 6 months for ...well military reasons. Which, I'd rather not disclose here..at all.\nAfter coming back. I proposed to her an idea of writing an anime in which I had ocme up with. After working out the kinks int he plot, story line and so on we started to work on it. only to have our love unfurl.\nFast forwarding a bit. I gathered up the money to visit her in her state (at this point we were an LDR) and then visited 3 times before moving to her state. Which I will warn you now. Actually cost a shit ton of money to not only vist..but more if you want to move there. Anywho.\nAfter staying there for a yearish. I moved her back with me to FL, where we currently reside.\nOur strong relationship i think came from not only our similarities and our likeness of the same things but also our differences. Having almost lost the relationship once or twice....our bonds grow even stronger. When you fight, your bond grows weaker and then strengthens 10 fold. Its really because we talk.\nAnd yes, we HF/HC in the same room. Unless we're away or at a different house/place. Normally though, in the same room so we can converse easier. That and we live together. So why not?\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Oh wow, well I guess virtual relationships can work out then! What have been the highlights of your HF journeys thus far? Any particular moments?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: I'm actually surprised that I gained a reputation in Innuendo (and I don't mean that green-or-red number), so I think my main highlight would be the point in time where I literally answered every topic on the first page of Innuendo, whether it be a serious help topic or a troll. I was on sort of friendly terms with The Rated R Superstar at the time (or so I like to think :P) so while people started calling me the Innuendo Queen, I remember, and Viral points it out quite often that at some point, TRRS either jokingly or seriously said, \"Icey for mod 2012!\" ...if I hadn't have had such a series of bad computer problems right after, I think I could have contributed more towards Innuendo, rather than my half a year hiatus that followed, with me losing a working computer, then working on my writing projects in a hermit-like fashion ._. But that whole period of brief notariety did have an impact on me, because it was the first time I had stood out in a large community and... well okay, the ego inflation was flattering :P But I did invest a heavy amount of time posting in Innuendo. Now, with the Minecraft server I run and other IRL priorities, I can only *sometimes* dedicate myself to Innuendo, which is kind of a shame. :/\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: Yes. Virtual relationships CAN work out... but IF, and ONLY IF, you put the EFFORT into it. It doesn't just go like anormal relationship. There's a lot you have to do, to maintain it's hold. Its not some magical fairytale thing from a book. Lol.\nI don't know if I have any HF highlights? I don't actually think I'm all that well known on HF nor do I want to be, though according to various people. I'm actually quite an idol or something. One thing I might be proud of though is the Website and Hacking forum was once nice and clean with some hard work put into it and some real quality threads flowing through it. Or maybe in the White Hat Help section...my canned speeches have become the \"norm\" now. And many many people use them daily to help others.\nI think for Icey though... she was voted for as a mod of innuendo and gaining the title \"Innuendo Queen\".\nBut to be honest, you'll have to ask someone else what my HF highlights are. Because to me, I'm just \"that guy\" who there's in the corner at a dance or something. I tend to help people and that's it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What improvements/changes do you think need to be made on the Hackercraft server to improve it or maximise profit/experience?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: Ooh, boy. I sense a large, presidential-campaign-sized speech coming from Viral :P. For me, I'm not one that's familiar with the technical side of running a server - Viral handles most of the files, and all of the custom coding and re-coding that goes into our server. For me, as a simple player, I just want the lag fixed. My computer is not meant to be a gaming machine and handles lag badly, so when I DO log into HC, I usually lag out and have to continously sign in/sign out, which... it takes my client at least four, five minutes to even see that HC is online for some reason (and it's a completely vanilla client; I have no mods at all). So it's horribly inconvenient. As an admin who is used to the control I get in my server, I'm also not used to the way HC is run in terms of grief control, theft problems, etc, so I don't feel as safe as I would when compared to playing as a normal (non admin) member on my own server. I guess that's the main difference, because I so heavily emphasize that griefing will get you banned on our server, and it runs rampant on HC. It's not my server so I can't exactly say anything. So I don't log in as often as I could, should there be any kind of security in terms of grief/theft control. Call me a wimp, but I'm bad at PVP...I just build things, usually xD\nAs for profit... we do sell items like creative and factions and it does work on our server. However, our community isn't quite as ...I guess bravely outspoken as some of the people I've seen in HC. We have profanity filters on our server for example, and I moderate chat to keep drama and insults down. So the two communities are drastically different and what may work for one server may be criticized on another (like how people were saying selling factions doesn't work, in the Hackercraft forums). Our community is small and tight-knit so they usually know each other pretty well, and they know us and the way we handle purchases, so I guess it's a level of trust we built up. Omni's a good businessman. It'll take some time to get the bugs rolled out of Hackercraft, and I think once the community is solid, profits can start rolling out. Ours did ;]\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: A lot of what _needs_ to be done has already been stated many times over, I would think, in the HackCraft forum. A lot of what needs or should be done Dan and Omni already know and just haven't done it yet. Whether or not they're working on it. I don't know. Somethings I'd like changed though, as a player, not neccasrily a server owner is:\n\n[list]\n[*]Better economy. Resetting everyone to X balance and then changing things out like how much X costs or sells for, =/= resetting the economy. Delaying inflation is all they did.\n[*]Get rid of the damn xrayers. NO ONE likes an xrayer. While I know it's _impossible_ to stop this 100%. You can piss off Xrayers quite a bit. I myself do a few things to get them re-think it.\n[*]Grief/theft protection would be nice. However, this is a faction server. Not a lets blow sunshine up your ass server. So grief and theft protecton I will admit should and probably will take a back seat on this one for a bit.\n[*]Map size. For PvP and factions 10,000 is actually pretty friggin small. Even on small servers that hold up to 64 players. I would at least suggest increasing it to 15k or 20k to allow for more room. Because the server came out in 1.3, and I was the first one to reach the 10k border (did it on the first day) -- And I'm going to presume othe rplayers did the same exact thing....all the chunks should have already of been pre-loaded. (or most of the chunks). Meaning if anything new was supposed to come in...it won't. Because the chunk has already been generated.\n[*]The staffing tiers. Sorry. But the way I run my server and the way this one is run is just completely different in terms of staffing. For once, I have staff online 24/7 no matter what. This is why some of my staff live in different time zones. Staff is essential for servers. No matter the type of server it is. There is ALWAYS going to be a problem. And a lot of times, staff are needed. Because I haven't different tiers to my server though, my mods certainly don't have /ban and /tempban. While I could more than likely trust them with it, sometimes, we as humans make mistakes and its possible mods can just go haywire or awol.\n[*]If he wants to start making profit. Get the stupid bugs worked out already. Don't just leave it up to Dan. Take a first hand position and see whats going on. See if you can help\n[*]Custom plugins are a must. You can do a lot, I will admit, with public plugins. But cutoms give it the unique edge other copy servers don't have.\n[*]Sell something that won't ruin the fun for others. Minecraft. Isn't about battling others (disregarding PvP) it's about having fun. People want to have fun. Killing others at PvP is fun for others while building with what is essentially lego blocks is fun for others.\n[*]Newer more creative spawn. Right now....I find it to be bland. That's just me though. Our spawn is actually going through a reconstruction itself.\n[/list]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: So icey, being the Innuendo Queen, you must know a lot about that kind of stuff. Where do you learn about all this stuff...?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: It's strange, but I spend hours on Wikipedia jumping articles. I know people say Wiki isn't always accurate but I use it as a base for jumping to other research papers, or I use their cited works as reference, and check it against others. Human sexuality is something I want to put serious college-level study into one day. Human relationships and jumping into a person's head is something I got into not only from helping people in Innuendo, but my romance and erotic writing. And... there are some posts in Innuendo that I blatantly say, \"I have done this,\" which I've had people tell me is awkward to read if they consider me to be an internet-sibling XD It's part research, part experience. To be honest, I haven't been in many relationships at all, but my relationship with Viral has given me a whole world of new experiences, both good and bad (and by \"bad,\" I mean that in a good, \"This gave me an experience I can use to help people with,\" Viral), so I try to apply both the good and bad experiences, along with research together. If that makes sense.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Viral, when/how did you originally learn about hacking/coding, and where has it taken you since? What languages/methods do you currently know and how did you manage to learn them so thoroughly?\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: I originally learned about coding through my love of computers. I've been using and messing with computers since I was about 2 or 3. First was just stupid little games and then it grew. I gradually started learning more and more, and by the time I was 8 years old I could code fluently in 2 or 3 languages. I don't really remember which ones, but Batch and HTML were one of my first ones. After learning to code fluently and wanting to proceed my career as a game designer at the age of 10 (at which point I had already designed a game and wanted to program) I was finishing up learning ASM at the time. I started to think to myself...that I could program all these neat applications but what if someone could mess it up? So I thought to myself - \"How can I break my own application?\". What did I do? I got onto a different computer, downloaded my program and then looked at it from a viewers perspective. From there, I started to learn hacking. Yup. I learned hacking the old fashioned way. I learned how to hack, before I even knew what it was. By the time I was 12 or so, I had already learned quite a few techniques. Some from self taught experience or learning. And some from books.\nAfter venturing our a bit though, ...I ran into a few hacking ....friends you could say. Whom taught me some more techniques. Back then when it was just crappy looking message boards and no one had anything but dial up and AOL. Lolll. -- However, my love of computers and my enthuism for it has never once slowed down or stopped. I've continued, to this day to learn more and more techniques as they come out. I've even developed a few techniques that are there now. -- That said, asking me how many I techniques for hacking I know would be ridiculous. I'd never be able to list them all. Same goes for programming languages. I've been coding/scripting/programming since I was at least 7ish or so. I've learned language after language and last I was told and/or counted I was at about 50 languages. .____. Some of them, I don't remember that well anymore since I never use them and really only learned it just to know it for enthuism sakes and others because I no longer have a use for them.\nI've broken into and taken actual data from some pretty big sites like Google, MIT, Yahoo, AOL, Microsoft, Bing, Facebook, MySpace, WoW, ... I'm on Google somewhere, and have written some exploits for the above sites. MIT I broke into when I was 15 and had access to credit card info, social security numbers, emails, phone numbers and so on. I sent them an email where the hole was and how to patch it. Lucky for me, I wasn't taken to jail because apparently I could have. Lol. So much for White hatting huh?\nCurrently. I work for a computer company, and a civillian contractor for an un-named source.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, thanks for the... well, it'd be false to call it an interview, so novel, today Viral and iceybunneh. Was definitely a good one. Any final comments?\n[url=http://hackforums.net/member.php?action=profile&uid=620004][color=#FF1493][b]iceybunneh[/b][/color][/url]: LOL. Well thank you for dealing with both of our novels :P I think I typed just as many books as Viral did. This was an enjoyable interview, good sir. Final comments... I want to get back to posting the way I was before in Innuendo, so I hope people are up for more walls of text from me ;D\n[url=http://hackforums.net/member.php?action=profile&uid=23809][color=white][b]Viral Dragon[/b][/color][/url]: Thanks Phytrix for being so patient with our answers. We know we gave you a lot of information to part through and we apologize. Or rather, I apologize for mine. -- I'm glad you took the time. I'd like to hopefully think this gave the users of HF a good read and maybe inspire them to take themselves farther than before. \"Never, ever, let someone tell you otherwise that you can't go farther than what you already have. I hope you were inspired to take yourselves to a new height and achieve a greater sense of self respect and otherwise goals you may have\".\n[/spoiler]",
      "subject": "[11/11/12] - HF News"
    },
    {
      "pid": "28041070",
      "uid": "515249",
      "dateline": "1352696386",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[color=white][b]SmartGlass Now Available For iOS[/b][/color]\nApple device owners can now use the new, sleek SmartGlass application. The original Xbox app was updated to include the SmartGlass features, along with a new app icon and name. Users can control Xbox features from their iOS devices, however functionality is not available for all games. For example, you can use the SmartGlass app to view your Halo 4 service record or detailed information about something. SmartGlass is available on iOS, Android and Windows phones.\n\n[color=white][b]Black Ops 2 YouTube Live Streaming[/b][/color]\nActivision has announced that they are partnering with YouTube to let gamers live-stream multiplayer matches. Players will now possess the ability to stream from their consoles in League Play matches and will support audio commentary, webcams, and videos available through Call of Duty ELITE. \"With our competitive play and eSports initiatives, we wanted to deliver live streaming capabilities built right into Call of Duty: Black Ops 2, because Call of Duty is not only fun and exciting to play, but we believe it will be just as exciting to watch,” “By making the capability of live streaming as accessible as possible to our fans, straight from a player's console without the need for any additional hardware or sophisticated setups, we are empowering our fans to share their multiplayer experiences.\" \n\n[color=white][b]Gears of War Series Passes 19 Million Sales[/b][/color]\nEpic Games have announced that the series has passed over 19 million sales. Gears of War is one of the biggest Xbox exclusive titles, with Gears of War 3 selling over three million copies in its first week. The next Gears of War game, Judgement, is set to be released on March 19, 2013. You can also pre-order the game now at retailers. \n\n[color=white][b]Navy SEALs Punished[/b][/color]\nAccording to CBS, several active SEAL Team Six members that worked on Medal of Honor Warfighter used classified material \"which had been given to them by the Navy\" which “violated the unwritten code that SEALs are silent warriors who shun the spotlight.” The SEAL's involved “all received letters of reprimand which would kill their chances for promotion” and had half their pay taken away for two months.\n\n[color=white][b]Video Of The Week[/b][/color]\nThe video chosen this week is PKA 112, where WoodysGamertag and the rest of the PKA crew try to call Walmart and Gamestop to receive Call of Duty Black Ops 2 early. But does it work? Who knows... Watch the podcast to find out! You can also watch the 6v6 matches that caused some YouTube drama in the upcoming weeks. You can view the video below.\n\n[align=center][spoiler]\n[video=youtube]http://www.youtube.com/watch?v=74S-0MKX_8k&feature=plcp[/video]\n[/spoiler][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]The Smokey States[/b][/color]\nYou might want to consider rebranding Washington and Colorado as the 'smokey cities'. On election day, voters passed a referendum in both states that would make the recreational use of marijuana legal. Allen St. Pierre, executive director the National Organization for the Reform of Marijuana Laws, stated that \"Yesterday's elections have forever changed the playing field regarding cannabis prohibition laws in America (and probably in large parts of the world, too).\" Don't get excited to fast though, because the DEA has explained that the \"enforcement of the Controlled Substances Act remains unchanged.\" That is, marijuana, on a federal level, still remains illegal, and they will treat it as such in both states. Colorado's Amendment 64 and Washington's Initiative 502 have set a precedent, and they also are expected to bring in much a needed tax revenue on a state level. \n\n[color=white][b]Salafis Protest For Sharia Law[/b][/color]\nLast Friday, those affiliated or in support of Egyptian Salafi groups gathered in the thousands in the Tahrir Square. The protesters(roughly 10,000 of them) protested that \"The people want God's law applied.\" The Egyptian constitution is currently being formed, and many of those want that constitution to have Sharia law, while others would like it to remain secular. The Muslim Brotherhood has hoped to see Sharia law implemented over time, while the Salafis have no interest in waiting to see it be done. They want Sharia law incorporated immediately. The minority Christians, who make up around 10% of the population in Egypt, are fervently opposed to such laws in their state.\n\n[color=white][b]Thousands Of Syrians Flee Into Turkey[/b][/color]\nOn Thursday and Friday this week, roughly 9,000, largely from the border town of Ras al-Ain, fled their mother nation and ran into Turkey in fear of bombings by President Bashar al-Assad. Turkey's refugee camps now compose of over 120,000 Syrian refugees. One refugee, who goes by the name of Gasan Alun stated \"We will stay here until the fighting has completely stopped and all has calmed down.\" Further explaining, he also said \"I hope to God they don't bring the planes.\" Turkey is growing impatient as they worry about the increase of refugees, as it wanes on their resources and poses the risk of a spillover. \n\n[color=white][b]China Announced New Economic Goal[/b][/color]\nChina leadership explained on Saturday that they feel China will exceed 7.5 percent GDP growth in 2012. President Hu Jintao also said that the per capita income is expected to double by 2020. Though they are confident that growth will remain, China also proclaims \"...we dare not lower our vigilance. The foundation of the economic stabilization is not solid enough... Under the backdrop of a persistent global financial crisis as well as a new situation and problems in the economy, we must make preparations for dealing with difficulties and challenges over the long term.\"\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nApple has paid an amount of $21 million to own a license for a clock design that is currently implemented into iOS 6. In September, the SBB of Switzerland objected that this clock-design of Apple is almost as same as their clock, which is hung all over the Switzerland railway station, which was based on the clock design created as a trademark by an SBB employee, Hans Hilfiker. During the past week, Apple paid them $21 million to settle the matter. Meanwhile, during the same week, Apple and HTC agreed to build an agreement that includes the building of their patents for the next 10 years. Both the companies have had patent issues for two years and now seem to be happy with this agreement. \"We are glad to have reached a settlement with HTC,\" Apple CEO Tim Cook said in a statement, while HTC CEO Peter Chou said \"HTC is pleased to have resolved its dispute with Apple.\"\n\n[color=white][b]Google[/b][/color]\nGoogle's access was finally restored in China, after an outage that lasted 12 hours. Initially, Google thought it might be an error from their side, so they checked for it and later announced that it wasn't. Eventually, it was uncovered that political issues were what blocked its usage, which lead China to switch their security to 'wartime level.' And as a result of that, Google, Gmail, etc. became inaccessible by users located in China. After the restoring access, users were able to access all Google services. However, we do know that Google and China have had their own censorship battle going on over half a decade.\n\n[color=white][b]Twitter[/b][/color]\nTwitter's official application, 'Twitter app', has been having a problem with tweet requests. Users have been struggling to receive their respective tweets in an acceptable time due to server delays. In response to this issue, Twitter updated their blog with the post \"Some users may be experiencing a delay with new tweets in their timelines. Our engineers are currently working on this issue.\" However, users with an alternative Twitter application, such as 'TweetDeck', didn't seem to have any issue in receiving their tweets. \n\n[color=white][b]Yahoo[/b][/color]\nThe search engine company, Yahoo, has started a new project that has been named as \"Project Homerun,\" according to AllthingsD. AllthingsD states that Yahoo is attempting to redesign their homepage into one similar to Microsoft's Windows 8 website, by using large homepage images at the top, closely resembling W8's live tiles. This change will make Yahoo more browser-supportive for Smart-devices, especially with those devices with a larger screen. Since Yahoo has a large amount of traffic to its homepage, it's been estimated that any changeover may cause a potential increase in relation to the company's finance.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b][color=white]Dave Grohl Joins Queens Of The Stone Age For New Album [/color][/b]\nNirvana legend and Foo Fighters frontman Dave Grohl has joined alternative rock band Queens of The Stone Age for their upcoming album, slated for a 2013 release, according to band member Josh Homme. The announcement was made on BBC Radio, along with the disclosure of their previous drummer's departure, Joey Castillo. Grohl played drums for the band's 2002 album, Songs For The Deaf. The band confirmed the announcement via Twitter.  \n\n[b][color=white]Music Video Of The Week[/color][/b]\n[spoiler][video=youtube]http://youtu.be/APHX-9ZQ7x0[/video][/spoiler]\n\n[b][color=white]Member Submitted Videos[/color][/b]\n[spoiler]\n[video=youtube]http://youtu.be/zpnQf_iu1jk[/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nOne thing that has always interested me is human laughter. The sheer amount of ways we can achieve laughter is unbelievable, and the wonders it does for us is astounding. Some say it has the power of healing, and I would tend to agree. There's just something about a good, heart laugh that you can't beat. In that moment, nothing can compare to the way you feel. It's just something to think about.",
      "subject": "*"
    },
    {
      "pid": "28041073",
      "uid": "515249",
      "dateline": "1352696390",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you think of Windows 8?\"\n\n[i]\"I think Windows 8 looks terrible. I will not download it or ever use it. Windows 7 is \na perfectly good OS, but Microsoft just wants to have \"The next big thing\". They should \nhave just kept working on and improving Windows 7, no need for integration with phones \nor xbox live. Also, [url=http://emm.msi.com/admin/temp/templates/321/microsoft-windows-8-logo.jpg]the logo[/url] they have made is extremely simple, \njust 4 blue boxes. They Windows 7 one is much more aesthetically pleasing. I hope they \ndon't make the OS after w8 even simpler, we would be going backwards in technology.\"\n[url=http://hackforums.net/member.php?action=profile&uid=875998]-The Dark Knight[/url][/i]\n\n[align=right][i]\"I bought Windows 8 just a couple days after it came out and personally, I \nLOVE it! People always say it's going to be terrible because you can use it with touch screen, \nbut I haven't had an issue using it with my mouse. It's much faster than Windows 7, everything \nthat was on my Windows 7 machine, is compatible on my Windows 8 machine. People speak \nbefore they buy, but I honestly think they should give it a try, and spend a week getting used \nto it. It's another great OS by Microsoft.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=822426][i]-iHaX™[/i][/url][/align]\n\n[i]\"Windows 8 is a fresh breath of air into Microsoft's stagnant life. It is truly ingenious, and fits \nall users, from new to old. It is bound to be the OS of the next three years leading its own way. \nIt is slick, appealing, and actually faster. Utilizing new technologies and a smarter boot strategy \nyou can expect 10 second boot times (after post ofc). In addition to that, MS is also going very \nstrong with hardware this time, and I think the surface is going to put a real dent into Apple's \nmonopoly over the tablet market. It is the perfect solution for everyone, and the Windows Store \nis already filled with amazing apps, both free and paid. It is quickly paving the way to become the \nmost successful release from MS yet.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=580684][i]-RDCA[/i][/url]\n\n[align=right][i]\"What are my opinions on the new Windows 8? Personally I have some goods and bads \nabout the new OS. I LOVE the new \"Start\" menu, I mean if they had that one windows 7 it would be \nperfect. But I still wanna be able to click the start button and go to a normal start menu. Just the over \nall way you navigate annoys me.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1058305][i]-Ida[/i][/url][/align]\n\nThe topic for next week is \"Where do you stand on decriminalizing versus legalizing Marijuana?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/iDFxVFdkSUOXk.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/dzLNF.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibzjXZEHaFyKvP.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=660659]-Anal OG-[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=903914]Prince™[/url]\n[list][*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=138559]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}