{
  "posts": [
    {
      "pid": "21895391",
      "uid": "515249",
      "dateline": "1334964012",
      "message": "[align=center][IMG]http://i.minus.com/jkhqlllf6xAWI.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#F84343][b]420th [/b][/color][color=#EEE727][b]full[/b][/color] [color=#39E46E][b]edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \nIt's actually the [b]88th full edition[/b]. Thank you for reading!\n\n[align=center][img]http://i.minus.com/jRxdaoipBirWd.PNG[/img][/align]\n[b][color=#F84343]Hack Foru[/color][color=#EEE727]ms' 5th an[/color][color=#39E46E]niversary[/color][/b]\nAfter a long wait, Hack Forum's 5th anniversary is finally here! To celebrate this event, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has changed the banner and announced that the entire next week will be a celebration of this accomplishment; so hopefully he has some festivities in mind. To view [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about this event, click the following link: http://goo.gl/66uh7\n\n[b][color=#F84343]Hac[/color][color=#EEE727]k Soc[/color][color=#39E46E]iety[/color][/b]\nEarlier this week, there were several members spamming these forums and advertising their own. Fortunately, the staff members on Hack Forums were able to control the situation and ban all of the spammers. The word Hack Society has also been censored due to this event.\n\n[b][color=#F84343]Ne[/color][color=#EEE727]w gr[/color][color=#39E46E]oup[/color][/b]\nA new group has been created on Hack Forums, called [i]Coders[/i]. Many members are excited to see how this group will be run and what it will do, as there have been quite a few requests for a group of this nature. With this most recent purchase, the new group price has been raised to $3500. To see [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the new group, click the following link: http://goo.gl/vChz6\n\n[b][color=#F84343]Dow[/color][color=#EEE727]n t[/color][color=#39E46E]ime[/color][/b]\nFor unknown reasons, Hack Forums was down for about 30 minutes this week. It is possible that [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] was working on something special for the 5th anniversary, but nothing is known for sure. To see [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the down time, click the following link: http://goo.gl/NnFa6\n\n[b][color=#F84343]Ub3r u[/color][color=#EEE727]pgra[/color][color=#39E46E]de link[/color][/b]\nAfter a few years of constantly changing the link [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has created a universal ub3r upgrade link. This link allows l33t members to apply for ub3r, and ub3r members to purchase upgrades for other members. To see [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s tweet about the new ub3r upgrade link, click the following link: http://goo.gl/G2BOr\n\n[align=center][img]http://i.minus.com/jnvTWr6gqjWf2.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=452771][b][color=#0066FF]Kuroi[/color][/b][/url] was rep-fucked.\n[url=http://hackforums.net/member.php?action=profile&uid=361543][b][color=#0066FF]Scooter[/color][/b][/url] has reached 2,000 reputation points.\n[url=http://hackforums.net/member.php?action=profile&uid=613009][b][color=black]Morchid[/color][/b][/url] was banned for fraud donations.\n[url=http://hackforums.net/member.php?action=profile&uid=1084980][b][color=black]Desire_[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=4546669][b][color=black]adampelletgun[/color][/b][/url] was banned.\n[url=http://hackforums.net/member.php?action=profile&uid=752389][b][color=black]eiqhtworks[/color][/b][/url] was banned for being a pain in the ass.\n[url=http://hackforums.net/member.php?action=profile&uid=426982][b][color=black]Virtualization[/color][/b][/url] was banned for account sharing.\n[url=http://hackforums.net/member.php?action=profile&uid=330676][b][color=black]Diabolic[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=1042121][b][color=black].Cartman[/color][/b][/url] was banned for threatening to ddos HF.\n[url=http://hackforums.net/member.php?action=profile&uid=56304][b][color=black]JesusOfSuburbia[/color][/b][/url] was banned for advertising porn forums.\n\n[align=center][img]http://i.minus.com/j46PQ4w5rFTwD.PNG[/img][/align]\n[color=#F84343][size=large][b]Gene[/b][/size][/color][color=#EEE727][size=large][b]ral Thr[/b][/size][/color][color=#39E46E][size=large][b]ead(s)[/b][/size][/color]\n[color=#F84343][i][b]Gaming Thread[/b][/i][/color] - [url=http://hackforums.net/showthread.php?tid=2398861][color=#EEE727][Propitious] Timeline of Console Gaming - BlackChaos[/color][/url] - [url=http://hackforums.net/member.php?action=profile&uid=766449][color=#39E46E][b]BlackChaos[/b][/color][/url] - Black Chaos has created an amazing thread with all of the consoles and their generations. Everyone can find something they didn't know, so enjoy!\n\n[color=#F84343][i][b]Coding Thread[/b][/i][/color] - [url=http://hackforums.net/showthread.php?tid=2323009][color=#EEE727][C#]Sockets, Packets & Pointers[/color][/url] - [url=http://hackforums.net/member.php?action=profile&uid=522041][color=#39E46E][b]Gray[/b][/color][/url] - Gray covers the many aspects and uses of sockets in this tutorial.\n\n[color=#F84343][i][b]Mental Thread[/b][/i][/color] - [url=http://hackforums.net/showthread.php?tid=2413633][color=#EEE727]iDoser Revealed - Unbiased review[/color][/url] - [url=http://hackforums.net/member.php?action=profile&uid=444723][color=#39E46E][b]Frostbiteâ„¢[/b][/color][/url] -Â iDoser is a sound system that is supposed to control your mind and give you the mood or high you want, without taking any substances. This is a review on how it worked for Frostbite.\n\n[color=#F84343][i][b]Donation Thread[/b][/i][/color] - [url=http://hackforums.net/showthread.php?tid=2419158][color=#EEE727]7th donation from Red Lions group to HF1000$[/color][/url] - [url=http://hackforums.net/member.php?action=profile&uid=80618][color=#39E46E][b]nokia2mon2[/b][/color][/url] -Â nokia2mon2 has donated another thousand to Hack Forums. Along with this donation, the Red Lions received a special text feature on their usernames, giving them a sort of shadow.\nÂ \n\n[align=center][img]http://i.minus.com/jOaMp7twbPKu2.png[/img][/align]\n[color=#F84343][size=large][font=Monotype Corsiva]Int[/font][/size][/color][color=#EEE727][size=large][font=Monotype Corsiva]erv[/font][/size][/color][color=#39E46E][size=large][font=Monotype Corsiva]iew - [/font][/size][/color][font=Monotype Corsiva][size=large][url=http://hackforums.net/member.php?action=profile&uid=964299][color=#F84343]Purp[/color][color=#EEE727]le H[/color][color=#39E46E]aze[/color][/url][/size][/font][spoiler=]\n[color=white][b]Ignite[/b][/color]: Good afternoon Purple, thanks for taking the time out to participate in our special 4/20 edition today. Any shoutouts before we begin?\n[color=#9400D3][b]Purple Haze[/b][/color]: Good afternoon as well.\nI'd like to give a shoutout to the old gang; Spencer, Orbsa and Chief\nWe can include Existence in that bundle as well, but he's a smith\n\n[color=white][b]Ignite[/b][/color]: Alright, sounds like a badass crew. I understand you smoke weed, how exactly did you start?\n[color=#9400D3][b]Purple Haze[/b][/color]: I believe I was around the age of 12. I began smoking cigarettes with friends which I eventually grew out of. I also tried weed with them once or twice. Afterword I began to discuss marijuana with my uncle (my dad didn't want me smoking at the time, obviously). He being an avid smoker talked to me a lot about it and actually started smoking with me. Great guy, right?\n\n[color=white][b]Ignite[/b][/color]: Interesting. Have you ever thought about quitting or don't you see any negatives about it?\n[color=#9400D3][b]Purple Haze[/b][/color]: Honestly I see marijuana differently from most people.\nPeople think it's 'bad' or 'addicting', when it's not.\nMost 'bad' drugs are chemically made, marijuana is just a dried plant.\nWhile marijuana is mentally addicting, yes, it is not physically addicting.Â \nSure it may kill brain cells, but nothing that causes serious damage.\nI do not see any negatives about the plant whatsoever.\n\n[color=white][b]Ignite[/b][/color]: Moving away from the weed subject. How is HF going for you?\n[color=#9400D3][b]Purple Haze[/b][/color]: Hackforums is going pretty well. A lot of people seem to think a fairly recent repfuck has affected me. It hasn't whatsoever. It's just a number on a forum. I'm pretty much doing the norm; Helping members out in the RAT section, and affiliating myself with groups and such; Being Blackshades Staff as well as Techsperts co-leader. Also might be going back into the marketing business soon as I plan on selling something.\n\n[color=white][b]Ignite[/b][/color]: Alright, sounds good. I bet being Blackshades staff is fun, how long have you been doing that?\n[color=#9400D3][b]Purple Haze[/b][/color]: It's been a couple of weeks. I've always enjoyed helping people and working their problems out, and being paid to do it makes it 10x better. ðŸ¤«\n\n[color=white][b]Ignite[/b][/color]: Haha. Time for some quickfire questions!\n[color=#9400D3][b]Purple Haze[/b][/color]: Sounds fun. Shoot 'em at me.\n\n[color=white][b]Ignite[/b][/color]: Existence or BV1?\n[color=#9400D3][b]Purple Haze[/b][/color]: Existence\n\n[color=white][b]Ignite[/b][/color]: Favourite movie?\nPurple Haze: Dances With Wolves\n\n[color=white][b]Ignite[/b][/color]: All time favourite quote?\n[color=#9400D3][b]Purple Haze[/b][/color]: \"Does a bear shit in the woods?\"\nI'm sure I've got a nice, serious quote in the depths of my mind, but there's a humorous quote for ya.\n\n[color=white][b]Ignite[/b][/color]: Alright, that wraps up the interview. Any final comments?\n[color=#9400D3][b]Purple Haze[/b][/color]: Happy 420 everyone. Toke up. I'll make sure I take a hit for Hackforums.\n[/spoiler]\n\n[color=#F84343][size=large][font=Monotype Corsiva]Int[/font][/size][/color][color=#EEE727][size=large][font=Monotype Corsiva]erv[/font][/size][/color][color=#39E46E][size=large][font=Monotype Corsiva]iew - [url=http://hackforums.net/member.php?action=profile&uid=87814][color=#F84343]hugsyou[/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=940577][color=#EEE727]Honor Et Veritas[/color][/url], [url=http://hackforums.net/member.php?action=profile&uid=897447][color=#39E46E]Ceaser[/color][/url][/font][/size][/color][spoiler=]\n[color=white][b]Waleed[/b][/color]: First of all I'd like to thank you for taking part in this interview. Typically on HF News we start off our interviews by giving our interviewee's the opportunity to give their fellow HackForums colleagues a shout out. Do you have anyone in mind hugsyou?\n[color=#F84343][b]hugsyou[/b][/color]: Yo shout out to my big homie MagicSpeed\n\n[color=white][b]Waleed[/b][/color]: Looks like someone is having an early celebration, I hope ÎœagicSpeedâ„¢ will one day read this issue of HF News although he's been banned for the past 12 month. After reading your posts you seem really pumped for the event tomorrow; what do you have planned?\n[color=#F84343][b]hugsyou[/b][/color]: My friends and I have been saving up money and bud for the past month for this. Some of my friends are in school, so we gotta wait for them. For us others though, we have an extra $100 to toke on while we wait.\n\n[color=white][b]Waleed[/b][/color]: I like the sound of that, seems like you have a big day in store tomorrow. Clearly you're aware of 420 seeing as I didn't even have to mention it to receive that quick response from you. We've had mixed comments regarding the event but we'd like to hear your opinion on the 420 celebration.\n[color=#F84343][b]hugsyou[/b][/color]: Christians have Christmas, Jews have Honica, African Americans have their own month, stoners have 4/20. It's where the new smokers and old, no matter how different come together.\n\n[color=white][b]Waleed[/b][/color]: I feel you my brotha', and I guarantee many other people would agree with that factor as well. Majority of \"stoners\" have the ambitions of one day seeing marijuana legalized. Do you have the same perception or would you rather have it remain prohibited and why?\n[color=#F84343][b]hugsyou[/b][/color]: I don't mind seeing it for medical reasons, but I'd rather keep it illegal. That's part of the fun I have from smoking it. Going on adventures in the woods because I can't walk the streets with a joint. Would be nice to see if in a lower level class though, instead of being a class 1 drug.\n\n[color=white][b]Waleed[/b][/color]: You've really helped me reminisce those good old days of High School. I'd like to thank you once again hugsyou for allowing us to interview you, are there any last words you'd like to leave for our readers?\n[color=#F84343][b]hugsyou[/b][/color]: A friend with weed is a friend indeed! Thanks for your time.\n[hr]\n\n[color=white][b]Waleed[/b][/color]: I am now speaking to Honor Et Veritas the owner of the new official group \"Coders\". Typically on HF News we give our interviewee's the opportunity to give their fellow HackForums colleague's a shout out. Do you have anyone in mind Honor Et Veritas?\n[color=#EEE727][b]Honor Et Veritas[/b][/color]: Hm... Good question. CodeCompiler, xhorntail, Styles, and (LMAO) OrangeViper. First three are amazing friends of mine, proving themselves to me as such by sticking around through the bullshit, and making my interwebz fun a bit more enjoyable; And the last one is pure troll.\n\n[color=white][b]Waleed[/b][/color]: That's great to hear, and I hope they are pleased to see their names mentioned in this issue of HF News. As you may be aware tomorrow is 420 a day celebrated world-wide by marijuana consumers; what is your view on this celebration and what does this day mean to you?\n[color=#EEE727][b]Honor Et Veritas[/b][/color]: Personally I think that celebrating 420 is childish. I smoke for the hell of it, I don't need a special date to tell me to go binge smoking. It almost feels like it's just a rebellion. (Which, I'm fairly sure it is) If you want to smoke weed, do it when ever. But in general, 420 doesn't mean anything to me. I'll either smoke or not, but I wont even blink about it being 420.\n\n[color=white][b]Waleed[/b][/color]: You've made plenty of strong points there, I'd have to agree with your perception of it being a rebellion. It brings more awareness to the legalization of marijuana. The reason I mention this is because the subtitle \"The Great Debate\" is regularly being associated with marijuana. The consumption of marijuana is prohibited in several states and countries. Do you feel it's time to legalize the substance or should it remain prohibited and why?\n[color=#EEE727][b]Honor Et Veritas[/b][/color]: I feel it should be legalized. Keeping it illegal just puts more people in jail and gives it a bad look in the eyes of the government. It's purely pointless to keep something thats so easily available illegal. Tax it or someshit, but keeping it illegal just costs more money.\n\n[color=white][b]Waleed[/b][/color]: Thank you Honor Et Veritas for taking the time to voice your opinion, I would like to wish you a happy 420 although you do not celebrate it. Are there any last words you'd like to share with our readers?\n[color=#EEE727][b]Honor Et Veritas[/b][/color]: Sure; Smoke because you want to, not because its a trend.\n[hr]\n\n[color=white][b]Waleed[/b][/color]: First of all I'd like to thank you for taking part in this interview. Typically on HF News we start off our interviews by giving our interviewee's the opportunity to give their fellow HackForums colleagues a shout out. Do you have anyone in mind Ceaser?\n[color=#39E46E][b]Ceaser[/b][/color]: You're welcome, as far as shout outs, at the moment I do not have anyone in mind.\n\n[color=white][b]Waleed[/b][/color]: That's fine. I understand that you are aware of 420 which is a world-wide event that's in fact occurring tomorrow; what are your views on the celebration?\n[color=#39E46E][b]Ceaser[/b][/color]: There are consequences to smoking pot, but there are consequences for doing most things. If you choose to smoke, that's your decision.\n\n[color=white][b]Waleed[/b][/color]: You seem like a very virtuous individual, in numerous \"420\" threads you've remarked schooling and education, by the looks of it you are very determined of your future. Would you like to explain to our readers why you see marijuana consumption as unjust?\n[color=#39E46E][b]Ceaser[/b][/color]: The vast majority of marijuana users I have seen around me, or at least in my school use it to escape problems. I see no problems with using marijuana as a relaxer, or just to have fun at home with friends on the weekend. But, using marijuana to run away from your problems is childish, as you'll never get away from said problems.\n\n[color=white][b]Waleed[/b][/color]: By the looks of it, I can presume you won't be participating in the event; what are your plans for tomorrow?\n[color=#39E46E][b]Ceaser[/b][/color]: From 8 AM to noon I'll be in school. Afterward I plan to go out fishing for an hour or two, and head off to work for the night.\n\n[color=white][b]Waleed[/b][/color]: Once again Ceaser I would like to thank you for taking the time out of your day to participate in this interview, have a happy 420 and a great time fishing. Are there any last words you'd like to leave for our readers?\n[color=#39E46E][b]Ceaser[/b][/color]: No problem at all Waleed, enjoy your day as well. As for the readers, I would like to say just use your weed at home, and stay safe and out of trouble.\n[/spoiler]",
      "subject": "[4/20/12] - HF News"
    },
    {
      "pid": "21895399",
      "uid": "515249",
      "dateline": "1334964037",
      "message": "[align=center][img]http://i.minus.com/jUtGdwrlisP72.png[/img][/align]\n[align=center][IMG]http://i19.photobucket.com/albums/b168/OmegaSaiyan/420HFNews.png[/IMG][/align]\n[align=center][YT]http://www.youtube.com/watch?v=HkppBeTIhjM&context=C4fa544cADvjVQa1PpcFPagEN4PnEYkzbgFHdkYxjXbChKtw93P58=[/yt][/align]\n[align=center]To play some fun online Stoner games, go to [url]stonergames.net[/url][/align]\n\n[align=center]There is a new Modern Warfare 3 clan open to all Hack Forums members.\nThe name of the clan is \"HackForums\" and members of the clan will be eligible for future tournaments. Â To join the clan, send a PM to \"Starstruck\" and he will invite you to join.[/align]\n\n[align=center][img]http://i.minus.com/jFk41epm8uQvf.png[/img][/align]\n[b][color=#F84343]Senate Consi[/color][color=#EEE727]ders Decrimin[/color][color=#39E46E]alizing Marijuana[/color][/b]\nLast month, the bill 162-161 was passed due to Republican House Speaker, William O'Brien's abstinence from the vote. This, therefore allowed the bill to move on to the senate. Â Reporters from Boston.com News stated that:\n\"A first offense would be a violation punishable by a $250 fine. The second would be $500. Subsequent offenses would be misdemeanors subject to a year of jail time and a $1,000 fine. Offenders under 21 could also be ordered to take a drug awareness program.\"\nJohn Lynch, current governor of New Hampshire promises to veto the mess during the Judiciary Committee hearing on Thursday. Â \n\n[b][color=#F84343]Marijuana Cl[/color][color=#EEE727]ub Suing C[/color][color=#39E46E]ity for $3 Million[/color][/b]\nA medical marijuana club in Murrieta, California has filed a $3 million law suit against the city of Murrieta, due to police harassing it's members and threatening patients with violence, arrest, and detention.Â The suit states that police targeted patients exiting the club and interrogated them about the medically prescribed marijuana.Â The club claims that this is a violation of medical privacy laws. Â \n\n[align=center][img]http://i.minus.com/j8qjwD8yB2zYK.png[/img][/align]\n[b][color=#F84343]Wi[/color][color=#EEE727]nd[/color][color=#39E46E]ows[/color][/b]\nWindows 8 is going to be released in four different packages: normal, pro, RT, and enterprise. Windows Phone is also getting an upgrade to Windows Phone 8 (Apollo). All Windows phones, yes, all, are getting the update, even if you have the first ever models. Windows Phone 8 is going to be a major release, and it may bring some giant software differences.Â \n\n[b][color=#F84343]Pat[/color][color=#EEE727]ent [/color][color=#39E46E]War(s)[/color][/b]\nThere have been many patent wars, with many companies in distress and in court battles. Both the CEO of Apple and the CEO of Samsung are meeting up to discuss licensing about their products and such. Also, Twitter is trying to call a truce to all these patent wars it has been having. It seems like all companies now are getting into patent wars, but is it to protect their products, or to make a profit?\n\n[b][color=#F84343]Orac[/color][color=#EEE727]le VS G[/color][color=#39E46E]oogle:[/color][/b]\nOracle, which owns Java, is suing Google for its Android infringement of Java. Java is a free programming language, but some aspects of the language are licensed. Oracle has stated that Google has used unlicensed code in their Android platform. Google is denying these allegations, stating that in the ~50 million lines of code, any use of Java is of the free type. Oracle is asking for 1 billion dollars, and has taken the battle to court. Â Â \n\n[align=center][img]http://i.minus.com/j52DPPi1a7LtB.png[/img][/align]\n[b][color=#F84343]Bob[/color] [color=#EEE727]Mar[/color][color=#39E46E]ley[/color][/b]\nBob Marley (born Robert Nesta Marley) is the icon of the rasta and reggae. He is well known as one of the greatest musicians to ever live and often talked about smoking marijuana in his songs. Bob was a notorious stoner, and a free thinker, there's no doubt.\n\n[b][color=#F84343]Col[/color][color=#EEE727]lie[/color] [color=#39E46E]Buddz[/color][/b]\nNot as well known as Bob Marley, Collie Buddz is another reggae musician and avid toker. Collie Buddz talks about smoking marijuana in almost all of his songs, in fact, his name is a reference to marijuana itself.\n\n[b][color=#F84343]Willie[/color] [color=#EEE727]Nel[/color][color=#39E46E]son[/color][/b]\nNot a large reggae musician, but another notorious stoner. Willie Nelson bragged about smoking a joint on the roof of the White House, he said during the interview, \"Well, what would you do?\".\n\n[b][color=#9400D3]Jimi Hendrix[/b][/color]\nOne of the Music News' writers personal favorites of all time, Jimi Hendrix was an outstanding musician. He is very well known for his love for marijuana, in fact, he composed the song that the Music News' writer gets his name from, \"Purple Haze.\"\n\n[b][color=#F84343]Su[/color][color=#EEE727]bli[/color][color=#39E46E]me[/color][/b]\nSublime was a well known reggae/punk band who all partook in smoking green. They had a unique style and sound, and they're also one of the Music News' writers favorites.Â \n\n[b][color=#F84343]Marijuan[/color][color=#EEE727]a Songs o[/color][color=#39E46E]f the Week[/color][/b]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=vUsv4Lb7EQs[/yt]\n[yt]http://www.youtube.com/watch?v=h0i62GnQoo0[/yt]\n[yt]http://www.youtube.com/watch?v=rmadSGJCzo8[/yt]\n[yt]http://www.youtube.com/watch?v=W55Smyyzs58[/yt]\n[yt]http://www.youtube.com/watch?v=1TD_pSeNelU[/yt]\n[yt]http://www.youtube.com/watch?v=zaGUr6wzyT8[/yt]\n[yt]http://www.youtube.com/watch?v=x7COuZLQ5z8[/yt]\n[yt]http://www.youtube.com/watch?v=AEYN5w4T_aM[/yt]\n[yt]http://www.youtube.com/watch?v=HFvaYRll-II[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jXgjHfhNsHFVE.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI'd really just like to thank you all, I really enjoyed doing this edition. We will be doing themed editions for most holidays, with custom artwork and possibly delayed timing. I believe it was all worth it.\nWhether or not you agree with 4/20 and marijuana, it's still a world-wide holiday, so to speak, and many people enjoy this occasion. \nToke on!",
      "subject": "*"
    },
    {
      "pid": "21895414",
      "uid": "515249",
      "dateline": "1334964063",
      "message": "[align=center][img]http://i.minus.com/jQA2kdWhDqVEk.png[/img][/align]\r\n\n[color=#F84343]\"What is your f[/color][color=#EEE727]avorite section o[/color][color=#39E46E]f Hack Forums? Why?\"[/color]\r\n\n[i]\"My favourite section of HF would have to be the Graphics section, expecially \r\nthe Graphics Battle section, at the moment. It is not overly crowded, but when \r\nyou do see something new, it truly blows your mind. It amazes me how people can \r\ncreate new things, and make them look so modern and beautiful. The Graphics \r\nBattle section interests me the most, since you can really feel the determination \r\nof people to prove themselves in these battles. Hell, who wants to lose? Whethe\r\r\nit be a sig of an advanced robot, or an antiqued picture of a turntable, there is \r\nalways something new and mind-blowing in every corner of the Graphics section! :)\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][i]-Phytrix[/i][/url]\r\n\n[align=right][i]\"The most section I love is The Lounge. I love chilling there, I get to \r\nknow a lot of new things, and even things on other HF members. I all the time get a \r\ngood laugh there. I couldn't surf HF a day without taking a look at the lounge and \r\nposting replies to threads there. I guess that's my opinion. Thanks. <3\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=509788][i]-Makaveli The Don[/i][/url][/align]\r\n\n[i]\"My most favourite section would have to be the beginner hacking section. By it \r\nbeing my most favourite section, my post activity there is of that high, consequently \r\nmaking me enjoy it a lot more! You ask why? Well, my main inspiration to helping people \r\nis the \"Thanks\" in return. Without them saying thanks, you feel that the time you spent \r\nexplaining and helping them out was wasted. I also believe it to be my favourite section \r\ndue to the friends to which I make. Even though they are at there beginner stages, I \r\nlove to show them the way of works as such and give them my information and knowledge \r\nto which I've learnt during my time on HF. I notice that after helping them out and speaking \r\nto them like normal human beings, they are a lot more willing to PM me and ask for help. \r\nI think by making such connections/friends, it helps Hack forums to continue in growing \r\nand to become established!\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=992333][i]-Accident[/i][/url]\r\n\n[align=right][i]\"My favourite section has to be The Lounge. Whoever or whatever you are, \r\nthere's always a thread somewhere for you that you can voice your opinion in. It's a great \r\nplace to relax and to sit back and enjoy yourself. Although you are more likely to get trolls \r\nin that section, the ammount of laughs and fun you have in there makes up for that.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=766789][i]-Brock Obama[/i][/url][/align]\r\n\n[i]\"My favorite section is the Hacking tutorials section. You never know what people are going \r\nto discover, or a certain way to use a program. People can learn a new skill, learn how to use \r\na new program, and even make lots of money through people showing off bitcoin miners and \r\nother products. You never know what is going to happen in the next thread, so it is a world of \r\nopportunities that are usually new tutorials, and if they were based off of an older tutorial, they \r\nwould have probably (and hopefully) have been updated.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url]\r\n\n[align=right][i]\"I personally feel the Marketplace is the best section/sections on HF. Many will \r\ndisagree, but really, even though there are scammers, the marketplace is the best place for me \r\nto but/sell stuff. The HF marketplace is the reason today I have Ub3r and have been able to buy \r\nmultiple products on HF. The marketplace also allows multiple people to sell their own products, \r\nand others with interests in those kinds of products can satisfy themselves. It's a great cycle \r\nand a great place.\"[/i]\r\n[url=http://hackforums.net/member.php?action=profile&uid=790289][i]-Phayzon[/i][/url][/align]\r\n\nThe topic for next week is [color=#F84343]\"If you spent 4/20 d[/color][color=#EEE727]oing something specia[/color][color=#39E46E]l, what did you do? In detail.\"[/color]\r\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\r\n\n[hr]\r\n\n[align=center][IMG]http://i.minus.com/jFDzDBrN0L2b0.png[/IMG][/align]\r\n[align=center][img]http://i.imgur.com/7ZTTN.png[/img][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/jJvR2Z0oJI1sP.png[/img][/align]\r\n[align=center][spoiler=][img]http://i.imgur.com/X65Fm.jpg[/img][/spoiler][/align]\r\n[align=center][spoiler=][img]http://boozeworthy.com/wp-content/uploads/2010/04/muffins.jpg[/Img][/spoiler][/align]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/jbhdohvaqgGuEi.png[/img][/align]\r\n[align=center]\r\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\r\n[video=youtube]http://www.youtube.com/watch?v=2gQ9npO1gJ0[/video][/align]\r\n\n[i][b][color=#F84343]Writ[/color][color=#EEE727]ten t[/color][color=#39E46E]opics[/color][/b][/i][spoiler=]\r\n[b][color=#F84343]Leade[/color][color=#EEE727]rship C[/color][color=#39E46E]hanges[/color][/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=759904][b][color=white]Vexna[/color][/b][/url] is now a moderator of the Hacking Tools and Programs section.\r\n[url=http://hackforums.net/member.php?action=profile&uid=995878][b][color=white]LemonBro3[/color][/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=393774][b][color=white]Sharkâ„¢[/color][/b][/url] were recently promoted to leader of Techsperts.\r\n\n[b][color=#F84343]Aw[/color][color=#EEE727]ar[/color][color=#39E46E]ds[/color][/b]\r\n[url=http://hackforums.net/member.php?action=profile&uid=80618][b][color=white]nokia2mon2[/color][/b][/url] has received the Qwazz Star award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=80618][b][color=white]nokia2mon2[/color][/b][/url] has received the Militant award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=80618][b][color=white]nokia2mon2[/color][/b][/url] has received the Ninja award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=80618][b][color=white]nokia2mon2[/color][/b][/url] has received the Cuddly and Cute award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=121196][b][color=white]Natha[/color][/b][/url] has received the Cat Lover award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=1159829][b][color=white]Subscription[/color][/b][/url] has received the Master Donator award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=1159829][b][color=white]Subscription[/color][/b][/url] has received the Gamer award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=502172][b][color=#FFD700]TNZagreb[/color][/b][/url] has received the GFX Guru award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=402384][b][color=#0066FF]Riggs[/color][/b][/url] has received the Hustler award.\r\n[url=http://hackforums.net/member.php?action=profile&uid=624699][b][color=#0066FF]à¹–Û£Ûœâ€SheepÄ±Ä±[/color][/b][/url] has received the Master Donator award.\r\n[/spoiler]\r\n\n[hr]\r\n\n[align=center][img]http://i.minus.com/jk6hkaS2osd4z.png[/img][/align]\r\n\n[size=medium][color=#F84343][b]HF[/b][/color][/size] [size=medium][color=#EEE727][b]News[/b][/color][/size] [size=medium][color=#39E46E][b]Team[/b][/color][/size]\r\n[list][*][color=#F84343][b]Publisher & Head Journalist[/b][/color]\r\n[list][*][url=http://goo.gl/4W9dI][color=#EEE727]Sir[/color][/url][/list]\r\n[*][color=#F84343][b]Journalists[/b][/color]\r\n[list][*][url=http://goo.gl/WpABi][color=#EEE727]OnTheFly[/color][/url]\r\n[list][*][color=#39E46E]Headlines[/color][/list][/list]\r\n[list][*][url=http://goo.gl/4W9dI][color=#EEE727]Sir[/color][/url]\r\n[list][*][color=#39E46E]Notable Threads[/color]\r\n[*][color=#39E46E]Opinions[/color]\r\n[*][color=#39E46E]Sir's Second[/color]\r\n[*][color=#39E46E]GFX Gallery[/color]\r\n[*][color=#39E46E]Webshow[/color]\r\n[*][color=#39E46E]Comics[/color][/list][/list]\r\n[list][*][url=http://goo.gl/KNR24][color=#EEE727]Starstruck[/color][/url]\r\n[list][*][color=#39E46E]Gaming News[/color][/list][/list]\r\n[list][*][url=http://goo.gl/4FHct][color=#EEE727]Chocothunda[/color][/url]\r\n[list][*][color=#39E46E]World News[/color][/list][/list]\r\n[list][*][url=http://goo.gl/nO6qc][color=#EEE727]ReactioNz[/color][/url]\r\n[list][*][color=#39E46E]User News[/color][/list][/list]\r\n[list][*][url=http://goo.gl/aLdh6][color=#EEE727]DÃ¸n[/color][/url]\r\n[list][*][color=#39E46E]Tech News[/color][/list][/list]\r\n[list][*][url=http://goo.gl/f1yJs][color=#EEE727]Purple Haze.[/color][/url]\r\n[list][*][color=#39E46E]Music News[/color][/list][/list][/list]\r\n[list][*][color=#F84343][b]Interviewers[/b][/color]\r\n[list][*][url=http://goo.gl/Et7FB][color=#EEE727]Michael Westen[/color][/url]\r\n[*][url=http://goo.gl/89giM][color=#EEE727]Ignite.[/color][/url]\r\n[/list]\r\n[*][color=#F84343][b]Graphical Editor[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/mPAjw][color=#EEE727]Barneyyzâ„¢[/color][/url]\r\n[/list]\r\n[*][color=#F84343][b]Reporter[/b][/color]\r\n[list]\r\n[*][url=http://goo.gl/nO6qc][color=#EEE727]ReactioNz[/color][/url]\r\n[/list]\r\n[/list]",
      "subject": "*"
    }
  ]
}