{
  "posts": [
    {
      "pid": "16875478",
      "uid": "515249",
      "dateline": "1319687293",
      "message": "[align=center][IMG]http://img543.imageshack.us/img543/8540/hfnews.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]64th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://goo.gl/wwafo[/img][/align]\nThis week a new country has been added to the block list. No reason has been given as to why this country has been blocked, but as always, there is a reason. [url=http://hackforums.net/member.php?action=profile&uid=450827][b]The Holy[/b][/url] has posted a thread explaining how he feels about the situation; You can view that thread [url=http://hackforums.net/showthread.php?tid=1860097][b]here[/b][/url].\n\nThere have been multiple threads created regarding new section rules. One has been posted in the [url=http://hackforums.net/forumdisplay.php?fid=136][b]Ebook Bazaar[/b][/url] section explaining that you are [u]NOT[/u] allowed to ask for vouches or review copies. For more information please view the thread [url=http://hackforums.net/showthread.php?tid=1838556][b]here[/b][/url]. Another strict rule has been paced in the [url=http://hackforums.net/forumdisplay.php?fid=47][b]Hacking Tutorials[/b][/url] section. From now on, you can no longer ask, private message or post about eBooks in this section. Ebooks are now strictly forbidden from being in this section, read more about it [url=http://hackforums.net/showthread.php?tid=1852486][b]here[/b][/url].\n\nA new section has been added to the [url=http://hackforums.net/forumdisplay.php?fid=120][b]Monetizing Techniques[/b][/url]; you can view this new section [url=http://hackforums.net/forumdisplay.php?fid=221][b]here[/b][/url]. This particular monetizing section was created specifically for  Free Money Making Ebooks. Read the rules of this section below,\n\n1. No referrals links like Adf.ly or Sharecash.\n2. No marketplace selling.\n3. No asking or hinting for reps even in PM in exchange for free ebooks.\n4. No ebooks involving illegal activity.\n\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b]Positive[/b][/url] has created a thread in [url=http://hackforums.net/forumdisplay.php?fid=134][b]Suggestions and Ideas[/b][/url], stating the previous suggestions others have made and what answer they received when posted. You can view this thread [url=http://hackforums.net/showthread.php?tid=1812957][b]here[/b][/url].\n\nWe have combined the news editions and hope you enjoy.\n\n[align=center][img]http://goo.gl/qBj6w[/img][/align]\n\n\"What do you think about the free groups getting removed?\"\n\n[i]\"I am against this, for the most part. While I agree that money is important, as is balancing the load on the resources, what isn't being taking into account is the payment in improving member quality.\n\nLet me explain. While other groups have donated $2000 for their place, groups such as \nThe Alliance have contributed time and effort into helping and mentoring members; we \nhave had and continue to have a huge effect due to our concerted effort, not only in \nour private sub-forum but also in every appropriate section on this forum. While the group \nitself hasn't had a mass donation, some of the members have done so; plus, by helping \nmembers, more are inclined to stay, potentially becoming donators themselves. In the \nend, it comes down to if $2000 is valued over each groups' previous and continued efforts \nto help the forum.\"[/i]\n[url=http://goo.gl/oDopi][i]-Ethereal[/i][/url]\n\n[align=right][i]\"The free groups removal are probably for the best. Ever since [url=http://hackforums.net/member.php?action=profile&uid=1][color=SkyBlue][b]Omniscient[/b][/color][/url] \nstarted charging for the groups, I knew that more groups would get removed so that \nwhen groups are purchased by users, more space will be available. Their are currently 13 \ngroups, which 4 are paid for. I think the [url=http://hackforums.net/forumdisplay.php?fid=110]HJT Team[/url] should stay because they help users \nfrom keeping there computer clean. [url=http://hackforums.net/showthread.php?tid=1544636]Reviewers[/url] are staying & I think the Red Lions are to. If \nthe leader of the free groups cared about getting removed than they should all put money \naside to re-purchase it. This way they can make their own rules & do not have to follow anyone \nelse. To be honest with everyone, it's going to be hectic when they are removed, a lot of \nflaming will take place along with banning some well respected members. When that day comes, \nwe will see who has kept there quality on the forums & which ones flipped out. Lets just wait \nand see what happens.\"[/i]\n[url=http://goo.gl/3fcaX][i]-Genuine[/i][/url][/align]\n\n[i]\"Hello, I would like to submit my opinion for the next edition: I believe that the free groups of \nHF are a significant part of HF. A lot of these are old groups that people had to try hard to get\n into. I wish they had more credibility because groups like The Wraith, TA, Techsperts, Malvager, \netc. Are/were the OG groups on HF. I'm sad to see a lot of them go. I don't like the ideas of \npaid groups as much. I don't like one person becoming power hungry and turning into a complete \nass hole. You may or may not know to whom I am referring. I understand they paid $2k, but that \ndoesn't mean people should suck their pathetic little dicks to get in. I was in almost all of the free \ngroups at one time, and I've been in a few of the paid. I can honestly say that I've enjoyed the \nfree ones better. When the paid ones came along, dirty deals went on between the free and paid \nones, and I think it made them worse. \"[/i]\n[url=http://goo.gl/WakHU][i]Codad[/i][/url]\n\n[align=right][i]\"I think that some groups should be removed, or at least charged to keep the group. \nSome people paid good money to get a group, and there are people who have been in a group fo\n\nfree, and these groups do not do much towards HF.\nAn example could be the Rats Crew. Granted; they are a good group of knowledgeable members, but \nthey do not give any significant change to HF, as some groups may.\nNothing against the rat's crew; just an example.\"[/i]\n[url=http://goo.gl/S9Xxg][i]-+Pirate[/i][/url][/align]\n\nThe topic for next week is \"What do you think about the Runescape Nuke-Day?\" (Yes I realize it is not an HF-related topic, but it has a lot of interest in some people.)\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[align=center][img]http://goo.gl/JZcco[/img][/align]\nA 7.2 earthquake rocked the eastern Turkey, killing at least 80 people. earthquakes are an all to common thing in Turkey, and you can read up on the history of earthquakes in Turkey [url=http://www.allaboutturkey.com/deprem.htm][color=#FFDAB9]here[/color][/url]. The death toll is estimated to rise easily over 1,000, as rescuers continue to pick people still clinging to life under a mass of rubble. Thousands of Turks fled into the streets, screaming and crying out for fellow friends and relatives. Buildings and offices cracked/collapsed crushing hundreds (est.) This is only but a small hint of what people are going through in eastern Turkey at this moment, although it should be noted that the earthquake has long since passed, and the brave men and women of Turkey have now begun digging with either shovels or their bare hands for loved ones trapped. Over 100 aftershocks have been recorded within 10 hours of the earthquake, one of which with a magnitude of 6.0. The Turkish President Abdullah Gul is requesting assistance from anyone who can help, and their American ally is expected to aid in the rescue effort as well. What will become of this tragedy? Time will only tell. You can read more about the earthquake [url=http://www.huffingtonpost.com/2011/10/23/turkey-72-earthquake_n_1027099.html][color=#FFDAB9]here[/url][/color].\n\n[align=center][IMG]http://goo.gl/RE0uZ[/IMG][/align]\n[align=center][img]http://i.imgur.com/SBmh9.jpg[/img][/align]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n[url=http://www.gamecove.net/][img]http://gamecove.net/images/gamecoveHF.png[/img][/url]\n\n[align=center][URL=http://goo.gl/VX8xv][IMG]http://img710.imageshack.us/img710/580/contactforadvert.png[/IMG][/url][/align]",
      "subject": "[10/26/11] - HF News (Editions Combined)"
    },
    {
      "pid": "16875488",
      "uid": "515249",
      "dateline": "1319687329",
      "message": "[align=center][IMG]http://img713.imageshack.us/img713/5570/hfusernews5oct.png[/IMG][/align]\n\n[align=center][url=http://hackforumsnews.com][img]http://i1142.photobucket.com/albums/n610/HFNewsGFX/HfSite.png[/img][/url][/align]\n\n[align=center][img]http://goo.gl/9wMJo[/img][/align]\n\n[url=http://goo.gl/Lo7WP][color=white][b]Brandenx781[/b][/color][/url] got promoted to undergraduate status in the HJT team. Congratulations to him!\n\n[url=http://goo.gl/5NeIz][color=white][b]Sync™[/b][/color][/url] has regained control of his account. Anyone interested in more information on what happened should look [url=http://goo.gl/ogbfy]here[/url]. His birthday was also on 10/19/11, happy birthday!\n\n[url=http://goo.gl/weM98][color=black][b]Ron Paul 2012[/b][/color][/url] asked for a one year ban, the exact reasoning behind this is unknown, and many are not sure he will ever return. (No this is not the Runescape section mod)\n\n[url=http://goo.gl/XjCF0][color=#FFCC00][b]Krew[/b][/color][/url] has hit his four year anniversary on Hack Forums. Congratulations to him, as not many members have a UID in the thousands and are still around.\n\n[url=http://goo.gl/4o2x9][color=black][b]Wolves[/b][/color][/url] asked for a vacation ban until 10-29-11, hopefully all is well with him. and his vacation goes smoothly.\n\n[align=center][img]http://goo.gl/6bjLl[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Helpful Thread[/b][/i] - [url=http://goo.gl/eg4CN]xerotic's HF Scripts[/url] - [url=http://goo.gl/VIJ7W][color=white][b]xerotic[/b][/color][/url] - A while ago a member coded a plugin for greasemonkey that added new content and abilities for members, it was then left to rot. Lately we have had other members pick the project back up again, yet now we see xerotic coming up with even more ideas. I personally have installed all of his plugins, and I think you should too.\n[i][b]eWhoring Thread[/b][/i] - [url=http://goo.gl/VpEDC][tut] How to ewhore including how to blackmail with pics[/url] - [url=http://goo.gl/r6dVA][color=#0066FF][b]Kamz89[/b][/color][/url] - Anyone who wishes to inquire more about the method of eWhoring should read this tutorial.\n[i][b]Informative Thread[/b][/i] - [url=http://goo.gl/5b9Uy][TUT][HOT]How To Make Your Computer Faster By Disabling Core Parking[/url] - [url=http://goo.gl/dqGhI][color=#0066FF][b]EyeOfTheTiger[/b][/color][/url] - This thread is a great tutorial on how to increase the speed of your computer in only a few minutes.\n\n[color=#FFFFE0][size=large][b]SRPP Thread(s)[/b][/size][/color]\n[i][b]Interesting Debate[/b][/i] - [url=http://goo.gl/QQf9t]Without religion there would be no schools[/url] - [url=http://goo.gl/L5CL5][color=#0066FF][b]Тate[/b][/color][/url] - Quite an interesting perspective is given from the user Tate. I recommend people go and give their thoughts on this too.\n[i][b]Discussion Topic[/b][/i] - [url=http://goo.gl/PhcuO]Ron Paul[/url] - [url=http://goo.gl/qcrXQ][color=white][b]One-Armed-Pirate[/b][/color][/url] - Since the upcoming election is imminent, people are starting to take a stand on who they think should be the republican representative. Ron Paul is one of the known members of the GOP, in this thread you can give your opinion of him.\n\n[color=#FFFFE0][size=large][b]Suggestion Thread(s)[/b][/size][/color]\n[b][i]Interesting Idea[/i][/b] - [url=http://goo.gl/U14q2]HF Products[/url] - [url=http://goo.gl/931RT][color=#0066FF][b]Captain Hood[/b][/color][/url] - This suggestion is quite an interesting idea and it would be a great way to recognize other members, if they ever left their basement.\n\n[color=#FFFFE0][size=large][b]Sales Thread(s)[/b][/size][/color]\n[i][size=xx-small]If you think your thread is worthy of being in the Sales  Thread area, send me a [url=http://goo.gl/dx0Sd][b]message[/b][/url][/size][/i]\n[i][b]Successful Thread[/b][/i] - [url=http://goo.gl/LIw7e]★ ★ RebelSecurity Booter | Spoofed | Stable | Unlimited Attacks | 60 Min. Attacks ★ ★[/url]  - [url=http://goo.gl/BfIZq][color=#0066FF][b]Fanatic[/b][/color][/url] - This booter has received a good amount of publicity and seems to have quite a large amount of positive feedback. If you are in need of a booter, check this one out and see if it is right for you.\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Deities[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hello Deities and thank you for accepting this interview. Are there any shout outs you'd like to give?\n[b][color=white]Deities[/color]:[/b] I want to shout out to my mom and all the little people that got me here. I know that no one really knows you guys, but you are there in my heart! As for real shouts, big hands up for The Alliance and big personal shout for my MSN group buddies. They know who they are. ^.^\n\n[b][color=#0066FF]Reported[/color]:[/b] How old are you.\n[b][color=white]Deities[/color]:[/b] I'm sixteen to everyone online. ^.^\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you currently have a girlfriend/boyfriend, fiance, or are you married.\n[b][color=white]Deities[/color]:[/b] Can I have an \"Its complicated\" option? ^.^ I am currently not seeing anyone but I have been working over a girl that has (Had) a boyfriend. So a friend with benefits for when they were together but now that they have broken up we are just like non status lovers.\n\n[b][color=#0066FF]Reported[/color]:[/b] What's your sex life like and what's your favorite sex position?\n[b][color=white]Deities[/color]:[/b] I'm pushy with anything I do so it goes from like a cute couple or cute date to wild teasing and having fun. I don't play favorites though so I love all of them (Other then some weird stuff where my parts have carpet burn or something.)\n\n[b][color=#0066FF]Reported[/color]:[/b] Are there any specific members on HF you truly dislike?\n[b][color=white]Deities[/color]:[/b] iBruteforce just because we have a common \"dislike\" for each other.\n\n[b][color=#0066FF]Reported[/color]:[/b] What type of members do you hate.\n[b][color=white]Deities[/color]:[/b] The one who is ignorant but tries to pull it off like he knows the world. Such as giving false advice or teaching others what they yet have to learn themselves.\n\n[b][color=#0066FF]Reported[/color]:[/b] What kind of games do you play, or do you not play games?\n[b][color=white]Deities[/color]:[/b] I love TPS or FPS and or RPG games. However when its an RPG I play the new age ones. Example would be Tera that has yet to come out in NA.\n\n[b][color=#0066FF]Reported[/color]:[/b] What's your opinion on try hards?\n[b][color=white]Deities[/color]:[/b] Try harder. Not at the work, but at looking normal. All of the top people are try hards. It's called work for a reason. ^.^ However those that are naturally successful at it make it look natural, easy, and their personality. You might have to work to raise your status, but you don't need to be a robot while doing it.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you come by hackforums and what made you stay active?\n[b][color=white]Deities[/color]:[/b] Boring answer? Batch. Stayed active just because I had nothing better to do. What I did with my activity however was learn and then took it upon myself to teach and help others. I actually did learn a lot from HF such as coding, graphics, information, and stuff I can use in the real world.\n\n[b][color=#0066FF]Reported[/color]:[/b] Will any big updates be happening to the alliance, other than the recruitment?\n[b][color=white]Deities[/color]:[/b] Yes and no. Changes to the system may be on their way and how members handle themselves if they are apart of The Alliance might also be altered. However, I would say that the early recruitment that has ended on the 21st was the biggest news for now.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you like that the alliance is so strict and exclusive?\n[b][color=white]Deities[/color]:[/b] I honestly say that while we are strict, there is a lot of lean-way for stuff. We aren't robots or machines, we are all members that just like to have fun. However the system in place of helping HF I would say is perfectly fine the way it is. Only the best make it in The Alliance and we continue to teach and help our members; this allows them to help other members of HF and set standards that we aim to maintain and raise for others.\n\n[b][color=#0066FF]Reported[/color]:[/b] Have you ever made a big mistake with alliance that you thought would have been catastrophic or was damaging to the group?\n[b][color=white]Deities[/color]:[/b] No. Being a leader means you are never wrong. To rephrase this, while you can be wrong and some mistakes could have happened, there is no way to turn it back and redo it. Thus any action I or other leaders have taken is supported by the group and if anything is wrong, we aim to fix it and not complain over it.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you come up with your username ( Deities ), are you into philosophy or religions?\n[b][color=white]Deities[/color]:[/b] While I have a lot of username changes, my main username has always been Deities. I came up with it because I love mythology however when searching names to use for an IGN (In Game Name) on some online game, I thought it would be better to use the general description of all of them. Such as people put \"God\" as their username; I however took the Greek word for Gods and used that, to state in a way all of the mythological names that I love to read about.\n\n[b][color=#0066FF]Reported[/color]:[/b] Are there any down sides from being a leader of the alliance?\n[b][color=white]Deities[/color]:[/b] HF Work puts work outside HF on a time frame. I sometimes find myself without enough time in the day to get things done.\n\n[b][color=#0066FF]Reported[/color]:[/b] Did you ever second guess your group?\n[b][color=white]Deities[/color]:[/b] Never.\n\n[b][color=#0066FF]Reported[/color]:[/b] Did you have any other ideas for the alliance, and if you did what were they?\n[b][color=white]Deities[/color]:[/b] The idea has always been the same and anything new that The Alliance brings will be amazing or inventive. So as for new ideas, wait and find out. ^.^\n\n[b][color=#0066FF]Reported[/color]:[/b] What are your opinions on your groups low member rating?\n[b][color=white]Deities[/color]:[/b] Confusing question. What others think of our members or how they rate out members? I would say that it doesn't matter who you are as long as you are able to help. We house members that are very well known on HF all the way down to new members that haven't even been here for 3 months. It's all about you as a person and what you can bring to HF and The Alliance. As for if you mean \"rating\" by numbers. I understand The Alliance member count is very low. We have around 25 members now and those members are responsible to hold up our system of helping the forum. Being in the elite group is always a smaller % (Rich being smaller % compared to the commoner which is always the majority %). This does mean that our members tend to do more work. (Gawh, long ass answer but the question was confusing). Bottom line? I <3 The Alliance members.\n\n[b][color=#0066FF]Reported[/color]:[/b] Now to wrap this interview up... is there anything you'd like to say before this interview ends?\n[b][color=white]Deities[/color]:[/b] Xerotic sucks at transformice bootcamp. I can prove this with pictures. ^.^\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Reported[/font][/size][/color][spoiler=]\n[b][color=#0066ff]Michael Westen[/color][/b]: Hello Reported, thanks for taking the time to do this interview! Before we begin, are there any special members you'd like to give a shoutout too?\n[b][color=#0066ff]Reported[/color][/b]: Yes, I'd like to give a big shout out to... bugga, McFlurry, Astonish is NJ, Diabolic, Cobalt+, Sir, ~Tom~, EarthShaker, TheHackersLove, Reverence Members, Writers Members, and all of my haters.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: That's quite the list! So, how did you find Hack Forums?\n[b][color=#0066ff]Reported[/color][/b]: I was told about hackforums by a guy I knew that could host boot. I was a bit hesitant on joining at first, but I eventually joined. After I joined I gained knowledge, bought a host booter, and host booted the guy that introduced this website to me. ( We became enemies )\n\n[b][color=#0066ff]Michael Westen[/color][/b]: Ouch, quite ironic that your first slave was also your mentor in a sense. Why were you accepted into Reverence?\n[b][color=#0066ff]Reported[/color][/b]: I'm not 100% sure, but my guess is my skills and I was vouched for by Diabolic if I'm not mistaken.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: You have made tons of contributions since you've joined Reverence, so kudos to you. What's the responsibility like, being the leader of the Writers interviewers?\n[b][color=#0066ff]Reported[/color][/b]: It's pretty demanding, but I love work and I handle it. I basically review applications, help leaders, do interviews, spell check interviews, vouch for a possible future HF News team member, etc.\n\n[b][color=#0066ff]Michael Westen[/color][/b]:I see, that must be difficult to balance such a workload on top of other things. I've been meaning to ask, why exactly is your name \"Reported?\"\n[b][color=#0066ff]Reported[/color][/b]: My first username was ReportedFall and I got that username from hacking one of my old fan boys xbox live account. So I social engineered his account and used it as a primary account. So I went on using that username for my modded lobbies, usernames, alias, etc. Eventually I got tired of it, because ReportedFall makes no sense and I reported a lot of people. So I just removed the 'Fall' part.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: What motivated you to write your thread entitled \"Report Reported: System Explained | Detailed?\"\n[b][color=#0066ff]Reported[/color][/b]: My username and all of the false reports I see get submitted. So I made that thread hoping it would help members and give them more in-depth instructions.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: It definitely will help many members, old and new. I noticed your 1 year anniversary is coming up in exactly 1 month, how has Hack Forums changed and grown in your opinion?\n[b][color=#0066ff]Reported[/color][/b]: It's grown more strict and the member quality has lowered quite a bit, but over all it's still just as helpful, addictive, and informative. There are just those certain members you need to stay away from and if anyone wants to know who they are please visit bugga's thread [url=http://hackforums.net/showthread.php?tid=1829232]here[/url].\n\n[b][color=#0066ff]Michael Westen[/color][/b]: I see you advertise yourself as a malware helper in your signature. Why aren't you on the HijackThis team?\n[b][color=#0066ff]Reported[/color][/b]: I'm not in the HijackThis team, because I've never donated and I'm not as experienced and skilled to be invited. IMHO.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: That's a shame - I think you would make a great addition to the HJT team. Would you consider this to be the only forum you're truly dedicated too?\n[b][color=#0066ff]Reported[/color][/b]: Currently yes, but in the past I was apart of a few growing websites. I drifted away from them though.\n\n[b][color=#0066ff]Michael Westen[/color][/b]: What is your favorite section of HF?\n[b][color=#0066ff]Reported[/color][/b]: The Lounge, SRPP, Reverence Forum, and the Computing Section.\n\n[b][color=#0066ff]Michael Westen[/color][/b]:I also find myself in the Lounge and Reverence Forum a lot.To wrap things up, do you have anything else you'd like to say?\n[b][color=#0066ff]Reported[/color][/b]: Thank you for this interview and the following goes out to all of the HF members with haters...\n\n\"Not everyone is going to like you, so don't take it personal if you have a hater. If you do have a hater you shouldn't take it personal, you should take it as a joke. They're raging through a computer screen, so they're the stupid ones. Although, you gotta love your haters! ;)\"\n[/spoiler]\n\n[align=center][img]http://goo.gl/zEtV9[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.\nI realize I missed some things, they will be added in the next edition.[/i]\n[video=youtube]http://www.youtube.com/watch?v=X_c6OILA-Jc[/video][/align]\n\n[spoiler=[i]Written topics[/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ Tank_\n--Leadership\n---Positive (http://goo.gl/udVvb) - Techsperts - Leader\n--Awards\n---DragScope (http://goo.gl/1HXaC) - Businessman - I'd call you a businessman.\n--Misc.\n---\n--Questions\n---\n[/spoiler]",
      "subject": "*"
    }
  ]
}