{
  "posts": [
    {
      "pid": "24705554",
      "uid": "515249",
      "dateline": "1342917908",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#9f2dc5][b]101st full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Official Hack Forums Skype Support[/b][/color]\nOmniscient recently created a Skype account dedicated towards HF support. He stresses that it should be used for only important issues such as \"stickies, upgrade problems, or donations.\" Many of you may know about Omniscient's recent injury, which he informed to the community that because of it, typing causes a slight pain in his knuckle. When using his Skype account, Omniscient will often be using voice chat to communicate to reduce typing. Read more here: http://goo.gl/MjqaJ\n\n[color=white][b]Downtime[/b][/color]\nIn the past week, Hack Forums has continued to go offline every few days for several minutes at a time. Recently, Omniscient has announced on both Hack Forums and his Twitter account that it has mostly been down due to maintenance involving SQL. Although this may be bothersome to some, it will hopefully improve Hack Forums' functionality, speed, and efficiency in the long run. Read more here: http://goo.gl/O7Ldw\n\n[color=white][b]Rhythm and GFX Masters Recruiting[/b][/color]\nMusic enthusiasts group Rhythm and graphic designers group Graphic Masters began recruiting this week. Both groups are looking for those who stand out or have a particular talent in the subjects the groups are tied to. You can read more about Rythym's recruitment here: http://goo.gl/QL2BP and about Graphic Masters' here: http://goo.gl/0RiZj\n\n[color=white][b]Omniscient's Injury Update[/b][/color]\nOmniscient recently released [url=http://www.youtube.com/watch?v=a2A0QGIeGXY]a video[/url] on his official YouTube channel showing his cast. He also posted another picture of his X-Ray, which you can see here: http://goo.gl/7Bq3d\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=657392][b]Astonish[/b][/url] was demoted from Mentor's and kicked from the HJT team. We have yet to receive the reason why.\n[url=http://hackforums.net/member.php?action=profile&uid=946680][b]Ignite.[/b][/url] is celebrating his birthday this week. Happy Birthday.\n[url=http://hackforums.net/member.php?action=profile&uid=361543][color=#0066FF][b]Scooter[/b][/color][/url] will be leaving Hack Forums. Read his farewell thread [url=http://hackforums.net/showthread.php?tid=2694076]here[/url].\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1222901][color=black][b]The Master™[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1135141][color=black][b]єиιgмα[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1220739][color=black][b]deadlyicedragon[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1302707][color=black][b]SuperToad[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=682899][color=black][b]Bassline[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=496237][color=black][b]Armin Van Buuren[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=128873][color=black][b]T3h Hack3r[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1222901][color=black][b]The Master™[/b][/color][/url] was banned for trying to sell his account.\n[*][url=http://hackforums.net/member.php?action=profile&uid=661940][b]bugga[/b][/url] was temporally vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=331245][color=black][b]Spuderman[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1135141][color=black][b]єиιgмα[/b][/color][/url] was banned for multiple accounts.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1220739][color=black][b]deadlyicedragon[/b][/color][/url] was banned for reputation abuse.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1302707][color=black][b]SuperToad[/b][/color][/url] was banned for multiple accounts.\n[*][url=http://hackforums.net/member.php?action=profile&uid=682899][color=black][b]Bassline[/b][/color][/url] was banned fro selling his account.\n[*][url=http://hackforums.net/member.php?action=profile&uid=54244][color=black][b]Condoms[/b][/color][/url] took a vacation.\n[*][url=http://hackforums.net/member.php?action=profile&uid=255400][color=black][b]Tupac™[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=785374][color=black][b]lоѕτ[/b][/color][/url] was vacation banned.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2692989][b]Why does god allow gays to be born?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1062927][color=#FFD700][b]๖ۣۜMind ๖ۣۜControl™[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2696396][b]Pornography, do you agree with it or not?[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=114319][b]Mr. Anderson[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2684251][b]I am disgusted at humanity[/b][/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=1382658][b]teh Oracle[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2696766][b]I Found the Secret to the Universe... // I Saw it All. - VERY Interesting[/b][/url] \n\n[url=http://hackforums.net/member.php?action=profile&uid=491112][color=#0066FF][b]KILLM3[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2688327][b]CodeGenetix - Universal Keygen [FREE!][/b][/url]\n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=195796]phybeя[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome, phybeя, to the 100th edition of the HF News! Before we get right into it, are there any shout-outs you'd like to give?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: I would like to give personal shout-outs, but there are far too many members, and I don't want to miss anyone by accident or make them feel bad; so, shout-out to everyone!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure a shout-out to everyone will put a smile on many people's faces. So, I'm sure you are aware of our celebrations this week. It is the 100th edition of the HF News, and couldn't have been formed into what it is today without the help of many members around the forum. I'd like to give a personal shoutout to every member who has ever helped out with the HF News, to [url=http://hackforums.net/member.php?action=profile&uid=74244]Yin[/url], the founder, and to [url=http://hackforums.net/member.php?action=profile&uid=515249]Sir[/url], the current publisher. What is the HF News in your perspective, what does it do for HF, and how could it improve?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: The HF news to me, is the gateway to our forum's updates; whether it is through the information of new changes, big or small, or through the weekly bans/rep-fucks. It's a great composition of work that is there to provide an entertaining way of informing the community. Not only does it provide HF related news but it also dips into real-world news, which is always neat, since I learn a thing or two that I would have heard about otherwise. In my honest opinion, I personally don't think anything needs improvement.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Couldn't have explained it better myself. As a member who runs a relatively successful security service (see [url=http://hackforums.net/showthread.php?tid=2404898]here[/url]), and also a dedicated white-hat, I'm more than positive that you are aware of the dangers which internet browsing entails nowadays. What security measures do you take while browsing, how serious/common do you consider cyber crimes in todays society, and what can people do to protect themselves?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: Believe it or not, I personally don't take any 'heavy' security measures while on the internet. Of course, I am still cautious of what I download/run, but other than that, in terms of privacy and personal information, having my information public does not necessarily frighten me. Although I know that some people do take privacy seriously, so we all have our own opinions. Cyber crimes happen on a daily basis, whether you want them to or not, and the only solution I see for people to protect themselves against it is [b]being aware[/b]. Being aware doesn't just mean reading some article on the latest malware, but instead always make sure you know what you are diving into before you even begin thinking about taking any course of action. A lot of the time, I see new members here on HF introduced having already comitted some sort of 'computer crime', and they start to worry about the consequences. That right there, is a prime example why you [b]shouldn't[/b] venture into something without weighing out the consequences, or even knowing enough about the results.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, I suppose that's a good way to put it. As they say, prevention is the best cure. You've been a member on HF for well over 2 years, and have since formed to be one of the more respectable members on HF. What originally brought you to HF, what were your intentions, and did you ever think you would come to be where you are today?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: I actually wrote a feedback thread not too long ago which sums up my whole HF journey, which you can read [b][i][url=http://hackforums.net/showthread.php?tid=2645228]here[/url][/i][/b]. To sum it up though, I was always interested in computer gaming, and from that, I became interested in cheats, mods and 'hacks', which later led me to stumble upon the great HackForums community. My intentions were simply to learn at the time, since the only real 'hacking tools' I was aware of, were keyloggers. I didn't necessarily think that I would be in the position I am today, but then again, who can answer that unless they can see the future? :p \nBut in all serious, there are way too many things that have happened to me being on HF that in no way I could forsee.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Sounds interesting. Definitely different, compared to the classic 'FaceBook hack' introductions that we all too commonly see. While we are on the topic of classics, where do you see yourself in the next few years? Do you think you will still be on HF, and do you currently have any future plans IRL?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: Hopefully in a few years, I will either continue pursuing my goals as a security researcher, whether it's working for a company or as a freelancer, since computer security has always been one of my main interests. Although, to answer the question early, I am currently still working on my main business(PhyberPay LLC) which depending on how things go in the next couple of months, could determine my future endeavours as well. PhyberPer LLC is currently under reformation, to make it even better (see [url=http://hackforums.net/showthread.php?tid=2528451]here[/url] for more info). I think I will still be on HF, although I may not be as active.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, good luck with whatever your future throws your way. Success has been a very controversial topic recently. One could blatantly say that it is how much money you earn, although that's a very one-sided way to perceive it. What, in your opinion, defines success?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: Happiness. Of course, there will always be people who say \"money defines success\", but there are also prime examples of people with stacks of money who aren't even [i]truly[/i] happy. Success shouldn't even be judged or determined by someone else, but rather yourself. I believe that happiness and success are directly correlated. There is always one story that is the backbone of a topic like this for me, and if any of you know, it is about a man by the name of [url=http://en.wikipedia.org/wiki/Christopher_McCandless]Christopher McCandless[/url]. I'm not going to go into story time here, but Chris spent his whole life living by his parent's will, and their pressure for him to \"succeed\". He was a bright kid, and was planning on going to Harvard law, but as soon as he graduated from college, he donated his life's savings ($24,000) to charity, and hitchhiked across the west, where he eventually reached his great climatic journey, which was Alaska, where he lived in the wild, which was his true aspiration. He was free of all the pressures of society, and lived in pure bliss. In his eyes, that was 'success', since he achieved his life's goals. In anyone else's eyes, they would call him idiotic for donating all of his money, but the point was, he didn't need money and all the excess things we take for granted, to stay happy. It is all based on a true story called '[url=http://en.wikipedia.org/wiki/Into_the_Wild_(film)]Into the Wild[/url]', which is in the form of both novel and film, and I would strongly recommend it to everyone!\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's a great definition, and a very heart-warming story. I'd also like to ask you about your views on stereotypes and generalisations. They are there for a reason, most obviously, but how do you think they should be used, and used appropriately? Also, what are some stereotypes on HF that you've noticed, and how are they executed?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: I'll start off with another quote, \"When you judge someone, you don't define them, you define yourself\". It's human nature to judge, sure, although no one should use that as an excuse; whether it's on the internet, or in real life. On the internet, whether it's places like Facebook or HF, you see people talking down to other people they don't even know. The most common type(s) of harassment are in the form of stereotypes. I constantly see on HF people who assume that everyone here has 'no life', or is a complete 'nerd'. Who cares who or what any given person is or does? Not everyone who uses the computer is automatically a nerd. Hearing that stereotype is disappointing, and it just goes to show how ignorant some people can be. Not only that, but people also seem to disregard the fact that there are a wide range of different aged members here, and you often hear people tossing around the term 'kid', or something similar, which is used by the 'kid' to refer to an older member, which is just plain silly. :P\nAnother common stereotype I see on HF, is people who assume that Ub3rs and L33ts are better than normal members, which is completely incorrect in many circumstances. I've seen and talked with many normal members who are not only more intelligent and mature than most upgraded members. The fact that they don't have different colored usernames, or a special userbar, shouldn't determine their social hierarchy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I completely agree. Stereotypes are used all too commonly for harrasment, all over the world. On HF, age stereotypes, and stereotypes referring to members as 'no lifes', or 'nerds', are becoming typical in a day. I also agree with the Ub3r/L33t statement. I know various normal members who I respect more than almost every upgraded member. How do you think groups benefit members on HF, and how have they affected you?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: Ah... the long awaited discussion on groups :P. Well, from being a member of various groups during my time on HF, I've almost seen it all. From groups being the most 'respected', to being the most inactive. I still think that the concepts of groups are great since it's a way to interact with members who share similar interests in a subforum of your own, although I feel like the number of groups should have been cut down a long time ago. I often notice that new groups and their purposes are too similar to other groups, which always creates conflicts, whether it is deciding what type of activity system they will have, or how they will contribute to HF. Although, I can also say that there is only so much diversity that new groups can have. Of course, every group strives to be respected, and I understand that, but it's all getting too cliche. \nGroups have enabled me to share my knowledge with fellow members in a fun enviroment, but they've also been structured in a way where helping almost becomes a chore. I personally love helping members, whether I'm in a group or not, but being in a group where you have to log all your 'helpful' posts, and activities of the sort, almost takes away from the true qualities of most of the members. Not only have the groups affected my opinions of HF, but seeing the organization tactics, and how everything and everyone is coordinated, also helps to form valuable real-world skills.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: That's definitely a unique and insightful way to look at things. I agree with the fact that they bring a lot of diversity and discussion to the table, although I also agree with the fact that some groups are becoming too cliche, and are losing sight of the original purpose. I'd like to thank you for joining us on such a special edition. Any final thoughts/comments before I let you get back to work?\n[url=http://hackforums.net/member.php?action=profile&uid=195796][color=white][b]phybeя[/b][/color][/url]: I'd just like to thank you for giving me the opportunity to be interviewed, the HF News team for collaborating and putting everything together, and I'd like to thank [url=http://hackforums.net/member.php?action=profile&uid=1]Omniscient[/url], the [url=http://hackforums.net/showstaff.php]staff members[/url], [url=http://hackforums.net/showmods.php]moderators[/url], mentors, and all the HF community for their hard work and dedication to making HackForums the great community that it is today.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview -  [url=http://hackforums.net/member.php?action=profile&uid=1172544]Cody[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Hello and welcome to the 101th edition of the HF News, Cody. Are there any shout outs you would like to give before we start?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: Yes, I'd like to give a shoutout to Daisy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: I am sure she will appreciate it. It seems you are becoming more known by the day, your post count, rep, and awards all growing. What do you do this all for? Is it a hobby, something fun to do, or a buisness type thing?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: Honestly, hackforums is something that I enjoy. People will call me a moron for donating so much, or spending so much, but that's really up to me when it comes to how I wish to spend my money. I've made a decent amount from Hackforums, and I've decided to give back. I personally post around 150-200 times a day as it's something I enjoy.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Who can blame you for doing something you like to do? I don't think anyone should, it is your choice alone. So besides donating to HF directly, you also do many giveaways and contests. Do you ever get PMs thanking you? How does it make you feel, and are there any specific examples?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: Well, on my select email giveaway thread, I often have people reply back thanking me. These emails are useless to me, and clearly they're useful to the user. I enjoy giving people things for free. I've had a decent amount of people PM me and thank me. I appreciate their kind words. I'm unable to think of a specific example though.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: It's fine. So along with your general generosity, you are also apart of many groups. How do you manage to stay active, and if you can decide, which group is your favorite? What do you think of The Coders accepting everyone into the group?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: The current activity requirements in the groups that I am in aren't too bad at all, especially when you see a topic that interests you. Rhythm is for sure my favorite group. I paid $15 to get into techsperts because I wished to learn new things, though, I believe the change was a perfect idea. I love rhythm, I've got over 2,000 posts in that sub forum. I personally believe Hex and Lust are being generous, exactly what castle bravo did - give all users a chance to be in a group (even if it is a short amount of time)\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well your take on The Coders is a bit different than a lot of people, which shows that you aren't pessimistic. Do you have any future aspirations for HF? Where do you see yourself in a year's time? Along with that, what are some of your in real life hobbies?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: Honestly, I'd like to own a group. It' something that Daisy and I have been considering. I've been approved to purchase one, though, we're just not positive yet.  We feel as though Hackforums has a decent amount of groups, and we can't seem to come up with a reasonable motive behind starting up a group. I honestly just see myself doing what I'm doing now, having fun on HF. Some things I like to take part in are playing CoD with friends, chasing my dog (little storm trooper takes everything and runs with it) and working.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Seems like a reasonable aspiration, though I do agree with you. It seems all groups are trying to become official. Also a bit out of curiosity, it seems you do report a lot of info to the News team, are you surprised to be interviewed? How does it feel? Would you ever consider joining the News team if you were offered?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: Yes, I often report events to the news team via the news report section. I enjoy reporting the events, and honestly, yes. I was surprised when you PMed me, didn't expect it at all. It feels nice though - especially some of the things you've said, about my generosity, etc. I'd for sure consider joining the news team, it would all just depend on what I would be writing. I've always loved to write.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well if you do apply, I wish you the best of luck. With that, though we are coming to an end of this interview. Do you any final questions comments or concerns?\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][b]Cody[/b][/url]: Yes. I'd like to thank you for allowing me to be interviewed, and I'd like to mention how enjoyable hackforums can be when you use it to the best of your ability.\n\n[url=http://hackforums.net/member.php?action=profile&uid=580684][color=#0066FF][b]RDCA[/b][/color][/url]: Well thanks for being my interviewee, and this brings us to an end of our interview.\n[/spoiler]",
      "subject": "[7/21/12] - HF News"
    },
    {
      "pid": "24705929",
      "uid": "515249",
      "dateline": "1342918656",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[align=center][img]http://i.imgur.com/sJaEA.png[/img]\n[video=youtube]http://www.youtube.com/watch?v=3E-1UMsb7wM[/video]\n[video=youtube]http://www.youtube.com/watch?v=LcdGH4jB3xs[/video][/align]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[Color=White][b]The Dark Knight Rises movie shooting:[/color][/b]\nThis week at a midnight showing of The Dark Knight Rises in Aurora, Colorado, a man, in black body armor shot at least 12 people dead and at least 58 more people were injured, in theater 9 of the cinema 16 move theater in Aurora. The suspect claimed he was \"The Joker\" and started firing at everyone in the movie theater. The suspect, James Holmes was arrested in the back of the Century 16 theater only a few minutes after the shooting. He told police that he had also rigged his apartment to explode. The police found items that could be used to make an explosive and will have a bomb squad team come in as soon as today.\n\n[Color=White][b]40 hours straight of video games:[/color][/b]\nThis week, a 18-year-old boy was found dead after playing the video game Diablo III for 40 hours straight. He was found passed out by the workers of the Internet cafe at which he was playing the game. The workers also believe that the boy did not eat during those 2 days. The police ordered a autopsy on the boy and they believe that sitting in a strained position caused him some cardiovascular problems.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Amazon[/b][/color]\nManagers of Amazon has announced that they've cut an exclusive deal for TV shows such as \"Fringe\" and \"West Wing.\" Amazon's licensing agreement with Warner Bros. also includes some shows like \"Dark Blue, \"Alcatraz,\" and \"The Whole Truth.\" Even though these types of licensing deals have covered longer terms, [url=http://hackforums.net/member.php?action=profile&uid=903914]Prince™[/url]'s film-industry sources say it's not unprecedented. Those sources also say that this is where the subscription video-on-demand business is headed.\n\n[color=white][b]Apple[/b][/color]\nLast week, the exploit that we saw which allowed users to purchase digital goods inside apps without paying has just jumped platforms and now works on Apple's Mac platform. Alexei Borodin, who created the iOS in-app purchase exploit, now has found a similar solution for apps purchased in Apple's Mac App Store. Like the exploit for iOS, this too requires that users install special security certificates on their machines, though it also requires the installation of an extra helper program.\n\n[color=white][b]Facebook[/b][/color]\nFacebook has acquired a Vancouver-based developer of Mac and iOS apps, Acrylic Software. The small firm is known for a personalized newspaper known as \"RSS app Pulp\" and the secure database app Wallet (for securely storing passwords, credit-card numbers, etc.). Without acquiring, Facebook has decided to cease the development of the two apps, which means that the apps will continue to be available for download and purchase, but will no longer be updated.\n\n[color=white][b]Samsung[/b][/color]\nDDaily's (Koren language news site) report says that Samsung will beging produing flexible AMOLED displays this quarter. They're said to be around a third of the thickness of the Samsung's current display panels. It's expected to be around just 0.6 millimeters compared to 1.8 millimeters. A device with an ultra-thin flexible AMOLED display is to be released by the end of this year.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[color=white][b]50 Cent Supports Frank Ocean, Gay Marriage[/b][/color]\n50 Cent stated that he fully supports Frank Ocean's choice to reveal a past love affair with a man and made a strong comment towards those who might be prejudiced against Frank Ocean. \"Anyone that has an issue with Frank Ocean is an idiot,\" 50 Cent said. \"I think Frank Ocean is a talented artist, I think he's created material that made me know his name, that impressed me, with things he said on a song like 'Novacane.' I could care less about what his personal preference is in his bedroom.\n\n[color=white][b]Music Video of The Week:[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=QJO3ROT-A4E&feature=g-music[/video]\n[/spoiler]\n\n[color=white][b]Member Submitted Videos: (Kid Cudi Theme)[/b][/color]\n[spoiler]\n[video=youtube]http://www.youtube.com/watch?v=MfNjBS1n0cY[/video]\n[video=youtube]http://www.youtube.com/watch?v=7xzU9Qqdqww[/video]\n[video=youtube]http://www.youtube.com/watch?v=VrDfSZ_6f4U[/video]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nI wish there were more humanitarians in this world. Although there are those who spend money on charity and help people through fiscal use, I wouldn't count them as humanitarians. The reason I don't count them as humanitarians is because they don't show true affection. All of their help to humankind can be counted on paper, they don't truly sympathize and live with the people in pain or trouble. Those who travel to other countries and help civilizations learn new things, or gather books through a non-profit to expand the library of a small African village, are the ones I really admire. They aren't devoting pocket change to their cause, they're devoting their lives.",
      "subject": "*"
    },
    {
      "pid": "24706030",
      "uid": "515249",
      "dateline": "1342918859",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"Where do you see yourself in five years? Expand?\" \n\n[i]\"Well in 5 more years I will be 19 as I'm 14 right now. I have 2 opinions on this, where \nI want to be and where I think ill be. Lets start with where I want to be. I want to be \ngraduated high school with 70%+ in each class. I see myself as played basket ball all through \nthe school years both on junior and senior teams. I want to have a nice car, good friends who \nI can count on and a good computer life making money and having fun. Where I think Ill be is \ngraduated high school with at least a 60%+ in each class. I will more than likely played on my \nschool basketball teams but maybe not senior. Ill have a decent car as my parents got my sister \na car when she turned 18 and it was decent and they would do the same for me. Hopefully \nIll have a girl and some friends to hang with.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=874827][i]-EpicXXCrushor1[/i][/url]\n\n[align=right][i]\"In the next five years I would like to see myself in the Australian Defence Force \nas a member of the network security staff. I believe that this goal is very achievable as here at \nHF there are so many great HQ members willing to teach you everything you need to know about \nsecurity. The idea of being a Grey Hat in the Defence Force seems pretty good to me. Get paid to \nsecure systems, get paid to hack into enemy systems. If I achieve this, I would owe my career to HF.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1342661][i]-Actually Is Dolan[/i][/url][/align]\n\n[i]\"In 5 Years I will be 18 years old, and I hope to still be a member of the HackForums community. \nBy then I hope that I have learned to code well and that I will be able to do more giveaways for \nHackForums, because at 13 I don't come by a lot of money, and by then I will have a job. I hope to \nmaybe be a mentor, I'm not sure about it though because there are so many people who deserve it \nmore than me. The fact that I am 13 also doesn't help, because a lot of people underestimate me and \nas soon as they hear how old I am and refuse to do anything with me. I hope to prove that age doesn't \nmean that you can't be trusted about anything.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=848947][i]-KillzyazMadness[/i][/url]\n\n[align=right][i]\"I see myself being one of HF's biggest business men, and helping HF evolve to something \ngreater than what it is today. I would not only be a business man on here, but I will have my own registered \ncompany, or at least be working with one. One day, all the people here will be using my booter, as an example. \nI also plan to cut all kiddy problems I have with everyone.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=847197][i]-Control Panel[/i][/url][/align]\n\n[i]\"In five years I see myself as being either a freshman or a sophomore in college, studying engineering. I \nplan to still play sports during my endeavor and as always I will still browse this lovely forum. By that time \nI will have been on this forum for 6 years, so I will look down on the \"New Phags\" like the \"Old Phags\" look \nupon us at this particular time. I will frown upon the kids who think it's cool to flame and troll, and laugh \nwhen I see they have been banned. I will try to stay HQ, and I will strive to help others. I will also see many \nfriends and enemies leave, but I will meet others as time goes on. If I do say so myself, it seems like I have a \nfun journey confronting me as time progresses, and I will have to enjoy what I can and ignore the madness of \nthis cruel world...\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1070150][i]-tdog0403[/i][/url]\n\n[align=right][i]\"Well in 5 years from now i see myself as a awesome programmer. I'm really looking into it \nprogramming/coding and studying it. I think i would most likely go to college and get a better education. \nI'm really learning fast also if HackForums is still up i will be much active as i am now and probably be a \nrespected member when the community gets to know me.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=1335748][i]-Contentment[/i][/url][/align]\n\nThe topic for next week is \"What do you think is the world's biggest problem? Why?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/jboiZ0PHtCeibV.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/jbpBT14MyiMuwl.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/jbuS4R42VeZIY0.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jboTqTPiJCRRa2.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=iIdvYtgHAwE[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[color=white][b]Awards[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=1172544][color=#0066FF][b]Cody‍[/b][/color][/url] got the Gamer award.\n[url=http://hackforums.net/member.php?action=profile&uid=619030][b]iNviZ[/b][/url] got the Drunk award after drinking whiskey with [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1007343][b]BELLAGIO[/b][/url] got the Drunk award. We don't know why.\n[url=http://hackforums.net/member.php?action=profile&uid=454666][b]adampelletgun[/b][/url] got the Master Donator award. Thanks.\n\n[color=white][b]Group Leadership changes[/b][/color]\nNone.\n[/spoiler]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=816875]Boxxy[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://goo.gl/Y2HFq]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/gul1T]TheVortex[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/BTW8B]ρяιη¢є[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/CNcVT]Bay[/url]\n[list][*]Music News[/list][/list]\n[list][*][url=http://goo.gl/7PvOu]AvidWB[/url]\n[list][*]Webshow[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://goo.gl/nN5aK]RDCA[/url]\n[*][url=http://goo.gl/eswtU]SoulZeh[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/iIaDf]PyroStorm[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}