{
    "posts": [
        {
            "pid": "16670032",
            "uid": "515249",
            "dateline": "1319079017",
            "message": "[align=center][IMG]http://img713.imageshack.us/img713/5570/hfusernews5oct.png[/IMG][/align]\n\n[align=center][url=http://hackforumsnews.com][img]http://i1142.photobucket.com/albums/n610/HFNewsGFX/HfSite.png[/img][/url][/align]\n\n[align=center][img]http://goo.gl/9wMJo[/img][/align]\n\nThere weren't too many noticeable account changes this week. Here were a couple of bans:\n\n[url=http://goo.gl/gkIya][color=black][b]Frida[/b][/color][/url] was banned for reporting Staff and Administrators. \n\n[url=http://goo.gl/h8Qf7][color=black][b]Bread[/b][/color][/url] was banned until 10/22/11 for the reason \"Don't cross limits\". This member is well known for his witty guide on [url=http://goo.gl/yCkmQ]How to make Bread[/url].\n\n[url=http://goo.gl/5NeIz][color=black][b]Sync™[/b][/color][/url] was banned as his account was possibly compromised. His name was also changed to \"psycho buddy\".\n\n[url=http://goo.gl/s6gga][color=black][b]Thoth[/b][/color][/url], again we see him banned for trolling and ban evasion.\n\n[url=http://goo.gl/LgKfu][color=black][b]Hуѕтєяιa X™[/b][/color][/url] was banned until 10/25/11 for vacation.\n\n[url=http://goo.gl/FUC0Z][color=black][b]Zach[/b][/color][/url] was banned until 10/22/11 as he is having some life troubles and his family isn't doing so well.\n\n[align=center][img]http://goo.gl/6bjLl[/img][/align]\n\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Anime Thread[/b][/i] - [url=http://goo.gl/gJqiY]16/10/2011 Anime Adventures Weekly– Issue #3[/url] - [url=http://goo.gl/WtTLD][color=white][b]Tasemu[/b][/color][/url] - Almost like a mini-news edition, these threads come out weekly and contain a lot of helpful information about anime. Anyone interested in anime should definitely read these.\n[i][b]Gaming Thread[/b][/i] - [url=http://goo.gl/jM9V6][Craftbukkit] [16GB RAM Server] Retribution-MC [Survival] [Professional Staff][/url] - [url=http://goo.gl/jeUvc][color=#FFCC00][b]fl3x[/b][/color][/url] - The well loved and well known server \"Retribution-MC\" has returned!\n[i][b]Informative Thread[/b][/i] - [url=http://goo.gl/5M75b]Ultimate Guide on Computer Overclocking, Customizing and Hardware | Parts | Tips[/url] - [url=http://goo.gl/wTRG2][color=white][b]Glassy[/b][/color][/url] - This is a great compilation tutorial on everything Overclocking, Customizing and Hardware. Be sure to stop by.\n\n[color=#FFFFE0][size=large][b]SRPP Thread(s)[/b][/size][/color]\n[i][b]Open Ended Debate[/b][/i] - [url=http://goo.gl/FIHWp]Are you for or against Occupy Wallstreet?[/url] - [url=http://goo.gl/rziVR][color=#0066FF][b][AnimeFAN!] Kenshin[/b][/color][/url] - This thread has received a bit of interest and has a good topic. Occupying Wallstreet is one of the largest boycotts for a long time. Go speak your mind!\n[i][b]Most Interesting Topic[/b][/i] - [url=http://goo.gl/CVr4m]Capitalism is slavery.[/url] - [url=http://goo.gl/0FfPk][color=white][b]thought+inquiry=truth[/b][/color][/url] - Another thread from this member, but nonetheless interesting. \n\n[color=#FFFFE0][size=large][b]Suggestion Thread(s)[/b][/size][/color]\n[b][i]Suggestion Compilation[/i][/b] - [url=http://goo.gl/YcJ9T]Recently Suggested and Denied/Accepted Suggestions[/url] - [url=http://goo.gl/sNUpF][color=white][b]Positive[/b][/color][/url] - This thread is not quite a suggestion, but so far it has been able to withstand the test of time. Many members who think they have a new idea need to read this thread and see whether or not it has been suggested.\n\n[color=#FFFFE0][size=large][b]Sales Thread(s)[/b][/size][/color]\n[i][size=xx-small]If you think your thread is worthy of being in the Sales  Thread area, send me a [url=http://goo.gl/dx0Sd][b]message[/b][/url][/size][/i]\n[i][b]Successful Thread[/b][/i] - [url=http://goo.gl/xZ8F9][IRC Bot] Merqy [LR/PP/Bitcoin/Moneybookers] [Simple and Powerful][/url]  - [url=http://goo.gl/pXrLG][color=#0066FF][b]Paperbag[/b][/color][/url] - Merqy is all about stability. Get an IRC bot online in no time, that works, and works well. Definitely recommended.\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - McFlurry[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Reported[/color]:[/b] Hello McFlurry and thank you for accepting this interview. Now to start it off are there any shout out's you'd like to give?\n[b][color=#0066FF]McFlurry[/color]:[/b] Yes, I'd like to give a few shout outs to the leaders of Reverence, Astonish is NJ, Diabolic, N3w_2_H@Ck1n™, Reported, and all Reverence members\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you discover hackforums?\n[b][color=#0066FF]McFlurry[/color]:[/b] I was talking with my friend and he told me he was selling some gamertag's on Hack Forums. I asked him \"what is Hack Forums\" and he explained it to me. I thought it was a great board and I signed up. I was never active on any forum before, but I felt this was the right place for me.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you enjoy being in the HJT Team and do you help a lot of people with white hat related problems?\n[b][color=#0066FF]McFlurry[/color]:[/b] Yes I do enjoy being in the HJT Team and I appreciate all the hard work the teachers do to benefit there trainee's. I occasionally get a PM asking for help and I do my best to help the user out with the best of my knowledge and resources. \n\n[b][color=#0066FF]Reported[/color]:[/b] Do you enjoy being a co-leader of Reverence?\n[b][color=#0066FF]McFlurry[/color]:[/b] Yes I do, It gives me a chance to interact with members on a different scale. I help lead some projects in Reverence which benefits the forum and I love doing it. \n\n[b][color=#0066FF]Reported[/color]:[/b] Why do you think known members are thinking about leaving hackforums or are leaving hackforums?\n[b][color=#0066FF]McFlurry[/color]:[/b] I honestly can't really say, but I would think it's because of the changes Omniscient is going to make and some of the changes he already made. Personally I find that Omniscient is just trying to make Hack Forums better. It also might be, because they feel the quality of Hack Forums is going down hill.\n\n[b][color=#0066FF]Reported[/color]:[/b] How did you get into the HJT Team?\n[b][color=#0066FF]McFlurry[/color]:[/b] I donated.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you still sell and give spots away on your booters?\n[b][color=#0066FF]McFlurry[/color]:[/b] Not anymore, I did in the past but now I do not and I don't run my booter anymore.\n\n[b][color=#0066FF]Reported[/color]:[/b] Is there anyone in reverence you might promote to mentor or remove from mentor?\n[b][color=#0066FF]McFlurry[/color]:[/b] No comment. I'd like to keep that private in Reverence.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you see yourself as a talented graphic artist and will you be opening and graphic shops?\n[b][color=#0066FF]McFlurry[/color]:[/b] I consider myself decent but I am not amazing or that experienced. I just really do graphics when I have free time. I used to take it more seriously, but I was not really dedicated and I just didn't care anymore. Although maybe in the future I would open a signature shop or something like that.\n\n[b][color=#0066FF]Reported[/color]:[/b] How much money have you donated to hackforums and do you ever see yourself ever purchasing the Master Donator award?\n[b][color=#0066FF]McFlurry[/color]:[/b] I have donated around $50. That does not include member upgrades and paid stickies. I can see myself in the future buying the master donator award.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you have any goals on hackforums?\n[b][color=#0066FF]McFlurry[/color]:[/b] My main goal is to help out everyone I can. I also strive to get better and gain more knowledge.\n\n[b][color=#0066FF]Reported[/color]:[/b] Do you have a secret that you've never told anyone on hackforums? If so what is it?\n[b][color=#0066FF]McFlurry[/color]:[/b] No I don't have a secret that I have not told anyone.\n\n[b][color=#0066FF]Reported[/color]:[/b] Alright now to wrap this interview up. Is there anything you'd like to say before this interview ends?\n[b][color=#0066FF]McFlurry[/color]:[/b] I would like to thank you Reported for interviewing me and I'd like to give one last shout out to all Reverence leaders and members.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - KillaMuvz[/font][/size][/color][spoiler=]\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] Thank you for letting me interview you for the 62nd full edition KillaMuvz. Do you have any shoutouts for anyone on hackforums?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] I must thank you first for this opportunity of being interviewed.I'd like to give a shout out to Zach, Existence, crazy Banksy, CaptainBri, BlackShadow, WiFi, Positive, and Megan Foxxx.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] How did you discover HackForums?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] About a year and some months ago I started taking this class at school called \"Informatics\". It's not very common to take it, since the school system in Portugal is different than other countries. So, there I was learning my first coding language, Pascal. Then a crazy friend of mine, saw that I have skills. So he suggested that I code a Keystroke Logger. I honestly was like; \"DUDE IMA BE A L33T HACKER o.o!\". So I started searching the internet for tutorials and more info about malware and that's how I found HackForums.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] What do you think about Judge Dredd being hacked?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] That's actually pretty funny. The hacker should receive some kind of award for it. As he decided to hand the account back without harming nor doing anything with his powers.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] What do you think about Omniscient thinking about removing all of the free groups?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] Hm, that's a tough question. Well there's always two sides of the coin. On the good side, renewing the old which is the motto of evolution. On the bad side those groups that can't afford to buy their \"existence\" and since the beginning, gave their best to help build this nice community and their family which is their group can't do anything about it. I'm really sad about the idea of deleting the RATs Crew. Thinking about it makes my head ache. \n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] Do you have any plans for Cryptex?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] Baked and I are working pretty hard to successfully build a company in the near future which will sell both Advanced and Lite versions of Cryptex plus some tool I'll start coding soon.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] Do you have any hobbies?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] Yes. I run a lot, I consider myself a quite fast runner. I play the violin, I've been playing for about 5 years now. Kill zombies on Call of Duty(COD). I love to play football or soccer, whatever you want to call it. I think that's it.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] What sort of music do you like?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] A bit of everything, except for reggae. It all depends on how I'm feeling really. I like to keep my mind open for new sorts of music.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] What sort of movies do you like?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] Same thing as music, depends on how I'm feeling and the situation I'm in. I really like comedy movies. Romance, hm only if the girl you're dating wants to watch one then sure. Thrillers are good. Love horror movies because I tend to laugh at all of them. Suspense if it isn't dull.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] Do you play any games like Xbox 360, DS3D, PS3, etc?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] I don't actually have a console? It makes me waste tons of time. Although I love to kill zombies on Call of Duty: Black Ops or Left4Dead2. You just made me thing of the old times when I first bought a PlayStation 1 (That old big block) and I played Tekken every single day, good times.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] If you had one wish what would it be?\n[b][color=#0066FF]KillaMuvz[/color]:[/b] I'd like to be rich, but then mostly everything would lose their purpose. Or I'd want a million wishes, but that's probably cheating. So I'll say, be capable of building a really nice and loving family in the future.\n\n[b][color=#0066FF]Kyle FYI™[/color]:[/b] Thank you for participating in this interview!\n[b][color=#0066FF]KillaMuvz[/color]:[/b] You're welcome and again thank you for this opportunity!\n[/spoiler]\n\n[align=center][img]http://goo.gl/zEtV9[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=VJoM8KDni_0[/video][/align]\n\n[spoiler=[i]Written topics[/i]]\nWebshow\n-Answer QnA\n-Talk about the Topics sent in\n-Guest Speaker ^ Interview ^ WiFi\n--Leadership\n---Peter Chao (http://goo.gl/c5vue) - Normal -> Mentor -> Staff\n---Rusty_v (http://goo.gl/me3ry) - Normal -> Staff -> Mentor\n--Awards\n---Glassy (http://goo.gl/wTRG2) - Sticky Man - http://hackforums.net/showthread.php?tid=1793236\n---Dєαtђ S (http://goo.gl/zCMR9) - Dunce - \"For your english\"\n---The MammoTh (http://goo.gl/gKWEH) - Drunk - I'll be honest. You really don't deserve this particular award but it's the one you wanted so here ya go.\n--Misc.\n---\n--Questions\n---\n[/spoiler]",
            "subject": "[10/19/11] - HF User News"
        }
    ]
}