{
  "posts": [
    {
      "pid": "12152001",
      "uid": "295848",
      "dateline": "1306376000",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFmainbanner.png[/IMG][/align]\n\n[color=#FFD700][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\n\nThe edition you are currently reading is the [b]43rd full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFheadlines.png[/IMG][/align]\n\n[align=justify]It's been a busy week for Hack Forums, so let's get to it! [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] recently noted the growing flaming and harassment problem on the site and has simply made an addition to the HF rules. It states, \"Members are not allowed to engage in threatening behavior toward other members. This includes flaming. Also threats to steal accounts, dox, or swat. This includes any on-site material such as posts, PMs, or profiles.\" He encourages members act civil toward each other. To find out more visit his thread [url=http://hackforums.net/showthread.php?tid=1309290][b]here[/b][/url]. \n\nEarlier this week there was also a minor issue with login keys. If you were wondering why you were logged out of your account, it was due to a reset of all member login keys. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has done so for security purposes to protect member accounts. To find out more click [url=http://hackforums.net/showthread.php?tid=1304786][b]here[/b][/url]. \n\nIn the Marketplace, all Apple products have now been banned. This means it is now a disallowed blackhat activity due to the massive amount of fraudulent deals taking place. All sales and trades are now banned. You can read [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s original thread [url=http://hackforums.net/showthread.php?tid=1304697][b]here[/b][/url].\n\nLately we've been getting quite a few new awards, and this week is no exception. The Liberty Reserve Head award has been added by [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url]. To gain this award members simply have to donate $20.00 USD to the site via Liberty Reserve. You can find this new award [url=http://hackforums.net/myawards.php][b]here[/b][/url]. \n\nWith all these things, it's nice to take a break. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has spent two days away from Hack Forums on a short but nice vacation enjoying the real world. \n\nOne of our administrators, previously known as [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Hanzo[/b][/color][/url], has changed his username. He is now known as [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url] and oversees the sites reputation abuse issues as well as other problems with a passion.\n\nIn some unfortunate news, our staff member [url=http://hackforums.net/member.php?action=profile&uid=175033][color=Lime][b]xerotic[/b][/color][/url] was compromised again, this time via e-mail. We warn members to take caution when dealing with his e-mails as they may not be under his control. You can read more about the hack and his temporary ban [url=http://hackforums.net/showthread.php?tid=1307160][b]here[/b][/url]. Hopefully this is the last of his troubles, now that the account has been secured once again.\n\nIn some group news, the TechSperts has finished their first round of recruitment. [url=http://hackforums.net/member.php?action=profile&uid=30595][color=Lime][b]The Rated R Superstar[/b][/color][/url] has posted the accepted and denied members [url=http://hackforums.net/showthread.php?tid=1278242&pid=11980219#pid11980219][b]here[/b][/url].\n\nAlso, the Red Lions group has re-opened recruitment. You can apply for this prestigious group as well as find their application forms and information [url=http://hackforums.net/showthread.php?tid=1314549][b]here[/b][/url]. \n\nFinally, the HF News is proud to introduce a new integration of paid advertisements on every weekly issues. Members will be able to advertise their products or services on the thread for small payments. All proceeds are donated toward Hack Forums to help Omniscient keep this site running. To find out more click [url=http://hackforums.net/showthread.php?tid=1313298][b]here[/b][/url].[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFusernews.png[/IMG][/align]\n\n[align=justify]The Ub3r [url=http://hackforums.net/member.php?action=profile&uid=72708][color=#0066FF][b]Apple[/b][/color][/url] has started to code an ingenious program called [url=http://hackforums.net/showthread.php?tid=1296932][b]Leaf[/b][/url] -- be sure to go check it out.\n\n[url=http://hackforums.net/member.php?action=profile&uid=110838][color=#0066FF][b]Perfectionist[/b][/color][/url] was able to hack in to Samsung. See his bragging thread [url=http://hackforums.net/showthread.php?tid=1312971][b]here[/b][/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=64184][color=#0066FF][b]Notorious Mental[/b][/color][/url] was repfucked on 5-20-11.\n\n[url=http://hackforums.net/member.php?action=profile&uid=193588][color=#0066FF][b]Ryuku[/b][/color][/url] wrote a tutorial on how to effectively store you password for safe and easy access. See it [url=http://hackforums.net/showthread.php?tid=1304546][b]here[/b][/url].\n\nOur very own [url=http://hackforums.net/member.php?action=profile&uid=656453][color=#0066FF][b]ReactioNz[/b][/color][/url] will be having his birthday May 26th.\n\n[url=http://hackforums.net/member.php?action=profile&uid=80618][b]nokia2mon2[/b][/url] has sent another huge donation of $1,000 in the name of his group the 'Red Lions'. More on his return and the donation itself can be read [url=http://hackforums.net/showthread.php?tid=1311710][b]here[/b][/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=317364][color=#0066FF][b]Nightmare[/b][/color][/url] has been the first member to receive the new 'Liberty Reserve Head' award that was created this week. To see all who have received this award, click [url=http://hackforums.net/myawards.php][b]here[/b][/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=183072][color=white][b]Mr.Kewl[/b][/color][/url] wrote an informative thread on all the hacking tools and programs around. Check it out [url=http://hackforums.net/showthread.php?tid=1299720][b]here[/b][/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=329361][color=white][b]Valik ϟ[/b][/color][/url] got his thread stuck in the Gamertag section. Read all about it [url=http://hackforums.net/showthread.php?tid=1306565][b]here[/b][/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=137645][color=black][b]mothered[/b][/color][/url] was banned for his account being compromised, and has yet to recover his account.\n\n[url=http://hackforums.net/member.php?action=profile&uid=46373][b][color=black]phire nuk3r[/color][/b][/url] got unbanned, then banned hours after for advertising. (Until 6-23-11)\n\n[url=http://hackforums.net/member.php?action=profile&uid=415712][b][color=black]NATASHAx[/color][/b][/url] got banned for sharing accounts, some think with Nyx-.\n\n[url=http://hackforums.net/member.php?action=profile&uid=11953][b][color=grey]Nyx-[/color][/b][/url] now has a dead account. Details are still unknown.\n\n[url=http://hackforums.net/member.php?action=profile&uid=729494][color=grey][b]Grumpy[/b][/color][/url] was banned for a day, repfucked, and given a minus then from [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url]. In addition, he got his Ub3r taken away and now has a dead account. Moral of the story? Don't fuck with [url=http://hackforums.net/member.php?action=profile&uid=4066][color=#4DD0FC][b]Judge Dredd[/b][/color][/url].[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFothernews.png[/IMG][/align]\n\n[align=justify]If you haven’t noticed, everybody is still alive. The rapture that was predicted to happen last Saturday didn’t happen. However, some people have thought that the volcano that went off in Iceland that spewed ash everywhere was because of the rapture. I guess some people just don’t know what coincidences are.\n\nMacintosh computers, which are known for being “unable to get viruses”,  have been widely infected by a security program known as “Mac Defender”. Apple has announced that in the coming days Mac OS X will receive a software update that will remove the viruses and its variants. \n\nFor some of the members that do not understand this, Other News is for off-site news. This section isn’t for other news that goes on at Hack Forums. It’s for other things that go on off-site. So if you see something that is stated that has nothing close to do with Hack Forums and you post about it, your post will be reported promptly.\n\nHere's a quote to make you think: Psychic fair closed due to unforeseen circumstances.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFinterviews.png[/IMG][/align]\n\n [size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - Poppins[/color][/font][/size]\n[spoiler][align=justify][color=white][b]Boxing:[/b][/color] Thanks for participating in the interview. Let's get started. First off, any shout outs or opening statements before we get started?\n[color=#0066FF][b]Poppins:[/b][/color] Thanks. First off: it's an honour. I would like to shout out :'D, Crayo and Zainzilla. \n\n[color=white][b]Boxing:[/b][/color] What would you say inclines you to get on Hack Forums and post? \n[color=#0066FF][b]Poppins:[/b][/color] My motivations are very different from the day I started. I would say now both the lounge and the SRPP section are the reasons I post. I enjoy meeting some awesome new people and hearing different points of view. \n\n[color=white][b]Boxing:[/b][/color] How do you feel about where Hack Forums is heading as a forum and community? (Better,worse, high, low and quality)\n[color=#0066FF][b]Poppins:[/b][/color] Errm, that's a good question. I think that the quality is still brilliant. The reason it appears there are more conflicts is just because there are more people here. It's pretty crazy that we are going to be hitting a million users soon. \n\n[color=white][b]Boxing:[/b][/color] I would have to say I agree. With the recent opening of Suggestions and Ideas, do you have any that you would find beneficial to the forum? \n[color=#0066FF][b]Poppins:[/b][/color] Not really, no. My only comment would be to do something about the current SRPP section. It needs a sub forum or just a bit more attention. \n\n[color=white][b]Boxing:[/b][/color] How do you feel about the current Staff? \n[color=#0066FF][b]Poppins:[/b][/color] They are doing a great job. They are under quite a bit of pressure but I haven't had one negative comment from any PM I have sent. Keep it up guys. \n\n[color=white][b]Boxing:[/b][/color] How did you first discover Hack Forums?\n[color=#0066FF][b]Poppins:[/b][/color] I went on holiday and someone taught me some MySQL injection techniques so I went home and Googled 'underground hacking forums'. Not very underground but the rest is history. \n\n[color=white][b]Boxing:[/b][/color] Would you consider yourself respected, liked or just well-known on Hack Forums? \n[color=#0066FF][b]Poppins:[/b][/color] I would say I am well known but I don't think I can answer the other two. Those are for others to judge, not me. \n\n[color=white][b]Boxing:[/b][/color] Makes perfect sense, sorry about that. Have you ever been interested to join a group on Hack Forums? \n[color=#0066FF][b]Poppins:[/b][/color] I've joined every group on Hack Forums. :3 Apart from the Wraith, The RAT's Crew & PhilKer. I just left because I only post in the SRPP section and The Lounge. It's unfair to be inactive in a group.\n\n[color=white][b]Boxing:[/b][/color] Very interesting... You stated earlier that you stay in The Lounge and SRPP to \"enjoy meeting some awesome new people and hearing different points of view\", yet you have quite a few posts outside of that. What made you stop posting in other sections and only hanging out in these two? \n[color=#0066FF][b]Poppins:[/b][/color] Although I sometimes post outside I tend to stick to them because they are the only things that interest me in terms of this forum anymore. I haven't really got anything else to learn or discuss so I just chill in those two. \n\n[color=white][b]Boxing:[/b][/color] I'd like to finish off saying thanks for letting me interview as well as ending it with a hypothetical question: If Omniscient asked you to become a staff member that dealt with reports and rep abuse, what would your answer be? \n[color=#0066FF][b]Poppins:[/b][/color] I would say yes. I think it would be an awesome opportunity. :smile Thanks for the chance it's been a pleasure.[/align][/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - +cobalt[/color][/font][/size]\n[spoiler][align=justify][color=white][b]Security™:[/b][/color] What are your thoughts on the recent \"World Ending\" scare, on May 21st?\n[color=#0066FF][b]+cobalt:[/b][/color] Well, it's just like any other apocalyptic scare. One person says something, people spread it like wildfire, then nothing happens. In all, people are just gullible. \n\n[color=white][b]Security™:[/b][/color] I take it you're not a believer in all of these theories, do you believe 2012 is our doomsday?\n\n[color=#0066FF][b]+cobalt:[/b][/color] More than likely no. Everything people say that could happen in 2012 would have shown some bigger signs by now. The biggest shit that's gonna go down is mass commotion and a bit of anarchy. The next day millions will wake up hungover and go on with their lives.\n\n[color=white][b]Security™:[/b][/color] What do you plan on doing on 12/21/12? What about the days following, and upcoming?\n[color=#0066FF][b]+cobalt:[/b][/color] Well, first I'll probably you know, go into middle of town and stir people and yell out that the apocalypse is coming. On 12/21/1, I'll wake up and turn on the news. I'll watch pandemonium while I eat some leftover pizza. The following days, I'll make fun of all of the people who will say, \"I knew it wasn't gonna happen in the first place.\"\n\n[color=white][b]Security™:[/b][/color] Haha, sounds like a lot of fun. When not on Hack Forums, what are some things that you enjoy doing?\n[color=#0066FF][b]+cobalt:[/b][/color] Well, I have a job, so that. I hang with my friends. I actually like to do some film making and photography. \n\n[color=white][b]Security™:[/b][/color] When on Hack Forums, what are some things you enjoy doing? What sections are your favorite?\n[color=#0066FF][b]+cobalt:[/b][/color] I go into a lot of sections. I go into the SRPP section a lot. I lurch the Rules and Announcement section getting my reporting on. I go into the Graphics section a lot, too. I seldom go into The Lounge, but when I do I don't post a lot.\n\n[color=white][b]Security™:[/b][/color] What are your favorite recent updates? What updates do you dislike?\n[color=#0066FF][b]+cobalt:[/b][/color] I haven't cared for most of the updates, but I have not liked some. I hate the post count disabling in the Rules and Announcements. I, for one, will admit that I care for my post count. I see having a high-ish count gives me goals to look forward to. No one realizes that taking post count off sections just increases LQP. \n\n[color=white][b]Security™:[/b][/color] I see you care about your post count, but what about your reputation? Do you care, or is it just a number? And do you set goals internally?\n[color=#0066FF][b]+cobalt:[/b][/color] I'm not gonna lie like a lot of members. I care about my forum statistics. I care if I have a high reputation and post count. I'll care if I get repfucked. I don't exactly set goals for myself as some would think I would. If I notice that I'm getting close to a number, I'll think to myself, \"50 more posts till that number, or 10 more points till this.\"\n\n[color=white][b]Security™:[/b][/color] I respect you for actually being honest. Do you value honesty on and off Hack Forums? What are some other values of yours?\n[color=#0066FF][b]+cobalt:[/b][/color] On HF, I can't always tell when someone is lying, but I can in real life. When someone lies to me, I'll look down upon them. If they are honest, I'll respect them. If not, screw 'em. Some of my other values are cleanliness, intelligence, and morality.\n\n[color=white][b]Security™:[/b][/color] You seem very intelligent, and respectful. What would you advise new members of Hack Forums to do, to shine as a great member?\n[color=#0066FF][b]+cobalt:[/b][/color] What I see a lot of new members do is, try to strive for popularity. While some of them might get their high spot for a while, it isn't for a good thing. If you want to be a great member, the best advise I can give is don't give a fuck. Do that and you'll go a long way. This is also a small thing, but would it kill you to learn how to use the shift bar. You got two of them, and they won't bite. \n\n[color=white][b]Security™:[/b][/color] Final question, if you had 3 wishes right now, what would they be? (Can't ask for more wishes)\n[color=#0066FF][b]+cobalt:[/b][/color] I've been asked this a lot. I've thought of the perfect answer for it too.\n\n1. A machine to give me anything I want.\n2. A machine to simulate anything I want.\n3. A corn dog.[/align][/spoiler]\n\n[align=center][img]http://i1118.photobucket.com/albums/k604/Qwazzy/HFcredits.png[/img][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url]\n[/list]\n[color=white][b]Publishers Assistant[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url]\n[/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url] - Other News\n[*][url=http://hackforums.net/member.php?action=profile&uid=153686]Fireren[/url] - Headlines\n[*][url=http://hackforums.net/member.php?action=profile&uid=515249]Sir[/url] - User News\n[/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=114470]F4T4L 3RR0R[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=656453]ReactioNz[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=629674]Waldo[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url]\n[/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=137080]Boxing[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=92059]Security™[/url]\n[/list]\n[color=white][b]Editor[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[/list]\n[color=white][b]Graphic Designer[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url]\n[/list]",
      "subject": "[5/25/2011] - HF News"
    }
  ]
}