{
  "posts": [
    {
      "pid": "20796783",
      "uid": "515249",
      "dateline": "1331783296",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\r\n\nThe edition you are currently reading is the [color=#98FB98][b]83rd full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \r\n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\r\n[color=white][b]Prestige[/b][/color]\r\nA mysterious new feature called \"Prestige\" has been added to HackForums. Prestige is a combination of post count, repuatation, number of awards, and online time. Although there is no official use for this feature yet, Omniscient has stated that it may be later used as a requirement for certain section, similar to how you must have positive rep to enter the marketplace. To view the announcement thread for this new feature click the following link: http://goo.gl/DwkTF\r\n\n[color=white][b]Ban on discussion of fake items[/b][/color]\r\nThe day that many members have been waiting for is here, counterfeit and fake goods are no longer welcome on HackForums. The main reason for this was most likely due to the massive amount of threads related to fake beats, which several members found quite bothersome. To read Omniscient's announcement thread in the shopping deals section click the following link: http://goo.gl/Gfi3s\r\n\n[color=white][b]Removal of free groups[/b][/color]\r\nAs the number of paid groups is rapidly increasing, Omniscient has decided that all free groups will be removed. He has however, given them a chance to stay if they pay an unknown amount. Most free groups will have until the summer to make the payment, failure to do so will ensure their removal from HackForums.\r\n\n[color=white][b]IP checker[/b][/color]\r\nA nifty new plugin was recently coded and 'plugged in' to HackForums by Omniscient. This plugin converts all IP addresses to click-able links in threads and posts, when clicked the link will open a new window containing the IP's hostname and its GeoIP location. To read Omniscient's announcement thread for the new plugin click the following link: http://goo.gl/Q49hy\r\n\n[color=white][b]New marketplace rule[/b][/color]\r\nDue to an excessive amount of members using the 'post and delete to ' method to  their threads Omniscient has put a new rule in place. The rule states that any members attempting to use the 'post and delete to ' method to  their threads will be given a LPQ warning and have their sales thread closed. To view Omniscient's announcement thread for the new rule click the following link: http://goo.gl/DRx7V\r\n\n[color=white][b]Kοny censored[/b][/color]\r\nAfter quite a few threads and twice as many posts Omniscient has finally decided to censor the word \"Kοny\". Now when a user tries to post the word it is censored and reads \"that guy who is spammed everywhere\".\r\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\r\n[url=http://hackforums.net/member.php?action=profile&uid=656453][color=lime][b]ReactioNz[/b][/color][/url] requested to be banned for two days while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=729921][b][color=#0066FF]тнє Jσкєя[/color][/b][/url] was rep fucked, as a result, he is no longer in the lead for highest reputation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=964299][b][color=white]Purple Haze.[/color][/b][/url] was rep fucked for infecting members.\r\n[url=http://hackforums.net/member.php?action=profile&uid=657392][b][color=white]Astonish[/color][/b][/url] has reached 1,000 reputation points.\r\n[url=http://hackforums.net/member.php?action=profile&uid=182754][color=black][b]Orgy[/b][/color][/url] had his account stolen.\r\n[url=http://hackforums.net/member.php?action=profile&uid=604554][color=black][b]Leave Me Alone![/b][/color][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=334478][color=black][b]Lith[/b][/color][/url] was banned and rep fucked for being LQ.\r\n[url=http://hackforums.net/member.php?action=profile&uid=789792][color=black][b]Kornk[/b][/color][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=646083][color=black][b]Intimist[/b][/color][/url] was banned and rep fucked.\r\n[url=http://hackforums.net/member.php?action=profile&uid=141245][color=black][b]TheBlackHat[/b][/color][/url] was banned for post delete ing.\r\n[url=http://hackforums.net/member.php?action=profile&uid=398783][color=black][b]inxy[/b][/color][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=300616][color=black][b]Thoth[/b][/color][/url] was banned for harassing members.\r\n[url=http://hackforums.net/member.php?action=profile&uid=834989][color=black][b]๖ۣۜBlowmy16inch[/b][/color][/url] requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=413519][color=black][b]Nexum[/b][/color][/url] was banned and rep fucked for multiple accounts.\r\n[url=http://hackforums.net/member.php?action=profile&uid=1032821][color=black][b]Staat[/b][/color][/url]  requested to be banned while on vacation.\r\n[url=http://hackforums.net/member.php?action=profile&uid=613009][color=black][b]Onyx.[/b][/color][/url], previously known as Morchid, was banned and rep fucked.\r\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\r\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\r\n[i][b]GFX Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2215488]A Quick Comprehensive Typography Guide [IMPORTANT][/url] - [url=http://hackforums.net/member.php?action=profile&uid=62795][color=#0066FF][b]Tasemu[/b][/color][/url] - This is a great guide by our former GFX Master, teaching you how to do modern typography.\r\n\n[i][b]Metasploit Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2170672]☆[TuT] Metasploit Ultimate [TuT]☆[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1042274][color=white][b]-๖ۣۜDivine-[/b][/color][/url] - If you've ever wondering how Metasploit is used or how you can capitalize on this program, then you should read this tutorial.\r\n\n[i][b]GFX Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2297650][Tut] How to resize images without having them pixelate[/url] - [url=http://hackforums.net/member.php?action=profile&uid=581426][color=#0066FF][b]Quad[/b][/color][/url] - Resizing pictures can be a major pain, with pixelation changing as you get larger or smaller, but with this tutorial, you can learn how to do it and keep the quality.\r\n\n[i][b]Rule Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2281694]Minecraft Account Rules[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] - There have been a few changes to the rules about minecraft accounts, you should probably read this.\r\n \r\n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\r\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Flux Pavillion[/font][/size][/color][spoiler=]\r\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey Flux! First off, thanks for taking the time out for this interview! Before we begin, would you like to give any shoutouts?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: Yes, I'd like to give a shoutout to my friend Cognition. He's a good friend of mine who often gives me a good second thought to things, and links me to some very good threads.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Fantastic! To start off, how did you find Hack Forums?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: I found Hack Forums through my friend Chad. It was just another site at first, but gradually lured me in with mysterious Black Hat methods, programs, and discussions. I don't commit myself to much hatting now-a-days, but I do enjoy informational and humorous threads every once and a while when I log in.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That’s great! Your friend Chad was certainly nice enough to bring such a great member to our forums! I know you're not familiar with the prestige system, but how do you feel about another ranking system on Hack Forums?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: When I noticed the prestige system I noticed that I had a decently high prestige. I wondered what it was for and still cannot wait for it to be implemented into the forum.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I’ll be interested to see what direction the prestige system goes in. When you’re not on Hack Forums, what are you doing?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: Well, currently I've been trying to install a \"almost vanilla\" Mac OS X on my computer (Hackintosh), so that has taken up most of my time. Currently I have a very nice Intel based \"Mac\" with a 5750 in it. Runs like a champ neglecting some of the fine tuning I need to add to graphics.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That’s great, though I will always be a Windows guy. Who would you consider your favorite member and why?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: That's a tough one. I don't really know if I have a favorite member or not; though, when I was in Red Lions I always like nokia2mon2 and Glassy, among the other member's of Red Lions. It's an awesome group to be in and I recommend to everyone to apply when they can.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: The Red Lions in general are the epitome of quality, as they all take a pledge to help out other members, so the reason behind your choices seem clear cut to me. If you were admin for 24 hours what would you do?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: Honestly, I'd be overwhelmed administering a forum this big. It would take more than 24 hours to get used to. Eventually, I would pole common suggestions in the forum related to content and change the rules to make the forum more appealing to the Black Hat users. Abiding common laws of course.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: It’s a fine line appealing to Black Hats while keeping it legal, I think Omni has walked it pretty well. Why do you think you're so active in the Innuendo section?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: I enjoy the stories, and enjoy answering people's questions. I consider myself a pretty understanding person in general, and don't mind helping people out.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: I see you quit Hack Forums for a little bit, what convinced you to come back?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: The lack of quality forums on the internet. Yes, I agree HF has declined in content since I've joined, but weighing out the good and bad, this forum is still spectacular.\r\n\n[b][color=#1466ff]Michael Westen[/color][/b]: That about wraps it up for me! Do you have any closing words for the readers?\r\n[b][color=#1466ff]Flux Pavilion[/color][/b]: Yes, I'd like to say keep up the quality posting, work, and be open to new ideas and members. Have a good day/nice night!\r\n[/spoiler]\r\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - Sir[/font][/size][/color][spoiler=]\r\n[b][color=#1466ff]Sir[/color][/b]: Hey there, handsome stud muffin. Have you picked a replacement interviewer yet?\r\n[b][color=white]Sir[/color][/b]: Well, beefcake, I can't say that I have.\r\n\n[b][color=#1466ff]Sir[/color][/b]: I'm sad to hear that, sexy beast. When can we expect results on that?\r\n[b][color=white]Sir[/color][/b]: As a favor to man-candy like you, I'll have an answer by next week. However, there is a possibility I'll take on two; so as to have three interviews a week. A possibility.\r\n[/spoiler]",
      "subject": "[3/14/12] - HF News"
    },
    {
      "pid": "20796940",
      "uid": "515249",
      "dateline": "1331783698",
      "message": "[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Stephen Hawking will appear on Big Bang Theory[/b][/color]\nThe legendary theoretical physicist will be guest starring on the Big Bang Theory on April 5, 2012 on an episode where Sheldon Cooper, a super nerd, has a dream in which Hawking enters \"to share his beautiful mind with his most ardent admirer\".  Hawking has made a variety of guest appearances in other popular shows such as \"Futerama\", along with \"The Simpsons\".\n\n[color=white][b]PayPal Reverses eBook Sales Ban[/b][/color]\nOn Tuesday, PayPal, which is owned by  eBay, reversed their ban on the sale of electronic books which depicts child pornography, bestiality, rape, or incest.  Rather than banning the whole category of books, PayPal will now focus on banning individual books from being sold.\n\n[color=white][b]Worlds Tallest Man May Stop Growing[/b][/color]\nAfter being treated by doctors at the University of Virginia, Sultan Kosen, from Turkey may stop growing.  He is listed in the Guinness World Records, measuring at 8 feet, 3 inches, at the age of only 29.  His new medication is aimed to regulate the production of growth hormones.  He also holds the record for the worlds largest hands and feet.  Guinness also scheduled a meet with him and the worlds smallest man who measures at 2 feet, 5 inches.\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[b][color=white]Yahoo[/color][/b]\nYahoo! has recently sued Facebook for patent infringement(s). Facebook and Yahoo have worked together great in the past and Facebook has also said that they have brought Yahoo! more users. It seems now companies are suing each other for money and it always seems to be a “Patent Infringement.” \n\n[b][color=white]Apple[/color][/b]\nA man is suing Apple because he claimed that Siri the personal assistant “does not perform as advertised. “ He is also stating that the iPhone 4S without Siri is just an expensive iPhone 4. Faiz, the guy who is suing Apple, asked Siri for directions and it gave him wrong ones. In the ad’s Siri is shown giving directions, but it does not say anywhere that those directions are 100% accurate.\n\n[b][color=white]BBC[/color][/b]\nBBC has claimed that its been hacked by the Iranians. They say a cyber-attack has attacked their servers to stop the coverage of Iran. This could mean Iran is trying to stop all media coverage. \n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[b][color=white]Adele[/b][/color]\nAdele's album \"21\" clocks it's third week at number 1, selling 247,000 copies this week.\n\n[color=white][b]New Judge[/b][/color]\nBrittany Spears and her agent Jason Trawick are negotiating the contract for her becoming a new judge of \"The X Factor\"\n\n[color=white][b]Bruce Springsteen[/b][/color]\nBruce Springsteen's album \"Wrecking Ball\" hit at No. 1 on the U.K. album chart Sunday March 11th.\n\n[color=white][b]Taylor Gang[/b][/color]\nWiz Khalifa dropped a mixtape March 13th called \"Taylor Allderdice\". The mixtiape name is the name of the school he went to. He will also be releasing a new album \"ONIFC\" (Only Nigga In First Class) sometime this summer.\n\n[color=white][b]Music Videos Of The Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=gdpKPSjQ37Y[/yt]\n[yt]http://www.youtube.com/watch?v=WM8bTdBs-cw[/yt]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nIn this day and age, people are getting too caught up in this new world of technology. I realize that I too rely on the internet and gadgets that I own, yet I am still in touch with the ages behind me. My father was an older man when I was born, so I got introduced to several things for the '50s and '60s that I would have never run in to otherwise. We listened to vinyl records in front of a wood-burning fireplace. We went through radios from the '60s that are still in working condition, a hobby of his. We tied flies for fly fishing, and actually went fly fishing. I wasn't even introduced to a computer of working condition until I was upwards of eight years old. Living with someone who is from an entirely different age than anyone else I know has put me in touch with the recent history of our country and how things were done. I wish that everyone could experience these things, getting in touch with some of the foundations for the commodities that we enjoy today. But alas, it is not this way. I just put forth a challenge for anyone reading this to go out and find something from the past, maybe something your grandfather did, maybe even your father, and try it yourself. Be old school.",
      "subject": "*"
    },
    {
      "pid": "20796963",
      "uid": "515249",
      "dateline": "1331783755",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"How do you feel about Kοny 2012?\"\n\n[i]\"Joseph Kοny is indeed a bad person. There\n is nothing right about taking children from their homes and forcing them to become\n soldiers. But there seems to be more to it. The group backing the now viral campaign,\n Invisible Children, has had a shady past. In 2011, they received $8,676,614 in donations\n which only 32% of that went to direct help in Uganda. The remaining money went into\n their pockets. You do not need a group such as Invisible Children to accept donations\n so they can afford to make a 12th movie. Something is wrong with that. Joseph that\n guy who is spammed everywhere is horrible, but the Invisible Children campaign going\n on right now is also horrible. If people want to donate to something, they should do the\n research about the group accepting the donations before jumping on the bandwagon.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=95159][i]-Tater Tot[/i][/url]\n\n[align=right][i]\"I feel that it is being pushed to far, don't get me wrong yeah the guy is a dickhead but\n the topic doesn't deserve so much attention. It's just another topic that went viral and will be forgotten\n in a few months. People are acting like something will actually happen to him. It's not for any other\n country to get involved in, it's Uganda's problem, not ours.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=795605][i]-Demoralize[/i][/url][/align]\n\n[i]\"I think that Kοny 2012 is being too looked on. This guy has\n been doing it for 26 years, and many of my friends think is just starting. If the world is going to\n do anything, i believe they're trying to get attention out there, so when they do strike, other\n people that do this will get a huge scare. It's unfortunate people do this stuff, but like i said...\n This has been happening by the same guy for 26 years!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=822426][i]-iHaX™[/i][/url]\n\n[align=right][i]\"Kοny 2012 is an idiots way to make themselves feel good.\n They think by liking a FB page, or tweeting they're making a difference; they're not. By doing so do you think\n the government will just swoop in and invade Africa? No, because they are not allowed. You think that guy\n who is spammed everywhere cares about your likes? Get your heads out of your asses, and go to Uganda if\n you want to help.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=279955][i]-Happeh[/i][/url][/align]\n\nThe topic for next week is \"How do you feel about the new Prestige system?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/p8ebp.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3342137_460s.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://d24w6bsrhbeh9d.cloudfront.net/photo/3340333_460s.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=0E91_UwvKOQ[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b][color=white]Positive[/color][/b][/url] received the AssKisser award. \n[url=http://hackforums.net/member.php?action=profile&uid=377103][b][color=#0066FF]ƒrequency[/color][/b][/url] received the Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=594159][b][color=#0066FF]Rawr![/color][/b][/url] received the Master Donator award.\n[url=http://hackforums.net/member.php?action=profile&uid=594159][b][color=#0066FF]Rawr![/color][/b][/url] received the Cat Lover award.\n[url=http://hackforums.net/member.php?action=profile&uid=920387][b][color=white]Ηades[/color][/b][/url] received the Master Donator award.\n\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=431105][b][color=white]Tɦɛ Gʀiɱ[/color][/b][/url] has recently been promoted to leader of the Marketers.\n[url=http://hackforums.net/member.php?action=profile&uid=402384][b][color=white]Riggs[/color][/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=71329][b][color=#0066FF]Zain[/color][/b][/url] are now moderators of the Shopping Deals section.\n[url=http://hackforums.net/member.php?action=profile&uid=661940][b][color=white]Bugga[/color][/b][/url] has recently been promoted to leader of the new group illuminati.\n[url=http://hackforums.net/member.php?action=profile&uid=657392][b][color=white]Astonish is NJ[/color][/b][/url] has recently been promoted to Mentor.\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b][color=white]Positive[/color][/b][/url] is now the official leader of \"Techsperts\" as it is now a paid group.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}