{
  "posts": [
    {
      "pid": "21630853",
      "uid": "515249",
      "dateline": "1334197567",
      "message": "[align=center][IMG]http://goo.gl/yemsX[/IMG][/align]\n\nThe edition you are currently reading is the [color=#98FB98][b]87th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\nWe have added the \"Gaming News\" section. I hope you all enjoy it!\nWe will be getting a new layout soon, and it will include a bar for the Gaming News section, please be patient!\n\n[align=center][img]http://i.minus.com/jDq8Ol06Hfbzh.png[/img][/align]\n[color=white][b]New usergroup \"Root\"[/b][/color]\nAfter the suspension of the Minecrafters, the leader of the group, Castle Bravo, has decided to rename the group \"Root\" and give it a whole new meaning. In a few words Root is a group about anything and everything computer related. However, the group is invite only and there seems to be strict requirements before you can even be considered. To read Castle Bravo's announcement thread click the following link: http://goo.gl/UnWiI\n\n[color=white][b]New upgrade prices[/b][/color]\nFor unknown reasons [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] has decided that the ub3r and possibly l33t prices will change within the next week or so. This may be due to the rise in upgrade purchases, however, nothing is certain at this point in time. [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] has also announced that he will no longer be allowing normal to ub3r upgrades. To read [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient's[/b][/color][/url] tweet about these changes click the following link: http://goo.gl/ZhBXr\n\n[color=white][b]Site tweaks[/b][/color]\nRecenty [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] tweeted about tweaking some of the code on HackForums, however nothing specifically was said. The suggestions section was also very active in the past week so it is likely that [url=http://hackforums.net/member.php?action=profile&uid=103669][color=#4DD0FC][b]Omniscient[/b][/color][/url] will be implementing some of the suggested changes.\n\n[align=center][img]http://goo.gl/lWWKU[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=594159][b][color=black]Rawr![/color][/b][/url] was banned, rep fucked, and had his awards removed for being an associate with Time and Musky.\n[url=http://hackforums.net/member.php?action=profile&uid=134868][b][color=black]Amzo[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=566671][b][color=black]panDa.[/color][/b][/url] had his account stolen.\n[url=http://hackforums.net/member.php?action=profile&uid=203626][b][color=black]Nubby[/color][/b][/url] was banned for trolling.\n[url=http://hackforums.net/member.php?action=profile&uid=752389][b][color=black]eiqhtworks[/color][/b][/url] was banned for LQP.\n[url=http://hackforums.net/member.php?action=profile&uid=86914][b][color=black]Vito Scaletta[/color][/b][/url] was banned for creating another account to troll.\n[url=http://hackforums.net/member.php?action=profile&uid=331245][b][color=black]Jash[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=829359][b][color=black]eXawn[/color][/b][/url] was banned for trolling.\n[url=http://hackforums.net/member.php?action=profile&uid=944024][b][color=black]Neal Caffrey[/color][/b][/url] was banned for selling outside of the marketplace. Then had his ban extended because he created another account.\n[url=http://hackforums.net/member.php?action=profile&uid=738154][b][color=black]MLD[/color][/b][/url] was banned and rep fucked for trolling.\n[url=http://hackforums.net/member.php?action=profile&uid=667183][b][color=black]ß|Λcksí-íΛdΘw™[/color][/b][/url] has requested to be banned while on vacation.\n[url=http://hackforums.net/member.php?action=profile&uid=67727][b][color=black]єץє[/color][/b][/url] was banned for complaining about his rep fuck.\n[url=http://hackforums.net/member.php?action=profile&uid=665594][b][color=black]Modern[/color][/b][/url] has requested to be banned while on vacation.\n\n[align=center][img]http://goo.gl/YEmyS[/img][/align]\n[color=#FFFFE0][size=large][b]General Thread(s)[/b][/size][/color]\n[i][b]Mac Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2379517]Create an invisible Folder[/url] - [url=http://hackforums.net/member.php?action=profile&uid=526511][color=white][b][M][/b][/color][/url] - If you're an avid mac user and you don't know how to create an invisible folder, this thread is right for you!\n\n[i][b]WoW Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2377748][ALWAYS UPDATED] Premium WoW Guide Index List [NO PM NEEDED] ManaView's/DUGI's/Zygor[/url] - [url=http://hackforums.net/member.php?action=profile&uid=43337][color=#0066FF][b]iPlay[/b][/color][/url] - Seeing as the WoW section is always full of guides and spam, iPlay has organized all of the guides he can find in one easy to find place.\n\n[i][b]Scandal Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2386596]I've caught out The Mammoth.[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1247066][color=white][b]Burst[/b][/color][/url] - The MammoTh recently received the Youtube award for his video for Hack Forums. This member has found the fiverr advertisement that he used.\n\n[i][b]XSS Thread[/b][/i] - [url=http://hackforums.net/showthread.php?tid=2375454]☆[TuT] Ultimate XSS Tutorial [TuT]☆[/url] - [url=http://hackforums.net/member.php?action=profile&uid=1042274][color=white][b]-Divine-[/b][/color][/url] - If you're interested in learning XSS, this thread will give you a good head for it.\n \n\n[align=center][img]http://goo.gl/C6j11[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - тнє Pυηιѕнєя[/font][/size][/color][spoiler=]\n[b][color=#1466ff]Michael Westen[/color][/b]: Hey тнє Pυηιѕнєя! Thanks for taking the time out for this interview! Before we begin, would you like to give a shout out to any special members?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]:  Polymath 1.0, my lover, and of course, my good friend, Sir.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: You and Poly seem to be great friends - A great thing to have on Hack Forums. To start us out, what were you looking for when you stumbled upon Hack Forums?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: What I was looking for? I was looking to hacking runescape, which I now found out is impossible, and I look back at myself a year ago, and I think why did I even play runescape, its terrible if you look at it closely.\n\n[b][color=#1466ff]Michael Westen[/color][/b]:  I can feel the tension between you and the active members of the Runescape section already - I definetely remember being amazed by \"Runescape Hacks 2005,\" on YouTube back in the day. What's your favorite part of Hack Forums? The people, the tutorials, what?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: My favorite part of Hack Forums is The Lounge. I always chuckle at what most people have to say, and I even laugh at myself sometimes. I really bust out laughing when The Lounge \"legends\" post stuff. The only down side for me is the annoying people, like the ones that are like \"Ask me anything\". That's the worst thing on there, those, are the attention whores.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: The Lounge is certainly diverse - It's a good section to blow off steam, though it sometimes has the opposite effect. Let's say Omni promoted you to Staff - What would your reaction be and what would be your first course of action?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: I would ask him, \"Why me?\", but I would be somewhat happy and suprised. My first action, would honestly be to keep a \"heavy eye\" out on the users that are on don't talk to list, I will not state the names here, as I they do not know they are on that list.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Definitely - I think my first reaction would be making sure he did it on purpose! What's your opinion on scamming? How do you think it should be addressed?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: I think scamming is just a part of life now, scammers be scamming people that work (hopefully) for their money. Scamming, honestly shouldn't be dealt with, it's your fault if you get scammed, your the one wanting or buying an item. Completely your fault.\n[b][color=#1466ff]Michael Westen[/color][/b]: Tough love Pυηιѕнєя! I understand though - The marketplace explicitly states you deal at your own risk, though some things can't be avoided. Do you have an opinion on the recent killing of Trayvon Martin?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: No comment.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Alright, moving right along - Do you have any opinion on the purchase of Instagram by Facebook for the ridiculous price of $1 billion USD? It's certainly shows the power of social networking in our generation.\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: It was purchased by Facebook? Crazy. I don't use Facebook, and I swear to it I never will. Yet for $1,000,000,000 USD, you could have done so much more. I would have donated 1/4 to Charities, and not to be greedy or anything, but I would honestly keep the rest, and give some to my mother, father, grandma, and brothers. They have always been there for me when I need someone to help me when I need help.\n\n[b][color=#1466ff]Michael Westen[/color][/b]: Certainly - I don't think anyone would turn their nose at $750 million. To wrap it up, do you have any words for the readers? Perhaps advice or observations?\n[b][color=#1466ff]тнє Pυηιѕнєя[/color][/b]: Don't fry bacon in the nude. I guess that is all.\n[/spoiler]",
      "subject": "[4/11/12] - HF News"
    },
    {
      "pid": "21630945",
      "uid": "515249",
      "dateline": "1334197730",
      "message": "[align=center][IMG]http://i19.photobucket.com/albums/b168/OmegaSaiyan/CaptureHFNEWS.png[/IMG][/align]\n[align=center][font=Tahoma][size=x-large][u]  Video Clip Of The Week  [/u][/size][/font][/align]\n[align=center][video=youtube]http://www.youtube.com/watch?v=z8wFnZmTG4A[/video][/align]\n\n[align=center][img]http://i.minus.com/jLwA4sea2JfOI.png[/img][/align]\n[color=white][b]Springfield's true Location in the Simpsons is Oregon[/b][/color]\nFor the past 20 years, the cultural phenomenon known as the Simpsons has been hiding the true identity of the protagonist's city, Springfield.  \"When I grew up, I realized it was just a fictitious name,\" said Groening. \"I also figured out that Springfield was one of the most common names for a city in the U.S.\"\n\"In anticipation of the success of the show, I thought, `This will be cool; everyone will think it's their Springfield.' And they do,\" he said.  Groening told Smithsonian magazine that Springfield, Oregon, is 100 miles south of his hometown of Portland.  \n\n[color=white][b]Best Buy CEO Resigns after a 'personal conduct' inquisition[/b][/color]\nBrian Dunn, Best Buy's CEO,  suddenly stepped down after an investigation into his 'personal conduct' was acknowledged by the company on Tuesday.  \"Certain issues were brought to the board's attention regarding Mr. Dunn's personal conduct, unrelated to the company's operations or financial controls, and an audit committee investigation was initiated,\" said a spokeswoman for Best Buy's board of directors.  After Dunn [i]chose[/i] to resign, after 28 years with Best Buy states that he is proud of his fellow employees and wishes them the best.\n\n[color=white][b]Arcade Caine[/b][/color]\n[spoiler=]\nFor those interested in the future of a child, this is a video that shows some of the creativity and ideas of Caine.\n[yt]http://www.youtube.com/watch?v=faIFNkdq96U[/yt]\n[/spoiler]\n\n[align=center][img]http://i.minus.com/jbnj1rNeSxwKbL.png[/img][/align]\n[b][color=#FFFFE0]NOKIA[/color][/b]\nThe Lumia 900 is finally out. The new Lumia phone packs a punch. It is perhaps 1 of the best Windows Phone out right now. The new Lumia has a 1.4 GHz processor, 4G capability and HTML 5.  It has a gorgeous 4.3 AMOLED ClearBlack glass screen, which makes watching videos and such amazing. The Lumia is currently only for AT&T. The phone is worth getting if you want a different OS then Android or iOS.\n\n[b][color=white]Facebook/Instagram[/color][/b]\nFacebook has purchased Instagram. The startup that consisted of less then 10 people and was a mini social network of it’s own. It has become the top iOS free app on the App Store recently. People have said they will cancel their Instagram because Facebook will “ruin it” and make it all complicated and difficult to use, and try to make it Facebook. Facebook has brought in the team that started Instagram and will probably let them to continue work on the app.\n\n[color=white][b]Samsung[/b][/color]\nThe Samsung Galaxy Tab 2 has been unveiled. It is slightly better in performance but still packs some of the same features.  Samsung themselves said that the update to the Tab would be incremental. The models are a 7.0 and a 10.1 model. It will be starting at 99 dollars and rising from there.\n\n[align=center][img]http://i.minus.com/jd4aY9bnxNFRl.png[/img][/align]\n[color=white][b]Hot 100[/b][/color]\nFor it's fifth week, Fun's \"We Are Young\" holds its place at #1 on Billbaord Hot 100. Coming in at #2 is Justin Bieber's \"Boyfriend\".\n\n[color=white][b]Born This Way[/b][/color]\nThe European leg of Lady Gaga's Born This Way Ball is set to kick off August 14 in Bulgaria, following a run of spring and summer dates through Asia and Australia.\n\n[color=white][b]Gym Class Heroes[/b][/color]\nAs Gym Class Heroes rolls out \"The Fighter,\" the third single from \"The Papercut Chronicles II\" album, frontman Travie McCoy predicts that \"we're definitely going to be riding this (album) for a while.\" But he also says that there may be more where the group's 2011 release came from. \n\n[color=white][b]One Direction[/b][/color]\nFollowing the grand example of Karmin and Lana Del Rey, One Direction made their \"Saturday Night Live\" debut on Saturday (Apr. 7), with performances of \"What Makes You Beautiful\" and \"One Thing.\"\n\n[color=white][b]Music Videos Of The Week[/b][/color]\n[spoiler=]\n[yt]http://www.youtube.com/watch?v=o3YPyeO0zcg[/yt][/spoiler]\n\n[align=center][img]http://i.minus.com/jeLhgJAzL8zy6.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nWhat's wrong with the easy way out? I've just been pondering this lately. Is the hard way supposed to make us a better person or prove that we can handle such situations? Possibly. I just don't fully understand why the easy way is the bad way. If the outcome is similar, and you don't lose anything, what's so bad about it? This isn't saying that you shouldn't push yourself to do your best, but still, sometimes you just need to take it easy and solve the problem in the least problematic way. Just a thought.",
      "subject": "*"
    },
    {
      "pid": "21631175",
      "uid": "515249",
      "dateline": "1334198200",
      "message": "[align=center][img]http://goo.gl/nctCW[/img][/align]\n\n\"What do you think of the HF News?\"\n\n[i]\"What do i think of the HF News? I think its absolutely amazing. I look at it \nall the time, I, lots of times am not sure whats going on and if anything big \nhappened lately, but that's not a problem. I can just go to the HF News section \nand i will be up to date. I also think that the HF News Team does a tremendous \njob writing these, and i love how it includes all kinds of things varying from HF \nNews to Web Shows and News all over the world. To be honest, i think this is a \nvery big part of HF since i read the HF news alot. I hope to see it continue to grow.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=985864][i]-AlphaKiloCharlie[/i][/url]\n\n[align=right][i]\"I think the HF News is sexy.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=524451][i]-Cutie Pie[/i][/url][/align]\n\n[i]\"I think the HF News is one of the [b]best[/b] features Hack Forums has, not only \nbecause it provides both myself and the other members with the news but it goes to \nshow how a group of people can work together in a team to provide a service to the \ncommunity.  Free of charge too!  Bravo zulu to you and your team, keep it up!\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=298746][i]-Ğяаммая Яäŷš[/i][/url]\n\n[align=right][i]\"I think that the HF news is a great way for members to know about the \nwho's and what's about the changes happening to HF and it's members. People can find \nout about bans, repfucks, popular threads and any changes that happen to HF and it's \noccupants. Some of the newer editions seem a bit derisory, such as the \"world news\" \nsection that does not have much to do with hacking or the forums.\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=529870][i]-+Pirate[/i][/url][/align]\n\n[i]\"Even though my activity in and around the forum is high, it's physically impossible for me \nto know everything regarding the forum, so this is where the HF news steps in. In my opinion, \njust by reading this article it's equivalent to browsing the forums for hours on end and still not \nknowing just as much. It gives you an insight to why people were banned and the latest \ninformation happening in and out of the forums. My biggest love of the HF news would have to \nbe the day it falls on. Wednesdays are always the same; Arrive home, dread that you're only half \nway through the week, log onto HF and feel happy. The satisfaction to which you receive when \nlogging on and realising the next week's news has been published, is immensely satisfying. The \nenjoyment you get by reading the reasons for bans and reasons for rep fucks, always tend to \nbring a smile to my face. The main part of the news for me, would have to be the [b][color=#98FB98]notable threads[/color][/b] \nI enjoy seeing what threads in the opinions of others deserve to be credited. Most of the time, I \nwould spend a couple of minutes on each thread, reading through the endless attempts to congratulate \nthe OP on an amazing thread, and watch those whom experiencing the sheer force of jealousy and \nstart to attempt a vigorous troll attempt. I would also have to say the [b][color=#98FB98]HF headlines[/color][/b] to be a \ngreat addition to the news. I know that many of fellow HF members, are either not within reach of \nknowing such information or to scared to ask. I know for a fact that I am one of those members whom \nwhich tend to steer clear from any communication to those whom are in the moderating team. \nRegardless, just by reading this part of the news, you really get a good insight to how the staffing \nteam works and obviously just the general updates to which have overcome the forum. \n\nOverall, I think the weekly HF news, not only has a huge influencing on sprucing up my emotions and \nweek, but also gives a good informative and insight to the forum\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=992333][i]Accident[/i][/url]\n\nThe topic for next week is \"What is your favorite section of Hack Forums? Why?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://goo.gl/Y5qY4[/IMG][/align]\n[align=center][img]http://i.imgur.com/wXkVn.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j4CBzMlQXRTPf.png[/img][/align]\n[align=center][spoiler=][img]http://i.imgur.com/lUJ3A.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.imgur.com/8yqIX.jpg[/img][/spoiler][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/jizLL89o2ExZa.png[/img][/align]\n[align=center]\n[i]Please Give Feedback on the Sound Quality, GFX, and Length.[/i]\n[video=youtube]http://www.youtube.com/watch?v=q2AWv-YyID8[/video][/align]\n\n[spoiler=[i][b]Written topics[/b][/i]]\n[b]Awards[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=128873]T3h Hack3r[/url] has received the MOTM award.\n\n[b]Leadership Changes[/b]\n[url=http://hackforums.net/member.php?action=profile&uid=275104][b][color=#0066FF]Delicious[/color][/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=89623][b][color=#0066FF]Mark Webber[/color][/b][/url] have been demoted from leader of Techsperts.\n[/spoiler]\n\n[hr]\n\n[size=xx-large][font=Monotype Corsiva][color=deepskyblue]Current News Team.[/color][/font][/size]\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/WpABi]OnTheFly[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Notable Threads\n[*]Opinions\n[*]Sir's Second\n[*]GFX Gallery\n[*]Webshow\n[*]Comics[/list][/list]\n[list][*][url=http://goo.gl/KNR24]Starstruck[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://goo.gl/4FHct]Chocothunda[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://goo.gl/aLdh6]Døn[/url]\n[list][*]Tech News[/list][/list]\n[list][*][url=http://goo.gl/f1yJs]Purple Haze.[/url]\n[list][*]Music News[/list][/list][/list]\n[list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/Et7FB]Michael Westen[/url]\n[*][url=http://goo.gl/4W9dI]Sir[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/rMHjl]Rhythm[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/nO6qc]ReactioNz[/url]\n[/list]\n[/list]",
      "subject": "*"
    }
  ]
}