{
  "posts": [
    {
      "pid": "16212303",
      "uid": "0",
      "dateline": "1317617969",
      "message": "[align=center][img]http://goo.gl/a6bwp[/img][/align]\n\nThe edition you are currently reading is the [color=#f66058][b]61st full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\nFirst and for most, a proxy killer plug-in has been added. This is essentially for registration and logins and will no longer allow proxies of any type to be used while here on Hack Forums. A statement was also made, \"Now whatcha gonna do bitches?\" Hopefully his proxy killer will stay sturdy and filter all of the proxy's out there.\n\nA new section has been added to the [url=http://hackforums.net/forumdisplay.php?fid=106]Service and Offerings[/url] forum. The new section is called, [url=http://hackforums.net/forumdisplay.php?fid=219]Graphics Market[/url] and is used to sell your services of graphics. If you have any type of graphics to sell, post them there.\n\nIt has been announced that [url=http://www.opera.com/mobile/]Opera Mini[/url] has been firewalled. Multiple reasons were given, but the main statement is: \"Sorry but the ban evaders and scammers use it like a VPN.\" This is primarily saying that too many people are using [url=http://www.opera.com/mobile/]Opera Mini[/url] to access Hack Forums after being banned. Creating multiple accounts and scamming on Hack Forums is obviously not allowed, therefore he has put a foot down, in hope that it will limit those childish acts.\n\nBe aware, there is an impersonator of [url=http://hackforums.net/member.php?action=profile&uid=1][color=#00BFFF][b]Omniscient[/b][/color][/url] on Twitter. Please realize that the only Twitter [url=http://hackforums.net/]Hack Forums[/url] uses is [url=http://twitter.com/#!/HackForumsNet]@HackForumsNet[/url]. The person that is impersonating our fellow administrator is [url=http://twitter.com/#!/jesselabrocca]@jesselabrocca[/url]. This person is posting infected links on the Twitter account, please do not download anything from this Twitter. \n\nAn official mods list has been added to the forum. You can view that [url=http://hackforums.net/modlist.php]here[/url]. This page displays our forum moderators throughout Hack Forums and what forum they moderate. There is also a staff list at [url=http://hackforums.net/stafflist.php]here[/url] which displays all of the staff regardless of the userbars they are wearing.\n\nHack Forums now has an official Google +1 button which can be located at the footer. This allows users to click the +1 and helps the site with overall SEO.\n\n[align=center][img]http://goo.gl/ZveLN[/img][/align]\n\n\"Should the world focus on alternative energy and preserving life, or exploring space and colonizing planets?\"\n\n[i]\"This goes back to the basis of focus on you before worrying about others\n in the sense that we should focus on our own planet before screwing around with\n the rest. We're on the tip of the iceberg, freshwater is dwindling so is\n gas and who knows how long natural gas will last. Our energy is being produced\n from a finite resource. And I personally don't want to see WW3 fought over it.\n Therefore it is of the utmost importance for us to steer our focus directly toward\n SAFE and CLEAN alternative energy that is also renewable and infinite. On the\n subject of colonizing planets, it is a dream, America no longer has the capital to\n fund a space program let alone a full scale colonization effort even if we found a\n viable planet. And booming countries such as China likely don't see any financial \nbenefit in looking into this area. Therefore space exploration as of now is an \nexpensive luxury the world cannot afford. These are my thoughts, I hope they cause\n you to ponder the current state of the world, if only for a brief moment. \"\n[url=http://goo.gl/HFP89]-Fireren[/url][/i]\n\n[align=right][i]\"First and foremost, we should be more focused on\n our own planet then trying to colonize another. If we cannot\n take care of our own planet, then what is stopping us from\n messing up another?\"\n[url=http://goo.gl/Holkw]-FuzzyBanana92[/url][/i][/align]\n\nThe topic for next week is \"What do you think of the Reputation Reset?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url]. \n\n[align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nThe Bloodshed that has been present in Syria shows no limits, as lives continue to be taken and protest continue to rage in this region. Demonstrators have demanded for true democratic elections, as well as the removal of Bashar al-Assad, the current President of Syria. He was the son of former President, Hafez al-Assad, who also made many controversial calls during his own presidency. Hafez al-Assad is often criticized for authorizing the Hama Massacre, which was ordered to combat a revolt led by the Sunni Muslim community that targeted the regime of al-Assad. The deaths that resulted in the Hama Massacre is uncertain, although many credible sources give a count anywhere from 15,000 to 35,000 Syrian citizens. More can be read about the Hama Massacre [url=http://en.wikipedia.org/wiki/Hama_massacre][color=#FEE5AC]here[/color][/url]. This massacre is very important to note, since the son of the man who ordered it is the current President of Syria. Apparently the apple doesn't fall far from the tree, because according to several credible sources, more than 3,000 protesters have been killed at the hands of Bashar al-Assad. More information on Bashar al-Assad can be found [url=http://en.wikipedia.org/wiki/Bashar_al-Assad][color=#FEE5AC]here[/color][/url]. \n\nPerhaps you're wondering, what is the main cause of all this unrest in Syria? There are many answers to that question, although there is a common understanding between all of the protesters of what they're fighting for. The poor citizens of Syria are calling for the removal of Bashar al-Assad (as established in the previous paragraph), equal rights for Syria's ethnic and religious groups and more political freedoms such as freedom of press, speech, and assembly. These are the freedoms that many take for granted in other parts of the World. The term \"President\" is very misleading in Syria, since it's more of a dictatorship if anything. Bashar al-Assad has been [i]elected[/i] twice, and he's gone unopposed both of these times. Water and electricity has been shut off in some areas, and some security forces are going as far as to confiscate food and flour. On top of the 3,000 Syrian citizens that have been killed, thousands have also been injured or detained. There have been reports of detainees being tortured or killed. What does the Syrian Government have to say about these accusations? The Syrian government has repeatedly denied the reports of defections and blames \"armed gangs\" for causing trouble. You can read more into the 2011 Syrian Uprising [url=http://en.wikipedia.org/wiki/2011_Syrian_uprising][color=#FEE5AC]here[/color][/url].\n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n\n[spoiler=GFX Gallery][align=center][img]http://goo.gl/C6jfj[/img][/align][/spoiler]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n\n[b][color=#f66058]Interview with Joey Tribbiani[/color][/b][spoiler=]\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nHello Joey Tribbiani, and thank you for participating in the 61st edition of HF News.\nDo you have any shout outs to any one first of all? \n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nHey bugga, Wolves, Deities, Sir, Viral, BoodyE, Cobalt, Akinova, nidhish and Ethereal! \n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nOkay cool. How did you find/join hackforums.net?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nHonestly, I can't even remember how I found HF. \n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nOh haha. What do you think about the mentors have more power now?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nIt's good to have more powers so actions can be taken much faster. I hope this helps in lessening the staff's work load.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nI think its a lot better. What do you think of Omniscient's recent activity?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nHe is doing what he can to make this site a better place. There are always going to be people having different view point. Not everyone needs can be satisfied. Decisions are taken keeping in mind how it will affect the majority.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\nWhat do you think about the vouch system?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nI assume it is a system which will make HF a comparitively safer place for deals.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nYes same. What are your hobby's?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nI like football, swimming, managing events for the high school fests etc...\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nWhat sort of music do you like?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nAlmost anything except dubstep and hardcore rock.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\nWhat sort of tv programs do you watch?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nI like watching comedy and detective type of shows - White Collar, Bones, HIMYM, Castle, Two and Half Men etc..\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\nOh I love two and a half men. What do you think about them killing off Charlie and getting Ashton Kutcher in?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nAshton himself said that he can't replace Charlie Sheen, what more do I need to say...\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\nIt still wont be the same but any way. Do you play any games?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nYeah, I know. Let's see if Ashton can pull something close enough.\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nAnd no, I am not a gamer. I play CS 1.6 sometimes, but I am not a pro. I just play for the lulz...\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\nTalking about gaming what do you think of the new minecrafters group?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nI am not a gamer. So, gaming groups are just not for me to comment on.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\naww okay then. To end this off if you had one wish what would it be and why?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nI would like to switch places with Bill Gates.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says:\nAnd why would you like to switch places with him?\n[b][color=#E0FFFF]Joey Tribbiani[/color][/b] says:\nbecause it feels good to be one of the most successful person on Earth. Lol.\n\n[b][color=#FFFFE0]Kyle FYI™[/color][/b] says: \nHaha well thank you for doing this interview I have enjoyed interviewing you.[/spoiler]\n\n[align=center][youtube]http://www.youtube.com/watch?v=Rezojh2UyRw[/youtube][/align]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n\n[url=http://goo.gl/7M6h9][img]http://goo.gl/bT3g8[/img][/url]\n\n[align=right][url=http://goo.gl/XNOmD][img]http://goo.gl/2frWD[/img][/url][/align]\n\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url][/align]\n",
      "subject": "[10/2/11] - HF News"
    }
  ]
}