{
  "posts": [
    {
      "pid": "6716998",
      "uid": "136025",
      "dateline": "1285709577",
      "message": "[align=center][IMG]http://i52.tinypic.com/28r1ux.jpg[/IMG][/align]\n\nWelcome everyone, to the weekly edition of HF News. The edition you are currently reading is the 17th FULL edition. It is for the dates of 9/22/2010 to 9/29/2010. To read any older HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i54.tinypic.com/qstieq.png[/IMG][/align]\nThis past week on Hack Forums has been a week filled with surprise and conquest, as well as irregular occurrences and some downtime.\n\nOver the last few days, members of Hack Forums residing in the European continent have experienced some severe downtime from the Hack Forum image server. For many people that don't know, due to the popularity of Hack Forums, the website is hosted on four dedicated servers to meet the crucial demands of bandwidth and data. The image server has had trouble connecting to many European members, thus causing immense downtime for images.\n\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=699249]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nOne great accomplishment, after 3 long years, Hack Forums has achieved 6,000,000 posts. This must be a great achievement for Omniscient, his forum has achieved the unthinkable. It was only 50 days ago (from the day 6,000,000 posts was achieved), that Hack Forums hit 5,000,000 posts. This is an extremely quick pace, showing that Hack Forums yields 20,000 posts [B]a day[/b].\n\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=701893]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nIn other news, the Reviewers group has opened applications once again. It has been found that there was a mass kick of approximately 13 members from the group, give or take. You must be an UB3R to apply, and it seems that the amount of people attempting to join the group is outstanding. We would like to wish luck to all the applicants, as well as the leaders, who will surely have a tough time choosing 7-10 members.\n\n[color=#1E90FF][b]You can read more about [url=http://hackforums.net/showthread.php?tid=703353]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nIt has been brought to the attention of the users and Administrators of the forum, that a bug is present in the avatar system. Many people have had trouble uploading avatars, while this issue is not present in other people's accounts. We're all sure that the system managers are working on this issue at present.\n\n[color=#1E90FF][b]You can read a bit about the issue [url=http://hackforums.net/showthread.php?tid=704999]here[/url].[/b][/color]\n\n[align=center][IMG]http://i54.tinypic.com/30rmg0j.png[/img][/align]\nThis week, there was an addition of a new Reviewer, [url=http://hackforums.net/member.php?action=profile&uid=416897]EctoPlasm[/url]. Within three hours as a Reviewer, a thread appeared under his creation. Omniscient was not flattered with the content, and his Reviewer status was removed. This was a new record, with the shortest position as a Reviewer. We hope people can remember and take into account, Staff complaints should be forwarded to higher authority, not posted publicly. \n\n[color=#1E90FF][b]You can read more about this [url=http://hackforums.net/showthread.php?tid=698476]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nA member, [url=http://hackforums.net/member.php?action=profile&uid=128758]ʎssɐןɔ ʎɐʇs[/url] has had an issue with the Staff team as well as rules and policies of Hack Forums. He seems to be disputing an issue with what the rules state in regards to person information. I hope the issue can be resolved as soon as possible.\n\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=706625]here[/url] and [url=http://hackforums.net/showthread.php?tid=705837]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nA few members have been getting into trouble through multiple ways from \"Calling in\" service and \"PID\" products. The trouble varies from legal ramifications, monetary loss as well as account limitations on Hack Forums. People have been scammed through services and others have had their account positions jeopardized.\n\n[color=#1E90FF][b]You can read more about it [url=http://hackforums.net/showthread.php?tid=706745]here[/url].[/b][/color]\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\n[url=http://hackforums.net/member.php?action=profile&uid=74411]slim[/url] has posted a thread about girls suffering from Rett Syndrome. He is trying to raise awareness for many people suffering from this horrible disease. Many members have contributed to the cause, and you should too.\n\n[color=#1E90FF][b]You can read more of this [url=http://hackforums.net/showthread.php?tid=706504]here[/url].[/b][/color]\n\n[align=center][IMG]http://i51.tinypic.com/1zd6eja.png[/IMG][/align]\nThis week on Hack Forums has been an average, uneventful week. There has not been much [b]large[/b] discussion or news. This shows that Hack Forums Staff have been keeping the forum clean, so that no issues worthy of reporting for can arise.\n\n[align=center][IMG]http://i51.tinypic.com/2w4f95h.png[/IMG][/align]\nThis week, we've got an interview with Hack Forums Staff member Xch4ng3, and Hack Forums owner, Omniscient.\n\n[color=#1E90FF][b]1.[/b][/color] When did you join Hack Forums? What did you aim to achieve when you joined? \n[color=#32CD32][b]Xch4ng3:[/b][/color] [i]Wednesday, June 3rd, 2009, 07:43 am. When I first joined I wanted to just learn more about hacking and how things worked. I had previous knowledge of things like reverse engineering and had messed around with a lot of general computer stuff. HackForums was just an extension to add to my existing knowledge.[/i]\n\n[b][color=#1E90FF]2.[/color][/b] After joining, where was most of your time spent (section)?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i] Exploiting the MSN network was my major interest, so I spent most of my time reading up and learning from the AIM/MSN hacking section. [/i]\n\n[color=#1E90FF][b]3.[/b][/color] Who was your first ever inspiration and or friend in Hack Forums?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i] I don't really keep \"online friends.\" Acquaintances maybe, friends not so much. Inspiration wise (and no bumlicking intented) was iBF. He helped me with a doxing request and was the first one to deal with a scam report I had. [/i]\n\n[color=#1E90FF][b]4.[/b][/color] When did you upgrade to L33T (approximately)?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i]I think it was a week after I joined the site.[/i]\n\n[color=#1E90FF][b]5.[/b][/color] Do you think you're a nice Staff member, a lenient Staff member, or a ruthless Staff member?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i] I try not to be nice when being staff, don't like emotions getting in the way of things. I'm a mix between lenient and ruthless. [/i]\n\n[color=#1E90FF][b]6.[/b][/color] If you could go back and do one thing, what would it be?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i] Nothing, everything happens for a reason and it's because those things happened that I'm here now. I would change nothing because at that point it was exactly what I wanted to do. [/i]\n\n[color=#1E90FF][b] 7.[/b][/color] If you could choose to be on person on Hack Forums, who would it be and why?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i] No one, I'm happy and content with who I am. [/i]\n\n[color=#1E90FF][b]8.[/b][/color] Do you have any favourite Staff members?\n [color=#32CD32][b]Xch4ng3:[/b][/color] [i] All of the team are my favourites. Each one of them contributes to keeping the site going so yeah, team effort. [/i]\n\n[color=#1E90FF][b]9.[/b][/color] How did you feel when you were contacted by Omniscient to become a Staff member?\n[b][color=#32CD32]Xch4ng3:[/color][/b] [i] I was pretty happy. I remember my face dropping when I saw it. [/i]\n\n[color=#1E90FF][b]10.[/b][/color] What is your favourite group that you're in, other than Staff.\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i]D.S Inc. Currently inactive but it was the first thing I did on here and I'm proud of creating the first grey-hat group with TRRS as my co-leader. [/i]\n\n[color=#1E90FF][b]11.[/b][/color] Last question, is there any information you would like to give the members, interesting facts, quotes or anything?\n[color=#32CD32][b]Xch4ng3:[/b][/color] [i] Nothing that sticks out at the moment, guess a thanks to everyone (mature) on the site for making HF what it is today. Shout out to everyone who I've talked with in the past few years, you always have something to learn and that's something I've learnt from talking to people here.\n\nGuess that's about it. :P[/i]\n\nThank you for such a great interview, Xch4ng3.\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nWe were also lucky enough to get an interview with Omniscient.\n\n[color=#1E90FF][b]1. [/b][/color]When you were young, what were your ambitions for when you grew up? Did you see yourself running a large forum network with multiple successful websites and forums?\n[color=#00BFFF][b]Omniscient:[/b][/color] I wanted to become a helicopter pilot actually. And when I was young there was no internet as we know it today.\n\n[color=#1E90FF][b]2.[/b][/color] We all know the domain HackForums.net does somewhat sound deceiving to the actual content of the forum, when you purchased the domain, what were you initial plans?\n[color=#00BFFF][b]Omniscient:[/b][/color] To create a forum for computer enthusiasts to discuss things like hacking hardware and code. It developed into something different but at it's core that still it's mission.\n\n[color=#1E90FF][b]3. [/b][/color]Do you feel that working alone on a project is much more reliable than working with a partner? If so, what do you see as more of an advantage working without a partner?\n[color=#00BFFF][b]Omniscient:[/b][/color] Absolutely. I have no one to blame but myself if things go wrong. Initially I had employees and paid freelancers for some of my early projects in the 90's. Over time I learned as much as I could myself more out of necessity than anything else. I'd rather fail on my own and learn to be better. This is how I've become the webmaster and sysadmin I am today. It took lots of failures. And I don't see any advantages of working with a partner online.\n\n[color=#1E90FF][b]4.[/b][/color] What is your greatest achievement or milestone from Hack Forums, when was it achieved, and why was it so important to you?\n[color=#00BFFF][b]Omniscient: [/b][/color]I guess a million posts felt great. Seems just like a nice number to achieve. Previously I've had 500k post sites so it was reaching that next level I wanted. HF is on target to do 10 million posts in 6-8 months.\n\n[color=#1E90FF][b]5.[/b][/color] When you first began your forum network, which website did you believe would be the most successful in the subsequent years?\n[color=#00BFFF][b]Omniscient:[/b][/color] I'd like to believe every site has it's success level. I know some will make me $10 a month but if they require no maintenance then it's a successful site. Plenty of forums reach respectable income levels and you have to weigh the work versus the reward.\n\n[color=#1E90FF][b]6.[/b][/color] Do you have any major plans for Hack Forums, or is it all going to be just smooth flowing from now on?\n[color=#00BFFF][b]Omniscient:[/b][/color] Yes I do have lots of plans. Most of which I won't openly discuss. Even staff doesn't know my biggest plan. As I write this too I'm adding a new award to the site. Read about it in the help docs. I look to constantly improve HF.\n\n[color=#1E90FF][b]7.[/b][/color] Have you ever had an inspiration, if so, who was it and why?\n[color=#00BFFF][b]Omniscient:[/b][/color] I can seriously say I've had two aspirations for my work on forums. One is a site called FatWallet.com. The owner Tim is a great guy and I was one of his first members. At the time it was a small offspring site of Anandtech's deals section. Over the years Fat Wallet has become one of the biggest websites online and I've watched it grow from day one.\n\nThe other is my buddy Dave (CheapyD) website CheapAssGamer.com. I'm good friends with Dave too. You can view the progress of his site as well. It's worth millions. I was one of his sysadmins early on. While I don't participate in CAG anymore it's still a big inspiration to me.\n\nBoth of those websites have one thing in common and that's owner dedication. It took years but without their daily commitment the sites would have never grown to their current level. Both started as simple forums too and are now today monster websites. Ironically HF has now passed CAG in it's statistics for activity. So I'm inspired by them to be dedicated and constantly improve my site.\n\n[color=#1E90FF][b]8.[/b][/color] Is Hack Forums what you wanted it to be three years ago?\n[color=#00BFFF][b]Omniscient:[/b][/color] I never envisioned HF to be this big. That's honest. However it was my goal to make it as big as I could which is the same goal for all my sites. Some work out and some don't. SupportForums.net for example has tremendous potential and I'm working diligently to unlock it. I've actually not progressed HF as far as I wanted in the past 6 months. There are lingering projects I want done but haven't found the time to complete them.\n\n[color=#1E90FF][b]9.[/b][/color] You have developed language skills in PHP, are there any other coding or programming languages that you believe you understand well?\n[color=#00BFFF][b]Omniscient:[/b][/color] I was proficient in Perl years ago but stopped programming in the language when I realized how much better php was. I don't have a need to know other languages. I'm also dabbling in Ruby but have not yet mastered it. Again this is a time constraint issue. I'd like to dev with Java but so far no time for that either.\n\n[color=#1E90FF][b]10.[/b][/color] Would you like to give any new enthusiastic webmasters some tips for running a forum?\n[color=#00BFFF][b]Omniscient:[/b][/color] Don't clone another site. You'll go nowhere fast. \n\nThank you for a great interview Omniscient, it has been a great addition to HF News.\n\n[align=center]**[color=#1E90FF]**[/color]**[/align]\n\nTune in next week for another great edition of HF News.",
      "subject": "[9/22/2010] - HF News"
    }
  ]
}