{
  "posts": [
    {
      "pid": "14848387",
      "uid": "0",
      "dateline": "1313809945",
      "message": "[align=center][img]http://goo.gl/rtXkU[/img][/align]\n\nThe edition you are currently reading is the [color=#deff00][b]55th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url].\n\n[align=center][img]http://goo.gl/cA8RE[/img][/align]\n\nOn the 18th of August 2011, [url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url], celebrated his 41st birthday. We wish him a belated happy birthday and hope that he enjoyed his birthday and would be able to enjoy many more in the future! His wishlist can be found [url=http://goo.gl/YpDM1][b]here[/b][/url].\n\nOn this special occasion, [url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to give members a special present. On the eve of his birthday, the banned members were given amnesty and their bans were lifted. This amnesty does not cover anyone who was banned as a scammer. This was done to show a sign of goodwill and provides members a second chance to prove they can be quality members. You can read more about it [url=http://goo.gl/23701][b]here[/b][/url].\n\nAfter being asked so many times in PMs as to why he wants so many PSP games [url=http://goo.gl/XSV0p][color=#4DD0FC][b]Omniscient[/b][/color][/url] decided to take a picture of his PSP collection. It turns out that he is very anal about it. You can read more about it [url=http://goo.gl/R9aKU][b]here[/b][/url].\n\nThe group help doc, entitled [b][i]\"Custom User Groups\"[/i][/b] is now created. It explains how purchasing custom user groups works. You can view it [url=http://goo.gl/oDiyc][b]here[/b][/url].\n\nThe thread rating system is now disabled throughout the forum. It was found that this feature is not useful, hence, it was removed. You can read more about it [url=http://goo.gl/diUhL][b]here[/b][/url].\n\n[url=http://goo.gl/PlBLN][b]Cloudflare[/b][/url] services are now being tested on HackForums. The reason behind this action is an attempt to thwart some of the larger DDOS attacks which the site has been experiencing. You can read more about it [url=http://goo.gl/G2mhk][b]here[/b][/url].\n\nThe minimum number of posts required to send a PM has been increased from 5 to 20 posts.\nThe minimum number of posts required to use the signature has been lowered from 100 to 50 posts.\nAlso, the minimum post length has been lowered from 50 to 40 characters.\n\nStaff member [url=http://goo.gl/oB1hp][color=lime][b]cobija[/b][/color][/url] has requested a vacation ban. He is due to return 08-25-2011.\n\n[url=http://goo.gl/iNARa][color=#FFD700][b]Oldies[/b][/color][/url], formerly known as [b][color=white]Xypher[/color][/b], ex-leader of The Alliance and Black Knights, has requested that his master donator award be removed. He has also requested to be removed from the ub3r usergroup, respectively having the Sapphire of Ub3r award removed as well. He does not feel a real need to have ub3r anymore and says that he is simply here to learn and advertise about his forum. \n\n[url=http://goo.gl/Jl8LC][b]Volenar[/b][/url] has been promoted to the co-leader of Reverence. Also, [url=http://goo.gl/7PNe2][b]Amp™[/b][/url] has been promoted to the co-leader of Red Lions and Black Knights. We wish them hearty congratulations and best of luck with their newly added responsibilities!\n\n3 official groups have recently started recruiting - Red Lions, Black Knights and Reverence. You can find their recruitment threads [url=http://goo.gl/5tJ5I][b]here[/b][/url], [url=http://goo.gl/0Epos][b]here[/b][/url] and [url=http://goo.gl/SDjcy][b]here[/b][/url] respectively. \n\n[align=center][img]http://goo.gl/0zRhM[/img][/align]\n\n[url=http://goo.gl/gGUxd][color=#AAAAFF][b]Astonish is NJ[/b][/color][/url] made a thread congratulating [url=http://hackforums.net/member.php?action=profile&uid=120522][color=white][b]Volenar[/b][/color][/url] on getting engaged. Congratulations Volenar!\n\n[url=http://goo.gl/7g1HW][color=#0066FF][b]SeaNanners™[/b][/color][/url] has the second most reps of anyone who joined in 2011, [url=http://goo.gl/Lp5ut][color=#0066FF][b]тнє Jσкєя[/b][/color][/url] takes the first position. They are also part of the 21 members who have reached over 1,000 reps.\n\n[url=http://goo.gl/gGUxd][color=#AAAAFF][b]Astonish is NJ[/b][/color][/url] started a thread where many of the other Reverence members posted their part in the tutorial, be sure to see [url=http://goo.gl/UGLdJ]Reverence's Xbox 360 Tutorial Edition![/url]\n\n[url=http://goo.gl/JX6BW][color=#0066FF][b]Indirect[/b][/color][/url] has a lot of Android/Rooting knowledge, and helped [url=http://goo.gl/4W9dI][color=#0066FF][b]Sir[/b][/color][/url] root his phone.\n\n[url=http://goo.gl/QNFEU][color=#FFCC00][b]CM Punk[/b][/color][/url] got demoted to l33t because of a comment he made about the ease of getting Ub3r. See [url=http://goo.gl/q9Qcg][color=#4DD0FC][b]Omniscient[/b][/color][/url]'s reasoning [url=http://goo.gl/En60q]here[/url].\n\n[url=http://goo.gl/2f8iU][color=#FFCC00][b]Boots[/b][/color][/url] got demoted to l33t because the member who bought him Ub3r reversed the payment.\n\n[url=http://goo.gl/gKWEH][color=white][b]«MammoTh™[/b][/color][/url] received the Master Donator award after many small donations amounting up to $500.\n\n[url=http://goo.gl/sNUpF][color=white][b]Positive[/b][/color][/url] has reached his goal of 9,000 members, and has an average of 125 daily users on his DDoSing program. See his thread [url=http://goo.gl/u3qoZ]here[/url].\n\n[url=http://goo.gl/O2PhA][color=white][b]n4z1[/b][/color][/url] and Eminence created a useful tutorial on staying anonymous. It involves things like VPNs, proxies, and general information. See the thread [url=http://goo.gl/ugb7N]here[/url].\n\n[url=http://goo.gl/NwWHU][color=white][b]iLLusiionsZ[/b][/color][/url] got ranked 105th for 98,210 Gamerscore on the Texas Gamerscore Leaderboard for Xbox Live, and just needs 100k points to be ranked in the top 10. This summer iLLusiionsZ started with 50k now he has 98k, see the proof [url=http://goo.gl/1Npnj]here.[/url]\n\n[url=http://goo.gl/LczjM][color=#0066FF][b]Vitani's Mate[/b][/color][/url] has turned 20 on the 18th. Be sure to tell him happy birthday!\n\nDue to the newly implemented LQP warning, many members have been limited for making 2 or more low quality posts.\n\n[b]Bans.[/b]\n[list]\n[*] [url=http://goo.gl/5HG3l][color=black][b]Ωмεɢα[/b][/color][/url] has requested a vacation ban.[/list]\n\n[align=center][img]http://goo.gl/VtaCL[/img][/align]\n\nThe Independence Day of India is celebrated on the 15th of August to commemorate its independence from British rule and its birth as a sovereign nation in 1947. All over the country, flag-hoisting ceremonies are conducted by the local administration and authorities. The main event takes place in Delhi, the capital city of India, where the Prime Minister hoists the national flag at the Red Fort and delivers a [url=http://goo.gl/3iM0L][color=#FFDAB9]nationally televised speech[/color][/url]. In his speech, he highlights the achievements of his government during the past year, raises important issues and gives a call for further development. The Prime Minister also pays his tribute to leaders of the freedom struggle.\nAlso, in response to this occasion, Google donned the [url=http://goo.gl/UPvqJ][color=#FFDAB9]Red Fort as its Google logo[/color][/url].\n\nMozilla recently released Firefox 6 and has released neat little graphics to show users how the world's most popular browser is released. You can read more about the process and have a look at the timeline images [url=http://goo.gl/8h73r][color=#FFDAB9]here[/color][/url].\nAmong the some of the new features, one of the key changes in Firefox 6 was in the address bar, which now highlights the domain of the website a user is visiting, to thwart spoofing. Mozilla also said it streamlined the look of the site identity block, and added support for the latest draft version of WebSockets with a prefixed API.\n\"Power users\" of Firefox's Panorama feature can now load saved tab groups only while using Panorama thanks to Firefox 6's Panorama Groups on Demand feature. The result is improved browser startup time and a better overall experience, Mozilla says.\nFor a full list of the new features, check out the [url=http://goo.gl/1RaSu][color=#FFDAB9]Firefox 6 Release notes[/color][/url].\n\n[align=center][img]http://goo.gl/XRlcJ[/img][/align]\n\n[spoiler=][img]http://goo.gl/MQXq7[/img][/spoiler]\n[i][size=x-small][url=http://goo.gl/BOCG4]Element[/url][/size][/i]\n\n[align=right][spoiler=][img]http://goo.gl/h4k4B[/img][/spoiler]\n[i][size=x-small][url=http://goo.gl/UBh99]So Fucking Classy[/url][/size][/i][/align]\n\n[spoiler=][img]http://goo.gl/YcLNB[/img][/spoiler]\n[i][size=x-small][url=http://goo.gl/JpkHr]hansen[/url][/size][/i]\n\n[align=right][spoiler=][img]http://goo.gl/T0gT6[/img][/spoiler]\n[i][size=x-small][url=http://goo.gl/sL7dc]Poseidon[/url][/size][/i][/align]\n\n[align=center][img]http://goo.gl/XlrXu[/img][/align]\n[hr]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 1 - Valiant[/font][/size][/color][spoiler=]\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Hello Valiant , and thank you for participating in the 55th edition of the HF News. Would you like to make any opening statements?\n[color=#AAAAFF][b]Valiant:[/b][/color] I'm just glad to be here for an interview.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Lets jump right into this one, why did you join HF?\n[color=#AAAAFF][b]Valiant:[/b][/color] I actually came across HF while doing some research on viruses and malware. I joined to help people in the WHH section who were asking for help with virus removal. By research, I don't mean how to create malware, but the inner mechanisms of malware, so that it would be easier for me to figure out how malware works and how to defend against it. \n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] Well I am glad you found us. Anyway, Who was your first enemy on Hack Forums and how did you get to become enemies with him/her?\n[color=#AAAAFF][b]Valiant:[/b][/color]  Never really had any \"enemies\" on HF. It's just the Internet. I try to avoid any problems - or conflicts for that matter.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] That is always good, If you had to pick one member who does not currently have the White Hat Helpers award, who would it be?\n[color=#AAAAFF][b]Valiant:[/b][/color] That's a hard one. I think I would actually pick T3h Hack3r for all the hard work he does around the HJT section. That's not to say there aren't more members deserving of the award though.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] I talked to him before, great guy! Now on to some HJT questions, how do you feel leading one of the top groups on HF?\n[color=#AAAAFF][b]Valiant:[/b][/color] I had already trained in a training camp program on another website. When I came here, I began to help members with HJT. It started off with me being one of the sole volunteers here, but over time, this eventually grew and Omniscient decided that opening a HJT section for me to manage would be a good idea. From there, I eventually established the training program for more volunteers. It grew enormously from its early days.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] That is good to hear :) Would you consider yourself a harsh or laid back leader?\n[color=#AAAAFF][b]Valiant:[/b][/color] I'm laid back for the most part, but I don't tolerate any broken rules by volunteers-in-training. Obviously, this is for their own good, and there are plenty more people out there who are willing to put in good, honest work that we can train instead of them.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] If someone thinks there computer is infected what would you recommend them doing - on HF?\n[color=#AAAAFF][b]Valiant:[/b][/color] Well, the first step is to scan with an antivirus and perhaps a secondary malware scanner. Temp files should be cleared as well. After that, if problems persist, the HJT section has instructions on how to get help from a volunteer. System restore *is* an option, but it's generally not recommended. Most malware these days embed themselves in system restore points as well.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] That is great to hear, what do you like better Pepsi or lemonade?\n[color=#AAAAFF][b]Valiant:[/b][/color] I'm going with lemonade. Never been a big fan of soda, never will be. That stuff kills you slowly anyway.\n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color] I hate soda too, Well this whent by quick, any shout outs before we say goodbye?\n[color=#AAAAFF][b]Valiant:[/b][/color]  Just some thanks to you for the interview, and a good job to everyone on the HJT Team for their hard work. \n\n[color=#AAAAFF][b]Astonish is NJ:[/b][/color]  I would like to thank HJT for everything they do also. Well, thanks for the interview. Hope you enjoyed it. \n[color=#AAAAFF][b]Valiant:[/b][/color] Thanks, I did.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview 2 - Volenar[/font][/size][/color][spoiler=]\n[color=white][b]Diabolic:[/b][/color] Hello Volenar, thanks for letting me interview you for this week’s edition of HF News.\n[color=white][b]Volenar:[/b][/color] No problem. It is truly an honour to be in this edition.\n\n[color=white][b]Diabolic:[/b][/color] I'd first like to ask you why and how did you first join Hack Forums.\n[color=white][b]Volenar:[/b][/color] I got to know Hackforums via another forum I was on. I wanted to learn more about what DDoSing was an how to perform it, you know.. The basic skid stuff. I googled about it but I didn't find anything which really attracted me. I asked on that other forum whether they knew a good website on which I could learn this and they referred me to Hack Forums. And well, here I am! \n\n[color=white][b]Diabolic:[/b][/color] Ha, I believe you have just recently become the co leader of Reverence. How did that happen ??\n[color=white][b]Volenar:[/b][/color] I reduced my general activity on Hackforums to some section, one of those sections were the sub-forums of the groups I was in at that time. I saw some things which could improve about Reverence and I messaged Astonish about it. We talked for a long time, not just hours but a few days. We met up several times to think of some new ideas and most of my ideas got applied. I assume that Astonish believes in my and wanted to give me the opportunity to accomplish success by granting me this magnificent gift.\n\n[color=white][b]Diabolic:[/b][/color] I am sure you will do a very good job, on the same note as that what do you expect to with your new role as Reverence co leader as in what do you wish to bring to the group?\n[color=white][b]Volenar:[/b][/color] I expect a real revolution. Me and the other co-leaders are working out several projects from which Reverence can only benefit from. I can not disclose what ones yet, I am sure that you understand this. I am not going to be a bully leader or a leader who thinks that he stands above his members. No, I equal my level to the level of my members and so I communicate. I cannot promise a lot but you will see some great changes occurring within Reverence.\n\n[color=white][b]Diabolic:[/b][/color] I was hoping you would say milk and cookies ha-ha, I can't wait to see some new changes around the group as I am sure many of the Reverence members can't. So what sections of Hack Forums do you currently browse the most?\n[color=white][b]Volenar:[/b][/color] As I previously mentioned I mainly spend my time in the group sections. Besides from that I often bring a visit to the whole Computing tab and help out where I can. Since I recently became an undergrad of the HJT-team program I now visit the HiJackThis Log analyzing section as well. I am eager to learn more.\n\n[color=white][b]Diabolic:[/b][/color] Oh well congratulations on becoming a HJT Undergrad. The computing tab is truly amazing I agree there. So your now a group orientated member. Also this is something many people must ask you but where does the username Volenar come from?\n[color=white][b]Volenar:[/b][/color] When I was a kid I used to watch the Harry Potter movies a lot, well, I still do. The bad character in there is called \"Voldermort\" from where \"Vol\" comes. Eonar was the name of my character on World of warcraft and from there I formed the name. I have been through quite a lot of names whilst I was on Hackforums.net, but this one is definitely a keeper! \n\n[color=white][b]Diabolic:[/b][/color] Oh so there is mystical story to the name, I am also a harry potter fan and I would of never guessed. So since the beginning of your journey at Hack Forums what skills have you acquired?\n[color=white][b]Volenar:[/b][/color] I became a lot more social and mature. At the first I was just up to laughing with everything, but now I'm taking a more serious look at the things. I can call myself a decent hacker however I have only learned this for the good and not to abuse the skills. I always dreamed of becoming a white hat hacker and now I'm one step closer to it. So to list it I actually have learned everything you can learn on Hack Forums, besides from coding and graphics. My next step is Graphical design.\n\n[color=white][b]Diabolic:[/b][/color] I am horrible at graphics as many know but being a white hat hacker is surely an achievement. Has anything major changed within HF since you first joined ?\n[color=white][b]Volenar:[/b][/color] Everything. The quality of the community in general has dropped, I must admit. When I firstly joined a lot of guys on Hack Forums were more straight to the point. Now there are a lot of people, even upgraded members who do nothing but tempt to troll others. And oh yeah, I remember when there was a search bar/newest post thing at the right hand side of your screen! Other than that there are not really any big changes made which affected me.\n\n[color=white][b]Diabolic:[/b][/color] Ha-ha, Don't feed the trolls is my motto anyway what do you think about the new rule that's been put in place about your post count counting in every section?\n[color=white][b]Volenar:[/b][/color] Honestly I find it a good choice made by Omniscient. I know that it was made from some frustration but I find it good. It increases the members' post count yet Omniscient has given Low Quality another punch in combat by increasing the minimum post count limit to 50 and the LQP warning to 25%\n\n[color=white][b]Diabolic:[/b][/color] I totally agree with you, so having a life outside of Hack Forums what do you do within that spare time ?\n[color=white][b]Volenar:[/b][/color] I practice Muay Thai and MMA. I love fighting sports, it teaches you a certain kind of discipline, especially when they have eastern roots, like Muay Thai. Besides from that I spend a lot of time with my girlfriend, my fresh fiancée.\n\n[color=white][b]Diabolic:[/b][/color] Awwww I almost cried reading that ha-ha, anyway is there anything else you wish to say to the Hack Forums community or any personal shout outs?\n[color=white][b]Volenar:[/b][/color] I would like to thank everyone from the HJT team who has taught me and formed me to who I am now. I would also like to give a personal shout out to Reverence, in particular Astonish. Thanks for the opportunity. To end with a positive note I would like to encourage the staff members to continue with what they are doing. Great job all.\n\n[color=white][b]Diabolic:[/b][/color] Well I’d also like to say thank you for allowing me to interview you for this week’s HF News Edition it has been a pleasure speaking to you.\n[color=white][b]Volenar:[/b][/color] Same goes for you, thanks a lot for this opportunity.\n[/spoiler]\n\n[align=center][img]http://goo.gl/yNZGh[/img][/align]\n\n[url=http://goo.gl/3cDOZ][img]http://goo.gl/8r0pM[/img][/url]\n[align=right][url=http://goo.gl/sLsk6][img]http://goo.gl/0veBz[/img][/url][/align]\n[align=center][url=http://goo.gl/TuaBu][img]http://goo.gl/5Pxd7[/img][/url]\n\n[hr]\n [img]http://goo.gl/WhR30[/img][/align]\n\n[color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/kQNfV]Cobalt+[/url]\n[/list]\n[color=white][b]Publisher's Assistant[/b][/color]\n[list][*][url=http://goo.gl/VIJ7W]xerotic[/url]\n[/list]\n[color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/2TOSE]Joey Tribbiani[/url]\n[list][*]Headlines[/list]\n[*][url=http://goo.gl/8KlIG]DΣxus[/url]\n[list][*]Headlines[/list]\n[*][url=http://goo.gl/O8NJY]BlackChaos[/url]\n[list][*]World News[/list]\n[*][url=http://goo.gl/Ms2su]kyoutu[/url][list]\n[*]World News[/list]\n[*][url=http://goo.gl/9o5L7chocothunda[/url][list]\n[*]User News[/list]\n[*][url=http://goo.gl/4W9dI]Sir[/url][list]\n[*]User News[/list][/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://goo.gl/FrpHu]Zeon[/url]\n[list][*]Head Reporter[/list]\n[*][url=http://goo.gl/HseZT]Figaro[/url]\n[list][*]Headlines[/list]\n[*][url=http://goo.gl/oUEoV]Mr.Kewl[/url]\n[list][*]Headlines[/list]\n[*][url=http://goo.gl/bm9lH]-BoodyE-[/url]\n[list][*]User News[/list]\n[*][url=http://goo.gl/vbEM4]Puppy™[/url]\n[list][*]User News[/list]\n[*][url=http://goo.gl/2vNh9]Decoy[/url]\n[list][*]World News[/list]\n[*][url=http://goo.gl/mqwu2]Cyber-Security[/url]\n[list][*]World News[/list]\n[/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://goo.gl/gGUxd]Astonish is NJ[/url][list]\n[*]Head Interviewer[/list]\n[*][url=http://goo.gl/aJS0l]Diabolic[/url]\n[*][url=http://goo.gl/sNUpF]Positive[/url]\n[/list]\n[color=white][b]Editors-in-Chief[/b] [/color]\n[list][*][url=http://goo.gl/bm9lH]-BoodyE-[/url]\n[*][url=http://goo.gl/Jcfe3]DaL33T[/url]\n[/list]\n[color=white][b]Graphical Editor[/b][/color]\n[list][*][url=http://goo.gl/Ms2su]kyoutu[/url][/list]\n",
      "subject": "[8/19/11] - HF News"
    }
  ]
}