{
  "posts": [
    {
      "pid": "27865040",
      "uid": "515249",
      "dateline": "1352092432",
      "message": "[align=center][IMG]http://i.minus.com/jpbRhrRig2LgV.png[/IMG][/align]\n\nThe edition you are currently reading is the [color=#00BFFF][b]116th full edition[/b][/color]. To read any older editions of HF News, please go [url=http://goo.gl/pxojJ]here[/url]. \n\n[align=center][img]http://i.minus.com/jba1spITkcOXLN.png[/img][/align]\n[color=white][b]Major Group Change[/b][/color]\nFor the first time in the history of Hack Forums, a group's ownership has been sold and changed, completely. As well as one person owning two groups. The event happened this week, when Tibit, the owner of Empire, went ahead and bought off the group known as \"Rhythm\" from its previous owner, Positive. The transfer in ownership. paired with Tibit now owning more than one group has sparked much discussion on the future of custom user groups. Furthermore, it is quite the achievement for Tibit and only time will tell how this all pans out. A list of the current owners of each group can be found [url=http://hackforums.net/showgroups.php]here[/url].\n\n[color=white][b]HackerCraft Updates[/b][/color]\nIt's been a busy week for the official Minecraft server of HackForums known as HackerCraft. The major changes came when [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] went ahead and relieved Mr. H of his duties as Administrator of the HackerCraft server. According to many, Mr. H was simply not the appropriate person for the task. Following his removal, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] altered and released the server into another phase of beta, dubbed \"Back in Black\". More information on the matter can be found [url=http://hackforums.net/showthread.php?tid=2981555]here[/url]. Consequentially, the changes ended with [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] installing the well known Minecraft section moderator and group owner \"Dan.\" as Administrator of the server and re-opening the server to the public.\n\n[color=white][b]Windows 8 New Section[/b][/color]\nFollowing the release of the new operating system from Microsoft called \"Windows 8,\" [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has gone ahead and created a new forum for discussions of the OS. The brand new section can be found [url=http://hackforums.net/forumdisplay.php?fid=254]here[/url]. The section will surely increase in activity as time goes on.\n\n[color=white][b]Thread Rating Updates[/b][/color]\nThe infamous feature that has caused a stir in the Marketplace section throughout the years has received a couple new updates this week. The feature is \"Thread Ratings,\" which is where Ub3r members can rate a thread out of five stars. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] went ahead and did a reset on all thread ratings forum-wide, along with making it so that Ub3r members can only rate five threads per day. The new updates are part of an ongoing effort to fight the thread rating abuse that has happened in the past.\n\n[align=center][img]http://i.minus.com/jHAVGLpCK2X3O.png[/img][/align]\n[color=white][b]User News[/b][/color]\n[url=http://hackforums.net/member.php?action=profile&uid=458073][b]Chiеf[/b][/url] and [url=http://hackforums.net/member.php?action=profile&uid=797403][b]630[/b][/url] both reached 10,000 posts!\n[url=http://hackforums.net/member.php?action=profile&uid=323740][b]Positive[/b][/url] temporarily lost his Ub3r status by mistake, which has since been regained.\n[url=http://hackforums.net/member.php?action=profile&uid=70881][color=#00FF00][b]Paradoxum[/b][/color][/url] has finished its probational period and is now officially Staff. Congratulations!\n\n[color=white][b]Repfucks[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1099423][color=black][b]Jae[/b][/color][/url] was repfucked.\n[*][url=http://hackforums.net/member.php?action=profile&uid=828184][color=black][b]Airon[/b][/color][/url] was repfucked.\n[/list]\n\n[color=white][b]Bans[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=146557][color=black][b]Skywalker[/b][/color][/url] was banned for a Marketplace violation.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1346174][color=black][b]BlackIceHosting[/b][/color][/url] was banned for a Marketplace violation.\n[*][url=http://hackforums.net/member.php?action=profile&uid=71764][color=#0066FF][b]flAmingw0rm[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1099423][color=black][b]Jae[/b][/color][/url] was banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=828184][color=black][b]Airon[/b][/color][/url] was banned for scamming.\n[*][url=http://hackforums.net/member.php?action=profile&uid=787112][color=black][b]Saturday[/b][/color][/url] was vacation banned.\n[*][url=http://hackforums.net/member.php?action=profile&uid=667183][color=black][b]ß|Λcksí-íΛdΘw™[/b][/color][/url] was vacation banned.\n[/list]\n\n[color=white][b]Awards[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=1137768][b]Kohsti[/b][/url] received the MOTM award.\n[/list]\n\n[color=white][b]Group Leadership Changes[/b][/color]\n[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][b]Chiеf[/b][/url] is now a leader of the Empire.\n[*][url=http://hackforums.net/member.php?action=profile&uid=651337][b]Tibit[/b][/url] is now the owner of Rhythm.\n[*][url=http://hackforums.net/member.php?action=profile&uid=1018876][b]Phytrix[/b][/url] is no longer a leader of Rhythm.\n[*][url=http://hackforums.net/member.php?action=profile&uid=323740][b]Positive[/b][/url] is no longer the owner of Rhythm.\n[*][url=http://hackforums.net/member.php?action=profile&uid=458073][b]Chiеf[/b][/url] is, once again, no longer a leader of Logic.\n[/list]\n\n[align=center][img]http://i.minus.com/jC7Qf9JqwY96f.png[/img][/align]\n[url=http://hackforums.net/member.php?action=profile&uid=1077919][color=#0066FF][b]Zuey[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2971627][b]Dear Atheists, do you wish that there was a God?[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=263101][color=#0066FF][b]pr0t0typ3[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2991782][b]xverisal out of prison ?![/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1074565][b]Luxi4r[/b][/url] - [url=http://hackforums.net/showthread.php?tid=2992291][b]Why is the human brain so much faster than computers?[/b][/url]\n[url=http://hackforums.net/member.php?action=profile&uid=1324218][color=#FFD700][b]Ꮆαεʈƨ[/b][/color][/url] - [url=http://hackforums.net/showthread.php?tid=2991125][b]What is your plan for the zombie apocalypse?[/b][/url]\n \n\n[align=center][img]http://i.minus.com/juGD7pFSr607C.png[/img][/align]\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=121196]Natha[/url][/font][/size][/color][spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 116th edition of the HF News Natha! Great to have you here, and hopefully feelings are mutual. As a customary, any shout outs you'd like to make?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Thanks, Phytrix. I'd like to start off by making a shout out to my girlfriend Teagan (yes, she's a member of Hackforums), Tibit, 630, Hazy, AsSaSs@iN, `P R O D I G Y, Phirewire, and of course, last but not least, Nyx-. (:\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Many prominent names in there. Anyhow, you mentioned Teagan, your girlfriend. Mind telling us how you two met, how you persuaded her to join the site, what she does on the site currently (lounging, learning, etc.), and do you have any tips for the failed romantics out there?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Well, me and Teagan met through a good, well, not so good friend anymore of mine, but I would rather not go there :). I actually didn't ask her to join the site, she saw I was a regular user of Hackforums, I always brought up debates that I saw on Hackforums to her, as she's a minor in psychology, and majoring in criminal justice, she's into debates, so she surprised me by joining the forum out of her own will, I previously warned her she probably shouldn't join because of the many abusive, and disrespectful people on the site, she simply replied with \"too late\", she joined because I persue her interests, and she wanted to take part in my interests, one being HackForums. She's big on Science, Religion, Philosophy, Politics, as mentioned above her career she's big on debates, but she does post around The Lounge, and Innuendo. Considering I believe I have a near perfect relationship with Teagan, I would say no trust; no relationship. We talk about any problems, We don't keep even the littlest things from each other, and that's the road to a happy relationship.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, hopefully she thrives on this site just as you have, and I'm sure those tips will be widely appreciated. For those that know you, your history with bans and repfucks are extensive, having been repfucked 6 times (approx.), perm banned and downgraded once (which has since been revoked), and even awardfucked! So, what's the story behind this?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Well, I use to run a site, which I cannot say, because it still remains on the so called beautiful censor of HackForums, which me being younger, I used HackForums userbar template, I refused to remove them off the website, and Omniscient was about to get his lawyer to contact me, at one point I even used HackForums theme (modified) even though Omniscient admitted to liking what I had done with it, he still saw it as a breach of copyright, so at this point I had a modified HackForums theme, and their userbars which I had edited with a template, so I was rep fucked, perm downgraded, and perm banned with the reason \"Gone for good,\"  but the reasoning behind rep fucks would have to be, at one point we all cared and thought reputation was our life, well atleast I did, I would literally get hurt over a negative reputation, complained, asked for reputation, and those led to rep fucks, I think quitting for a good 6 months made me realise that reputation doesn't matter in the slightest way. Lastly the award fuck was for complaining about how there was a space above my name which is now fixed because I had too many awards, so that's how my bad side of my HackForums history went.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: It's a rough road up the slope, however. Nothing ever goes smoothly. You have quite a few decent hacking tutorials. How did you learn about hacking (and computing/coding) and where has it taken you?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: It sure has.  Well I started off by joining HackForums to learn about host booters, because I was in the whole RuneScape DDoSing with a shell scene, and then this site came up, I soon progressed onto RATs which lead me to making pretty much IRL bank, I would RAT RSGP, and sell it, the whole tutorial side came from my love for writing, I love writing tutorials, getting attention within my tutorials, helping people, and simply being of high quality around the forum. My shell booter tutorial has just over 31,000 views, and 600+ replies. Along with many other popular tutorials. It has taken me to proceed onto University in February 2013 studying the road of IT, I'm hoping to become a successful technician/software engineer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Great to see you've helped so many people with your knowledge. I rarely visit the computing/hacking related sections of HF, so what direction do you think it's headed in and how can it be improved?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Well, expected, the quality in those forums is relatively low because of new members of the hacking scene, asking how to set up a rat, asking for crypts and such, I think it needs a moderator of some sort, to focus singly on that section instead of mentors overviewing it.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: From what I've seen in the Beginner Hacking section, and what I've heard (mostly from people bragging about easy reports), you've red-dotted the issues competently. We'll see where it goes, though. A popular philosophy topic in recent times has been that of free will. So, do we have free will? Why/why not?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: I believe we have the idea and the concept of free will intact. However, if you are religious I think you attempt to follow a specific set of guidelines to live how you would if you did not have free will. As for the rest of us, we are told to follow the rules of our government. It allows us to have our own \"free will,\" but within their limitations. We are led to believe what we have is our free will, and we are blinded but what has been taken away from us to keep us in line. So I think the idea of free will is there, but poorly executed.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: What has your experience with groups been, both past and current?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Well, currently the only group I'm in The Empire, probably the best group I've been in, most of the people I've given shout outs to are in that group, I'm loving the people, and the style, at one point, like a year ago, when all groups were free, back when there was Philker, I was almost in every group, I've been quite a group whore, but I do hope to make it into the Writers one day for the Hackforums News, as said above, I love to write.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Good luck with that. I can tell you first-hand it's an honor to work among the team. Tell us about the games that you play and why you play them. Have you had a chance to check out the new Hackercraft server yet?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Oh actually, I was a Minecraft player until I changed the password to my IRL friend's account and he called the police on me, which was pretty hilarious considering he accused me of having him infected. Well, I've played games such as CoD, I have 15th prestige and 400+ hours on Black Ops, and the same for MW2, I kind of quit around MW3, that was terrible and boring, I'm like 8th prestige on MW3, I hardly get time to play xbox anymore, I'm more focused on monetization, and no I haven't had a chance to try Hackercraft yet, but I'm sure it will be great.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Well, that's a nice friend that you have... and a lot of hours! I'm sure you don't want to leak your private monetizing methods, although what methods do you use, and what tips do you have for people, like myself, who fail in the field?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Haha, it's not easy, well I'm generally around ShareCa$h, RuneScape RSGP related methods, and that's basically it, I use to ewhore, social engineer, and similar activities, but I've given that up.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for sharing your wisdom with both myself and the readers today Natha. It's been an honor. Any final comments?\n[url=http://hackforums.net/member.php?action=profile&uid=121196][color=white][b]Natha[/b][/color][/url]: Honestly, thank you for taking the time to interview me, it's an honor doing this for the HF news, final words? KEEP POSTING BITCHES <3 -Natha.\n[/spoiler]\n\n[color=deepskyblue][size=large][font=Monotype Corsiva]Interview - [url=http://hackforums.net/member.php?action=profile&uid=1371432]angrybrit[/url][/font][/size][/color]\n[spoiler=]\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Welcome to the 116th full edition of the HF News, angrybrit! Any shoutouts before we get the ball rolling?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: Well I would like to thank The Empire members for their support and for being great people.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I'm sure they'll all appreciate that; myself included. You're a relatively new member to HF, having only been here for 4 months. What do you think makes HF stand out among forums, both for you personally and for the rest of the community? Why do so many people keep coming back?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: Firstly I must explain how I got here. Well, some of you may know I work at the risk management department at a bank and we had several \"hacker\" attacks against our agency, so it got me thinking. I always liked computers and I can actually remember when we got one of the first Toshiba's and I had great fun on it that. So I thought, I should look more into that, and HF seemed like the best, most intellectually entertaining forum to achieve a greater knowledge of hacking. As such, it is a rather interesting forum since it discusses subjects that are shunned in other tech forums.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Great to see you took this path. Since you've started digging further into the art of hacking (and, in result, programming), what have you learnt and where do you think it'll take you in the future?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: Well, I had started with assembly language, or more commonly known as ASM, probably the most brain-distorting language in the world after binary, and I learnt some C++ and Delphi before coming to this forum. Obviously only the legitimate uses and not the malware uses of them, so I am currently learning the ways of malware coding and I must say, it's quite the trip. I hope that I will have a greater understanding of the ways that malware work. One thing that captivated my interest for long enough were the privilege escalation hacks people used to gain root access to servers. I read a lot of documentation on said root exploits, but I still feel I have to learn more about them.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: You mentioned root exploits and your desire to learn more about them. What do you know currently, and what other hacking-related ventures have you been on? How is this beneficial to you?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: Well as I said previously it is mainly a hobby, however if I can find wealth in i then be it, I have done my fair deal in game hacking and got bored of it rather quickly due to the population of said games being angry twelve year olds, no offense meant to twelve year olds there, but the community was mostly immature.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: There has been much controversy recently about how groups are managed (won't point any out) and their focus' quality. What do you think makes a good group, and if you were to have one, what would you make it about?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: As you said I am rather new member of this community and have only known previous groups for very little time, but it looks like there is a new wave afoot (if I may use that expression), as Omni has restricted the sales of further groups; hence limiting us in the number of groups sold. If I had a group, I would focus it on knowledge; a place where one can freely share their knowledge on any subject (apart from the ones banned from HF) and learn from others, a sort of thought tank if I were to use a term associated with modern business.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: And where do you think the strong-points of the site are and why? Where could parts be improved and how?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: I think the site is well managed overall. I would, however, advocate a refurbishing of the dying sections or the sections like Cryptography where one post in two is begging to get a free crypt. I would also like to give a shoutout to the members of website hacking that contribute and not just spam the rate my deface threads.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I agree with the latter. The hacking sections in particular seem to have an over-flow of people looking for people to either do things for them, rather than learning how to do it themselves. What OS do you currently run and why do you think that's the best choice for you?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: I currently run Windows 7 on my laptop in dual boot with arch-Linux bare bones edition, however I do also run Centos on my server. I think the best choice of OS, for most people would be Windows due to its versatility, especially 7, however I haven't tested 8.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: I also run Windows, which I find rather user-friendly yet still sophisticated. Do you think stable and full happiness with an OS is achievable, or not?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: I think that a stable Windows installation is possible but sometimes a challenge. I trimmed my own installation of useless languages and other features I didn't need, but in the process corrupted it several times, resulting in a few re-installations, although well worth the pain.\n\n[url=http://hackforums.net/member.php?action=profile&uid=1018876][color=#0066FF][b]Phytrix[/b][/color][/url]: Thanks for the interview angrybrit! Anything you'd like to leave us with?\n[url=http://hackforums.net/member.php?action=profile&uid=1371432][color=white][b]angrybrit[/b][/color][/url]: Once again, thanks for interviewing me.\n[/spoiler]",
      "subject": "[11/4/12] - HF News"
    },
    {
      "pid": "27865052",
      "uid": "515249",
      "dateline": "1352092462",
      "message": "[align=center][img]http://i.minus.com/jTNhWwab1CFHJ.png[/img][/align]\n[i]Unable to acquire in time. May be updated later. Thread title will notify.[/i]\n\n[align=center][img]http://i.minus.com/jl0EswX4V4jJf.png[/img][/align]\n[color=white][b]North Korea's Pride[/b][/color]\nNorth Korea has publicly announced that they take pride in their track record in relation to human rights. The country claimed that the UN's monitor report of North Korea's human rights is unsubstantiated, as the report stated that it was an isolated nation which trampled all over human rights in an astounding fashion. Marzuki Darusman, a UN special rapporteur, proclaimed that North Korea had \"Extensive use of political prison camps, poor prison conditions and prisoners being subjected to forced labor, torture and corporal punishment.\" The UN delegate of North Korea, Kim Song, stated that, \"My delegation totally and categorically rejects the... groundless allegations.\" His speech to a UN committee continued on with him saying \"The report of the special rapporteur is a product of the hostile policies of the United States and European Union against the DPRK (North Korea) and is a typical example of politicization, double standards and selectivity on the issue of human rights,\"\n\n[color=white][b]The North-East Still Feeling Sandy's Wraith[/b][/color]\nIn the Tristate area, devastation still sweeps across from Hurricane Sandy's destruction. As the hurricane departs, 3.5 million homes and businesses are left without power. In addition, the shortage in power has caused an inability for many gas stations to provide fuel to people. This has caused people to angrily wait in hours to purchase some much needed fuel. In the New York area, locals have spoken out saying that they have been ignored, despite a promise from President Barack Obama and other politicians, that everything will be alright. In addition to that, the White House has purchased over 22 millions of gallons of unleaded gasoline and diesel to be transported into the New York and New Jersey areas.  \n\n[color=white][b]Indonesian Forces Kill One And Arrest One[/b][/color]\nAccording to the Associated Press, the Indonesian police force have killed 1 suspected militant and have arrested another, while conducting a raid on Sulawesi island. In Kayamaya village in Poso district, the two assailants had attempted to escape arrest by launching homemade bombs at Indonesian police forces. Brig. Gen. Boy Rafli Amar said, \"They tried to harm the police... we had to shoot and killed one of them.\" During the raid, officers had seized many bombs and other related instruments. The home that they raided was suspected to be a facility for training terrorists. This is not an isolated case, as this is an ongoing project where over 50 arrests have taken place and 9 have been killed in attempted arrests so far.\n\n[align=center][img]http://i.minus.com/jbnJDqXKVJiOjS.png[/img][/align]\n[color=white][b]Apple[/b][/color]\nOn October 18th, U.K. High Court Judge Colin Birss ordered Apple to include a statement on their website denoting that Samsung didn't copy any patent of Apple. Apple has hidden this by using few techniques that has been identified by a news-sharing site known as Reddit. It's been found that Apple has included a Java script that no matter how large your screen is, will efficiently increase the central image of the site, which is currently the iPad mini, to a size that makes sure that the statement is pushed down below the display. Meaning, you will have to scroll down a bit to look into the statement. The reddit user has also shared the JavaScript resize code that the Apple used, on a code-sharing site 'Pastebin' located [url=http://pastebin.com/HyqnXZCB]here[/url].\n\n[color=white][b]Sony[/b][/color]\nSony's newest smartphone, the Sony Xperia XL is out. It has a 4.55 inch LCD screen display with a resolution of 1280x720. It is powered by a 1.5GHz dual-core Snapdragon S4 processor and runs Android 4.2 Jelly Bean. The phone's outlook is pretty neat and clean, as always of Sony's Xperia smartphones. On the phone's right hand side lies the power button, volume control and a camera button. On the left hand side, a Micro-USB port is present, and a 3.5mm headphone jack is placed on top. It has a 13 megapixel camera with an LED flash at its back. The XL's 1,850mAh battery isn't removable, but it's memory can be extended using Micro SD memory cards. Its cost is only $99, presumably with an upgrade.\n\n[color=white][b]iPad[/b][/color] \nApple's iPad mini was launched last week in a quiet manner. Apple didn't put up any grand launch for their new iPad mini, which has reached markets now. People haven't rushed into buying the iPad mini because it isn't a big success, at least, so far. Various reviews says that the iPad mini is overpriced and is launched with an aim to make people go for the bigger one. A CNET writer, Larry Dignan says, \"Why would you brave all that mess for an arguably overpriced tablet -- even one made by Apple? Stay tuned for the next Samsung ad.\"\n\n[color=white][b]Google[/b][/color]\nGoogle's new Nexus series tablet, the Nexus 10 reached the markets last week. At a price of $339, you get a tablet with tons and tons of features in it. This is considered to be the best alternative for Apple's iPad, so far. It runs Android 4.0, powered by Samsung's 1.7GHz dual-core Exynos 5250 CPU. It has 2GB of RAM. This supports Swype as well. At 10.4\" in total length, the Nexus 10 has a 10\" display screen. It weighs around 1.33 pounds, and is complete with a sleek design, which makes it look much more attractive than all the other Nexus tabs released so far. One thing, it also supports the Miracast feature, which allows you to wirelessly display the tablet's screen on supported HDTVs, using respective adapters. Additionally, two more features 'Multiscreen' & 'Lockscreen' are to be added, eventually. Many features packed into a tiny box, a big bang for your buck.\n\n[align=center][img]http://i.minus.com/jbjo5C8ZAaCfSc.png[/img][/align]\n[b][color=white]NYC Shows Cancelled Due To Hurricane[/color][/b]\nDozens of concerts were forced to be canceled this week in New York City, after the wraith of Hurricane Sandy caused massive devastation across the majority of localities. Many shows were canceled since they were victimized by the widespread power outages across the city, while other were simply called off out of respect or in order to more appropriately distribute resources. On the receiving end of these cancellations were The Smashing Pumpkins, ESG, Weekend, along with various other musicians/bands, while the WFMU Record Fair and Village Halloween Parade were also called off. \n\n[b][color=white]Thom Yorke Side Project Release Rumored[/color][/b]\nRadiohead lead singer and solo man genius Thom Yorke's side project, Atoms for Peace, has been rumored to have an album release date of January 28, 2013 for their highly anticipated debut album. Reports have surfaced within the past few days that have revealed the details of the LP, but the band nor record Label, XL, will neither confirm nor deny the apparent leaks authenticity.  \n\n[b][color=white]Music Video Of The Week[/color][/b]\n[spoiler=][video=youtube]http://www.youtube.com/watch?v=W66yhfMb4d0[/video][/spoiler]\n\n[b][color=white]Member Submitted Videos[/color][/b]\n[spoiler=]\n[video=youtube]http://www.youtube.com/watch?v=eCV2h1uHx3o[/video]\n\n[video=youtube]http://www.youtube.com/watch?v=52jWkrfjakk&feature=g-vrec[/video][/spoiler]\n\n[align=center][img]http://i.minus.com/jKQ5rwMHo9quw.png[/img][/align]\nThis is basically my own little corner to type up my thoughts and some standpoints on different topics.\n---\nThe human mind is a complicated thing, possibly even the most complicated piece of technology we can comprehend. It is capable of so many things, and knows limitless power, as, we can only image the limits of ourselves. Now, that may seem like some kind of mumbo-jumbo, but I'd like to state that you should do whatever you can to protect your mind. Whatever it may be, it's important you take things that may impede your mental capacity in small doses. Be careful.",
      "subject": "*"
    },
    {
      "pid": "27865058",
      "uid": "515249",
      "dateline": "1352092471",
      "message": "[align=center][img]http://i.minus.com/jbdTi8oysSZ1ey.png[/img][/align]\n\n\"What do you feel is your biggest accomplishment? Details, please.\"\n\n[i]\"My biggest accomplishment, I've had many great accomplishments in my life. If \nI had to choose one that was the biggest (most important, so far), it would be me \nasking someone out (who said yes and is now my girlfriend). I had finally built up guts \nto do it. My other accomplishment would be me playing cricket. I practically won my \nteam the entire series - they called me buckets, because I was catching so many balls \nand I made it look easy :3\"[/i]\n[url=http://hackforums.net/member.php?action=profile&uid=875998][i]-The Dark Knight [/i][/url]\n\nThe topic for next week is \"What do you think of Windows 8?\"\n\nTo send in your entries for the next edition, PM [url=http://goo.gl/FzyrO]Sir[/url].\n\n[hr]\n\n[align=center][IMG]http://i.minus.com/jbatvBgH1Vli7e.png[/IMG][/align]\n[align=center][img]http://i.minus.com/i1nNeqmNsT5mo.png[/img][/align]\n\n[hr]\n\n[align=center][img]http://i.minus.com/j1AUE1oYr068J.png[/img][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibvdZP4DS42TtP.jpg[/img][/spoiler][/align]\n[align=center][spoiler=][img]http://i.minus.com/ibceT25eUk4Tx2.jpg[/img][/spoiler][/align]\n\n[hr]\n[align=center][img]http://i.minus.com/jbxAIvN3j9rdSS.png[/img][/align]\n\n[size=medium][color=white][b]HF News Team[/b][/color][/size]\n[list][*][color=white][b]Publisher & Head Journalist[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url][/list]\n[*][color=white][b]Journalists[/b][/color]\n[list][*][url=http://goo.gl/4W9dI]Sir[/url]\n[list][*]Opinions\n[*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=660659]-Anal OG-[/url]\n[list][*]Headlines[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=398007]Apathy[/url]\n[list][*]World News[/list][/list]\n[list][*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[list][*]User News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=903914]Prince™[/url]\n[list][*]Sir's Second[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=138559]MarkMare[/url]\n[list][*]Gaming News[/list][/list]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=1326923]Strokes[/url]\n[list][*]Music News[/list][/list]\n[*][color=white][b]Interviewers[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=827711]+Entity[/url]\n[/list]\n[*][color=white][b]Graphical Editor[/b][/color]\n[list]\n[*][url=http://goo.gl/fhjtL]Barneyyz™[/url]\n[/list]\n[*][color=white][b]Reporter[/b][/color]\n[list]\n[*][url=http://goo.gl/ZmQPe]Mr. Anderson[/url]\n[/list]\n[*][color=white][b]Proofreader[/b][/color]\n[list]\n[*][url=http://goo.gl/qrCWl]Phytrix[/url]\n[/list]\n[/list]",
      "subject": "**"
    }
  ]
}