{
  "posts": [
    {
      "pid": "4683952",
      "uid": "74244",
      "dateline": "1276981587",
      "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 6 [/align]\r\n\r\n[size=large][color=#32CD32]Headlines[/color][/size]\r\n\r\n[color=#FF4500]This week, HackForums hit 4 million posts! I'm sure from coming from 2007 to now, Omni is very proud of this forum. From our down point, when the site was going to be closed, to us here now. This community has something special within. Sure, we have trolls, low quality posters, and more, but we all bond as one. Credits to Omniscient for raising this forum from the ground up. Off to 5,000,000 we go, and credits to all of the members for making this forum what it is today. [/color]\r\n\r\n[color=#FF1493]Recently, Omniscient put a rule for donations [url=http://hackforums.net/showthread.php?tid=487418]here[/url]. The rule states no donation asking or begging for them. This will hopefully clear up the threads that are requesting money. However, this does not apply to signatures at this time. This means that you may post something in your signature, but not an annoying \"DONATE NOW HERE RIGHT HERE NOW RIGHT NOW !!!!!!!!!!!!!!\" signature. The warning type for donation begging is a 10 point (50% limited, 100% ban). Also, for example, let's say you make a crypter and release it. Omniscient said this in response -\r\n\r\n\"To be on the safe side I suggest members add something to their signatures that they gladly accept donations for their work.\"\r\n\r\nThis means he recommends you post it in your signature that says something like \"Donate to Yin Products, such as my crypter, here ________\" or something to that extent. Something big and annoying will most likely get your signature removed. [/color]\r\n\r\n[color=#1E90FF]This week, Omniscient made a [url=http://hackforums.net/forumdisplay.php?fid=167]Sports World[/url] subforum. This was added after many requests in the past, but all denied. One more did the trick.  This is to discuss many sports, from MMA, to cricket. This will hopefully sort the World Cup threads (trending very popularly on HF at the moment) from The Lounge, as well as any other discussions like UFC. Will this become a popular Lounge section? We'll find out![/color]\r\n\r\n[color=#32CD32]A few days ago, Omni made a choice for the future of HF hosting. He switched to Amazon Web Service's Cloud Hosting. \r\n\r\nIf you don't know what cloud hosting is, I'll tell you. Cloud hosting is usually operated on multiple connected servers. When you have regular dedicated or shared hosting, it's usually limited to a single server. Cloud Hosting is a pay per use type hosting. Some advantages of cloud hosting -\r\n\r\n[list]\r\n \r\n[*] When you use cloud web hosting, you will be free from those problems created by abrupt use of web site. It evenly balances across the complete network.\r\n\r\n[*] When you use cloud web hosting, it allows you allocate the available resources from the pool to the desired location. \r\n\r\n[*]  When you use cloud hosting, failure of any software piece will not affect the website. This is a huge advantage to using cloud hosting.\r\n\r\n[*] Probably the biggest advantage? The high scalability that allows fast scaling in resource consumption, which is either automatic or manually.\r\n\r\n[/list]\r\n\r\nThere are some downsides, such as security. They do have some protection, since major providers like Amazon for example, usually provide protection that doesn't allow unauthorized access. Omniscient purchased this for the jscript and CSS delivery. For now, it's somewhat of a \"test\" to see how it goes. Thanks Omni for getting high quality cloud web hosting! Amazon is a reputable dealer in the industry for cloud hosting.[/color]\r\n\r\n-----------------------------\r\n\r\n[size=large][color=#1E90FF]User News[/color][/size]\r\n\r\nN/A \r\n\r\n\r\n----------------------------\r\n[size=large][color=#800080]Just Plain Weird[/color][/size]\r\n\r\n[color=#9400D3]The unofficial [url=http://hackforums.net/showthread.php?tid=486627]HF Pokemon Month[/url] is made by Mewtwo. It's where L33T's and UB3Rs change their avatar and name to their choice of the Pokemon characters. Ooh! Me me! Can I be Ash?! There was something similar to this on Facebook a while back (read an article about it), and it seems like something fun for people to engage in.[/color]\r\n\r\n[color=#FFA500]Cubby posted a thread [url=http://hackforums.net/showthread.php?tid=486081]here[/url] that asks you to text a random girl, and ask her \"Hey baby, when are you going to let me tap that?\" That seems somewhat weird! I'm sure a lot of people doing that are going to get slapped!\r\n[/color]\r\n\r\n\r\n-----------------------------------------------\r\n[color=#1E90FF]Other News[/color]\r\n\r\nRemember to read [url=http://hackforums.net/showthread.php?tid=482193]this[/url] edition for information about infected crypters going around.\r\n\r\nExpect next week's on Friday Night. I need some suggestions for User News, those are hard to find.\r\n\r\nAlso remember to comment on the editions, I like to hear your responses.",
      "subject": "[6/13 - 6/19] HF News Week! [COMMENT]"
    }
  ]
}