{
    "posts": [
        {
            "pid": "5136767",
            "uid": "74244",
            "dateline": "1279084150",
            "message": "[align=center][IMG]http://img23.imageshack.us/img23/4201/hfnews.jpg[/IMG][/align]\r\n[align=center]Edition 8 [/align]\r\n\n[size=large][color=#FF4500]Headlines[/color][/size]\r\n[color=#FF1493]\r\nThis week, Omniscient added a security feature for UB3Rs. This feature was implented to stop account hacks. The feature is a \"security word\" feature. This is a security word you set by going to User CP and whenever you want to change your password, email, etc you have to use your \"security word\". \r\n\nOmniscient's direct quote on this -\r\n\n\"Added new ub3r feature for a security word today. Should prevent accounts from being stolen. source : [url=http://twitter.com/hackforumsnet]Twitter[/url]\"\r\n\nThis is in hopes to stop all the account hacking recently that has been happening at unbelievable rates. Read Omniscient's thread about the matter [url=http://hackforums.net/showthread.php?tid=528977]here[/url].[/color]\r\n\n[color=#1E90FF]This week, two forums were added into HackForums. The first one was [url=http://hackforums.net/forumdisplay.php?fid=171]VPN Hosting and Services[/url]. If you don't know what VPN is or stands for, it means \"Virtual Private Network\". A quote from Wikipedia on what a VPN is -\r\n\n\"A virtual private network (VPN) is a network that uses a public telecommunication infrastructure, such as the Internet, to provide remote offices or individual users with secure access to their organization's network. It aims to avoid an expensive system of owned or leased lines that can only be used by one organization. The goal of a VPN is to provide the organization with the same, secure capabilities, but at a much lower cost.\r\n\nsource: [url=http://en.wikipedia.org/wiki/Virtual_private_network]Wikipedia[/url]\"\r\n\nMany people offer these services here at HackForums. VPN connectivity works like this -\r\n\n[img]http://www.gta.com/images/external/products/vpn/flowVPN.jpg\r\n[/img]\r\n\nOmni believes this is a great category, and thus why he added it.[/color]\r\n\n[color=#FF1493]The other section added this week was the[url=http://hackforums.net/forumdisplay.php?fid=172] Website Showcase and Reviews[/url] section. Basically, the purpose of the section is for you to get your site reviewed. This means, you can post your URL to your site, and get it reviewed by members. You can ask them to rate your theme, etc. It is also to show off your site that you made. This is what you should know before posting -\r\n\n\"This section was created for those building websites to showcase them and ask for reviews.\r\n\nHF has strict policies against advertising of \"competing forums\" this means any hacker related forum with categories that are similar to the ones in the existing Hacking tab will get deleted and the member warned for advertising. To clarify you also cannot advertise such forums in your profle, posts, or PM. You will get banned for doing so.\r\n\nAnyone posting sites that have direct copies of HF material will be banned. I will not allow other people to clone parts of HF this includes forum structure and descriptions. You will get banned for doing so and I'll send a DMCA notice to your host.\r\n\nFor those posting their sites for review please understand you will get both positive and negatives comments. I advise those creating threads to take all criticism constructively.\r\n\nDo not use this section to advertise a service you offer on your website. Example is you have a webpage offering a crypter. This is not going to be allowed and your post belongs in marketplace.\r\n\nDo not post websites you do not own.\r\n\nNo posting of referral links of any kind here. This includes adf.ly links. All links must go right to the site.\r\n\nNo posting of sites which require login to view. These will also be deleted.\r\n\nThese rules are subject to change. Thank you. \r\n\nsource: thread by Omni [url=http://hackforums.net/showthread.php?tid=535289]here[/url]\"[/color]\r\n\n[color=#FF4500]If you didn't read the last edition, that was a \"minor one\", the only headline there, was that AsSaSs@iN stepped down from Super Moderator! He was a great staff member. His reasons were that he served a year, and felt like he had done his job. He was not demoted. We all appreciate his work, he's a great guy. He's still going to be active as a HJT Teacher and Analyzer. Thank you for your work AsSaSs@iN.[/color]\r\n\n--\r\n[size=large][color=#32CD32]User News[/color][/size]\r\n[color=#FF4500]\r\nThis one should go in next week's, but I'll put it in here anyway. A big controversy today has been the iRtehLeet scandal which can be found [url=http://hackforums.net/showthread.php?tid=539050]here[/url]. It's reached 70+ pages in it's two threads just today. I'm not going to talk too much about it, but it's an interesting read if you're bored.[/color]\r\n[color=#FF1493]\r\nThis week, Team SK1D infected their Skid Booter which was being sold on HackForums with the latest update. If you have not downloaded the update yet, DO NOT! It is INFECTED. Read more about this story [url=http://hackforums.net/showthread.php?tid=530035]here[/url]. If you did download it already, use the following steps -\r\n\n\"He used blackshades, and probably an aggressive server which means it re-adds the registry key auto and also the process cannot be killed. Please don't tell anybody to do that, they may get BSoD if trying to remove it improperly\r\n\nCan you edit thread? It's pretty easy to delete. Tell them to start in safemode and delete the file in temp directory/Blackshades.exe and restart PC\r\n\nTo tell them how to get to that folder, tell them to type start->run %temp% enter\r\n\nOr on vista/7, in the search bar.\"\r\n\nThank you xvisceral for helping people out on that![/color]\r\n\n--\r\n[size=large][color=#FF1493]Other News[/color][/size]\r\n[color=#32CD32]\r\nThis is late as I was on vacation for the whole week. This week, I'll post on Saturday. We'll be coming back on track, unless there's no news this week. \r\n\nGo check out SoTW this week, since they're doing a freestyle topic, meaning you make any signature you want to celebrate their anniversary. Check out the [url=http://hackforums.net/showthread.php?tid=537211]thread[/url] and submit your entires soon!\r\n\nStay tight for the Reviewers, we'll do it soon, don't you worry!\r\n\nThanks for reading this week's edition! Comments are encouraged![/color]",
            "subject": "HF News [7/4-7/11] [late] [COMMENT]"
        }
    ]
}