{
  "posts": [
    {
      "pid": "11819060",
      "uid": "295848",
      "dateline": "1305134462",
      "message": "[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFmainbanner.png[/IMG][/align]\n\n[color=#FFD700][b]Welcome everyone, to the weekly edition of HF News![/b][/color]\n\nThe edition you are currently reading is the [b]41st full edition[/b]. To read any older editions of HF News, please go [url=http://hackforums.net/forumdisplay.php?fid=162]here[/url].\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFheadlines.png[/IMG][/align]\n\n[align=justify]On Mother's Day, Hack Forums experienced a 24-hour rollback, which was  due to an apparent InnoDB ibdata corruption. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] stated that, \"All posts, PMs, and users from the past 24 hours are basically gone.\" Note this also includes any reputation points given out at that time period. The incident may have proved inconvenient but we are all glad that Hack Forums is back and running smoothly. To find out more about the technical issues go [url=http://hackforums.net/showthread.php?tid=1278129]here[/url].\n\nHack Forums has been attacked several times in the past week which has resulted in the site's recent IP change on May 6th. [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] announced after being attacked once again by a 4GB attack, that he would rather change the IP since the length of the attack was unknown. Thanks to the IP change minimal downtime was required. If you are having connection problems while using a proxy, or want to learn more about the change, check out the thread [url=http://hackforums.net/showthread.php?tid=1274835]here[/url] for more information. \n\nThe problems ensue, after a 24-hour rollback and the attacks on Hack Forums, it has been discovered that Hack Forums has in fact been shelled. The site was shelled back in February of this year, but  [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has just now announced it after weeks of research. He stated, \"All passwords in the DB are encrypted and salted.\" So the risk of losing your account is low. However, it is unknown whether IPs or e-mails have been stolen. Therefore fair warning to all -- to find out more about this intrusion check out the thread [url=http://hackforums.net/showthread.php?tid=1279573]here[/url].\n\n[url=http://hackforums.net/member.php?action=profile&uid=1737][color=white][b]Psycho[/b][/color][/url], an old member of Hack Forums, recently voiced out his concern regarding the declining quality of the forum itself. His thread explains what he has in mind. If you are up for a long read, check [url=http://hackforums.net/showthread.php?tid=1280282]this[/url] out.\n\nIf you were wondering why Hack Forums was acting sluggishly last Monday, it was because of the faulty server RAM that resulted in numerous memory related errors. The RAM was swapped out and though we've had a tiring week, [url=http://hackforums.net/member.php?action=profile&uid=1][color=#4DD0FC][b]Omniscient[/b][/color][/url] has stated, \"So let's get back to our routines and move on.\" Hack Forums is up and running and that's what counts. \n\nStaff member [url=http://hackforums.net/member.php?action=profile&uid=103669][color=lime][b]Factor8™[/b][/color][/url] was banned this week due to his e-mail being compromised. He is now back and hard at work as usual.\n\nIn other news, Techsperts a newly remade group lead by [url=http://hackforums.net/member.php?action=profile&uid=30595][color=lime][b]The Rated R Superstar[/b][/color][/url] is now openly recruiting. The group is based upon a knowledgeable member base with the sole goal of positively contributing to the forum and community. They have their own sub forum, and if you would like to apply for the group please click [url=http://hackforums.net/showthread.php?tid=1278242]here[/url].[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFusernews.png[/IMG][/align]\n\n[align=justify][url=http://hackforums.net/member.php?action=profile&uid=284502][color=white][b]Tha Sneak[/b][/color][/url] has won the MOTM for the month of April! See the voting [url=http://hackforums.net/showthread.php?tid=1249711]here.[/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=137645][color=#0066FF][b]mothered[/b][/color][/url] has finally received the Diamond award, the reason being \"long overdue\". See his awards [url=http://hackforums.net/myawards.php?uid=137645]here.[/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=515249][color=#0066FF][b]Sir[/b][/color][/url] has joined the HF News team as a trial writer.\n\n[url=http://hackforums.net/member.php?action=profile&uid=43420][color=white][b]Mendacious[/b][/color][/url], leader of The Gamers crew, has been inactive lately, but is now back and bringing The Gamers back to its former glory. \n\nPhilKer has a new leader! [url=http://hackforums.net/member.php?action=profile&uid=108823][color=white][b]Airex[/b][/color][/url] was recently promoted to an official leader in the PhilKer group. Here's a little quote of what he thought about it: \"I have so many plans on my current group such as organization, graphic changes, and more projects.\" More details can be found [url=http://hackforums.net/showthread.php?tid=1270418]here.[/url]\n\nThe RAT's Crew has released a tutorial on everything you have to know about RATS. Check it out [url=http://hackforums.net/showthread.php?tid=1280771]here.[/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=120522][color=white][b]Volenar[/b][/color][/url] has created a thread on computer crime. This is a wonderfully long informational thread. Check it out [url=http://hackforums.net/showthread.php?tid=1281078]here.[/url]\n\nCongratulations to [url=http://hackforums.net/member.php?action=profile&uid=128873][color=white][b]T3h Hack3r[/b][/color][/url] for graduating in the HJT team training. See his graduation thread [url=http://hackforums.net/showthread.php?tid=1280593]here.[/url]\n\n[url=http://hackforums.net/member.php?action=profile&uid=80618][color=white][b]nokia2mon2[/b][/color][/url], one of Hack Forums' most generous members, and the leader of the Red Lions, has been absent for over a month now. Many members are wondering when he'll return.\n\n[url=http://hackforums.net/member.php?action=profile&uid=734805][color=white][b]Glassy[/b][/color][/url] also created the Mother's Day banner, but sadly, due to the rollback, there is no record.\n\nThe well-known member [url=http://hackforums.net/member.php?action=profile&uid=101228][color=#0066FF][b]Tate[/b][/color][/url] has [url=http://hackforums.net/showthread.php?tid=1253919]written and recorded a rap[/url] about a girl, but not quite like what you would expect.\n\n[url=http://hackforums.net/member.php?action=profile&uid=277684][color=#0066FF][b]Knuckles[/b][/color][/url] got repfucked on 5-4-11 for negative repping Support(TM), saying that the e-book was infected.\n\nWe wish a happy birthday to the following:[list]\n[*][url=http://hackforums.net/member.php?action=profile&uid=734805][color=white][b]Glassy[/b][/color][/url] (Tuesday, 5-10)\n[*][url=http://hackforums.net/member.php?action=profile&uid=625689][color=white][b]A N D R E W[/b][/color][/url] (Sunday, 5-8)\n[*][url=http://hackforums.net/member.php?action=profile&uid=133256][color=white][b]Xypher[/b][/color][/url] (Saturday, 5-7)[/list]\n[url=http://hackforums.net/member.php?action=profile&uid=639914][color=black][b]VanCliffe[/b][/color][/url] has been banned and repfucked. He claimed he to have a copy of the Hack Forums database via a shell, which was found earlier this week. Note that the shelling was not done by him, as many members claim to believe due to skimming through the threads wrongly.\n\n[url=http://hackforums.net/member.php?action=profile&uid=729921][color=black][b]Akinova™[/b][/color][/url] got permanently banned for fraud order. He was also denied of Ub3r. He had 500+ reputation points, so he was fairly well-known. However, the ban was short-lived, as he is now unbanned.[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFothernews.png[/IMG][/align]\n\n[align=justify]This week, the all-mighty Mississippi River burst its levees in many different states. These levees are used to control its yearly spring swells. The height of the flooding this year maxed out at a record breaking 61.72 feet. It broke the record of its previous flooding in 1927 during the 'Great Mississippi Flood'. The river has since crested, and its water level is receding back to its normal levels.\n\nEarlier this year, thousands of students protested in Milwaukee about a budget bill. After 67 days, the police finally dismantled the protest in a classroom full of students who had sat in there the entire time. The police arrested and escorted the students out at 4 A.M. last Sunday.\n\nTeam Qwazz is now open for recruiting. They are currently the biggest group on Hack Forums and holds the most respected members within their ranks, including the entire Forum Team and the Site Owner. All members have increased administrator privileges with the ability to ban any member for any reason, auto repfuck, and rainbow colored usernames that flash. We don't know what will become of this group or what they intend to do. All we know is that Hack Forums as we know it, will be changed forever. If you think you're worthy of being in such a prestigious group, click [url=http://hackforums.net/showthread.php?tid=1258349]here[/url] for more information.\n\nFor those who love puzzles, a new anagram has surfaced this week. If you would like to give it a go, send a private message to either [url=http://hackforums.net/private.php?action=send&uid=295848&subject=Anagram%20Answer!&message=I%20think%20the%20answer%20to%20the%20anagram%20is:]Qwazz[/url] or [url=http://hackforums.net/private.php?action=send&uid=175033&subject=Anagram%20Answer!&message=I%20think%20the%20answer%20to%20the%20anagram%20is:]xerotic[/url] with your guesses. The anagram is (Predates Torment') and it pertains to one of many users favorite feature of Hack Forums. If you do not know what an anagram is, please read [url=http://en.wikipedia.org/wiki/Anagram]THIS[/url].\n[/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFinterviews.png[/IMG][/align]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 1 - xerotic[/color][/font][/size]\n[spoiler]\n[align=justify][color=white][b]Chick-Fil-A:[/b][/color] Thank you, xerotic, for participating in the 41st edition of HF News! Would you like to make any opening statements?\n[color=lime][b]xerotic:[/b][/color] Yeah, I would like to say thanks for interviewing me. Glad to be a part of this!\n\n[color=white][b]Chick-Fil-A:[/b][/color] Very good, let's begin. What are your thoughts on Omniscient's dedication to Hack Forums, and do you feel he's unappreciated?\n[color=lime][b]xerotic:[/b][/color] Well Omni definitely puts a lot of work into the forums, it is truly amazing for a one-man show (in regard to the server work). While some members are rather rude about what goes on HF, I am somewhat sure that he appreciates the members.\n\n[color=white][b]Chick-Fil-A:[/b][/color] I totally agree with your thoughts. What do you think of cobija and AsSaSs@iN's addition to the Hack Forums staff?\n[color=lime][b]xerotic:[/b][/color] Help is always nice. AsSaSs@iN is seasoned, per se, and is awesome to work with! As for cobija, I have not done too much work with him.\n\n[color=white][b]Chick-Fil-A:[/b][/color] I see you like having a lot of help. Would you rather have more Staff, less Staff, or keep it the way it is now?\n[color=lime][b]xerotic:[/b][/color] I don't mind it how it is now, it is a nicely rounded team.  \n\n[color=white][b]Chick-Fil-A:[/b][/color] Okay, if you could give a staff member of the year to only one member of Staff, to whom would it be, and why?\n[color=lime][b]xerotic:[/b][/color] Factor8™, no doubt. He has helped me so much, from helping me from the start and so on. He is awesome.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What is the worst part about being Staff? Why does this frustrate you the most?\n[color=lime][b]xerotic:[/b][/color] LQ trolls who break the obvious rules annoy me the most. Actually, everyone I have to warn for things laid out in the Help Docs. Like trying to bypass the char limit. It is just annoying as hell .\n\n[color=white][b]Chick-Fil-A:[/b][/color] So based on the amount of warnings you give out, do you consider yourself a stricter or more lenient staff member?\n[color=lime][b]xerotic:[/b][/color]: I think I am stricter than most, if not all Staff. I feel if I warn people and be a tight-ass, they might learn. If not, hey, they will be banned soon anyway from reaching 100% warning level. While on HF I do my work, people who know me off-site know my true personality online.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Okay, let's branch off the Staff for now. What made you want to learn Python programming?\n[color=lime][b]xerotic:[/b][/color] I don't remember. Only thing I remember is picking up the language on HF, learning it, writing tutorials, etc. I helped build the Python section up with various others. It is my personal pride of HF. I got my bronze tutorial award on my 3rd week of HF from my Python tutorial. I really enjoy coding in Python.\n\n[color=white][b]Chick-Fil-A: [/b][/color] Is there any goals that you hope to achieve soon? If so, please specify.\n[color=lime][b]xerotic:[/b][/color] Yeah, I hope to finish some Python projects of mine. Apart from that.. moderating.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Where do you hope to be in a year from now? Hack Forums related?\n[color=lime][b]xerotic:[/b][/color] I don't know where I will be on HF (but I am certain I will still be here) but I hope that where ever it is, it involves me helping the members and helping the forums.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What is your career goal later in life? What do you aspire to be?\n[color=lime][b]xerotic:[/b][/color] I aspire to work in a job in relation to IT. Hell, if I master Python, I can always apply at Google. However... this summer I am applying at a summer fair. If things work out.  \n\n[color=white][b]Chick-Fil-A:[/b][/color] That sounds exciting, making mad money from that. Now for the fun questions!\n[color=lime][b]xerotic:[/b][/color] Alright let's have it.  \n\n[color=white][b]Chick-Fil-A:[/b][/color] Is it true that because you don't respond for long periods of time in MSN, your are watching porn?\n[color=lime][b]xerotic:[/b][/color] Not usually... in most cases I just found something better to do than the current conversation.  \n\n[color=white][b]Chick-Fil-A:[/b][/color] Why do you prefer to shave your body hair or trimming, waxing, or going lumberjack?\n[color=lime][b]xerotic:[/b][/color] Well... the last time I trimmed trimming some hair, I cut some sensitive areas. Shaving hurts too in parts. Either way now, I am doomed. Figured might as well let myself go from now on, lol. People have always said I have a hairy body (in certain areas). \n\n[color=white][b]Chick-Fil-A:[/b][/color] Okay final question:\nIf there was a huge brawl, between: Qwazz. Chick-Fil-A, Omniscient, Tate, Thoth, Xypher, Robbieava and S70NER, who would win?\n[color=lime][b]xerotic:[/b][/color] IRL? None, I would come and win, naturally.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Lol, always a good time chatting with you xerotic. Would you like to make any final statements, shout outs, etc.?\n[color=lime][b]xerotic:[/b][/color] Yeah sure I'd like to say thanks to everyone on the forums for making it what it is today. Also... that is all.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Thank you for your time xerotic! This concludes our 41st edition of HF News![/align][/spoiler]\n\n[size=large][font=Monotype Corsiva][color=deepskyblue]Interview 2 - Sir[/color][/font][/size]\n[spoiler]\n[align=justify][color=white][b]Chick-Fil-A:[/b][/color] Hello Sir, and thank you for participating in the 41st edition of HF News! Would you care to make an opening statement before we begin?\n[color=#0066FF][b]Sir:[/b][/color] Sure, I'm just glad I get to be interviewed, especially on the edition that I helped with and worked on.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Okay, let's get started! What was the most exciting feature released on Hack Forums during your membership?\n[color=#0066FF][b]Sir:[/b][/color] Hmm, I think that even though it's recent, the post activity feature was the most exciting, I always wanted to see how active I was in certain areas.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you believe that Omniscient deserves more appreciation for all the time he puts into Hack Forums for us?\n[color=#0066FF][b]Sir:[/b][/color] I believe Omni deserves appreciation, but I don't believe he deserves his ass to be kissed. I remember once I was on TinyChat with him, and he said that he knew people would asskiss, but it really didn't make him like them more, he actually disliked them more after it. \n\n[color=white][b]Chick-Fil-A:[/b][/color] Who, besides Omniscient, is your favorite staff member, and why?\n[color=#0066FF][b]Sir:[/b][/color] Even though he isn't a staffer anymore, phire nuk3r was my favorite. That guys fist was as hard as his balls, and he had a lot of them. I miss that SoB.\n\n[color=white][b]Chick-Fil-A:[/b][/color] What are your thoughts on the recent addition of cobija and AsSaSs@iN?\n[color=#0066FF][b]Sir:[/b][/color] I'll be honest when I say, I never knew of their existence before their staff positions. But since they are both HJT members, that's to be expected, I don't spend to much time in those sections.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Do you like Hack Forums or Support Forums better?\n[color=#0066FF][b]Sir:[/b][/color] I enjoy Support Forums from time to time, but Hack Forums is where it's at. I've put a lot more of my time in this site than SF.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Recently the big controversy in the PSN take down, what are your thoughts?\n[color=#0066FF][b]Sir:[/b][/color] I laugh. Personally, I'm an Xbox 360 user (if I play a console.) It's just funny for me that the PSN was taken down for so long, and to repay people with their accounts and even credit cards being stolen, they get a month of free downloads. Let's just put in our new credit cards, eh?\n\n[color=white][b]Chick-Fil-A:[/b][/color] If you could give a member of the year award out, whom would you give it to, and why?\n[color=#0066FF][b]Sir:[/b][/color] Firstly, myself, but if it had to be someone else, I think I would choose Squire, because he promised me we would have babies.\n\n[color=white][b]Chick-Fil-A:[/b][/color] How did you find Hack Forums? Are you a black hat or white hat?\n[color=#0066FF][b]Sir:[/b][/color] I actually found HF through Minecraft, I joined NexusRP from the Minecraft Forums, and they kept talking about HF, so naturally I asked about it, and they told me it was Hack Forums. It was all downhill from there; I fell in love. As for the black/white hat, grey-hat for me, I used to dabble in the 'black arts' but not quite so much anymore.\n\n[color=white][b]Chick-Fil-A:[/b][/color] If you had to marry, fuck, or kill one person, and there are: Qwazz, Thoth, and Tate, how would you fit them in the scenario?\n[color=#0066FF][b]Sir:[/b][/color] In this scenario, the target is Sarah Palin. Qwazz would pull out a star to blind the cameras, and distract the body guards. Thoth, as a troll, would beat the shit out of anyone and everyone who came near Qwazz. Then Tate would sneak up behind Sarah for the kill.\n\n[color=white][b]Chick-Fil-A:[/b][/color] If Omniscient gave you the chance to accept $1000, or become Staff for a year, which would you choose, and why?\n[color=#0066FF][b]Sir:[/b][/color] Staff for a year, everyone can make money, not just anyone can become Staff.\n\n[color=white][b]Chick-Fil-A:[/b][/color] Thank you very much for your time Sir, would you care to give a final thought on any recent events, give some shout outs, etc.?\n[color=#0066FF][b]Sir:[/b][/color] \nTo phire nuk3r, you rocked my socks, miss you man.\nTo Nubby, good luck with your website hosting.\nTo xerotic, no hard feelings, I know how bad you wanted to be my favorite staff member.\nTo Qwazz, thanks for inviting me to be a writer for HF News!\n\n[color=white][b]Chick-Fil-A:[/b][/color] This concludes our interview. Thank you to Sir for his time, and everyone on the News team for their constant hard work.[/align][/spoiler]\n\n[align=center][img]http://i1118.photobucket.com/albums/k604/Qwazzy/HFWebshow-1.png[/img][/align]\n\n[align=center][yt]http://www.youtube.com/watch?v=6SWgHgiWboo[/yt][/align]\n\n[align=center][IMG]http://i1118.photobucket.com/albums/k604/Qwazzy/HFcredits.png[/IMG][/align]\n\n[color=white][b]Publisher & Head Writer[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=295848]Qwazz[/url][/list]\n[color=white][b]Writers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=277712]Cobalt[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=153686]Fireren[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=515249]Sir[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=115612]-BoodyE-[/url][/list]\n[color=white][b]Reporters[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=126243]Decoy[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=114470]F4T4L 3RR0R[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=168826]Tyler777[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=629674]Waldo[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=133256]Xypher[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=200751]Zach[/url][/list]\n[color=white][b]Interviewers[/b][/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=92059]Chick-Fil-A[/url][/list]\n[color=white][b]Editors[/b] [/color]\n[list][*][url=http://hackforums.net/member.php?action=profile&uid=70881]Paradoxum[/url]\n[*][url=http://hackforums.net/member.php?action=profile&uid=175033]xerotic[/url][/list]\n[color=white][b]Graphic Designer[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=566671]panDa.[/url][/list]\n[color=white][b]Webshow Host[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=238061]The Doctor[/url]\n[/list]\n[color=white][b]YouTube Channel Owner[/b][/color] \n[list][*][url=http://hackforums.net/member.php?action=profile&uid=639914]VanCliffe[/url]\n[/list]",
      "subject": "[5/11/2011] - HF News"
    }
  ]
}